{
  "name": "Xiatian Zhu",
  "homepage": "https://xiatian-zhu.github.io",
  "status": "success",
  "content": "Xiatian Zhu X. Zhu Home Publications Datasets Xiatian Zhu Xiatian Zhu is a Senior Lecturer at the Surrey Institute for People-Centred Artificial Intelligence, and Centre for Vision, Speech and Signal Processing (CVSSP), Faculty of Engineering and Physical Sciences, University of Surrey, Guildford, UK. Proir to that, he was a research scientist at Samsung AI Centre, Cambridge, UK. He received his Ph.D. from the Queen Mary University of London. His research interests include computer vision and machine learning. Email: xiatian.zhu AT surrey.ac.uk Google Scholar Semantic Scholar ResearchGate DBLP This website is obsolete. Please visit our UP Lab homepage. Recent Publications [ Full List ] SOFT: Softmax-free Transformer with Linear Complexity Jiachen Lu, Jinghan Yao, Junge Zhang, Xiatian Zhu, Hang Xu, Weiguo Gao, Chunjing Xu, Tao Xiang, Li Zhang In Proc. Neural Information Processing System, virtual, December 2021 (NeurIPS, spotlight) [ PDF ] Low-Fidelity End-to-End Video Encoder Pre-training for Temporal Action Localization Mengmeng Xu, Juan-Manuel Perez-Rua, Xiatian Zhu, Bernard Ghanem, Brais Martinez In Proc. Neural Information Processing System, virtual, December 2021 (NeurIPS) [ PDF ] Few-shot Action Recognition with Prototype-centered Attentive Learning Xiatian Zhu, Antoine Toisoul, Juan-Manuel Perez-Rua, Li Zhang, Brais Martinez, Tao Xiang In Proc. British Machine Vision Conference, virtual, November 2021 (BMVC) [ PDF ] Knowing What, Where and When to Look: Efficient Video Action Modeling with Attention Juan-Manuel Perez-Rua, Brais Martinez, Xiatian Zhu, Antoine Toisoul, Victor Escorcia, Tao Xiang In Proc. British Machine Vision Conference, virtual, November 2021 (BMVC) [ PDF ] Few-Shot Temporal Action Localization with Query Adaptive Transformer Sauradip Nag, Xiatian Zhu, Tao Xiang In Proc. British Machine Vision Conference, virtual, November 2021 (BMVC) [ PDF ] Simpler is Better: Few-shot Semantic Segmentation with Classifier Weight Transformer Zhihe Lu, Sen He, Xiatian Zhu, Li Zhang, Yi-Zhe Song, Tao Xiang In Proc. IEEE International Conference on Computer Vision, virtual, October 2021 (ICCV) [ PDF ] Boundary-sensitive Pretraining for Temporal Localization in Videos Mengmeng Xu, Victor Escorcia, Brais Martínez, Juan-Manuel Perez-Rua, Xiatian Zhu, Li Zhang, Bernard Ghanem, Tao Xiang In Proc. IEEE International Conference on Computer Vision, virtual, October 2021 (ICCV) [ PDF ] Global Aggregation then Local Distribution for Scene Parsing Xiangtai Li, Li Zhang, Guangliang Cheng, Kuiyuan Yang, Yunhai Tong, Xiatian Zhu, Tao Xiang IEEE Transactions on Image Processing, accepted, 2021 (TIP) [ PDF ] Learning hybrid ranking representation for person re-identification Guile Wu, Xiatian Zhu, Shaogang Gong Patern Recognition, Vol. 121, 108239, January 2022 (PR) [ PDF ] Towards Uncovering the Intrinsic Data Structures for Unsupervised Domain Adaptation using Structurally Regularized Deep Clustering Hui Tang, Xiatian Zhu, Ke Chen, Kui Jia, C. L. Philip Chen IEEE Transactions on Pattern Analysis and Machine Intelligence, accepted, 2021 (TPAMI) [ PDF ] Rethinking Semantic Segmentation from a Sequence-to-Sequence Perspective with Transformers Sixiao Zheng, Jiachen Lu, Hengshuang Zhao, Xiatian Zhu, Zekun Luo, Yabiao Wang, Yanwei Fu, Jianfeng Feng, Tao Xiang, Philip HS Torr, Li Zhang In Proc. IEEE Conference on Computer Vision and Pattern Recognition, Virtual, June 2021 (CVPR) [ PDF ] [ Code ] [ Project page ] (second most influential CVPR 2021 paper) Joint Bilateral-resolution Identity Modeling for Cross-resolution Person Re-identification Wei-Shi Zheng, Jincheng Hong, Jiening Jiao, Ancong Wu, Xiatian Zhu, Shaogang Gong, Jiayin Qin, Jian-Huang Lai International Journal of Computer Vision, accepted, 2021 (IJCV) [ PDF ] Intra-Camera Supervised Person Re-Identification Xiangping Zhu, Xiatian Zhu, Minxian Li, Pietro Morerio, Vittorio Murino, Shaogang Gong International Journal of Computer Vision, Vol. 129, pp. 1580-1595, February 2021 (IJCV) [ PDF ] Hierarchical Distillation Learning for Scalable Person Search Wei Li, Shaogang Gong, Xiatian Zhu Patern Recognition, Vol. 114, 107862, February 2021 (PR) [ PDF ] Multi-Perspective Cross-Class Domain Adaptation for Open Logo Detection Hang Su, Shaogang Gong, and Xiatian Zhu Computer Vision and Image Understanding, Vol. 204, 103156, March 2021 (CVIU) [ PDF ] Workshop Fourth International Workshop on Big Surveillance Data Analysis and Processing, IEEE INTERNATIONAL CONFERENCE ON MULTIMEDIA AND EXPO (ICME), Taibei, Tanwan, July 2022 Second International Workshop on Target Re-identification and Multi-Target Multi-Camera Tracking, IEEE Conference on Computer Vision and Pattern Recognition (CVPR), Long Beach, CA, USA, June 2019",
  "content_length": 4738,
  "method": "requests",
  "crawl_time": "2025-12-01 14:48:45"
}