{
  "name": "Xifeng Yan",
  "homepage": "http://www.cs.ucsb.edu/~xyan",
  "status": "success",
  "content": "Xifeng Yan - Home XIFENG YAN home | publications | tutorials | dataset | software Professor Venkatesh Narayanamurti Chair Computer Science Department University of California at Santa Barbara Ph.D. (2006) University of Illinois at Urbana-Champaign Curriculum Vitae [PDF] [Short Bio] Affiliation: IEE, INARC, NS-CTA, and ICB Computer Science Department Rm 2017, Henley HallUniversity of California Santa Barbara, CA 93106-5110 Direction xyan [at) cs dot ucsb dot edu Tel: (805) 893-3734 I am a professor at the University of California at Santa Barbara. The primary objective of my research is to explore foundation models in artificial intelligence, leveraging these models for knowledge discovery, and developing cross-disciplinary applications in areas like finance, healthcare, and science.  We have extensively innovated on graph mining, graph data management and pioneered transformer-based time series forecasting.  I am also a co-inventor of ADL/Mica, an agent first approach to conversational AI assistants. TEACHING CS165A: Artificial Intelligence (Fall, 2025) CS291A: Special Topics in Foundation Models (Spring, 2025) Previous Courses News (Nov 2025): An invited talk will be given at Nvidia, \"Adaptive Inference in Pretrained LLMs,\" [slides]. This talk will cover our recent studies, \"Adaptive Layer-skipping in Pre-trained LLMs,\" and \"Directed Multi-Token Decoding\" which illustrate and exploit the substantial underutilized computation in LLMs.  Our approach enables the generation of multiple tokens using only a subset of Transformer layers. Unlike speculative decoding, our method introduces no additional parameters, no auxiliary routines, and requires no post-generation verification. News (Nov 2025): My another amazing student, Ross Koval, has been conducting impressive research on leveraging large language models for financial forecasting. His two recent papers -- \"Context-Aware Language Models for Forecasting Market Impact from Sequences of Financial News\" and \"Multimodal Language Models with Modality-Specific Experts for Financial Forecasting from Interleaved Sequences of Text and Time Series\" -- demonstrated significant progress in this area. Through market neutral portfolio simulation, his approach improved the Sharpe ratio from 1.14 to 1.51. This domain holds tremendous potential, both in methodology and application. News (Oct 2025): I am invited to give an oral spotlight talk (24 among 418 accepted papers), \"Adaptive Inference in Pre-trained LLMs: Layer-skipping,\" at the Conference on Language Modeling (COLM) [slides]. The talk is about our recent paper, \"Adaptive Layer-skipping in Pre-trained LLMs.\"[arxiv] [model/code/data] [poster]. A similar talk was given at the 2025 IEEE/RSJ Int. Conf. on Intelligent Robots and Systems (IROS 2025). News (Aug 2025): I was thrilled to give a talk, \"Multimodal Language Models for Accelerating Scientific Discovery,\" at the 6th International Conference on Data-Driven Plasma Science [slides]. It is my first visit to Santa Fe.  This trip is very special to me as reading legendary stories from Los Alamos and articles about complexity science at the Santa Fe Institute during my childhood helped shape my career interests. News (Aug 2025):  Give a talk and poster at Berkeley Agent AI Summit: \"Transforming Agent-based Chatbots with Declarative Programming\" [slides][paper] News (June 2025): The training dataset of our multimodal language model Open-Qwen2VL released in April has been downloaded 90,000+ times on HuggingFace. It is a 2B-parameter multimodal language model pre-trained on 0.36% of the 1.4T multimodal tokens used in Qwen2-VL, but outperforms the closed-source Qwen2-VL-2B across various multimodal benchmarks. [arXiv] [project website] [code] [model] [data] News Archive RESEARCH INTERESTS Artificial Intelligence, Data Mining, Natural Language Processing RESEARCH PROJECTS  (publications) google scholar | dblp Foundation Models Artificial Intelligence for Finance and Science Multimodal AI Assistants Knowledge Grounded and Controllable Conversational AI (Amazon, PARC) Artificial Intelligence for Healthcare (NSF) Artificial Intelligence for Systems and IoTs Motif Discovery in Massive Protein Sequences (10,000 times faster than MEME) Knowledge Graph Query Processing and Benchmarking (NSF) Graph Information System(NSF) Network Science (ARL) Collaborative Networks (NSF) STUDENTS Graduate Students: Ross Koval, Weizhi Wang, Sirui Zeng, Xuan Luo Alumni (PhD): Zekun Li (Google/DeepMind), 2025 Alon Albalak (SynthLabs), 2024 Hong Wang (Applied Scientist, Amazon AWS), 2023 Shiyang Li (Research Scientist, Samsung Research), 2023 Jing Qian (Research Scientist, Microsoft), 2022 Zhiyu Chen (Assistant Professor, UT Dallas), 2022 Xiaoyong Jin (Applied Scientist, Amazon AWS), 2022 Hanwen Zha (Research Scientist, Facebook Research), 2021Wenhu Chen (Assistant Professor, University of Waterloo), 2021 Keqian Li (Research Scientist, Yahoo Research), 2019 Semih Yavuz (Research Scientist, Salesforce Research), 2019 Izzeddin Gur (Research Scientist, Google Research), 2019 Bay-Yuan Hsu (Assistant Professor, National Tsinghua Univ.), 2019 Yu Su (Assistant Professor, Ohio State Univ.), 2018 Honglei Liu (Research Scientist, Facebook), 2017 Theodore Georgiou (Google), 2017 Fangqiu Han (Snapchat), 2016 Huan Sun (Associate Professor, Ohio State Univ.), 2015 Bo Zong (NEC Labs America), 2015 Yang Li (Google), 2015 Shengqi Yang(Research Scientist, Facebook), 2015 Arijit Khan (ETH, now Associate Professor, Aalborg Univ., Denmark), 2013 Nan Li (oDesk, Apple, now Facebook), 2013 Gengxin Miao (Google), 2012 Alumni (PostDoc): Shulong Tan (Baidu Silicon Valley AI Lab), 2015 Yinghui Wu (Assistant Professor, Washington State Univ.), 2014Ying Tang (Associate Professor at Chengdu University of Technology), 2014 Ziyu Guan (Professor, Northwest University, China), 2012 Alumni (MS and Collaborators): Marina Zhukova (Linguistics, SocialBot), Rajan Saini (Google, 2023), Aaron Jimenez (Yardi Systems, 2023), Reeva Mishra (Microsoft, 2023, reevamishra.com), Apoorva Jakalannanavar Halappa Manjula (Roku, 2022), Krishna Gudipati (TruckX, 2021), Benu Changmai (Amazon, 2021), Xiyou Zhou (OctoML, 2020), Yuxiao Zhang (2020), Hongmin Wang(Microsoft, 2020), Mu Xu (Facebook, 2019), Dong-Anh Nguyen (Google, 2017), Tianyu Wu (Google, 2016), Anastasiya Lazareva (Element Analytics, 2016), Alex Morales (UIUC, 2014), Nadav Caspi (Microsoft, 2014), Chen Liu (Oracle, 2013), Matt Weiden (HRL, 2012), Lei Zhao (LinkedIn, 2011), Russell McLoughlin (LLNL, 2010) Alumni (Undergraduate): Xiyue Wang (Columbia, 2023), Xuan Luo (UCSB, 2022), Ari Polakof (Appfolio, GaTech 2022), Nuan Wen (USC, 2019), Yunkai Zhang (UC Berkeley, 2018), Alexander Wood (UCLA, 2014), Lijia Hong (CMU, 2012) Alumni (Highschool): Andy Jin (Stanford, 2018) HONORS and AWARDS The 1st place prize for the Alexa Prize SocialBot Grand Challenge 5 (SGC5), The 2nd place prize for the Alexa Simbot Challenge, 2023 Program Co-chair: 2023 ACM SIGKDD International Conference on Knowledge Discovery and Data Mining (SIGKDD'23) Research Track Program Chair Report Slides. Test of Time Award at VLDB 2022 Distinguished Paper Award at PLDI 2022 Best of ICDM 2019 Selection Program Co-chair: 2019 SIAM International Conference on Data Mining (SDM'19) ICDE 2013 Best Poster Award SIGKDD Best Student Paper Award, 2012 IEEE ICDM 10-year Highest Impact Paper Award, 2011 NSF Career Award, 2010 The Venkatesh Narayanamurti Chair, Univ. of California at Santa Barbara, 2008-present ACM-SIGMOD Dissertation Award Honorable Mention, 2007 Best Student Paper, Proc. of 2007 Pacific-Asia Conference on Knowledge Discovery and Data Mining (PAKDD), 2007 Best Student Paper, Proc. of 2007 IEEE International Conference on Data Engineering (ICDE), 2007 Excellent Teaching Assistant Award, CS Dept., Univ. of Illinois at Urbana-Champaign, 2003, 2004 Outstanding Teaching Assistant Award, CS Dept., SUNY at Stony Brook, 2001 Last Modified: July 10, 2022",
  "content_length": 7974,
  "method": "requests",
  "crawl_time": "2025-12-01 14:48:47"
}