{
  "name": "Xike Xie",
  "homepage": "http://staff.ustc.edu.cn/~xkxie",
  "status": "success",
  "content": "è°¢å¸ç§-ä¸ªäººä¸»é¡µ ä¸»é¡µ ä¸ªäººä¿¡æ¯ è¿ææ´»å¨ è¿æè®ºæ ç§ç é¡¹ç® æå­¦æ´»å¨ çæ´»ç §ç èç³»æä»¬ English Version If data had a color, it would be black. Black not because of absence, but because of vastnessâlike the universe. Data, like the universe, is infinite, expanding, and mostly unexplored. In cosmology, darkness isn't emptinessâit's the frontier. So it is with data. Donât cross the bridge until you come to it Honesty is the best policy Too many cooks spoil the broth When in Rome, do as the Romans do Donât judge a book by its cover ä¸ªäººä¿¡æ¯ ä¸ªäººä¿¡æ¯ ç¹ä»»ç ç©¶åãåå£«çå¯¼å¸ DDLå®éªå®¤ï¼Data Darkness Labï¼è´è´£äºº ä¸­ç§å¤§èå·é«ç­ç ç©¶é¢,æè´¤æ¥¼406-2 Email: xkxie at ustc.edu.cn ç ç©¶æ¹å (BIG Graph) MLsysï¼(BlG Stream) Neural Sketch, (Big Model) Graph RAG, LLM Inference å­¦æ¯æå¡ ä¸­å½è®¡ç®æºå­¦ä¼é«çº§ä¼åãæ°æ®åºä¸å§æ§å§ï¼ä¸­å½æè²æç¥å­¦ä¼å¤§æ°æ®ä¸å§å§åï¼ä¸­æä¿¡æ¯å­¦ä¼å¤§æç´¢ä¸å§å¸¸å§ï¼ä¸­å½çç©å»å­¦å·¥ç¨å­¦ä¼AIåå§ä¼å¤§æ¨¡åå­¦ç»ç§ä¹¦é¿ å­¦æ¯èæ¯ ä¸¹éº¦å¥¥å°å ¡å¤§å­¦ å©çææ é¦æ¸¯å¤§å­¦ åå£« è¥¿å®äº¤éå¤§å­¦ æ¬ç¡ Our Skills å¤§æ°æ® æºå¨å­¦ä¹ å¹¶è¡è®¡ç® åå¸å¼ç³»ç» è¿ææ´»å¨ 2026: PC Members/reviewers for VLDB, ICDE, NeurIPS, KDD 2025: PC Members/reviewers for ICDE KDD, CVPR, ICLR, NeurIPS 2024: PC Members/reviewers for NeurIPS, KDD, ICDE, IJCAI 2023: PC Members/reviewers for KDD, SIGIR ACM TURC 2020 - SIGMOD China Chapter (Co-Chair) IEEE MDM 2019 - PhD Forum & Panel (Co-Chair) CCF NDBC (ä¸­å½æ°æ®åºå­¦æ¯ä¼è®®) 2019 - Demo track (Co-Chair) è¿æè®ºæ â  SWIFT: Enabling Large-Scale Temporal Graph Learning on a Single Machine. Rui Guo, Zezhong Ding, Xike Xie*, Jianliang Xu. SIGMOD 2026 (CCF æ¨èAç±») â  Ada-KV: Optimizing KV Cache Eviction by Adaptive Budget Allocation for Efficient LLM Inference. Yuan Feng, Junlin Lv, Yukun Cao, Xike Xie*, S Kevin Zhou. NeurIPS 2025 (CCF æ¨èAç±») â  DuetGraph: Coarse-to-Fine Knowledge Graph Reasoning with Dual-Pathway Global-Local Fusion. Jin Li, Zezhong Ding, Xike Xie*. NeurIPS 2025 (CCF æ¨èAç±») â  LEGO-GraphRAG: Modularizing Graph-based Retrieval-Augmented Generation for Design Space Exploration. Yukun Cao, Zengyi Gao, Zhiyang Li, Xike Xie*, S. Kevin Zhou, Jianliang Xu. PVLDB 2025 (CCF æ¨èAç±») â  Capsule: an Out-of-Core Training Mechanism for Colossal GNNs. Yongan Xiang, Zezhong Ding, Rui Guo, Shangyou Wang, Xike Xie*, S. Kevin Zhou. SIGMOD 2025 (CCF æ¨èAç±») â  Lego Sketch: A Scalable Memory-augmented Neural Network for Sketching Data Streams. Yuan Feng, Yukun Cao, Hairu Wang, Xike Xie*, S. Kevin Zhou. ICML 2025 (CCF æ¨èAç±») â  Prototype-based Optimal Transport for Out-of-Distribution Detection. Ao Ke, Wenlong Chen, Chuanwen Feng, Yukun Cao, Xike Xie*, S. Kevin Zhou, Lei Feng. IJCAI 2025 (CCF æ¨èAç±») â  GraphInsight: Unlocking Insights in Large Language Models for Graph Structure Understanding. Yukun Cao, Shuo Han, Zengyi Gao, Zezhong Ding, Xike Xie*, S. Kevin Zhou. ACL 2025 (CCF æ¨èAç±») â  FRAG: A Flexible Modular Framework for Retrieval-Augmented Generation based on Knowledge Graphs. Zengyi Gao, Yukun Cao, Hairu Wang, Ao Ke, Yuan Feng, Xike Xie*, S. Kevin Zhou. ACL findings 2025 â  HIGGS: Hierarchy-Guided Graph Stream Summarization. Xuan Zhao, Xike Xie*, Christian Jensen. ICDE 2025 (CCF æ¨èAç±») â  ClusPar: A Game-Theoretic Approach for Efficient and Scalable Streaming Edge Partitioning. Zezhong Ding, Deyu Kong, Zhuoxu Zhang, Xike Xie*, Jianliang Xu. TC 2025 (CCF æ¨èAç±») â  Partial Optimal Transport Based Out-of-Distribution Detection for Open-Set Semi-Supervised Learning. Yilong Ren, Chuanwen Feng, Xike Xie*. S. Kevin Zhou. IJCAI 2024 (CCF æ¨èAç±») â  Prompt Learning with Extended Kalman Filter for Pre-trained Language Models. Quan Li, Xike Xie*. Chao Wang*, S. Kevin Zhou. IJCAI 2024 (CCF æ¨èAç±») â  Learning to Sketch: A Neural Approach to Item Frequency Estimation in Streaming Data. Yukun Cao, Yuan Feng, Hairu Wang, Xike Xie*, S. Kevin Zhou*. TPAMI 2024 (CCF æ¨èAç±») â  Play like a Vertex: A Stackelberg Game Approach for Streaming Graph Partitioning. Zezhong Ding, Yongan Xiang, Shangyou Wang, Xike Xie*, S. Kevin Zhou. SIGMOD 2024 (CCF æ¨èAç±») â  Mayfly: a Neural Data Structure for Graph Stream Summarization. Yuan Feng, Yukun Cao, Hairu Wang, Xike Xie*, S. Kevin Zhou. ICLR 2024 Spotlight â  Attacks on Continual Semantic Segmentation by Perturbing Incremental Samples. Zhidong Yu, Wei Yang*, Xike Xie*, Zhenbo Shi. AAAI 2024 (CCF æ¨èAç±») â  TIKP: Text-to-Image Knowledge Preservation for Continual Semantic Segmentation. Zhidong Yu, Wei Yang*, Xike Xie*, Zhenbo Shi. AAAI 2024 (CCF æ¨èAç±») â  A Probabilistic Sketch for Summarizing Cold Items of Data Streams. Yongqiang Liu, Xike Xie*. TON 2023 (CCF æ¨èAç±») â  Multithreading Heterogeneous Graph Aggregation. Kai Zou, Haoyun Li, Xike Xie*, Sean X. Wang. TKDE 2023 (CCF æ¨èAç±») â  OT-Filter: An Optimal Transport Filter for Learning with Noisy Labels. Chuanwen Feng, Yilong Ren, Xike Xie*. CVPR 2023 (CCF æ¨èAç±») â  Learn to Explore: on Bootstrapping Interactive Data Exploration with Meta-learning. Yukun Cao, Xike Xie*, Kexing Huang. ICDE 2023 (CCF æ¨èAç±») â  Meta-sketch: A Neural Data Structure for Estimating Item Frequencies of Data Streams. Yukun Cao, Yuan Feng, Xike Xie*. AAAI 2023 (CCF æ¨èAç±») â  GX-Plug: a Middleware for Plugging Accelerators to Distributed Graph Processing. Kai Zou, Xike Xie*, Qi Li, Deyu Kong. ICDE 2022 (CCF æ¨èAç±») â  Clustering-based Partitioning for Large Web Graphs. Deyu Kong, Xike Xie*, Zhuoxu Zhang. ICDE 2022 (CCF æ¨èAç±») â  Multi-dimensional Probabilistic Regression over Imprecise Data Streams. Ran Gao, Xike Xie*, Kai Zou, Torben Bach Pedersen. TheWebConf 2022 (CCF æ¨èAç±») â  XY-Sketch: on Sketching Data Streams at Web Scale. Yongqiang Liu, Xike Xie*. TheWebConf 2021 (CCF æ¨èAç±») â  On Efficient and Scalable Time-Continuous Spatial Crowdsourcing. Ting Wang, Xike Xie*, Xin Cao, Torben Bach Pedersen, Yang Wang, Mingjun Xiao. ICDE 2021 (CCF æ¨èAç±») â  A Data-driven Sequential Localization Framework for Big Telco Data. Fangzhou Zhu, Mingxuan Yuan, Xike Xie*, Ting Wang, Shenglin Zhao, Weixiong Rao, Jia Zeng. IEEE Transactions on Knowledge and Data Engineering (TKDE), accepted (2020) (CCF æ¨èAç±») â  OLAP over Probabilistic Data Cubes II: on Parallelization and Aggregating Extension. Xike Xie*, Kai Zou, Xingjun Hao, Torben Bach Pedersen, Peiquan Jin, Wei Yang. IEEE Transactions on Knowledge and Data Engineering (TKDE), accepted (2019) (CCF æ¨èAç±») â  A Survey of Spatial Crowdsourcing. Srinivasa Raghavendra Bhuvan Gummidi, Xike Xie*, Torben Bach Pedersen. ACM Transactions on Database Systems (TODS), 44(2), Article 8, 46 pages (2019) (CCF æ¨èAç±») â  Reverse Keyword-Based Location Search. Xike Xie*, Xin Lin, Jianliang Xu, Christian S. Jensen. ICDE 2017: 375-386 (CCF æ¨èAç±») â  Elite: an Elastic Infrastructure for Big Spatiotemporal Trajectories. Xike Xie, Benjin Mei, Jinchuan Chen, Xiaoyong Du, Christian S. Jensen. Very Large Data Base Journal (VLDBJ), 25(4): 473-493 (2016) (CCF æ¨èAç±») â  OLAP over Probabilistic Data Cubes I: Aggregating, Materializing, and Querying. Xike Xie, Xingjun Hao, Torben Bach Pedersen, Peiquan Jin, Jinchuan Chen. ICDE 2016: 799-810 (CCF æ¨èAç±») â  Learning-Aided Cleansing for Indoor RFID data. Asif Iqbal Baba, Manfred Jaeger, Hua Lu, Torben Bach Pedersen, Wei-Shinn Ku, Xike Xie. SIGMOD 2016: 925-936 (CCF æ¨èAç±») â  Enabling Scalable Geographic Service Sharing with Weighted Imprecise Voronoi Cells. Xike Xie, Peiquan Jin, Man Lung Yiu, Jiang Du, Mingxuan Yuan, Christian S. Jensen. IEEE Transactions on Knowledge and Data Engineering (TKDE), 28(2):439-453 (2016) (CCF æ¨èAç±») [Full Publication List] A childâs life is like a piece of paper on which every passerby leaves a mark. ç§ç é¡¹ç® â  å½å®¶èªç¶ç§å­¦åºéé¢ä¸é¡¹ç®âé¢åå¾æµè®¡ç®çç¥ç»å¾Sketchææ¯ç ç©¶â(ç¼å·ï¼62472400, 2025-2028)ï¼50ä¸ï¼ä¸»æ â  å½å®¶èªç¶ç§å­¦åºéé¢ä¸é¡¹ç®âé¢åç¨çåå¸æç¥çç¾¤æºååæ°æ®è´¨éç®¡çå ³é®ææ¯ç ç©¶â(ç¼å·ï¼62072428, 2021-2024)ï¼57ä¸ï¼ä¸»æ â  å½å®¶èªç¶ç§å­¦åºéé¢ä¸é¡¹ç®âåºäºäººæºååçå¤§æ°æ®æ¢ç´¢ç³»ç»å ³é®ææ¯ç ç©¶â(ç¼å·ï¼61772492, 2018-2021)ï¼64ä¸ï¼ä¸»æ â  \"å¤§æ¨¡åçé¿åºåè®­ç»åæ¨ç\", æ¨ªåï¼2023-2024, 60ä¸ï¼ä¸»æ â  CCF-åä¸ºæ°æ®åºåæ°ç ç©¶è®¡å\"é¢ååå¸å¼å¤§å¾å¤çç³»ç»çGPUæ¥å ¥æ¡æ¶ç ç©¶ä¸è®¾è®¡\", 2019-2020ï¼50ä¸ï¼ä¸»æ â  æ±èçèªç¶ç§å­¦åºéé¢ä¸é¡¹ç®âç©èç½ç¯å¢ä¸çä½ç½®æ°æ®è´¨éç®¡çææ¯âï¼ç¼å·ï¼BK20171240ï¼ 2017-2019ï¼ï¼10ä¸ï¼ä¸»æ â  ä¸­ç§é¢BRè®¡åï¼340ä¸ï¼ä¸»æ æå­¦æ´»å¨ â  ä¸ä¸è±è¯­ï¼ä¸­å½ç§å­¦ææ¯å¤§å­¦ï¼ç¡å£«çè¯¾ç¨ï¼2024 â  æ°æ®åºç³»ç»ï¼ä¸­å½ç§å­¦ææ¯å¤§å­¦ï¼æ¬ç§çè¯¾ç¨ï¼2020 â  æ°æ®ä»åºä¸æ°æ®ææï¼ä¸­å½ç§å­¦ææ¯å¤§å­¦ï¼ç¡å£«çè¯¾ç¨ï¼2019ï¼2020 â  æ°æ®åºåæ²¿ææ¯ï¼ä¸­å½ç§å­¦ææ¯å¤§å­¦ï¼åå£«çè¯¾ç¨ï¼2018ï¼2019ï¼2020 â  Advanced Database System, ä¸¹éº¦å¥¥å°å ¡å¤§å­¦ï¼ç¡å£«çè¯¾ç¨ï¼2012, 2013ï¼2014, 2015 ï¼åä½è ï¼Christian Thomsenææï¼ â  Study Group on Spatiotemporal Databases, ä¸¹éº¦å¥¥å°å ¡å¤§å­¦ï¼åå£«çè¯¾ç¨ï¼2015 ï¼åä½è ï¼Katja Hoseææï¼ â  Database System (SW6), ä¸¹éº¦å¥¥å°å ¡å¤§å­¦ï¼æ¬ç§çè¯¾ç¨ï¼2012ï¼åä½è ï¼éåææï¼ çæ´»ç §ç ä¸å¾ä¸­æä¸ä¸ªæ¯âä¸»ç¨âï¼æä¸ä¸ªæ¯âéº¦é¸âï¼ççè°æ¯è°ï¼uploaded by å´æ¹ç»´. Show All é£æ¯ æ´»å¨ äººç© Contact Us Email: xkxie at ustc dot edu dot cn The Data Darkness Lab is the space where we dive into that unknownânot fearing the dark, but exploring it. It's where we uncovering the unseen, decoding the implicit, and revealing the hidden structures of information. Just as astrophy",
  "content_length": 10254,
  "method": "requests",
  "crawl_time": "2025-12-01 14:48:46"
}