{
  "name": "Xilu Wang 0001",
  "homepage": "https://www.surrey.ac.uk/people/xilu-wang",
  "status": "success",
  "content": "Dr Xilu Wang | University of Surrey This website uses cookiesSome of these cookies are necessary and are used to help make our site work. With your consent, we will also use cookies to improve your experience, analyse site usage and assist in our marketing efforts. By clicking 'Accept all', you consent to our use of cookies.You can learn more about these cookies and manage your preferences at any time on our cookies page .Necessary Necessary These cookies enable essential website functions and ensure the site operates properly. They do not store personally identifiable information. While you can disable them in your browser settings, some features may not function correctly.Analytics Analytics These cookies help us understand how visitors interact with our website by collecting anonymous usage data. We use this information to improve website performance and enhance your experience.Personalisation Personalisation These cookies allow us to customise the content you see based on your activity, such as the courses you view, applications you make, or your location. This helps us provide a more relevant and tailored experience when using our site.Marketing Marketing These cookies deliver personalised ads based on your browsing activity and help us measure the effectiveness of our advertising campaigns. Accept all Manage preferences Save preferences Reject all Google Scholar LinkedIn Dr Xilu Wang Surrey Future Fellow PhD wangxilu@surrey.ac.uk Book a meeting with me20 BB 02Fridays 9:00-14:00 by appointment using the bookings link aboveAcademic and research departments School of Computer Science and Electronic Engineering, Nature Inspired Computing and Engineering Research Group, Surrey Institute for People-Centred Artificial Intelligence (PAI). ResearchResearch interestsMy main area of interest is Data-driven Optimization, Artificial Intelligence, and Machine Learning. My research focus liesin the development and application of concepts and algorithms of fair, privacy-preserving, and trustworthy machine learningand data-driven optimization. Topics in this area include:• Multi-objective optimization• Data-driven optimization and Bayesian optimization• Evolutionary Machine Learning: neural architecture search, transfer learning• Trustworthy AI: fair and federated optimization Expand research interests SupervisionPostgraduate research supervision Expand Completed postgraduate research projects I have supervisedAbel Alexander University of Surrey“A comparative study of Bayesian algorithms on expensive optimization” September 2021-September 2022• Distinction, Master student.• He currently works in Bank of America.Adrian Kruse Bielefeld University“Bayesian Multi-objective Evolutionary Optimization, Bielefeld University” January 2023-September 2023• Bachelor student.Scheu Louis Lamar Bielefeld University“Federated learning in objective detection” September 2023-Ongoing• Master student. Expand PublicationsBide Wang, Xilu Wang, Oleksiy V. Klymenko, JIAWEI HU, Rachael Gibson, Andrew Middleton, Chuan-Yu Wu (2025)Targeted probiotic tabletting: A hybrid active learning and finite element modelling approach for process optimisation, In: International journal of pharmaceutics : X10100420 ElsevierDOI: 10.1016/j.ijpx.2025.100420Tablets are an efficient dosage form for delivering probiotics. Prior studies have identified compression pressure, compression speed, and precompression pressure as critical process parameters determining probiotic survival during tabletting. However, due to the labour-intensive and time-consuming nature of experimental investigations, most previous studies focused on evaluating the impact of individual parameters in isolation. Consequently, the rapid and systematic identification of optimal process parameters to maximise probiotic survival remains a significant and unresolved challenge in pharmaceutical formulation research. To address this gap, an integrated approach combining active learning (AL) based Gaussian process regression (GPR) with finite element (FE) modelling was developed to systematically explore the compaction parameter space and identify optimal process conditions. All data utilised in AL were generated using an FE model that was specifically developed to predict viability of probiotics during tabletting. Remarkably, the integrated approach achieved high prediction performance after only 78 iterations, demonstrating a coefficient of determination (R2) of 0.96 across the entire design space for predicting probiotic survival rate during tabletting. Using the well-trained model, a global random sampling strategy combined with threshold filtering was employed to identify regions of the design space likely to yield near-optimal survival rates. Furthermore, the exploration of compression speed and precompression pressure at selected fixed main compression pressures enabled the generation of survival rate maps, providing insights into the interplay between probiotic survival rate and tablet mechanical performance. This study demonstrated the potential of hybrid data-driven and first-principles modelling approaches as a robust strategy for optimising probiotic tabletting processes and accelerating pharmaceutical development.Kaili Zhao, Xilu Wang, Chaoli Sun, Yaochu Jin (2025)A Large-scale Expensive Optimization Algorithm with a Multi-view Synthetic Sampling, In: IEEE Transactions on Evolutionary ComputationEarly Access(Early Access) Institute of Electrical and Electronics Engineers (IEEE)DOI: 10.1109/TEVC.2025.3571929Many real-world problems involve optimizing numerous decision variables and are expensive to evaluate, known as large-scale expensive optimization problems (LSEOPs). While surrogate-assisted evolutionary algorithms have proven effective for expensive problems, training proper models for LSEOPs remains challenging due to insufficient training data. In this paper, we adopt the divide-and-conquer approach, decomposing LSEOPs into lower-dimensional sub-problems and constructing models for sub-problems, and introduce a multi-view synthetic sampling technique for new sample selection. Specifically, we propose sorting all evaluated solutions in an ascending order and dividing them into intervals, from which data are sampled to obtain informative training data for models. The population for the LSEOP is updated by employing cooperative environmental selections on the population, formed by recombining all renewed populations for sub-problems to balance exploration and exploitation. Finally, a solution is selected among the current population for the true evaluation based on its multi-view performance predicted across all sub-problems. Results on CEC'2013 benchmark problems show the effectiveness and efficiency of our proposed method compared to three prevalent large-scale expensive optimization algorithms. Additionally, results on 2000-dimensional CEC'2010 benchmark problems and a 1200-dimensional real-world problem demonstrate encouraging scalability and robustness of the proposed method for addressing higher-dimensional problems.Kaili Zhao, Xilu Wang, Chaoli Sun, Yaochu Jin, Asad Hayat (2024)Efficient Large-Scale Expensive Optimization via Surrogate-assisted Sub-problem Selection, In: IEEE Transactions on Evolutionary Computation14(8) Institute of Electrical and Electronics Engineers (IEEE)DOI: 10.1109/TEVC.2025.3544449Traditional large-scale evolutionary algorithms are limited in their ability to solve certain real-world applications with high-dimensional, black-box, and computationally expensive objectives due to their need for numerous objective evaluations. Surrogate-assisted evolutionary algorithms (SAEAs) have shown effective for expensive black-box optimization by relying on inexpensive surrogate models. However, large-scale optimization remains challenging for SAEAs due to the exponentially growing search space and the presence of multiple local optima, resulting in difficulty in training a proper model due to the lack of samples. To address these challenges, we propose constructing an initial surrogate model on randomly selected dimensions and calculating a Gaussian distribution for each sampled dimension. The surrogate then provides predictions when perturbing each sampled dimension by sampling from the distribution, enabling the identification of the most important variables for constructing an active sub-problem to reduce the search space. A secondary surrogate model, built for the active sub-problem, guides the offspring generation and environmental selection for a modified particle swarm optimization algorithm to effectively explores the sub-space while escaping local optima in large-scale problems. Experimental results on CEC'2013 and CEC'2010 benchmark problems show that the proposed method outperforms state-of-the-art algorithms in addressing large-scale expensive optimization problems. The efficiency of the proposed method is further verified on CEC'2010 benchmark problems extended to 2000 dimensions.Xilu Wang, Yaochu Jin (2024)Distilling Ensemble Surrogates for Federated Data-Driven Many-Task Optimization, In: IEEE Transactions on Evolutionary ComputationEarly Access(Early Access) Institute of Electrical and Electronics Engineers (IEEE)DOI: 10.1109/TEVC.2024.3428701Blackbox optimization problems are commonly seen in the real world, ranging from experimental design to hyperparameter tuning of machine learning models. In numerous scenarios, addressing a collection of similar data-driven blackbox optimization tasks distributed on multiple clients not only raises privacy concerns, but also suffers from non-independent and identically distributed (non-IID) data, seriously deteriorating the optimization performance. To address the above challenges, this paper focuses on handling non-IID data in federated data-driven many-task optimization. To construct a high-quality global surrogate by robustly aggregating the local models, the server first fits a Gaussian distribution for each m",
  "content_length": 10613,
  "method": "requests",
  "crawl_time": "2025-12-01 14:48:47"
}