{
  "name": "Xin Xin 0003",
  "homepage": "https://xinxin-me.github.io",
  "status": "success",
  "content": "Xin Xin's Homepage News Nov 2024 I will organize the 1st R^3AG workshop in SIGIR-AP'24. Nov 2024 Two full paper was accepted in WSDM'25. Oct 2024 One full paper was accepted in NeruIPS'24. Oct 2024 One full paper was accepted in NeruIPS'24. July 2024 Two full papers were accepted in CIKM'24. Oct 2024 One full paper was accepted in Recsys'24. The paper got the \"Best Paper Award\". July 2024 I will co-organize the 1st AgentIR workshop in SIGIR'24. July 2024 One full paper was accepted in SIGIR'24. June 2024 One full paper was accepted in ACL'24. April 2024 One full paper got the \"Best Paper Honorable Mention Award\" in WSDM'24. April 2024 Two full papers were accepted by WSDM'24. Oct 2023 I will organize a workshop about RL-based Information Retrieval in CIKM'23. April 2023 Three full papers about multi-behavior recommendation, RL-based recommendation, and sequential recommendation were accepted by SIGIR'23. Feberary 2023 One full paper about sequential recommendation was accepted by WWW'23. October 2022 One full paper about conversational recommendation was accepted by WSDM'23. July 2022 One paper about recommendation privacy was accepted by TOIS. April 2022 One resource paper about medical conversation was accepted by SIGIR'22 resource track. March 2022 Two full papers about reinforcement learning for recommendation, and conversational recommendation were accepted by SIGIR'22. March 2022 One paper about graph-based social recommendation was accepted by TKDE. Jan 2022 One full paper about denoising recommender systems was accepted by WWW'22! Oct 2021 Two full papers about reinforcement learning for recommender systems were accepted by WSDM'22! Sep 2021 One full paper about pre-training of recommender systems was accepted by ICDM'21! August 2021 I have joined the School of Computing Science and Technology of Shandong University as a tenure-track assistant professor! August 2021 One full paper about sequential recommendation was accepted by CIKM'21! April 2021 Two full paper about recommendation biasing and graph learning debiasing were accepted by SIGIR'21! April 2021 I have been awarded the PhD degree in Computing Science! March 2021 I have successfully passed my PhD viva defense and a PhD degree will be awarded soon! October 2020 One full paper about graph learning for explainable recommendation was accepted by WSDM'21. Collaborated with Hao Chen in SJTU. July 2020 One full paper about graph learning for tag recommendation was accepted by CIKM'20. Collaborated with Bo Chen in SJTU. April 2020 One full paper about reinforcement learning for recommendation was accepted by SIGIR'20. Collaborated with Dr.Alexandros Karatzoglou in Google. April 2019 One full paper about relational modeling for item-based collaborative filtering was accepted by SIGIR'19. Collaborated with Dr.Xiangnan He. April 2019 One full paper about CNN for improved factorization machines was accepted by IJCAI'19. Collaborated with Bo Chen in SJTU. May 2018 One full paper about fast batch gradient descent was accepted by UAI'18. April 2018 A full paper about word embedding was accepted by ACL'18. Xin Xin (辛鑫) Associate Professor Information Retrieval Lab School of Computer Science and Technology Shandong University, China Email: xinxin@sdu.edu.cn N3 Floor, 72 Binhai Road, Qingdao Xin Xin is now an Associate Professor in the School of Computer Science and Technology of Shandong University, as a member of the Information Retrieval Lab. He also serves as the Dean Assistant for the School of Artificial Intelligence, Shandong University. Before that, he got his PhD degree in computing science from University of Glasgow, under the supervision of Prof. Joemon Jose. Formerly, he got his master degree from School of Software Engineering in SJTU (上海交通大学) and his bachelor degree from XJTU (西安交通大学). His research interests span recommender systems, reinforcement learning, graph learning, causual inference for recommendation and NLP. His work appeared in sereval top-tier ML & IR conferences including SIGIR, WSDM, CIKM, IJCAI, ACL and UAI. His PhD is supported by Chinese Scholarship Council. I'm looking for self-motivated (I won't push students while a good student should push me) master students. If you are interested in recommendation, reinforcement learning, and related fields, please drop me your CV (recruiting numbers depends on my funding). PS: Competition could be intense. Applicants are encouraged to have good communication ability (both in Chinese and English) since we could have densely connections with top-100 oversea universites and frequent presentations on international (CCF A/B) conferences. A good researcher should always be happy to share thoughts with peers. Selected Publications [Google Scholar] [Core Rank] pdf PSL: Rethinking and Improving Softmax Loss from Pairwise Perspective for Recommendation Weiqin Yang, Jiawei Chen, Xin Xin, Sheng Zhou, Binbin Hu, Yan Feng, Chun Chen, Can Wang NeruIPS 2024, CCF A pdf Content-Based Collaborative Generation for Recommender Systems Yidan Wang, Zhaochun Ren, Weiwei Sun, Jiyuan Yang, Zhixiang Liang, Xin Chen, Ruobing Xie, Su Yan, Xu Zhang, Pengjie Ren, Zhumin Chen, Xin Xin CIKM 2024, CCF B (corresponding author) pdf Towards empathetic conversational recommender systems Xiaoyu Zhang, Ruobing Xie, Yougang Lyu, Xin Xin, Pengjie Ren, Mingfei Liang, Bo Zhang, Zhanhui Kang, Maarten de Rijke, Zhaochun Ren Recsys 2024, CCF B, BEST PAPER AWARD pdf On the effectiveness of unlearning in session-based recommendation Xin Xin, Liu Yang, Ziqi Zhao, Pengjie Ren, Zhumin Chen, Jun Ma, Zhaochun Ren WSDM 2024, CCF B, Tsinghua Rank A pdf Debiasing Sequential Recommenders through Distributionally Robust Optimization over System Exposure Jiyuan Yang, Yue Ding, Yidan Wang, Pengjie Ren, Zhumin Chen, Fei Cai, Jun Ma, Rui Zhang, Zhaochun Ren, Xin Xin WSDM 2024, CCF B, Tsinghua Rank A (corresponding author), BEST PAPER HONORABLE MENTION pdf Learning Robust Sequential Recommenders through Confident Soft Labels Shiguang Wu, Xin Xin, Pengjie Ren, Zhumin Chen, Jun Ma, Maarten de Rijke, Zhaochun Ren TOIS, CCF A (co-first author) pdf Improving Implicit Feedback-Based Recommendation through Multi-Behavior Alignment Xin Xin, Xiangyuan Liu, Hanbing Wang, Pengjie Ren, Zhumin Chen, Jiahuan Lei, Xinlei Shi, Hengliang Luo, Joemon Jose, Maarten de Rijke and Zhaochun Ren SIGIR 2023, CCF A pdf Contrastive State Augmentations for Reinforcement Learning-Based Recommender Systems Zhaochun Ren, Na Huang, Yidan Wang, Pengjie Ren, Jun Ma, Jiahuan Lei, Xinlei Shi, Hengliang Luo, Joemon Jose and Xin Xin SIGIR 2023, CCF A (corresponding author) pdf Variational Reasoning over Incomplete Knowledge Graphs for Conversational Recommendation Xiaoyu Zhang，Xin Xin, Dongdong Li, Wenxuan Liu, Pengjie Ren, Zhumin Chen, Jun Ma, Zhaochun Ren WSDM 2023, CCF B, Tsinghua Rank A pdf On the User Behavior Leakage from Recommender Exposure Xin Xin, Jiyuan Yang, Hanbing Wang, Jun Ma, Pengjie Ren, Hengliang Luo, Xinlei Shi, Zhumin Chen, Zhaochun Ren TOIS, CCF A pdf Rethinking Reinforcement Learning for Recommendation: A Prompt Perspective Xin Xin, Tiago Pimentel, Alexandros Karatzoglou, Pengjie Ren, Konstantina Christakopoulou, Zhaochun Ren SIGIR 2022, CCF A pdf GDSRec: Graph-Based Decentralized Collaborative Filtering for Social Recommendation Chen Jiajia, Xin Xin , Xianfeng Liang, Xiangnan He, Jun Liu TKDE, CCF A pdf Learning Robust Recommenders through Cross-Model Agreement Yu Wang, Xin Xin *, Zaiqiao Meng, Xiangnan He, Joemon Jose, Fuli Feng WWW 2022, CCF A (*corresponding author) pdf Supervised Advantage Actor-Critic for Recommender Systems Xin Xin, Alexandros Karatzoglou, Ioannis Arapakis, Joemon M Jose WSDM 2022, CCF B, Tsinghua Rank A pdf Decomposed Collaborative Filtering: Modeling Explicit and Implicit Factors For Recommender Systems Hao Chen, Xin Xin, Dong Wang, Yue Ding WSDM 2021, CCF B, Tsinghua Rank A   Codes pdf ﻿Self-Supervised Reinforcement Learning for Recommender Systems Xin Xin, Alexandros Karatzoglou, Ioannis Arapakis, Joemon M Jose SIGIR 2020, CCF A  Codes pdf ﻿Relational Collaborative Filtering: Modeling Multiple Item Relations for Recommendation Xin Xin, Xiangnan He, Yongfeng Zhang, Yongdong Zhang, Joemon Jose SIGIR 2019, CCF A Codes pdf CFM: Convolutional Factorization Machines for Context-Aware Recommendation Xin Xin*, Bo Chen* (co-first author), Xiangnan He, Dong Wang, Yue Ding and Joemon M. Jose IJCAI 2019, CCF A  Codes pdf fBGD: Learning Embeddings From Positive Unlabeled Data with BGD Fajie Yuan, Xin Xin, Xiangnan He, Guibing Guo, Weinan Zhang, T. Chua, J. Jose UAI 2018, CCF B   Codes pdf Batch IS NOT Heavy: Learning Word Representations From All Samples Xin Xin*, Fajie Yuan* (co-first authors), Xiangnan He, Joemon M Jose ACL 2018, CCF A Codes Some of code repos have changed to new github username xinxin-me. Internship Research Intern, Telefonica Research, Barcelona, Spain. May 2019 - Nov.2019 Supervised by Dr.Alexandros Karatzoglou and Dr.Ioannis Arapakis Education University of Glasgow (UofG) Ph.D. in Computer Science October 2017 - March 2021, Glasgow, UK Main Supervisor: Prof. Joemon Jose Shanghai Jiaotong University (SJTU) Master in Software Engineering September 2014 - April 2017, Shanghai, China Supervisor: Prof. Dong Wang Xi'an Jiaotong University (XJTU) Bachelor in Software Engineering September 2010 - June 2014, Xi'an, China Professional Services PC Member of Conferences: Senior Program Committee Member of SIGIR (2023) Program Committee Member of WSDM (2023) Program Committee Member of IJCAI (2021,2022) Program Committee Member of NAACL (2021) Program Committee Member of WWW (2022) Program Committee Member of SIGIR (2020-2022) Program Committee Member of ACL (2020) Program Committee Member of EMNLP (2020) Program Committee Member of ACMMM (2020) Program Committee Member of CHIIR (2020-2023) Program Committee Member of ECIR (2020) Program Committee Member of ACMMM (2019-2022) Invited Reviewer for IEEE Transactions on Information system (TOIS) ",
  "content_length": 10317,
  "method": "requests",
  "crawl_time": "2025-12-01 14:48:50"
}