{
  "name": "Xin Gao 0001",
  "homepage": "https://www.kaust.edu.sa/en/study/faculty/xin-gao",
  "status": "success",
  "content": "Xin Gao - Professor, Computer Science - King Abdullah University of Science and Technology Top Home Study Faculty Xin Gao Professor, Computer Science Chair, Computer Science ProgramCo-Chair, Center of Excellence for Smart HealthPrincipal Investigator, Structural and Functional BioinformaticsExecutive Committee Member, Center of Excellence for Generative AI Computer, Electrical and Mathematical Science and Engineering Division Research Platform Membership: The Bioinformatics Platform xin.gao@kaust.edu.sa We work on the intersection between computer science and biology. In the computational side, we develop theories and methods in the field of machine learning, algorithms, and optimization. In the biological side, we develop novel methods to tackle a wide range of open problems, from sequence analysis, to 3D structure determination, to function annotation, to biological networks, and to healthcare. Program Affiliations Computer Science Statistics Bioengineering Bioscience Center of Excellence Center of Excellence for Generative AI Biography Dr. Gao received his B.A. in Computer Science in 2004 from Tsinghua University, China, and his Ph.D. in Computer Science in 2009 from the David R. Cheriton School of Computer Science at the University of Waterloo, Canada. Before joining KAUST, he served as a Lane Fellow at the Lane Center for Computational Biology at Carnegie Mellon University, U.S., from 2009 to 2010.He is the Associate Editor of numerous journals, including Bioinformatics, npj Artificial Intelligence, Journal of Translational Medicine, Genomics, Proteomics & Bioinformatics, Big Data Mining and Analytics, BMC Bioinformatics, Journal of Bioinformatics and Computational Biology, Quantitative Biology, Complex & Intelligent Systems, and the International Journal of Artificial Intelligence and Robotics Research.Gao has co-authored more than 400 research articles in bioinformatics and AI and is the lead inventor on over 60 international patents. Research Interests Professor Gao's research interest lies at the intersection between AI and biology/health. His research focuses on building novel computational models, developing principled AI techniques, and designing efficient and effective algorithms. He is particularly interested in solving key open problems in biology, biomedicine, health and wellness.In the field of computer science, he is interested in developing machine learning theories and methodologies related to large language models, deep learning, probabilistic graphical models, kernel methods and matrix factorization. In the field of bioinformatics, he works on developing AI solutions to key open problems along the path from biological sequence analysis, to 3-D structure determination, to function annotation, to understanding and controlling molecular behaviors in complex biological networks, and to biomedicine and health care. He is a world-leading expert on developing novel AI solutions for challenges in biology, biomedicine, health and wellness, in particular AI-based drug development, large language models in biomedicine, biomedical imaging analysis, and omics-based disease detection and diagnostics. bioinformatics Computational biology machine learning big data Education Profile Ph.D. University of Waterloo, Canada, 2009B.S. Tsinghua University, 2004 Awards and Recognitions Professional member, Association for Computing Machinery (ACM), 2024Member, Institute of Electrical and Electronics Engineers (IEEE), 2024Member, American Association for the Advancement of Science (AAAS), 2024Member, Association for the Advancement of Artificial Intelligence (AAAI), 2024Member, International Society for Computational Biology (ISCB), 2024Member, Life Science Society (LSS), 2024Member, American Chemical Society (ACS), 2024Member, Synthetic Biology Open Language (SBOL), 2024 Show more Publications Juexiao Zhou, Xiaonan He, Liyuan Sun, Jiannan Xu, Xiuying Chen, Yuetan Chu, Longxi Zhou, Xingyu Liao, Bin Zhang, Shawn Afvari, and Xin Gao*. (2024). “Pre-trained multimodal large language model enhances dermatological diagnosis using SkinGPT-4”. Nature Communications. 15: 5649.Juexiao Zhou, Siyuan Chen, Yulian Wu, Haoyang Li, Bin Zhang, Longxi Zhou, Yan Hu, Zihang Xiang, Zhongxiao Li, Ningning Chen, Wenkai Han, Chencheng Xu, Di Wang, and Xin Gao*. (2023). “PPML-Omics: a privacy-preserving federated machine learning method protects patients’ privacy from omic data”. Science Advances. 10: eadh8601.Bin Zhang, and Xin Gao*. (2023). “Deciphering DNA variant-associated aberrant splicing with the aid of RNA sequencing”. Nature Genetics. 55: 732-733.Longxi Zhou, Xianglin Meng, Yuxin Huang, Kai Kang, Juexiao Zhou, Yuetan Chu, Haoyang Li, Dexuan Xie, Jiannan Zhang, Weizhen Yang, Na Bai, Yi Zhao, Mingyan Zhao, Guohua Wang, Lawrence Carin, Xigang Xiao, Kaijiang Yu, Zhaowen Qiu, and Xin Gao*. (2022). “An Interpretable deep learning workflow for discovering sub-visual abnormalities in CT scans of COVID-19 inpatients and survivors”. Nature Machine Intelligence. 4: 494-503.Longxi Zhou, Zhongxiao Li, Juexiao Zhou, Haoyang Li, Yupeng Chen, Yuxin Huang, Dexuan Xie, Lintao Zhao, Ming Fan, Shahrukh Hashmi, Faisal AbdelKareem, Riham Eiada, Xigang Xiao*, Lihua Li*, Zhaowen Qiu*, and Xin Gao*. (2020). “A rapid, accurate and machine-agnostic segmentation and quantification method for CT-based COVID-19 diagnosis”. IEEE Transactions on Medical Imaging. 39(8): 2638-2652.Yu Li, Sheng Wang, Ramzan Umarov, Bingqing Xie, Ming Fan, Lihua Li, and Xin Gao*. (2018). “DEEPre: sequence-based enzyme EC number prediction by deep learning”. Bioinformatics. 34(5): 760-769. Show more Research Areas Computer Science Computational Bioscience Machine Learning Multimedia - ORCID - KAUST Repository - KAUST Academic Portal - Scopus",
  "content_length": 5778,
  "method": "requests",
  "crawl_time": "2025-12-01 14:48:49"
}