{
  "name": "Xin Zhang 0035",
  "homepage": "https://xinpl.github.io",
  "status": "success",
  "content": "Xin Zhang's Homepage Home Research Publications Service Awards Xin Zhang [Google Scholar] Assistant Professor | Co-Appointed Research Professor Programming Languages Lab Department of Computer Science and Technology School of Electronics Engineering and Computer Science Peking University Address: Room 1809, Science Building # 1, Peking University E-mail: xin AT pku.edu.cn Hello, I am Xin Zhang (pronunciation ≈ \"shin chang\"), an assistant professor at Peking University. Before joining Peking, I was a postdoctoral associate at MIT CSAIL working with Prof. Armando Solar-Lezama. I received my Ph.D. from Georgia Tech under the supervision of Prof. Mayur Naik. I am broadly interested in topics related to programming languages and software engineering. For details, please see Research. Students Ph.D. Zhenyu Yan Junhao Liu Yuanfeng Shi Tianchi Li Yifan Zhang Zhentao Ye (co-adivised with Yingfei Xiong) Haonan Yu Haoran Lin Undergraduates Haoyu Feng Zhiyi Li Zirui Zhou Ziyue Jin Alumni Yaoxuan Wu (Ph.D. Student@UCLA) Yifan Chen (co-adivised with Yingfei Xiong) Teaching Introduction to Probabilistic Programming (Spring 2025) Introduction to Discrete Mathematics (Fall 2024) News Oct 2025 Two papers conditionally accepted at POPL'26. Oct 2025 Two new papers at OOPSLA'25. One on how to combine informal information and formal information in program analysis. The other on how to apply CEGAR to find good representations for Bayesian program analyses. Aug 2025 New paper at ASE'25 on how to exploit logical structures in constraints to accelerate probabilistic inference. June 2025 New TSE paper on how to apply Bayesin reasoning to fault localization. Dec 2024 New paper on adding temporal information to machine learning model explanations at AAAI'25. June 2024 Two new papers at OOPSLA'24. One on how to combine graph neural networks and constraint solving to scale precise program analyses. The other on how to find good representations for program analyses based on Bayesian learning. March 2022 I have two openings for Ph.D. students this year. If you're interested in topics related to program analysis, program synthesis, and reliable machine learning, please apply to our program and contact me! Feb 2022 New paper on applying Bayesian methods to semantics-based fault localization at ICSE'22. July 2021 New paper on accelerating static analyses at SAS'21. May 2021 New paper on supporting causal inference in probabilistic programming at ICML'21. Sep 1, 2020 I will serve on the program committees of PLDI'21 and IJCAI'21. Please consider submitting to them! Oct 1, 2019 New paper at OOPSLA'19 on scalable verification of algorithmic fairness. Aug 15, 2019 I will serve on the external review committee of PLDI'20. Please consider submitting. Feb 15, 2019 I will serve on the program committee of SAS'19. Please consider submitting. Sep 4, 2018 New paper on providing actional explanations to judgments produced by a neural network at NIPS'18. Aug 8, 2018 I have been selected as a winner of the 2015-2016 Facebook Fellowship. Thank you, Facebook! Privacy Policy",
  "content_length": 3078,
  "method": "requests",
  "crawl_time": "2025-12-01 14:48:52"
}