{
  "name": "Xin Liu 0045",
  "homepage": "https://xinliulab.github.io",
  "status": "success",
  "content": "Xin Liu Xin Liu /ʃɪn ljuː/ 🔈 Assistant Professor, Florida State University Focusing on AI-driven edge networks and transformative IoT applications. xliu15 [at] fsu [dot] edu Department of Computer Science Love Building, Room 160 1017 Academic Way Tallahassee, FL 32306-4530 News [Sep 2025] Our lab’s first paper was accepted to IEEE S&P 2026. Congratulations, Bofan! [Jan 2025] 2024–2025 FYAP Grant Awarded. Thankful for the support from FSU! [Aug 2024] Kicked off my journey as a professor at FSU. Go Noles! Selected Publications Full List on Google Scholar 2FiA: Towards WiFi Sensing-Based Authentication with Unique Biometrics Bofan Li, Zhankai Ye, Weikuan Yu, Yongning Tang, Xin Liu* IEEE S&P 2026 O-JRC: An Open Source Software Platform for mmWave Joint Radar-Communication Development and Experimentation Xin Liu, Haocheng Zhu, Eylem Ekici* Computer Networks 2025 FTP: Enabling Fast Beam-Training for Optimal mmWave Beamforming Wei-Han Chen, Xin Liu (co-primary), Kannan Srinivasan*, Srinivasan Parthasarathy IEEE INFOCOM'24 LightThief : Your Optical Communication Information is Stolen behind the Wall Xin Liu, Wei Wang, Guanqun Song, Ting Zhu* USENIX Security'23 Verification and Redesign of OFDM Backscatter Xin Liu, Zicheng Chi, Wei Wang, Yao Yao, Pei Hao, Ting Zhu* USENIX NSDI'21 VMscatter: A Versatile MIMO Backscatter Xin Liu, Zicheng Chi, Wei Wang, Yao Yao, Ting Zhu* USENIX NSDI'20 Leveraging Ambient LTE Traffic for Ubiquitous Passive Communication Zicheng Chi, Xin Liu (co-primary), Wei Wang, Yao Yao, Ting Zhu* ACM SIGCOMM'20 I Can See the Light: Attacks on Autonomous Vehicles Using Invisible Lights Wei Wang, Yao Yao, Xin Liu, Xiang Li, Hao Pei, Ting Zhu* ACM CCS'21 [Paper] [Slides] [Presentation] Parallel Inclusive Communication for Connecting Heterogeneous IoT Devices at the Edge Zicheng Chi, Yan Li, Xin Liu, Yao Yao, Yanchao Zhang, Ting Zhu* ACM SenSys'19 (Best Paper Award Candidate) Chiron: Concurrent High Throughput Communication for IoT Devices Yan Li, Zicheng Chi, Xin Liu, Ting Zhu* ACM MobiSys'18 Passive-ZigBee: Enabling ZigBee Communication in IoT Networks with 1000X+ Less Power Consumption Yan Li, Zicheng Chi, Xin Liu, Ting Zhu* ACM SenSys'18 (Best Paper Runner-up Award) EAR: Exploit Uncontrollable Ambient RF Signals in Heterogeneous Networks for Gesture Recognition Zicheng Chi, Yao Yao, Tiantian Xie, Xin Liu, Zhichuan Huang, Wei Wang, Ting Zhu* ACM SenSys'18 Teaching COP 4610: Operating Systems Fall 2025 F24 Eval CIS 5370: Computer Security S25 Eval Students I am fortunate to mentor and collaborate with the following talented students: Zhuoyuan Liu, Ph.D. Student (Fall 2025 – Present) Bofan Li, Ph.D. Student (Spring 2025 – Present) Zhankai Ye, Ph.D. Student (Fall 2024 – Present) About Me Before joining FSU, I was a Postdoctoral Scholar at the NSF AI-EDGE Institute at The Ohio State University (OSU), where I had the privilege of working under the joint guidance of Prof. Ness Shroff, Prof. Eylem Ekici, and Prof. Kannan Srinivasan. I completed my Ph.D. at the University of Maryland, Baltimore County (UMBC), where I was mentored by Prof. Ting Zhu (now at OSU).",
  "content_length": 3116,
  "method": "requests",
  "crawl_time": "2025-12-01 14:48:48"
}