{
  "name": "Xin Wang 0061",
  "homepage": "https://eric-xw.github.io",
  "status": "success",
  "content": "Xin Wang Xin (Eric) Wang Assistant Professor, UCSB Computer Science Director, UCSB Center for Responsible Machine Learning Head of Research, Simular Email: ericxwang [at] ucsb [dot] edu Follow @xwang_lk Bio Xin (Eric) Wang is an Assistant Professor in the Computer Science Department at UC Santa Barbara and the Head of Research at Simular. He also directs the UCSB Center for Responsible Machine Learning (CRML). His research interests include Natural Language Processing, Computer Vision, and Machine Learning, with an emphasis on Multimodal and Agentic AI. Previously, he was a faculty at UC Santa Cruz and also spent time at Google Research, Meta FAIR, Microsoft Research, and Adobe Research. Eric has served as (Senior) Area Chair for conferences such as ACL, NAACL, EMNLP, ICLR, and NeurIPS, and organized workshops and tutorials at those venues. He has received several awards and recognitions for his work, including Best Paper Awards from CVPR and ICLRW, Google Research Faculty Award, Amazon Alexa Prize Awards, JPMorganChase Faculty Research Award, Cisco Faculty Research Award, eBay Faculty Research Awards, AAII Interdisciplinary Research Award, and various gift awards/grants from Adobe, Apple, Snap, Microsoft, OpenAI, Cybever, Orby, etc. News [NEW!] Agent S3 is released! The first computer use agent that appoaches human-level performance. [NEW!] Three papers accepted to NeurIPS 2025! [NEW!] Four papers accepted to EMNLP 2025! [NEW!] Invited Talks at Amazon and AI Agent Frontier Seminar. [NEW!] Our Agent S2 paper accepted to COLM 2025! [NEW!] Our VLM4D paper accepted to ICCV 2025! [NEW!] Invited Talks at IVADO Bootcamp and Workshop on Autonomous LLM Agents. [NEW!] Invited Talks at Apple, Cisco, Cresta, and Georgian. [NEW!] Keynote at SEMLA 2025. [NEW!] Huge congratulations to Dr. Xuehai He and Dr. Jing Gu on successfully defending their dissertations and graduating! Wishing you both the very best in your next chapter! [NEW!] Two papers accepted to ACL 2025! [NEW!] Our Agent S paper won the Best Paper Award at ICLR 2025 Agentic AI for Science! [NEW!] Serving as Senior Area Chair for EMNLP 2025 and Area Chair for NeurIPS 2025. [NEW!] Agent S2 is released! The best computer use agent with new SOTA on OSWorld, WindowsAgentArena, and AndroidWorld. [NEW!] Keynote Talk at the Large Model Safety Workshop. [NEW!] Invited Talk at Adobe Research, ServiceNow Research, Apple, and eBay. [NEW!] Four papers accepted to ICLR 2025! [NEW!] One paper accepted to NAACL 2025! [NEW!] Received multiple faculty research awards from eBay and Cisco. Thanks! [NEW!] Three papers accepted to EMNLP 2024! [NEW!] Two papers accepted to TMLR 2024! [NEW!] Two papers accepted to ECCV 2024! [NEW!] Two papers accepted to ACL 2024! [NEW!] Two papers accepted to NAACL 2024! [NEW!] Invited talk at Stanford University, Ohio State University, and University of Waterloo. [NEW!] Serving as Area Chair for ICLR 2025, NeurIPS 2024, and COLM 2024. [NEW!] Received a research grant from Microsoft. Thanks Microsoft! [NEW!] Received a gift award from Adobe. Thanks Adobe! [NEW!] Received multiple gift awards from eBay and Snap. Thanks eBay and Snap! [NEW!] Two workshops are accepted to ACL 2024! Will be co-organizing the 3rd Workshop on Advances in Language and Vision Research (ALVR 2024) and the Fourth International Combined Workshop on Spatial Language Understanding and Grounded Communication for Robotics (SpLU-RoboNLP 2024) in Bangkok, Thailand. [NEW!] Invited talk at Yale University (10/2023). [NEW!] Three papers accepted to NeurIPS 2023! Congratulations to all authors! [NEW!] Three papers accepted to EMNLP 2023! Congratulations to all authors! [NEW!] Our Athena team was awarded Second Place (Science Innovation Winner, $50,000) in the Alexa Prize SocialBot Grand Challenge 5! [NEW!] Serving as Area Chair for ICLR 2024. [NEW!] Our SlugJARVIS team won Third Place ($50,000) in the inaugural Alexa Prize SimBot Challenge! NEWS COVERAGE [NEW!] Two papers on (1) Ariel Vision-and-Dialog Navigation and (2) Text-to-Image Association Test are accepted to ACL 2023! [NEW!] Our ESC paper is accepted to ICML 2023! [NEW!] Our SlugJARVIS team advances to the finals of the inaugural Alexa Prize SimBot Challenge! Check out Amazon News for more information about this and UCSC News for our three teams of all three Alexa Prize Challenges! [NEW!] Co-organizing the 5th Workshop on Closing the Loop Between Vision and Language (CLVL) at ICCV 2023. [NEW!] Serving as Area Chair for NeurIPS 2023. [NEW!] Invited talk at the CVPR 2023 VizWiz Grand Challenge Workshop (06/2023). [NEW!] Invited talk at Google Research and UCI (3/2023). [NEW!] Invited talk at KAUST and USC (2/2023). [NEW!] Two papers on (1) Training-Free Structured Diffusion Guidance and (2) Neuro-Symbolic Procedural Planning with Commonsense Prompting (Spotlight) are accepted to ICLR 2023! [NEW!] Three papers on (1) Multimodal Graph Transformer, (2) Imagination-Based Automatic Evaluation, and (3) Imagination-Guided Open-Ended Text Generation are accepted to EACL 2023! [NEW!] Co-organizing the Workshop on Spatial Language Understanding and Grounded Communication for Robotics (SpLU-RoboNLP) at EMNLP 2023. [NEW!] Serving as Area Chair for ACL 2023, ICLR 2023, and EMNLP 2022. [NEW!] Our Sage team received an Amazon Alexa Prize Award to work on Alexa Prize TaskBot Challenge 2. Thanks Amazon! [NEW!] Our paper \"Parameter-Effcient Model Adaptation for Vision Transformers\" is accepted to AAAI 2023! [NEW!] Our Athena team received an Amazon Alexa Prize Award to work on Alexa Prize SocialBot Grand Challenge 5. Thanks Amazon! [NEW!] Our paper \"CPL: Counterfactual Prompt Learning for Vision and Language Models\" is accepted to EMNLP 2022! [NEW!] Our VLMBench paper is accepted to NeurIPS 2022 (Datasets and Benchmarks)! Check out the new compositional benchmark for vision-and-language robotic manipulation HERE! [NEW!] Invited talk at Adobe Research (08/2022). [NEW!] Our papers on (1) Privacy-preserving Federated Vision-and-Language Navigation and (2) Language-guided Artistic Style Transfer are accepted to ECCV 2022! [NEW!] Our SlugJARVIS team won the Alexa Prize SimBot Public Benchmark Challenge! link [NEW!] Our paper on Understanding Instance-Level Impact of Fairness Constraints accepted to ICML 2022! [NEW!] Two papers accepted to NAACL 2022 as Oral presentations! Topics include (1) Imagination-Augmented Natural Language Understanding and (2) Diagnosing Vision-and-Language Navigation. [NEW!] Invited talk at Fudan University (03/2022). [NEW!] Two papers accepted to CVPR 2022! Topics include (1) Compositional Temporal Grounding and (2) Language-based Video Editing. [NEW!] Three papers accepted to ACL 2022! Topics include (1) Vision-and-Language Navigation Survey, (2) Multilingual Fairness, and (3) Interpretable Research Replication Prediction. [NEW!] We have received a Google Faculty Research Award. Thanks Google! [NEW!] Invited speaker at the CVPR 2022 Workshop on Open-Domain Retrieval Under a Multi-Modal Setting. [NEW!] Invited talk at USC ISI (02/2022). [NEW!] Our SlugJARVIS team received an Amazon Alexa Prize Award to work on Alexa Prize SimBot Challenge. Thanks Amazon! [NEW!] Serving as Area Chair for ACL 2022 and NAACL 2022. [NEW!] We have received AAII Interdisciplinary Research Award. [NEW!] Invited talk at Microsoft Research (11/2021). [NEW!] Our paper on Mitigating Gender Bias in Image Search is accepted to EMNLP 2021 as an Oral paper. Congratulations Jialu! [NEW!] Invited talk at Stanford Vision Lab (10/2021). [NEW!] Received Google Cloud Research Credits. [NEW!] Our VALUE paper is accepted to NeurIPS 2021 (Datasets and Benchmarks). Congratulations to all the authors! [NEW!] Serving as Senior Program Committee (SPC) for AAAI 2022 and IJCAI-ECAI 2022. [NEW!] Co-organizing the 4th Workshop on Closing the Loop Between Vision and Language (CLVL) at ICCV 2021! [NEW!] I am giving a Tutorial on \"From VQA to VLN: Recent Advances in Vision-and-Language Research\" at CVPR 2021! [NEW!] Co-organizing the Second Workshop on Advances in Language and Vision Research (ALVR) at NAACL 2021! [NEW!] I am giving a keynote talk at the Third Workshop on Multimodal Artificial Intelligence at NAACL 2021 on June 6th! [NEW!] Our paper on Visual Question Rewriting was accepted to SIGIR 2021! [NEW!] I am serving as Area Chair for CoNLL 2021 and NLPCC 2021. [NEW!] Invited talk at Arizona State University. [NEW!] Two papers on multimodal style transfer learning for VLN and visual comparison were accepted to EACL 2020! [NEW!] I am serving as Area Chair for NAACL 2021. [NEW!] I am serving as Senior Program Committee (SPC) for IJCAI 2021. [NEW!] Three papers were accepted to EMNLP 2020 (two conference papers and one Findings paper)! [NEW!] Two papers were accepted to ECCV 2020 (the adversarial path sampling paper was seleted as Spotlight)! [NEW!] I successfully defended my Ph.D. Dissertation Closing the Loop Between Language and Vision for Embodied Agents. Thanks to the committee and everyone who has helped me along the Ph.D. journey! [NEW!] I am serving as Area Chair and Session Chair for EMNLP 2020. [NEW!] Co-organizing the workshop on Advances in Language and Vision Research (ALVR) at ACL 2020! [NEW!] Two papers were accepted to CVPR 2020 (the REVERIE paper was selected as Oral)! [03/2020] Invited panelist at the GPU Technology Conference (GTC) 2020. [11/2019] Organizer of the workshop on Language & Vision with applications to Video Understanding at CVPR 2020. [11/2019] Organizer of the tutorial on Self-Supervised Deep Learning for NLP at AACL-IJCNLP 2020. [10/2019] Invited speaker at the ICCV 2019 Workshop on Person In Context. [06/2019] Recipient of the CVPR 2019 Best Student Paper Award. [06/2019] Co-Organizer of the workshop on Closing the Loop Between Vision and Language at ICCV 2019. [06/2019] Invited talk at Facebook AI. [01/2019] Session Chair for AAAI 2019 (natural language processing). Selected Awards / Honors Cisco Faculty Research Award, 2025 JPMorganChase",
  "content_length": 39078,
  "method": "requests",
  "crawl_time": "2025-12-01 14:48:50"
}