{
  "name": "Xin Huang 0001",
  "homepage": "https://www.comp.hkbu.edu.hk/~xinhuang",
  "status": "success",
  "content": "Xin Huang - Hong Kong Baptist University Xin Huang Associate Professor Coordinator of Research Postgraduate Programme (PhD&MPhil) Coordinator of Programming Contest Teams Department of Computer Science Hong Kong Baptist University [Bio] [DB Group] Office Hours: DLB635, 3-5 pm on Tuesdays Email: xinhuang at comp.hkbu.edu.hk My research centers on developing innovative technologies and theories of data science, particularly at the large-scale graph data. Graph Data Management (Keyword Search, Graph Indexing, Graph Query Processing) Graph Mining (Graph Summarization and Visualization, Graph Decomposition, Graph Clustering, Node Ranking) Community Search [Tutorial] [Demo] [Code] [Data] [Survey] [Book] Public-Private Graph Analytics [Data] Graph Learning (Graph Neural Networks, Generative Graph Analytics) [Open Positions] I am looking for PhD students, research assistants, and postdocs. Please send me your CV, if you are interested. News [05/2025]: We organized the IEEE ICDE 2025 Workshop on Frontiers of Data Engineering and AI (FEDA). [03/2025]: I'm invited to serve as a Panel Member for 2025/26 Hong Kong PhD Fellowship Scheme (HKPFS) and RGC Junior Research Fellow Scheme (JRFS). [01/2025]: I'm invited to serve as an Associate Editor for Data Science and Engineering (DSE) and World Wide Web Journal (WWWJ). [06/2024]: Our deparment PG Day organizes two-day research and Yacht activities for RPG students. [Link 1] [Link 2] More News Education Ph.D. (The Chinese University of Hong Kong), 2014 B.Eng. (Xiamen University), 2010 Honors Best Student Paper Award, ACM/IEEE IWLS 2023 Best Faculty Article Award, Chinese Communication Association, 2022 HKBU President’s Award for Outstanding Performance as Young Researcher, 2021 Early Career Award, Hong Kong RGC, 2020 Best Paper Nomination, ACM CIKM 2020 Best Paper Award, WISE 2019 Best Student Paper Award, IEEE ICSC 2017 ACM SIGMOD Travel Award, 2014 Contact Mail Address: Room 635, David C. Lam Building Hong Kong Baptist University Kowloon Tong, Hong Kong Office: DLB 635 (map) Email: xinhuang at comp.hkbu.edu.hk Phone: (852) 3411-5958 Fax: (852) 3411-7892",
  "content_length": 2126,
  "method": "requests",
  "crawl_time": "2025-12-01 14:48:47"
}