{
  "name": "Xin Chen 0003",
  "homepage": "http://www.cs.nott.ac.uk/~pszxc",
  "status": "success",
  "content": "Xin Chen (University of Nottingham)'s homepage Dr Xin Chen BEng, PhD, IEEE Senior Member Associate Professor of Computer Science Intelligent Modelling & Analysis Group School of Computer Science University of Nottingham E-mail: Xin.Chen@Nottingham.ac.uk News (Good News Only!) - January, 2025: Four papers were accepted by IEEE-ISBI 2025,. Congratulations to the students. Zhendi Gong, Susan Francis, Eleanor Cox, Stamatios Sotiropoulos, Dorothee Auer, Guoping Qiu, Andrew French, and Xin Chen, \"MO-CTrans: A Unified Multi-organ Segmentation Model Learning from Multiple Heterogeneously Labelled Datasets.\" accepted by IEEE-ISBI, oral presentation, 2025. Benjamin Towle, Xin Chen and Ke Zhou, \"SeqSAM: Autoregressive Multiple Hypothesis Prediction for Medical Image Segmentation using SAM\". accepted by IEEE-ISBI, 2025. Ruizhe Li, Grazziela Figueredo, Dorothee Auer, Rob Dineen, Paul Morgan and Xin Chen, \" A Unified Framework for Semi-supervised Image Segmentation and Registration\", accepted by IEEE-ISBI, 2025. Stephen Lloyd-Brown, Susan Francis, Caroline Hoad, Penny Gowland, Karen Mullinger, Andrew French and Xin Chen, \" An Attentive Representative Sample Selection Strategy Combined with Balanced Batch Training for Skin Lesion Segmentation\", accepted by IEEE-ISBI, 2025. Old News 2024 - December, 2024: our Christmas party - November, 2024: Congrats on Jian's paper that is published in Magnetic Resonance in Medicine on investigating \"Regional changes in cerebral perfusion with age when accounting for changes in gray-matter volume\" . - October, 2024: A collaborative work with University of Adelaide on \"A Multi-Modal Framework for Drug-Drug Interaction Prediction in Long Tail Distinction\" has been published in Proceedings of the 33rd ACM International Conference on Information and Knowledge Management. - March, 2024: Our new paper on proposing a new boundary loss function for image segmentation is now published by Information Sciences. \"Boundary-wise loss for medical image segmentation based on fuzzy rough sets\", Information Sciences. - March, 2024: Three papers were accepted by IEEE-ISBI 2024,. Congratulations to the students. They will present the works in Athens in May. Benjamin Towle, Xin Chen and Ke Zhou, \"SimSAM: Zero-shot Medical Image Segmentation via Simulated Interaction\". accepted by IEEE-ISBI, oral presentation, 2024. Zhendi Gong, Andrew French, Guoping Qiu and Xin Chen, \"CTrans: A Multi-resolution Convolution-transformer Network for Medical Image Segmentation.\" accepted by IEEE-ISBI, oral presentation, 2024. Ruizhe Li, Dorothee Auer, Christian Wagner and Xin Chen, \" MrRegNet: Multi-resolution Mask Guided Convolutional Neural Network for Medical Image Registration with Large Deformations\", accepted by IEEE-ISBI, 2024. 2023 - October, 2023: Huge congratulations to Qiao Lin, who successfully defended her PhD thesis: \"Incorporating Fuzzy-based Methods to Deep Learning Models for Semantic Segmentation\" subject to minor corrections! A few more upcoming papers from her thesis. - September, 2023: Many congratulations to Ruizhe Li who passed his PhD viva subject to minor corrections! The title of his thesis is \"Semi-supervised Learning for Medical Image Segmentation\". He has also been awarded the University Tri Campus Postgraduate Prize: Andrew Hendry Postgraduate Scholarship, as a recognition of the contributions he has made in his research. - August, 2023: Our new paper on out-of-distirbution detection has been published in Fuzz-IEEE conference. \"Fuzzy Uncertainty-based Out-of-distribution Detection Algorithm for Semantic Segmentation\", IEEE International Conference on Fuzzy Systems 2023. - March, 2023: I am now Associate Professor of Computer Science - January, 2023: Now our grand challenge winner paper has been published \"Motion-Related Artefact Classification Using Patch-Based Ensemble and Transfer Learning in Cardiac MRI\" International Workshop on Statistical Atlases and Computational Models of the Heart, MICCAI 2022. ArXiv version 2022 - December, 2022: Congrats to Qiao's paper \"A Novel Quality Control Algorithm for Medical Image Segmentation Based on Fuzzy Uncertainty\" has now been published by IEEE Transactions on Fuzzy Systems. Well done! - October, 2022: as one of the co-Is, our multi-million project that aims to measure, model and predict gestational development was funded by Wellcome Leap's In Utero programme. - September, 2022: There is nothing happier than witnessing a talented and diligent PhD student (Ruizhe Li) get rewarded! We are the winner of task 1 CMRxMotion Challenge held in MICCAI2022 . - July, 2022: Mina Jafari's paper \"LMISA: A Lightweight Multi-modality Image Segmentation Network via Domain Adaptation using Gradient Magnitude and Shape Constraint\" has now been published by Medical Image Analysis. Well done! - June, 2022: Many congratulations to Mina Jafari on successfully defended her PhD thesis subjective to minor corrections, entitled \"Improvement of Model Performance and Generalisability of Deep Convolutional Neural Networks for Medical Image Segmentation.\" She is now working as a Post-doc researcher at Imperial College London. All the best! - June, 2022: Huge congrats to Zixiao, who is now officially Dr. Shen. He has been awarded his PhD on the topic of feature selection using Fuzzy-based methods. - June, 2022: Congrats to Zhendi's first paper, which is accepted by MIUA 2022. The paper presents a muscle segmentation method on Whole-body MRI based on his MSc work. He is now a year 1 PhD student under my supervision. - May, 2022: Qiao Lin's new paper on \"Quality Quantification in Deep Convolutional Neural Networks for Skin Lesion Segmentation using Fuzzy Uncertainty Measurement\" has been accepted by IEEE-WCCI 2022 as an oral presentation. - April, 2022: Golnar K. Mahani's new idea for bounding box based image segmentation is published in IEEE-ISBI 2022. Bounding Box Based Weakly Supervised Deep Convolutional Neural Network for Medical Image Segmentation Using an Uncertainty Guided and Spatially Constrained Loss. About I am an Associate Professor of Computer Science at the University of Nottingham, UK. My research interests are image processing, computer vision and machine learning, particularly applied to medical image analysis. My team and I develop algorithms for 2D/3D image segmentation, image registration, statistical shape/ motion modelling, classification/ regression models and CT & MRI image reconstruction, which have been successfully applied to different medical applications (e.g. breast cancer, diabetes care, wrist injury and radiotherapy). I am an active member in the computer vision and medical imaging community, regularly serve as reviewers for international conferences and prestigious journals (e.g. Medical Image Analysis, MICCAI, IEEE-ISBI, BMVC, IEEE-TMI, IEEE-TBME, Physics in Medicine and Biology, etc.). Previous Projects Inferring 3D Kinematics of Carpal Bones from Single View Fluoroscopic Sequences The wrist is one of the most complex and vulnerable joints in the body, consisting of eight carpal bones. Wrist pain is currently diagnosed by expert assessment of abnormal carpal bone movements in 2D fluoroscopy sequences. The overall aim of the current project is computer interpretation of these 2D sequences to recover the 3D motion of the carpal bones, and further leads to quantitative measurements of wrist diseases. - Chen, X., et al., Automatic Inference and Measurement of 3D Carpal Bone Kinematics From Single View Fluoroscopic Sequences. IEEE Transactions on Medical Imaging, 2013. 32(2): p. 317-328. - Chen, X., et al., Automatic Generation of Statistical Pose and Shape Models for Articulated Joints. IEEE Transactions on Medical Imaging, 2014. 33(2): p. 372 - 383. - Chen, X., et al., Inferring 3D kinematics of carpal bones from single view fluoroscopic sequences, MICCAI 2011, Springer. p. 680-687. - Chen, X., et al., Integrated frameworkfor simultaneous segmentation and registration of carpal bones, ICIP 2011, p. 433-436. Quantification of diabetic peripheral neuropathy using corneal confocal microscopy image Corneal confocal microscopy is a novel in-vivo imaging modality that has the potential to be a non-invasive and objective image biomarker for peripheral neuropathy. Automatic quantification of nerve morphology is a major step forward in the early diagnosis and assessment of progression, and, in particular, for use in clinical trials to establish therapeutic benefit in diabetic and other peripheral neuropathies. - Chen, X., et al., An Automatic Tool for Quantification of Nerve Fibers in Corneal Confocal Microscopy Images. IEEE Transactions on Biomedical Engineering, 2017. 64(4): p. 786-794. - Chen, X., et al., Small Nerve Fiber Quantification in the Diagnosis of Diabetic Sensorimotor Polyneuropathy: Comparing Corneal Confocal Microscopy With Intraepidermal Nerve Fiber Density. Diabetes Care, 2015. 38(6): p. 1138-1144. Adapting breast cancer screening strategy using personalised risk estimation Currently, breast screening is almost exclusively performed with mammography. However, for women with dense breasts the sensitivity of mammography for detecting breast cancer is low. The aim of the project is to develop methods to personalise breast cancer screening, based on risk and breast density markers. We have deleloped method to estimated volumetric breast density from single view mammography. - Chen, X., et al., Improving Mammographic Density Estimation in the Breast Periphery, IWDM 2016, p. 469-477 - Chen, X., et al., A Novel Framework for Fat, Glandular Tissue, Pectoral Muscle and Nipple Segmentation in Full Field Digital Mammograms, IWDM 2014. p. 201-208 - Chen, X., et al., Breast Cancer Risk Analysis Based on a Novel Segmentation Framework for Digital Mammograms, MICCAI 2014. p. 536-543. High Temporal and Spatial Resolution Dynamic MRI Reconstruction Dynamic magnetic resonance imaging (MRI) involves imaging a region of interest with high temporal resolution, and is use",
  "content_length": 14768,
  "method": "requests",
  "crawl_time": "2025-12-01 14:48:52"
}