{
  "name": "Xin Yu 0002",
  "homepage": "https://about.uq.edu.au/experts/38367",
  "status": "success",
  "content": "Associate Professor Xin Yu | UQ Experts Skip to menu Skip to content Skip to footer Associate Professor Xin Yu Email: xin.yu@uq.edu.au Positions Affiliate of ARC COE for Children and Families Over the Lifecourse ARC COE for Children and Families Over the Lifecourse Faculty of Humanities, Arts and Social Sciences Affiliate of Centre for Enterprise AI Centre for Enterprise AI Faculty of Engineering, Architecture and Information Technology Honorary Associate Professor School of Electrical Engineering and Computer Science Faculty of Engineering, Architecture and Information Technology Overview Background My name is Xin Yu, a Senior Lecturer at the University of Queensland. I am an Australian Research Council Discovery Early Career Researcher Award 2023-2025 (DECRA) recipient and an awardee of the prestigious Google Research Scholar Program in 2021. I am also a Google Visiting Faculty. Previously, I was a research fellow at the Australian National University (ANU). I received my PhD degree from the Australian National Unversity under the supervision of Prof. Richard Hartley, Prof. Fatih Porikli and Dr. Basura Fernando. I also received a PhD degree from Tsinghua University supervised by Prof. Li Zhang. I am interested in Computer Vision and Machine Learning topics. My research topics includes various computer vision and machine learning tasks, especially in efficient low-level image processing, image retrieval and localization, action recognition, 3D pose estimation, visual navigation and sign language recognition and translation. Read more Read less Availability Associate Professor Xin Yu is: Available for supervision Research impacts One of my research papers has been awarded \"Best Paper Honorable Mention\" award in the premium computer vision conference WACV 2020, and one paper has been nominated for the Best Paper Award in CVPR 2020. I was awarded the Outstanding Reviewer Award in ECCV 2020, CVPR 2021 and ICCV 2021. CVPR, ICCV and ECCV are internationally world-leading computer vision and machine learning conferences. My research interests include deep learning techniques, image processing, and computer vision tasks. I am a program committee member of top-tier computer vision and machine learning conferences, such as CVPR, ICCV, ECCV, ICML, ICLR and NeurIPS, and a reviewer of prestigious journals, such as TPAMI, IJCV and TIP. I am happy to supervise self-motivated PhD and MPhil students. If you are an undergraduate student and willing to conduct your honour project, please drop me an email. Read more Read less Works Search Professor Xin Yu’s works on UQ eSpace All (165) Journal Article (54) Conference Publication (110) Book Chapter (1) 2025 Journal Article Hyperspectral video object tracking with cross-modal spectral complementary and memory prompt network Jiang, Wenhao, Zhao, Dong, Wang, Chen, Yu, Xin, Arun, Pattathal V., Asano, Yuta, Xiang, Pei and Zhou, Huixin (2025). Hyperspectral video object tracking with cross-modal spectral complementary and memory prompt network. Knowledge-Based Systems, 330 (Part B) 114595, 1-16. doi: 10.1016/j.knosys.2025.114595 Hyperspectral video object tracking with cross-modal spectral complementary and memory prompt network 2025 Conference Publication Dynamic derivation and elimination: audio visual segmentation with enhanced audio semantics Liu, Chen, Yang, Liying, Li, Peike, Wang, Dadong, Li, Lincheng and Yu, Xin (2025). Dynamic derivation and elimination: audio visual segmentation with enhanced audio semantics. 2025 IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR), Nashville, TN USA, 10-17 June 2025. Piscataway, NJ USA: Institute of Electrical and Electronics Engineers. doi: 10.1109/cvpr52734.2025.00298 Dynamic derivation and elimination: audio visual segmentation with enhanced audio semantics 2025 Conference Publication Blind bitstream-corrupted video recovery via metadata-guided diffusion model Wang, Shuyun, Zhang, Hu, Shen, Xin, Wang, Dadong and Yu, Xin (2025). Blind bitstream-corrupted video recovery via metadata-guided diffusion model. 2025 IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR), Nashville, TN USA, 10-17 June 2025. New York, NY USA: IEEE Computer Society. doi: 10.1109/CVPR52734.2025.02139 Blind bitstream-corrupted video recovery via metadata-guided diffusion model 2025 Conference Publication Robust audio-visual segmentation via audio-guided visual convergent alignment Liu, Chen, Li, Peike, Yang, Liying, Wang, Dadong, Li, Lincheng and Yu, Xin (2025). Robust audio-visual segmentation via audio-guided visual convergent alignment. 2025 IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR), Nashville, TN USA, 10-17 June 2025. Piscataway, NJ USA: Institute of Electrical and Electronics Engineers. doi: 10.1109/cvpr52734.2025.02693 Robust audio-visual segmentation via audio-guided visual convergent alignment 2025 Conference Publication EasyCraft: a robust and efficient framework for automatic avatar crafting Wang, Suzhen, Chen, Weijie, Zhang, Wei, Zhao, Minda, Li, Lincheng, Zhang, Rongsheng, Hu, Zhipeng and Yu, Xin (2025). EasyCraft: a robust and efficient framework for automatic avatar crafting. 2025 IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR), Nashville, TN USA, 10-17 June 2025. New York, NY USA: IEEE Computer Society. doi: 10.1109/CVPR52734.2025.00524 EasyCraft: a robust and efficient framework for automatic avatar crafting 2025 Conference Publication M3GYM: a large-scale multimodal multi-view multi-person pose dataset for fitness activity understanding in real-world settings Xu, Qingzheng, Cao, Ru, Shen, Xin, Du, Heming, Wang, Sen and Yu, Xin (2025). M3GYM: a large-scale multimodal multi-view multi-person pose dataset for fitness activity understanding in real-world settings. 2025 IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR), Nashville, TN, United States, 10 - 17 June 2025. Washington, DC, United States: I E E E Computer Society. doi: 10.1109/cvpr52734.2025.01147 M3GYM: a large-scale multimodal multi-view multi-person pose dataset for fitness activity understanding in real-world settings 2025 Conference Publication Cross-view isolated sign language recognition challenge: design, results and future research Shen, Xin, Du, Heming, Xu, Miao, Liu, Miaomiao and Yu, Xin (2025). Cross-view isolated sign language recognition challenge: design, results and future research. WWW '25: The ACM Web Conference 2025, Sydney, NSW Australia, 28 April-2 May 2025. New York, NY USA: Association for Computing Machinery. doi: 10.1145/3701716.3717522 Cross-view isolated sign language recognition challenge: design, results and future research 2025 Conference Publication MDAM 3: a misinformation detection and analysis framework for multitype multimodal media Xu, Qingzheng, Du, Heming, Łukasik, Szymon, Zhu, Tianqing, Wang, Sen and Yu, Xin (2025). MDAM 3: a misinformation detection and analysis framework for multitype multimodal media. WWW '25: The ACM Web Conference 2025, Sydney, NSW Australia, 28 April-2 May 2025. New York, NY USA: Association for Computing Machinery. doi: 10.1145/3696410.3714498 MDAM 3: a misinformation detection and analysis framework for multitype multimodal media 2025 Conference Publication TokenBinder: Text-Video Retrieval with One-to-Many Alignment Paradigm Zhang, Bingqing, Cao, Zhuo, Du, Heming, Yu, Xin, Li, Xue, Liu, Jiajun and Wang, Sen (2025). TokenBinder: Text-Video Retrieval with One-to-Many Alignment Paradigm. IEEE. doi: 10.1109/wacv61041.2025.00485 TokenBinder: Text-Video Retrieval with One-to-Many Alignment Paradigm 2025 Conference Publication FlashVTG: Feature Layering and Adaptive Score Handling Network for Video Temporal Grounding Cao, Zhuo, Zhang, Bingqing, Du, Heming, Yu, Xin, Li, Xue and Wang, Sen (2025). FlashVTG: Feature Layering and Adaptive Score Handling Network for Video Temporal Grounding. 2025 Winter Conference on Applications of Computer Vision-WACV, Tucson Az, Feb 28-Mar 04, 2025. LOS ALAMITOS: IEEE. doi: 10.1109/wacv61041.2025.00894 FlashVTG: Feature Layering and Adaptive Score Handling Network for Video Temporal Grounding 2025 Journal Article DreamCar: leveraging car-specific prior for in-the-wild 3D car reconstruction Du, Xiaobiao, Sun, Haiyang, Lu, Ming, Zhu, Tianqing and Yu, Xin (2025). DreamCar: leveraging car-specific prior for in-the-wild 3D car reconstruction. IEEE Robotics and Automation Letters, 10 (2), 1840-1847. doi: 10.1109/lra.2024.3523231 DreamCar: leveraging car-specific prior for in-the-wild 3D car reconstruction 2025 Journal Article TalkCLIP: talking head generation with text-guided expressive speaking styles Ma, Yifeng, Wang, Suzhen, Ding, Yu, Ma, Bowen, Lv, Tangjie, Fan, Changjie, Hu, Zhipeng, Deng, Zhidong and Yu, Xin (2025). TalkCLIP: talking head generation with text-guided expressive speaking styles. IEEE Transactions on Multimedia, 27, 6335-6346. doi: 10.1109/tmm.2025.3581808 TalkCLIP: talking head generation with text-guided expressive speaking styles 2025 Conference Publication Affective behaviour analysis via&nbsp;progressive learning Liu, Chen, Zhang, Wei, Qiu, Feng, Li, Lincheng, Wang, Dadong and Yu, Xin (2025). Affective behaviour analysis via&nbsp;progressive learning. ECCV 2024 Workshops, Milan, Italy, 29 September - 4 October 2024. Heidelberg, Germany: Springer. doi: 10.1007/978-3-031-91581-9_26 Affective behaviour analysis via&nbsp;progressive learning 2025 Conference Publication Transferable attacks for&nbsp;semantic segmentation He, Mengqi, Zhang, Jing and Yu, Xin (2025). Transferable attacks for&nbsp;semantic segmentation. 35th Australasian Database Conference, Gold Coast, QLD, Australia, 16-18 December 2024. Heidelberg, Germany: Springer. doi: 10.1007/978-981-96-1242-0_28 Transferable attacks for&nbsp;semantic segmentation 2025 Journal Article ICE: Interactive 3D Game Character Facial Editing via Dialogue Wu, Haoqian, Zhao, Minda, Hu, Zhipeng, Fan, Changjie, Li, Lincheng, Chen, Weijie, Zhao, Rui an",
  "content_length": 17673,
  "method": "requests",
  "crawl_time": "2025-12-01 14:48:53"
}