{
  "name": "Xin Liang 0001",
  "homepage": "https://lxaltria.github.io",
  "status": "success",
  "content": "Xin's Homepage Xin Liang Assistant Professor Department of Computer Science University of Kentucky Office: 227 James F. Hardymon Bldg. Email: xliang@uky.edu Tel: (859)257-8029 Biography Dr. Xin Liang is a tenure-track assistant professor with the Department of Computer Science at University of Kentucky (UK). He received his Ph.D. in Computer Science from University of California, Riverside in 2019. Prior to that, he received his B.S. in Computer Science from Peking University in 2014, with a minor in Math and Applied Math. During his Ph.D. studies, he worked as student interns in the Extreme Scale Resilience Group and the Parallel Extreme-Scale Data Analytics Team at Argonne National Laboratory (ANL), the Scalable Machine Learning Group at Pacific Northwest National Laboratory (PNNL), and the Data Science at Scale Team at Los Alamos National Laboratory (LANL). Prior to joining UK, he worked as an assistant professor at Missouri University of Science and Technology and Computer/Data Scientist in the Workflow Systems Group at Oak Ridge National Laboratory (ORNL). Dr. Liang's research interests lie broadly in the areas of high-performance computing, parallel and distributed systems, scientific data management, large-scale data analytics, and distributed machine learning. He has published in many highly competitive conferences and journals such as IEEE/ACM SC, ACM HPDC, ACM PPoPP, ACM ICS, IEEE IPDPS, ACM PACT, IEEE BigData, IEEE Cluster, IEEE TPDS etc. He has received a Dissertation Year Fellowship (DYP) from UCR, two Best Paper Awards from IEEE Cluster, one Best Paper Finalist from ACM ICS, one Best Paper Award from IEEE IPDPS, one Best Paper Award from IEEE TBD, a CRII Award from the NSF, an EPSCoR Fellowship from the NSF, and a CAREER Award from the NSF. He has also received the IEEE CS TCHPC Early Career Researchers Award For Excellence in High Performance Computing in 2024. While working at ORNL, he led the ESAMR project funded by the Director's Research and Development (DRD) program as principal investigator. He is one of the key developers of SZ and major contributors of MGARD, which are two widely used data reduction software in the scientific computing community. More details about Dr. Liang can be found in his CV. Dr. Liang is always looking for self-motivated students to work on high-performance computing, scientific data management, and big data analytics. If you're interested in his research, please contact him at xliang@uky.edu. According to CS ranking, UK is ranked 35th considering the last ten years (2014-2024) and 27th considering the last eight years (2016-2024) among all the US universities in the area of high-performance computing. Latest News 07/2025: Jiannan has accepted an offer from Oakland University and will start as a tenure-track Assistant Professor there on August. Congratulations to Prof. Tian! 06/2025: Four papers have been accepted by SC'25. Congratulations to Wenbo on his co-first author paper! 06/2025: Jiannan's CSSI project has been awarded by the National Science Foundation (his role: site PI, in collaborations with the University of Houston and the University of Chicago). Congratulations to Jiannan! 06/2025: Xuan's paper on unstructured scientific data compression has been selected as the Best Paper Award in IPDPS'25. Congratulations to Xuan and the team! 04/2025: One paper has been accepted at VLDB'25. Congratulations to Pu! 04/2025: I am very honored to receive the Pigman College of Engineering Excellence in Research Award (one out of all Assistant Professors in the Stanley and Karen Pigman Colledge of Engineering at the University of Kentucky). Thanks a lot for the recognition from the college! 04/2025: Our OAC Core project has been awarded by the National Science Foundation (my role: site PI, in collaborations with the University of Illinois, Urbana-Champaign). This project aims to design a learning-driven framework to mitigate artifacts in scientific lossy data compressors. Thanks a lot to the NSF! 03/2025: One paper has been accepted at ICDE'25. Congratulations to Mingze! 01/2025: Xuan's paper on unstructured scientific data compression has been nominated for the Best Paper Award in IPDPS'25. Congratulations to Xuan and the team! 01/2025: One paper has been accepted at PacificVis'25 (TVCG journal track). 12/2024: Three papers have been accepted in IPDPS'25. Congratulations to Xuan and Pu! 12/2024: My CAREER project has been awarded by the National Science Foundation! This project aims to reduce the data movement time for scientific applications by enabling adaptable data retrieval with error control. Thanks a lot to the NSF! 12/2024: Our paper on the SZ3 lossy compression framework has been selected as the 2023 Best Paper Award from IEEE Transactions on Big Data by the IEEE Computer Society Publications Board. Congratulations to the team! 11/2024: I am very honored to receive the 2024 IEEE CS TCHPC Early Career Researchers Award For Excellence in High Performance Computing. Thanks a lot for the recognition from the community! [Announcement] [UK CCS News] 11/2024: One paper has been accepted at SIGMOD'25. 10/2024: Dr. Jiannan Tian joined our team as a postdoc researcher. Welcome Jiannan! 09/2024: We received a renewal of our subcontract from Argonne National Laboratory to continue the investigation of feature regeneration in lossy compressors. Thanks a lot to ANL! 08/2024: Boyi Zhang and Wenbo Li joined our team as PhD students. Welcome Boyi and Wenbo! 07/2024: One paper has been accepted in VIS'24. 06/2024: Two papers have been accepted in SC'24. Congratulations to Xuan on getting her first SC paper accepted! 03/2024: One paper has been accepted in EuroVis'24. 01/2024: One paper has been accepted in IPDPS'24. 12/2023: One paper has been accepted in ICDE'24. Congratulations to Mingze! 11/2023: Dr. Liang has been recommended as EPSCoR Research Fellows for our RII Track-4 project awarded by the National Science Foundation (my role: PI). This project aims to improve the performance of MPI on exascale systems with adaptive lossy compression methods. Thanks a lot to the NSF! 11/2023: One paper has been accepted in SIGMOD'24. 09/2023: One paper has been accepted in HiPC'23. Congratulations to Pu! 08/2023: Our OAC Core project has been awarded by the National Science Foundation (my role: lead PI, in collaborations with the University of Utah and the Ohio State University). This project aims to design topology-aware compressors for scientific applications. Thanks a lot to the NSF! 08/2023: Xuan Wu joined our team as a PhD student. Welcome Xuan! 06/2023: One paper has been accepted in VIS'23. 06/2023: Our CSSI project has been awarded by the National Science Foundation (my role: lead PI, in collaborations with New Jersey Institute of Technology and Temple University). This project aims to develop progressive data management middleware to advance exascale science. Thanks a lot to the NSF! 05/2023: One paper has been accepted in ICS'23 and nominated in the Best Paper Finalists! 04/2023: Two papers have been accepted in HPDC'23. 02/2023: One paper has been accepted in ICDE'23. 01/2023: Mikhail Kovalev and Andrew Chen from Paul Laurence Dunbar High School joined our team to complete their capstone research project. Welcome Mikhail and Andrew! 11/2022: One paper has been accepted in VLDB'23. Congratulations to Pu! 11/2022: One paper has been accepted in PPoPP'23. 11/2022: Attended the Turing lecture by Dr. Jack Dongarra at SC'22. Dr. Dongarra received the 2021 ACM A.M. Turing Award for pioneering contributions to numerical algorithms and libraries that enabled high performance computational software. [video] 10/2022: We received a subcontract from Argonne National Laboratory to investigate feature regeneration in lossy compressors. Thanks a lot to ANL! 10/2022: One paper has been accepted in IEEE Transactions on Visualization and Computer Graphics. 08/2022: Mingze Xia joined our team as a PhD student. Welcome Mingze! 08/2022: Our CyberTraining project has been awarded by the National Science Foundation (my role: site PI, in collaboration with University of North Texas, Southern Illinois University Carbondale, and Missouri University of Science and Technology). This project aims to host training workshops to develop workforce for deep learning with GPU-based systems. Thanks a lot to the NSF! 08/2022: One paper has been accepted in IEEE Transactions on Big Data. 06/2022: One paper has been accepted in SC'22. 05/2022: One paper has been accepted in SSDBM'22. 04/2022: One paper has been accepted in HPDC'22. 02/2022: Our CRII project has been awarded by the National Science Foundation (my role: PI). This project aims to enable the preservation of quantities of interest in scientific lossy compressors. Thanks a lot to the NSF! 01/2022: Pu Jiao joined our team as a PhD student. Welcome Pu! Research Interests Parallel, distributed, and heterogeneous systems. Data management, reduction, refactoring, and streaming. Scientific visualization and data analytics. Large-scale machine learning and deep learning. Cloud and edge computing. Fault tolerant mechanics, algorithms, and implementations. Linear algebra and numerical algorithms. Education Ph. D. in Computer Science, University of California, Riverside, 2014-2019. B. S. in Computer Science, Peking University, 2010-2014. Minor in Mathematics, Peking University, 2011-2014. Selected Publications (Full List, Google Scholar) My students are underlined. SC'25 Yanliang Li+, Wenbo Li+, Qian Gong, Qing Liu, Norbert Podhorszki, Scott Klasky, Xin Liang, and Jieyang Chen. HP-MDR: High-performance and Portable Data Refactoring and Progressive Retrieval with Advanced GPUs. Proceedings of the 38th ACM/IEEE International Conference for High Performance Computing, Networking, Storage and Analysis, St. Louis, MO, USA, Nov 16 - 21, 2025. (+: Co-first authors) VLDB'25 Jinyang Liu+, Pu Jiao+, Kai Zhao, Xin Liang*, Sheng Di, and Franck Cappello. QPET: A Versatile an",
  "content_length": 16409,
  "method": "requests",
  "crawl_time": "2025-12-01 14:48:48"
}