{
  "name": "Xin Li 0028",
  "homepage": "https://www.cse.ust.hk/~lixin",
  "status": "success",
  "content": "Dr. Cindy LI, CSE, HKUST Cindy Xin LI PhD, Hong Kong Univ. of Sci. & Tech., 2005 Assistant Professor of Engineering Education Undergraduate Programs Coordinator Dept. of Computer Science and Engineering Hong Kong University of Science & Technology Email: lixin@cse.ust.hk Tel: (+852) 2358 6994 Office: Room 3525, Academic Building EXPAND ALL SECTIONS COLLAPSE ALL SECTIONS Introduction Cindy Xin LI is the assistant professor of Engineering Education at Department of Computer Science and Engineering at the Hong Kong University of Science and Technology. She received her Ph.D from the same department, with research interests on network algorithms (especially in switches and routers). She focuses in undergraduate education, administration, counseling and advising now. She teaches fundamental courses in Computer Science, overlooks department undergraduate issues, leads advising and counseling service, and actively invovles in educatioin innovation. She is the founding member of Center for Engineering Education Innovation. Courses Courses COMP2011 Programming with C++ (4 credits), Spring 25 COMP2611 Computer Organization (4 credits), Spring 25 COMP1004 Programming Fundamentals and Methodology (4 credits) COMP1021 Introduction to Computer Science (3 credits) COMP1941 Great Ideas in Computing (3 credits) COMP2021 Unix and Script Programming (3 credits) COMP2711 Data Structures and Algorithms (4 credits) COMP3511 Operating Systems (3 credits) CSIT5600   Internet Infrastructure: Switches and Routers (postgraduate course) Publications Publications Journal X. Li and M. Hamdi, \"On Scheduling Optical Switches with Reconfiguration Delay\", Special Issue on High Performance Optical/Electronic Switches/Routers for High Speed Internet, IEEE Journal on Selected Areas in Communications (JSAC), vol. 21, Issue 7, 1156-1164, Sep 2003. X. Li, Z. Zhou and M. Hamdi, \"Non-Violation Set Scheduling for Two-Dimensional Optical MEMS Switches\", IEEE Communication Letters, vol. 10, Issue 4, 308-310, Apr 2006. B. Wu, K.L. Yeung, M. Hamdi and X. Li, \"Minimizing Internal Speedup for Performance Guaranteed Switches with Optical Fabrics\", The IEEE/ACM Transactions on Networking, Volume 17, Issue 2, April 2009. Conference X. Li, Z. Zhou and M. Hamdi, \"LCCF: A Scheduling Algorithm for Asynchronous Optical Switches\", the IEEE Workshop on High Performance Switching and Routing (HPSR'05), Hong Kong, May 2005. Z. Zhou, X. Li and M. Hamdi, \"Fast Scheduling for Optical Packet Switches with Minimum Configurations\", the IEEE Workshop on High Performance Switching and Routing (HPSR'05), Hong Kong, May 2005. X. Li, Z. Zhou and M. Hamdi, \"Space-Memory-Memory Architecture for Clos-Network Packet Switches\", the International Conference on Communications (ICC'05), Seoul, Korea, May 2005. X. Li and M. Hamdi, \"Design of a Scalable Hybrid Multicast Packet Switch with Optical Fabric\", Proceedings of the International Conference on Communications (ICC'04), vol. 3, 1760-1765, Paris, June 2004. X. Li and M. Hamdi, \"Analysis of Reduced Rate Scheduling for Switches with Reconfiguration Overhead\", Proceedings of the Global Communications Conference (GLOBECOM'03), vol. 5, 2782-2786, San Francisco, CA, Dec 2003. X. Liand M. Hamdi, \"Design and Analysis of Scheduling Algorithms for Switches with Reconfiguration Overhead\", Proceedings of the IEEE Workshop on High Performance Switching and Routing (HPSR'03), 61-66, Torino, Italy, June 2003. X. Li and M. Hamdi, \"lambda-ADJUST Algorithm for Optical Switches with Reconfiguration Delay\", Proceedings of the International Conference on Communications (ICC'03), vol. 2, 1288-1292, Anchorage, Alaska, May 2003. Book Charpter \"High-Performance Packet Switching Architectures\", Itamar Elhanany, Mounir Hamdi (Eds.) 2007, XIV, 230 p., 111 illus., Hardcover, ISBN: 1-84628-273-X Links Useful Links for Undergraduate Issues HKUST Undergraduate Admission Join HKUST. Dare to Dream, Ready to Achieve! School of Engineering Academic Registry A guide to a range of topics that relate to your study, with application forms for current students. CSE Undergraduate Intranet One-stop information portal for CSE undergraduate students (CSE log-in needed) Counseling and Wellness Center 24/7 psychological and emotional support to enhance wellbeing Hiking Hike around Hong Kong, scenery routes (in Chinese) and mobile App.",
  "content_length": 4343,
  "method": "requests",
  "crawl_time": "2025-12-01 14:48:48"
}