{
  "name": "Xinbo Gao 0001",
  "homepage": "https://see.xidian.edu.cn/faculty/xbgao",
  "status": "success",
  "content": "Xinbo Gao's Homepage ¡¡ ¡¡ Professor Xinbo Gao, Ph.D. Curriculum Vitae: CV_Chinese, CV_English Director of Eng. Research Center of MoE for Big Data Security Director of Video & Image Processing System (Visual Information Processing Lab) School of Electronic Engineering, Xidian University No.2, South Taibai Road, Xi'an 710071, China Email: xbgao (at) mail.xidian.edu.cn Web Page: http://see.xidian.edu.cn/faculty/xbgao Xinbo Gao was born in Laiwu, Shandong Province, China. He obtained his Bachelor Degree in Electronic Engineering, Master and Ph.D. Degrees in Information and Communication Engineering from Xidian University, Xi'an, China, in 1994, 1997 and 1999, respectively. From 1997 to 1998, he was a Research Fellow in Prof. Hiroyuki Iida's Lab, Department of Computer Science at Shizuoka University, Hamamatsu, Japan. From 2000 to 2001, he was a Postdoctoral Fellow in Prof. Xiaoou Tang's Multimedia Lab, Department of Information Engineering at the Chinese University of Hong Kong, Shatin, NT, Hong Kong SAR, China. ¡¡ In 2001, Dr. Xinbo Gao joined to Xidian University as an Associate Professor, and established the Video & Image Processing System Laboratory (VIPs Lab). Since 2003, he has been a Full Professor in School of Electronic Engineering at Xidian University, Xi'an, China. From 2004 to 2005, he was appointed  the Vice Dean of School of Electronic Engineering, and from 2005 to 2012, he was promoted as the Director of Office of International Cooperation and Exchange, Xidian University. From 2008 to 2012, he run the School of International Education as the Founding Dean. From 2013 to 2018, he was the Assistant President of Xidian University and Director of the State Key Laboratory of Integrated Services Networks. Currently, he is the Professor of Control Science and Engineering, Xidian University and President of Chongqing University of Posts and Telecommunications (2020- ). His research interests include computer vision, machine learning, pattern recognition. In these fields, he has published 7 books and around 500 technical articles in refereed journals and proceedings. He is on the Editorial Boards of several journals, including Signal Processing (Elsevier), and Neurocomputing (Elsevier). He served as the General Chair/Co-Chair, Program Committee Chair/Co-Chair, or PC Member for around 30 major international conferences. In addition, Dr. Gao is a Fellow of IEEE, a Fellow of IET/IEE, an Executive Board Member of China Society of Image and Graphics (CSIG), an Executive Board Member of the Chinese Institute of Electronics (CIE), an Executive Board Member of the China Association of Higher Education (CAHE), and Fellows of CIE, CCF, and CAAI. ¡¡ ¡¡ ¡¡ Your suggestions are welcome. Please leave your comments by clicking here. This website was modified on 2024/08/14 ¡¡",
  "content_length": 2813,
  "method": "requests",
  "crawl_time": "2025-12-01 14:48:53"
}