{
  "name": "Xingyi Song",
  "homepage": "https://www.sheffield.ac.uk/dcs/people/academic/xingyi-song",
  "status": "success",
  "content": "Dr Xingyi Song | Computer Science | The University of Sheffield Skip to main content Search sheffield.ac.uk Close menu × School of Computer Science School of Computer Science Menu Dr Xingyi Song School of Computer Science Lecturer in Computational Media Analysis, Natural Language Processing Outreach Support Member of the Natural Language Processing research group Open staff member portrait in a modal window x.song@sheffield.ac.uk +44 114 222 1867 Regent Court (DCS) Full contact details Dr Xingyi Song School of Computer Science Regent Court (DCS) 211 Portobello Sheffield S1 4DP Orcid ID:0000-0002-4188-6974 Google Scholar Profile Dr Xingyi Song, a Lecturer in Computational Media Analysis at the Department of Computer Science, University of Sheffield. He is a member of the Natural Language Processing group and GATE team (https://gate.ac.uk/)Previously he worked as a machine translation specialist at Iconic Translation Machine (2015-2016) and Research Associate for several EU funded projects such as Kconnect, Knowmak and Risis2 (from 2016-2021)) at the University of Sheffield. He completed his MSc and PhD in Natural Language Processing group at the University of Sheffield. His research interests are in Natural Language Processing, Computational Social Science, sentiment analysis and Bio-medical text processing. Publications Journal articles Jiang Y, Wang T, Xu X, Wang Y, Song X & Maynard D (2025) Cross-modal augmentation for few-shot multimodal fake news detection. Engineering Applications of Artificial Intelligence, 142, 109931-109931. Razuvayevskaya O, Wu B, Leite JA, Heppell F, Srba I, Scarton C, Bontcheva K & Song X (2024) Comparison between parameter-efficient techniques and full fine-tuning: a case study on multilingual news article classification. PLoS ONE, 19(5). View this article in WRRO Mu Y, Jin M, Bontcheva K & Song X (2024) Examining temporalities on stance detection towards COVID-19 vaccination. 2024 Joint International Conference on Computational Linguistics, Language Resources and Evaluation, LREC-COLING 2024 - Main Conference Proceedings, 6732-6738. View this article in WRRO Mu Y, Wu BP, Thorne W, Robinson A, Aletras N, Scarton C, Bontcheva K & Song X (2024) Navigating prompt complexity for zero-shot classification: a study of large language models in computational social science. Proceedings of the 2024 Joint International Conference on Computational Linguistics, Language Resources and Evaluation (LREC-COLING 2024), 12074-12086. View this article in WRRO Mu Y, Song X, Bontcheva K & Aletras N (2024) Examining the limitations of computational rumor detection models trained on static datasets. 2024 Joint International Conference on Computational Linguistics, Language Resources and Evaluation, LREC-COLING 2024 - Main Conference Proceedings, 6739-6751. View this article in WRRO Mu Y, Dong C, Bontcheva K & Song X (2024) Large language models offer an alternative to the traditional approach of topic modelling. Proceedings of the 2024 Joint International Conference on Computational Linguistics, Language Resources and Evaluation (LREC-COLING 2024), 10160-10171. View this article in WRRO Mu Y, Jin M, Song X & Aletras N (2024) Enhancing Data Quality through Simple De-duplication: Navigating Responsible Computational Social Science Research.. CoRR, abs/2410.03545. Scarton C, Prescott C, Bayliss C, Oakley C, Wright J, Wrigley S & Song X (2024) Message from the Organising Committee. Proceedings of the 25th Annual Conference of the European Association for Machine Translation Eamt 2024, 1, iv-v. Scarton C, Oakley C, Prescott C, Wright J, Bayliss C, Wrigley S & Song X (2024) Message from the Organising Committee. Proceedings of the 25th Annual Conference of the European Association for Machine Translation Eamt 2024, 2, iv-v. Wu B, Li Y, Mu Y, Scarton C, Bontcheva K & Song X (2023) Don’t waste a single annotation: improving single-label classifiers through soft labels. Findings of the Association for Computational Linguistics: EMNLP 2023, 5347-5355. View this article in WRRO Li Y, Scarton C, Song X & Bontcheva K (2023) Classifying COVID-19 vaccine narratives. Proceedings of the 14th International Conference on Recent Advances in Natural Language Processing, 648-657. View this article in WRRO Jiang Y, Yu X, Wang Y, Xu X, Song X & Maynard D (2023) Similarity-aware multimodal prompt learning for fake news detection. Information Sciences, 647. View this article in WRRO Mu Y, Jin M, Grimshaw C, Scarton C, Bontcheva K & Song X (2023) VaxxHesitancy: A dataset for studying hesitancy towards COVID-19 vaccination on Twitter. Proceedings of the International AAAI Conference on Web and Social Media, 17(1), 1052-1062. View this article in WRRO Zhang Z & Song X (2023) An exploratory study on utilising the web of linked data for product data mining. SN Computer Science, 4(1). View this article in WRRO Chilman N, Song X, Roberts A, Tolani E, Stewart R, Chui Z, Birnie K, Harber-Aschan L, Gazard B, Chandran D , Sanyal J et al (2021) Text mining occupations from the mental health electronic health record: a natural language processing approach using records from the Clinical Record Interactive Search (CRIS) platform in south London, UK. BMJ Open, 11(3), e042274-e042274. Song X, Petrak J, Jiang Y, Singh I, Maynard D & Bontcheva K (2021) Classification aware neural topic model for COVID-19 disinformation categorisation. PLoS ONE, 16(2). View this article in WRRO Maynard D, Lepori B, Petrak J, Song X & Laredo P (2020) Using ontologies to map between research data and policymakers’ presumptions: the experience of the KNOWMAK project. Scientometrics, 125(2), 1275-1290. View this article in WRRO He L, Gilbert M & Song X (2019) A Python script for adaptive layout optimization of trusses. Structural and Multidisciplinary Optimization, 60(2), 835-847. View this article in WRRO Jackson R, Kartoglu I, Stringer C, Gorrell G, Roberts A, Song X, Wu H, Agrawal A, Lui K, Groza T , Lewsley D et al (2018) CogStack - experiences of deploying integrated information retrieval and extraction services in a large National Health Service Foundation Trust hospital.. BMC Medical Informatics and Decision Making, 18(1). View this article in WRRO Jackson R, Kartoglu IE, Agrawal A, Lui K, Wu H, Groza T, Roberts A, Gorrell G, Song X, Lewsley D , Northwood D et al (2017) CogStack - Experiences Of Deploying Integrated Information Retrieval And Extraction Services In A Large National Health Service Foundation Trust Hospital. Cook O, Mu Y, Yang X, Song X & Bontcheva K () A Dataset for Analysing News Framing in Chinese Media. Proceedings of the International AAAI Conference on Web and Social Media, 19, 2402-2412. Jiang Y, Yu X, Wang Y, Xu X, Song X & Maynard D () Similarity-Aware Multimodal Prompt Learning for Fake News Detection. SSRN Electronic Journal. Book chapters Barrón-Cedeño A, Alam F, Chakraborty T, Elsayed T, Nakov P, Przybyła P, Struß JM, Haouari F, Hasanain M, Ruggeri F , Song X et al (2024) The CLEF-2024 CheckThat! Lab: Check-Worthiness, Subjectivity, Persuasion, Roles, Authorities, and Adversarial Robustness, Lecture Notes in Computer Science (pp. 449-458). Springer Nature Switzerland Barrón-Cedeño A, Alam F, Struß JM, Nakov P, Chakraborty T, Elsayed T, Przybyła P, Caselli T, Da San Martino G, Haouari F , Hasanain M et al (2024) Overview of the CLEF-2024 CheckThat! Lab: Check-Worthiness, Subjectivity, Persuasion, Roles, Authorities, and Adversarial Robustness, Lecture Notes in Computer Science (pp. 28-52). Springer Nature Switzerland Conference proceedings Cook O, Grimshaw C, Wu BP, Dillon S, Hicks J, Jones L, Smith T, Szert M & Song X (2025) Efficient Annotator Reliability Assessment and Sample Weighting for Knowledge-Based Misinformation Detection on Social Media. Findings of the Association for Computational Linguistics: NAACL 2025 (pp 3348-3358), April 2025 - April 2025. Cook O, Vasilakes JA, Roberts I & Song X (2025) Efficient Annotator Reliability Assessment with EffiARA. Proceedings of the 63rd Annual Meeting of the Association for Computational Linguistics (Volume 3: System Demonstrations) (pp 542-550), July 2025 - July 2025. Singh I, Scarton C, Song X & Bontcheva K (2025) Breaking Language Barriers with MMTweets: Advancing Cross-Lingual Debunked Narrative Retrieval for Fact-Checking. Ceur Workshop Proceedings, Vol. 4070 (pp 1-19) Stolfo A, Wu B, Gurnee W, Belinkov Y, Song X, Sachan M & Nanda N (2024) Confidence regulation neurons in language models. Advances in Neural Information Processing Systems. Vancouver, Canada, 10 December 2024 - 10 December 2024. View this article in WRRO Yang X, Mu Y, Bontcheva K & Song X (2024) Optimising LLM-driven machine translation with context-aware sliding windows. Proceedings of the Ninth Conference on Machine Translation (pp 1004-1010). Miami, Florida, USA, 15 November 2024 - 15 November 2024. View this article in WRRO Hughes A & Song X (2024) Identifying and Aligning Medical Claims Made on Social Media with Medical Evidence. 2024 Joint International Conference on Computational Linguistics Language Resources and Evaluation Lrec Coling 2024 Main Conference Proceedings (pp 8580-8593) Mu Y, Wu BP, Thorne W, Robinson A, Aletras N, Scarton C, Bontcheva K & Song X (2024) Navigating Prompt Complexity for Zero-Shot Classification: A Study of Large Language Models in Computational Social Science.. LREC/COLING (pp 12074-12086) Mu Y, Dong C, Bontcheva K & Song X (2024) Large Language Models Offer an Alternative to the Traditional Approach of Topic Modelling.. LREC/COLING (pp 10160-10171) Mu Y, Song X, Bontcheva K & Aletras N (2024) Examining the Limitations of Computational Rumor Detection Models Trained on Static Datasets.. LREC/COLING (pp 6739-6751) Mu Y, Jin M, Bontcheva K & Song X (2024) Examining Temporalities on Stance Detection towards COVID-19 Vaccination.. LREC/COLING (pp 6732-6738) Grimshaw C, Bontcheva K & Song X (2024) SheffieldVeraAI at SemEval-2024 Task 4: Prompting and fine-tuning a Large Vision-Language M",
  "content_length": 21340,
  "method": "requests",
  "crawl_time": "2025-12-01 14:48:58"
}