{
  "name": "Xingang Pan",
  "homepage": "https://xingangpan.github.io",
  "status": "success",
  "content": "Xingang Pan Xingang Pan Assistant Professor College of Computing and Data Science Nanyang Technological University Email: xingang.pan[at]ntu.edu.sg / / / Research Interests: Computer Vision Generative Models 3D Vision Computer Graphics I am a Nanyang Assistant Professor with MMLab@NTU at the College of Computing and Data Science, Nanyang Technological University. Prior to joining NTU, I was a postdoc researcher at Max Planck Institute for Informatics, advised by Prof. Christian Theobalt. I received my Ph.D. degree at Multimedia Laboratory in the Chinese University of Hong Kong in 2021, supervised by Prof. Xiaoou Tang. I obtained my Bachelor's degree from Tsinghua University in 2016. Our group studies fundamental and interesting problems in modeling our visual world through generative machine learning. We also explore the vast possibilities enabled by such generative world models, particularly for understanding and interacting with the physical world. We embrace curiosity-driven research. To prospective students: Application: If you are interested in joining our group at MMLab@NTU, please drop me an email at xingang.pan\\[at\\]ntu.edu.sg with your resume. Priority will be given to candidates with research experience in Embodied AI, then Generative AI. Due to the volume of emails received, we regret that only shortlisted candidates will be contacted. Thanks for your understanding. News [2025] We have 2 papers in ICLR 2025, 4 papers in CVPR 2025 with one oral, 4 papers in ICCV 2025, 2 papers in SIGGRAPH Asia 2025, and 1 paper in NeurIPS 2025. [2025] I will serve as an Area Chair for ICLR 2026. [2025] I start to serve as an Associate Editor for IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI), and IEEE Transactions on Visualization and Computer Graphics (TVCG). [2025] Yushi Lan and Yongwei Chen are awarded the Meshy AI Fellowship and the Meshy AI Fellowship Finalist respectively. [2025] We co-organized the 3DV 2025 Area Chair Workshop. [2025] Invited talk at the 3DV 2025 Area Chair Workshop. [2024] Awarded the prestigious Singapore NRF Fellowship funded by the National Research Foundation of Singapore. [2024] Awarded the Nanyang Assistant Professorship (NAP). [2024] I serve as an Area Chair for CVPR 2024~25, 3DV 2024~2025. Selected Publications Google Scholar and Full List. STream3R: Scalable Sequential 3D Reconstruction with Causal Transformer Yushi Lan*, Yihang Luo*, Fangzhou Hong, Shangchen Zhou, Honghua Chen, Zhaoyang Lyu, Shuai Yang, Bo Dai, Chen Change Loy, Xingang Pan. arXiv preprint, 2025. [Project] [Paper] [Code] WORLDMEM: Long-term Consistent World Simulation with Memory Zeqi Xiao, Yushi Lan, Yifan Zhou, Wenqi Ouyang, Shuai Yang, Yanhong Zeng, Xingang Pan. Advances in Neural Information Processing Systems (NeurIPS), 2025. [Project] [Paper] [Code] Bokeh Diffusion: Defocus Blur Control in Text-to-Image Diffusion Models Armando Fortes, Tianyi Wei, Shangchen Zhou, Xingang Pan. SIGGRAPH Asia, 2025. [Project] [Paper] [Code] Epona: Autoregressive Diffusion World Model for Autonomous Driving Kaiwen Zhang, Zhenyu Tang, Xiaotao Hu, Xingang Pan, Xiaoyang Guo, Yuan Liu, Jingwei Huang, Li Yuan, Qian Zhang, Xiaoxiao Long, Xun Cao, Wei Yin. International Conference on Computer Vision (ICCV), 2025. [Project] [Paper] [Code] TokensGen: Harnessing Condensed Tokens for Long Video Generation Wenqi Ouyang, Zeqi Xiao, Danni Yang, Yifan Zhou, Shuai Yang, Lei Yang, Jianlou Si, Xingang Pan. International Conference on Computer Vision (ICCV), 2025. [Project] [Paper] [Code] Textured 3D Regenerative Morphing with 3D Diffusion Prior Songlin Yang, Yushi LAN, Honghua Chen, Xingang Pan. International Conference on Computer Vision (ICCV), 2025. [Project] [Paper] [Code] FreeFlux: Understanding and Exploiting Layer-Specific Roles in RoPE-Based MMDiT for Versatile Image Editing Tianyi Wei, Yifan Zhou, Dongdong Chen, Xingang Pan. International Conference on Computer Vision (ICCV), 2025. [Project] [Paper] [Code] Alias-free Latent Diffusion Models: Improving Fractional Shift Equivariance of Diffusion Latent Space Yifan Zhou, Zeqi Xiao, Shuai Yang, Xingang Pan. Computer Vision and Pattern Recognition (CVPR), 2025 (oral). [Project] [Paper] [Code] SAR3D: Autoregressive 3D Object Generation and Understanding via Multi-scale 3D VQVAE Yongwei Chen, Yushi Lan, Shangchen Zhou, Tengfei Wang, Xingang Pan. Computer Vision and Pattern Recognition (CVPR), 2025. [Project] [Paper] [Code] 3DEnhancer: Consistent Multi-View Diffusion for 3D Enhancement Yihang Luo, Shangchen Zhou, Yushi Lan, Xingang Pan, Chen Change Loy. Computer Vision and Pattern Recognition (CVPR), 2025. [Project] [Paper] Neural LightRig: Unlocking Accurate Object Normal and Material Estimation with Multi-Light Diffusion Zexin He*, Tengfei Wang*, Xin Huang, Xingang Pan, Ziwei Liu. Computer Vision and Pattern Recognition (CVPR), 2025. [Project] [Paper] [Code] GaussianAnything: Interactive Point Cloud Latent Diffusion for 3D Generation Yushi Lan, Shangchen Zhou, Zhaoyang Lyu, Fangzhou Hong, Shuai Yang, Bo Dai, Xingang Pan, Chen Change Loy. International Conference on Learning Representations (ICLR), 2025. [Project] [Paper] [Code] Trajectory Attention For Fine-grained Video Motion Control Zeqi Xiao, Wenqi Ouyang, Yifan Zhou, Shuai Yang, Lei Yang, Jianlou Si, Xingang Pan. International Conference on Learning Representations (ICLR), 2025. [Project] [Paper] [Code] Video Diffusion Models are Training-free Motion Interpreter and Controller Zeqi Xiao, Yifan Zhou, Shuai Yang, Xingang Pan. Advances in Neural Information Processing Systems (NeurIPS), 2024. [Project] [Paper] [Code] I2VEdit: First-Frame-Guided Video Editing via Image-to-Video Diffusion Models Ouyang Wenqi, Yi Dong, Lei Yang, Jianlou Si, Xingang Pan. SIGGRAPH Asia, 2024. [Project] [Paper] LN3Diff: Scalable Latent Neural Fields Diffusion for Speedy 3D Generation Yushi Lan, Fangzhou Hong, Shuai Yang, Shangchen Zhou, Xuyi Meng, Bo Dai, Xingang Pan, Chen Change Loy. European Conference on Computer Vision (ECCV), 2024. [Project] [Paper] [Code] ComboVerse: Compositional 3D Assets Creation Using Spatially-Aware Diffusion Guidance Yongwei Chen*, Tengfei Wang*, Tong Wu, Xingang Pan, Kui Jia, Ziwei Liu. European Conference on Computer Vision (ECCV), 2024. [Paper] [Project] Learning Images Across Scales Using Adversarial Training Krzysztof Wolski, Adarsh Djeacoumar, Alireza Javanmardi, Hans-Peter Seidel, Christian Theobalt, Guillaume Cordonnier, Karol Myszkowski, George Drettakis, Xingang Pan, Thomas Leimk端hler. ACM Transactions on Graphics (Proc. of SIGGRAPH 2024). [Paper] [Project] DiffMorpher: Unleashing the Capability of Diffusion Models for Image Morphing Kaiwen Zhang, Yifan Zhou, Xudong Xu, Xingang Pan (corresponding author), Bo Dai. Computer Vision and Pattern Recognition (CVPR), 2024. [Paper] [Project] A Neural Implicit Representation for the Image Stack: Depth, All in Focus, and High Dynamic Range Chao Wang, Ana Serrano, Xingang Pan, Bin Chen, Hans-Peter Seidel, Christian Theobalt, Karol Myszkowski, Krzysztof Wolski, Thomas Leimk端hler. ACM Transactions on Graphics (Proc. of SIGGRAPH Asia 2023). [Paper] [Project] GlowGAN: Unsupervised Learning of HDR Images from LDR Images in the Wild Chao Wang, Ana Serrano, Xingang Pan, Bin Chen, Hans-Peter Seidel, Christian Theobalt, Karol Myszkowski, Thomas Leimk端hler. International Conference on Computer Vision (ICCV), 2023. [Paper] [Project] AssetField: Assets Mining and Reconfiguration in Ground Feature Plane Representation Yuanbo Xiangli*, Linning Xu*, Xingang Pan, Nanxuan Zhao, Bo Dai, Dahua Lin. International Conference on Computer Vision (ICCV), 2023. [Paper] [Project] Drag Your GAN: Interactive Point-based Manipulation on the Generative Image Manifold Xingang Pan, Ayush Tewari, Thomas Leimk端hler, Lingjie Liu, Abhimitra Meka, Christian Theobalt. SIGGRAPH, 2023. [Code] [Paper] [Project] [Media coverage: The Independent, Business Insider, The Verge] [Among the Most Influential SIGGRAPH Papers] Grid-guided Neural Radiance Fields for Large Urban Scenes Linning Xu*, Yuanbo Xiangli*, Sida Peng, Xingang Pan, Nanxuan Zhao, Christian Theobalt, Bo Dai, Dahua Lin. Computer Vision and Pattern Recognition (CVPR), 2023. [Paper] [Project] Voxurf: Voxel-based Efficient and Accurate Neural Surface Reconstruction Tong Wu, Jiaqi Wang, Xingang Pan, Xudong Xu, Christian Theobalt, Ziwei Liu, Dahua Lin. International Conference on Learning Representations (ICLR), 2023 (spotlight). [Code] [Paper] [Project] GAN2X: Non-Lambertian Inverse Rendering of Image GANs Xingang Pan, Ayush Tewari, Lingjie Liu, Christian Theobalt. International Conference on 3D Vision (3DV), 2022. [Paper] [Project] BungeeNeRF: Progressive Neural Radiance Field for Extreme Multiscale Scene Rendering Yuanbo Xiangli*, Linning Xu*, Xingang Pan, Nanxuan Zhao, Anyi Rao, Christian Theobalt, Bo Dai, and Dahua Lin. European Conference on Computer Vision (ECCV), 2022. [Code] [Paper] [Project] Disentangled3D: Learning a 3D Generative Model with Disentangled Geometry and Appearance from Monocular Images Ayush Tewari, Mallikarjun B R, Xingang Pan, Ohad Fried, Maneesh Agrawala, Christian Theobalt. Computer Vision and Pattern Recognition (CVPR), 2022. [Paper] [Project] A Shading-Guided Generative Implicit Model for Shape-Accurate 3D-Aware Image Synthesis Xingang Pan, Xudong Xu, Chen Change Loy, Christian Theobalt, Bo Dai. Advances in Neural Information Processing Systems (NeurIPS), 2021. [Code] [Paper] [Project] Generative Occupancy Fields for 3D Surface-Aware Image Synthesis Xudong Xu, Xingang Pan, Dahua Lin, Bo Dai. Advances in Neural Information Processing Systems (NeurIPS), 2021. [Code] [Paper] [Project] Exploiting Deep Generative Prior for Versatile Image Restoration and Manipulation Xingang Pan, Xiaohang Zhan, Bo Dai, Dahua Lin, Chen Change Loy, Ping Luo. IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI), 2021. [Code] [Paper] [Project] Do 2D GANs Know 3D Shape? Unsupervised 3D Shape Reconstruction from 2D Image GANs Xing",
  "content_length": 11036,
  "method": "requests",
  "crawl_time": "2025-12-01 14:48:54"
}