{
  "name": "Xinghua Mindy Shi",
  "homepage": "https://cis.temple.edu/~mindyshi",
  "status": "success",
  "content": "Mindy Shi's Homepage at Temple University Xinghua Mindy Shi Ph.D. Associate Professor Department of Computer & Information Sciences College of Science and Technology Temple University Email: mindyshi@temple.edu P: 215-204-7232 F: 215-204-5082 Office: SERC 346 POSITIONS AVAILABLE Postdoctoral Fellow in Machine Learning and Privacy One postdoctoral position in Machine Learning and Privacy is available in the Department of Computer and Information Sciences at Temple University. The appointee will support and complement ongoing projects in developing new algorithms for machine learning and privacy-preserving modeling. The appointee will work closely with scientists in the Institute for Genomics and Evolutionary Medicine (iGEM) and Center for Data Analytics and Biomedical Informatics at Temple, other institutions in Philadelphia (e.g. Penn Medicine) and beyond (e.g. Stevens Institute of Technology) to develop privacy preserving machine learning methods. Candidate must have or be close to obtaining a Ph.D. in quantitative fields (include but not limited to Computer Science, Statistics, Mathematics, and Physics) and have demonstrated a high level of research productivity through publication in peer-reviewed conferences and journals. Experiences with machine learning or data privacy is required. As a team player working closely with cross-institutional scientists with broad areas of expertise, strong interpersonal and communication skills are essential. Postdoctoral Fellow in Computational Biology / Bioinformatics One postdoctoral position in computational biology and bioinformatics is available in the Department of Computer and Information Sciences at Temple University. The appointee will support and complement ongoing projects in developing computational approaches/pipelines to integrate and analyze large-scale (epi)genomic, expression and interaction data sets for scientific discovery and validation. The appointee will work closely with scientists in the Institute for Genomics and Evolutionary Medicine (iGEM) and Center for Data Analytics and Biomedical Informatics at Temple, other institutions (e.g. Penn Medicine, Jackson Laboratory for Genomic Medicine) and International Consortium like The Human Genome Structural Variation Consortium (HGSVC) to develop new methods and pipelines toward precision medicine. Candidate must have or be close to obtaining a Ph.D. in quantitative fields (include but not limited to Bioinformatics, Computational Biology, Computer Science, Statistics, Mathematics, and Physics) and have demonstrated a high level of research productivity through publication in peer-reviewed conferences and journals. Extensive experiences using scripting languages (e.g. Perl, Python) and statistical/mathematical toolkits (e.g. R, SAS, Matlab, Mathematica) are required. Knowledge of machine/statistical learning and mathematical modeling techniques is desirable. As a team player working closely with cross-institutional scientists with broad areas of expertise, strong interpersonal and communication skills are essential. Recently celebrating its 50th year anniversary, CIS@Temple is one of the oldest computer science departments in the country and is experiencing tremendous growth in its research and academic programs. Temple University is a Carnegie R1 institution that serves more than 40,000 students and is ranked #44 among top public universities by the U.S. News & World Report. Located in the heart of Philadelphia (the 5th largest city in the United States, known for its arts, culture, history and affordable living), Temple University is in close proximity to many outstanding research centers and industry partners in information technology, healthcare, biotechnology, and finance. We offer a collegial environment, excellent facilities, and a competitive salary commensurate with experience. Applicants should email a single PDF file including cover letter, CV, brief research statement and list of 3 references to Dr. Mindy Shi (mindyshi@temple.edu). Graduate Students I am seeking for highly motivated graduate students with undergraduate training in computer science, statistics, mathematics, physics or quantitative biological sciences. Full assistantship will be provided upon admission. Please check out the admission information for CIS PhD and Bioinformatics PhD respectively. Please contact Dr. Mindy Shi (mindyshi@temple.edu) if you are interested. Current Group Members Listed by (Program, Duration in the lab) Chong Li (Bioinformatics PhD student, fall 2020-present, CST Outstanding RA Awardee 2024) Mohammad Erfan Molaei (CIS PhD student, summer 2021-present) Bin Li (CIS PhD student, spring 2021-present) Yang Zhao (CIS PhD student, fall 2024-present) Saamia N Farooki (Bioinformatics PSM Capstone project, 2023-present) Alumni Listed by (Role, Duration in the lab, Last known position) Postdocs: Dr. Junjie Chen (postdoctoral researcher, 2018-21, Assistant Professor of Computer Science at Harbin Institute of Technology, Shenzhen, China), Dr. Letu Qingge (postdoctoral researcher, 2018-19, Assistant Professor of Computer Science at North Carolina A&T University), Dr. Jia Wen (postdoctoral researcher, 2015-18, Postdoctoral Research Associate at University of North Carolina at Chapel Hill), Dr. Rubén Armañanzas (postdoctoral researcher, 2013, Research Assistant Professor at George Mason University) PhD students: Conor Nodzak (PhD, 2016-19, Senior Data Technology Analyst at Bank of America), Andrew Quitadamo (PhD, 2013-18, Bioinformatics Scientist at Boston Children's Hospital), Sisi Yuan (PhD rotation, 2018, PhD student at the University of North Carolina at Charlotte), Benika Hall (PhD, 2014-2017, Senior Data Scientist at NVIDIA), James Johnson (PhD rotation, 2017, PhD student at the University of North Carolina at Charlotte) Master, undergraduate students and interns: Emily Thyrum (CIS master, 2022-2023, CIS Instructor at Temple University), Yichen Du (Data Science undergraduate student, 2020), Jill Jenkins (PSM, 2019, Data Scientist at GAVS Technologies), Katherine Jensen (PSM and undergraduate student, 2018-19, PhD student at the University of North Carolina at Charlotte), Valentina Talevi (PSM, 2019, PhD Student at German Center for Neurodegenerative Disease), Angat Puri (PSM, 2017, Data Scientist at the Hartford), Lauren Gridley (PSM, 2017, Bioinformatician at RTI International), Seyed Nader Nazemi (PSM, 2016), Sasan Najar (PSM, 2016), Heena Desai (PSM, 2016, Bioinformatician at University of Pennsylvania School of Medicine), Dahlia Shvets (PSM, 2015, Data Scientist at Scripps Health), Lu Tian (PSM, 2015), Frederick Lin (PSM, 2014, Sr. Research Data Analyst at Northwestern University), Brianna Lam (PSM, 2014, Bioinformatician at Ayass BioScience), Swanthana Rekulapally (PSM, 2014, Research Associate at University of North Carolina at Chapel Hill), Shivam Patel (undergraduate, 2019, ), Erin Tsai (undergraduate, 2018), Alan King (undergraduate, 2016), Gang (Chris) Chen (intern, 2015), Ana C. Jacobs (intern, 2014). Research Interest We work at the intersection of data science, computer science and life sciences, focusing on the development of statistical and machine learning methods for biomedical research. Education Ph.D. and M.S. Department of Computer Science , University of Chicago, Chicago, IL. M.Eng. and B. Eng. Department of Computer Science and Technology, Beijing Institute of Technology, Beijing, China. Research Experiences Associate Professor, Department of Computer & Information Sciences , Temple University , (2019-) Assistant Professor, Department of Bioinformatics and Genomics, University of North Carolina at Charlotte, (2013-19) Postdoctoral Research Fellow and NIH T32 Genetics Fellow, Brigham and Women's Hospital, Harvard Medical School,(2009/10-12) Visiting Research Fellow, Broad Institute of MIT and Harvard, (2009-12) Selected Publications (Full publications available at Google Scholar ) (* Denote current or former trainees with Dr. Shi.) \"STICI: Split-Transformer with Integrated Convolutions for Genotype Imputation.\", Mowlaei MF*, Li C*, Jamialahmadi O, Dias R, Chen J*, Jamialahmadi B, Rebbeck TR, Carnevale V, Kumar S, and Shi X, Nature Communications. 16(1218), 2025. (Code is available at GitHub) \"A Comprehensive Catalog of 3D Genome Organization in Diverse Human Genomes Facilitates Understanding of the Impact of Structural Variation on Chromatin Structure.\", Li C*, Bonder MJ, Syed S, Jensen M, Human Genome Structural Variation Consortium (HGSVC), HGSVC Functional Analysis Working Group, Gerstein MB, Zody MC, Chaisson MJP, Talkowski ME, Marschall T, Korbel JO, Eichler EE, Lee C, and Shi X, Genome Research, Published in Advance December 5, 2024, doi:10.1101/gr.279419.124. (Code is available at GitHub) \"Discriminative Forests Improve Generative Diversity for Generative Adversarial Networks.\", Chen J*, Li J, Song C*, Li B*, Chen Q, Gao H, Wang H, and Shi X, In Proceedings of the 38th AAAI Conference on Artificial Intelligence (AAAI 2024), Vancouver, Canada, February 20-27, 2024. \"Assembly of 43 human Y chromosomes reveals extensive complexity and variation.\", Hallast P, Ebert P, Loftus M, Yilmaz F, Audano PA, Logsdon GA, Bonder MJ, Zhou W, Höps W, Kim K, Li C*, Hoyt SJ, Dishuck PC, Porubsky D, Tsetsos F, Kwon JY, Zhu Q, Munson KM, Hasenfeld P, Harvey WT, Lewis AP, Kordosky J, Hoekzema K, Human Genome Structural Variation Consortium (HGSVC), O’Neill RJ, Korbel JO, Tyler-Smith C, Eichler EE, Shi X, Beck CR, Marschall T, Konkel MK, and Lee C (2023), Nature, Aug 23 2023. \"PAR-GAN: Improving the Generalization of Generative Adversarial Networks Against Membership Inference Attacks.\", Chen J*, Wang HW, Gao H, and Shi X, In Proceedings of The 27th ACM SIGKDD Conference on Knowledge Discovery and Data Mining (KDD 2021), August 14-18, 2021, Virtual. (Code for PAR-GAN is available at GitHub) \"On the Convergence of Stochastic Compositional Gradient Descent Ascent Method.\", Gao H, Wang X, Luo L, and Shi X, In",
  "content_length": 15443,
  "method": "requests",
  "crawl_time": "2025-12-01 14:48:55"
}