{
  "name": "Xingda Wei",
  "homepage": "https://ipads.se.sjtu.edu.cn/pub/members/xingda_wei",
  "status": "success",
  "content": "Xingda Wei (魏星达) [IPADS] pub:members:xingda_wei Table of Contents Xingda Wei (魏星达) About Me Research Awards and Honors Services Students (Advised or co-advised) Publications 2025 2024 2023 2022 2021 2020 2019 2018 2017 2016 2015 Teaching Xingda Wei (魏星达) (Tenure Track) Associate professor Institute of Parallel And Distributed Systems School of Software Shanghai Jiao Tong University Software Building, 800 Dongchuan Rd., Shanghai, China Zip/Postal Code: 200240 Email: wxdwfc at sjtu dot edu dot cn About Me My research focuses on building system infrastructures to systematically bring better performance and resilience to applications. I am looking for self-motivated students interested in building hard-core systems. Drop me an E-mail if you want to join us or want to do research intern! Research My research focuses on building system infrastructures to systematically bring better performance and resilience to applications. My current focused topics including: Distributed system support for AI and AGI. [PhoenixOS [SOSP'25 (To appear]][DMVectorSearch preprint [BlitzScale OSDI'25](To appear) [KunServe preprint] The next-generation distributed computing infrastructure (Serverless). Serverless computing is a promising future direction for future cloud computing. However, current systems stacks are not designed for the new paradigm. How can we build the next-generation serverless system? [MITOSIS OSDI'23] [DMERGE (To appear)] The next-generation distributed storage system stack. Storage system (e.g., key-value stores and distributed file systems) are quickly evolving with modern hardwares and modern diverse workloads. How can they compose to better evolve with such trends? My related projects include: Fast remote persistent memory: Characterizing and Optimizing Remote Persistent Memory with RDMA and NVM [USENIX ATC'21] System co-design with modern datacenter networking Modern datacenter fast interconnects like RDMA and SmartNIC offer extremely powerful in-networking computing capabilities. How can we fully utilize the power of these networking features? My related projects include: DrTM: Fast In-memory Transaction Processing using RDMA and HTM [SOSP'15 ACM TOCS EuroSys'16 OSDI'18], Replication-driven Live Reconfiguration [USENIX ATC'17] DST(Decentralized Scalar Timestamp): Scalable timestamps for efficient MVCC [NSDI'21] Machine learning for systems. The advances in machine learning (ML) technologies also bring huge optimization space for computer systems. Besides providing powerful heuristics, the ML methods can change the complexity of traditional algorithms (e.g., sorting and indexing). My related projects include: XStore: Fast RDMA-based Ordered Key-Value Store using Remote Learned Cache [OSDI'20 ACM TOS] Awards and Honors Eurosys Best paper, 2024 华为火花奖, 2022 ACM 中国优秀博士学位论文提名奖 (ACM China Doctoral Dissertation Award), 2021 ACM ChinaSys 优秀博士学位论文奖 (ACM ChinaSys Doctoral Dissertation Award), 2021 Honorable Mention of the ACM SIGOPS Dennis M. Ritchie Award, 2021 Link Huawei OlympusMons Pioneer Award, 2020 Link Microsoft Research Asia Fellowship Award, 2018 Link Excellent Bachelor Thesis, 2015 Services Program Committee Member 2026: ASPLOS, EuroSys (Fall) 2025: NSDI, OSDI, CoNEXT, APSys 2024: NSDI, ASPLOS (Fall), CoNEXT (Winter) 2023: SysDW, Chinasys (Fall) 2022: EuroDW JSys Student Editorial Board Link Reviewer VLDB'22 (Journal), Reviewer TOCS'20, Reviewer TPDS'20, Reviewer Students (Advised or co-advised) Rongxin Cheng (P.h.d since 2022) Dingyan Zhang (P.h.d since 2023) Yingyi Hao (P.h.d since 2024) JiaHao Wang (P.h.d since 2025) Haotian wang (Master) Hongrui Xie (Master) Tianle Sun (Master) Jinbo Han (Master) Yang Liu (Master) Yifan Peng (Master, Co-advised w/ Prof. Rong) Shitong Chen (Master) Kaixi Zhang (Undergraduate) Publications 2025 [SOSP'25] PhoenixOS: Concurrent OS-level GPU Checkpoint and Restore with Validated Speculation. Xingda Wei, Zhuobin Huang (co-first)，Tianle Sun, Yingyi Hao，Rong Chen，Mingcong Han，Jinyu Gu，Haibo Chen. The 31st Symposium on Operating Systems Principles. [OSDI'25] Fast and Live Model Auto Scaling with O(1) Host Caching. Dingyan Zhang, Haotian Wang, Yang Liu, Xingda Wei (Corresponding author), Yizhou Shan, Rong Chen, Haibo Chen. The 19th USENIX Symposium on Operating Systems Design and Implementation. [ATC'25] KVCache Cache in the Wild: Characterizing and Optimizing KVCache Cache at a Large Cloud Provider. Jiahao Wang, Jinbo Han, Xingda Wei (Corresponding author), Sijie Shen, Dingyan Zhang, Chenguang Fang, Rong Chen, Wenyuan Yu, Haibo Chen. [NSDI'25] ODRP: On-Demand Remote Paging with Programmable RDMA. Zixuan Wang, Xingda Wei, Jinyu Gu, Hongrui Xie, Rong Chen, and Haibo Chen. 22nd USENIX Symposium on Networked Systems Design and Implementation. 2024 [Preprint] PARALLELGPUOS: A Concurrent OS-level GPU Checkpoint and Restore System using Validated Speculation, Zhuobin Huang, Xingda Wei, Yingyi Hao, Rong Chen, Mingcong Han, Jinyu Gu, Haibo Chen. [Preprint] Characterizing the Dilemma of Performance and Index Size in Billion-Scale Vector Search and Breaking It with Second-Tier Memory, Rongxin Cheng, Yifan Peng, Xingda Wei, Hongrui Xie, Rong Chen, Sijie Shen, Haibo Chen. [EuroSys (Best paper)] Serialization/Deserialization-free State Transfer in Serverless Workflows. Fangming Lu, Xingda Wei (Corresponding author), Zhuobin Huang, Rong Chen, Mingyu Wu, and Haibo Chen. The 19th ACM SIGOPS European Conference on Computer Systems, Athens, Greece, April 2024. 2023 [OSDI] No Provisioned Concurrency: Fast RDMA-codesigned Remote Fork for Serverless Computing. Xingda Wei, Fangming Lu, Tianxia Wang, Jinyu Gu, Yuhan Yang, Rong Chen, and Haibo Chen. 17th USENIX Symposium on Operating Systems Design and Implementation, Boston, MA, US, July 2023. Pre-print [OSDI] Characterizing Off-path SmartNIC for Accelerating Distributed Applications. Xingda Wei, Rongxin Cheng, Yuhan Yang, Rong Chen, and Haibo Chen. 17th USENIX Symposium on Operating Systems Design and Implementation, Boston, MA, US, July 2023. (To appear) 2022 [USENIX ATC] KRCORE: a microsecond-scale RDMA control plane for elastic computing. Xingda Wei, Fangming Lu, Rong Chen, and Haibo Chen. 2022 USENIX Annual Technical Conference, Carlsbad, CA, US. July 2022. [paper] | AE | github Awarded with USENIX Badges: Artifacts Available, Artifacts Functional, Results Reproduced. 2021 [USENIX ATC] Xingda Wei, Xiating Xie, Rong Chen, Haibo Chen, Binyu Zang. Characterizing and Optimizing Remote Persistent Memory with RDMA and NVM. 2021 USENIX Annual Technical Conference, July 2021. [paper] [NSDI] Xingda Wei, Rong Chen, Haibo Chen, Zhaoguo Wang, Zhenhan Gong, and Binyu Zang. Unifying Timestamp with Transaction Ordering for MVCC with Decentralized Scalar Timestamp. The 18th USENIX Symposium on Networked Systems Design and Implementation, Boston, MA, US, April 2021. [paper] talk github [ACM TOS] Xingda Wei, Rong Chen, Haibo Chen, and Binyu Zang. XStore: A Fast RDMA-based Ordered Key-Value Store with Remote Learned Cache. ACM Transactions on Storage, 17(3), Article No. 18, August 2021. paper 2020 [OSDI] Xingda Wei, Rong Chen, and Haibo Chen. Fast RDMA-based Ordered Key-Value Store using Remote Learned Cache. 14th USENIX Symposium on Operating Systems Design and Implementation, Banff, Alberta, Canada, November 2020. [paper] talk github Full version paper: ACM TOS 2019 [USENIX ATC] Xiating Xie, Xingda Wei, Rong Chen, and Haibo Chen. Pragh: Locality-preserving Graph Traversal with Split Live Migration. 2019 USENIX Annual Technical Conference, Renton, WA, US, July 2019. [paper] talk 2018 [OSDI] Xingda Wei, Zhiyuan Dong, Rong Chen, and Haibo Chen. Deconstructing RDMA-enabled Transaction Processing: Hybrid is Better! 13th USENIX Symposium on Operating Systems Design and Implementation, Carlsbad, CA, US, October 2018. [paper] [slides] talk github 2017 [USENIX ATC] Xingda Wei, Sijie Shen, Rong Chen, and Haibo Chen. Replication-driven Live Reconfiguration for Fast Distributed Transaction Processing. 2017 USENIX Annual Technical Conference, Santa Clara, CA, US, July 2017. [paper] [ACM TOCS] Haibo Chen, Rong Chen, Xingda Wei, Jiaxin Shi, Yanzhe Chen, Zhaoguo Wang, Binyu Zang, Haibing Guan. Fast In-memory Transaction Processing using RDMA and HTM. ACM Transactions on Computer Systems, Vol. 35, No. 1, Article 3, July 2017. [paper] 2016 [EuroSys] Yanzhe Chen, Xingda Wei, Jiaxin Shi, Rong Chen, and Haibo Chen. Fast and General Distributed Transactions Using RDMA and HTM. 11th ACM European Conference on Computer Systems, London, UK, April 2016. [paper] ACM DL 2015 [SOSP] Xingda Wei, Jiaxin Shi, Yanzhe Chen, Rong Chen, and Haibo Chen. Fast In-memory Transaction Processing using RDMA and HTM. 25th ACM Symposium on Operating Systems Principles, Monterey, CA, USA, October 2015. [paper] [slides] [poster] ACM DL github Featured on \"The Morning Paper\" Full version paper: ACM TOCS Teaching Computer system principle, 2022, Co-instructor Computer system engineering, 2022, Co-instructor Computer system engineering, 2021, Co-instructor Advanced Distributed Systems, TA pub/members/xingda_wei.txt · Last modified: 2025/09/28 12:43 by profile",
  "content_length": 9127,
  "method": "requests",
  "crawl_time": "2025-12-01 14:48:54"
}