{
  "name": "Xing Gao 0001",
  "homepage": "http://xgao-work.github.io",
  "status": "success",
  "content": "Xing Gao @ University of Delaware Assistant Professor X-Lab, Department of Computer and Information Sciences Joint with the Department of Electrical and Computer Engineering University of Delaware Office: 316b FinTech, STAR Campus Email: xgao [at] udel.edu Group Github: UD-X-Lab Research Interests [Openings] Cybersecurity in Software Supply Chain, Web 3, High-Performance Computing, and Large Language Model. Selected and Recent Publications [ICRA'25] Investigating Security Threats in Multi-Tenant ROS2 Systems [CCS'24] Toward Understanding the Security of Plugins in Continuous Integration Services [USENIX-SEC'24] Invalidate+Compare: A Timer-Free GPU Cache Attack Primitive [S&P'24] More Haste, Less Speed: Cache Related Security Threats in Continuous Integration Services [WWW'24] Characterizing Ethereum Upgradable Smart Contracts and Their Security Implications [CCS'23] TunneLs for Bootlegging: Fully Reverse-Engineering GPU TLBs for Challenging Isolation Guarantees of NVIDIA MIG [S&P'23] Continuous Intrusion: Characterizing the Security of Continuous Integration Services [S&P'23] Investigating Package Related Security Threats in Software Registries [INFOCOM'23] SDN Application Backdoor: Disrupting the Service via Poisoning the Topology [CCS'22] Ready Raider One: Exploring the Misuse of Cloud Gaming Services [USENIX-SEC'22] Exploring the Unchartered Space of Container Registry Typosquatting [DSN'22] TORPEDO: A Fuzzing Framework for Discovering Adversarial Container Workloads [S&P'22] Time-Print: Authenticating USB Flash Drives with Novel Timing Fingerprints [ACSAC'21] An Exploration of ARM System-Level Cache and GPU Side Channels [USENIX-SEC'21] Charger-Surfing: Exploiting a Power Line Side-Channel for Smartphone Information Leakage [DSN'21] CloudSkulk: A Nested Virtual Machine Based Rootkit and Its Detection [AsiaCCS'21] Red Alert for Power Leakage: Exploiting Intel RAPL-Induced Side Channels [WWW'21] An Investigation of Identity-Account Inconsistency in Single Sign-On [CVPR'20] Evade Deep Image Retrieval by Stashing Private Images in the Hash Space [CCS'19] Houdini’s Escape: Breaking the Resource Rein of Linux Control Groups [MM'19] Close the Gap between Deep Learning and Mobile Intelligence by Incorporating Training in the Loop [NDSS'18] Reduced Cooling Redundancy: A New Security Vulnerability in a Hot Data Center Professional Services Registration Chair: - ACM/IEEE Symposium on Edge Computing, 2023. Publicity Co-Chairs: - IEEE Conference on Communications and Network Security, 2022. TPC Member: - USENIX Security Symposium, 2026, 2025. - ACM Conference on Computer and Communications Security, 2026, 2025, 2024. - The ACM Web Conference, 2026, 2025, 2024. - IEEE/IFIP International Conference on Dependable Systems and Networks, 2024. - IEEE Conference on Communications and Network Security, 2024. - IEEE International Conference on Computer Communications and Networks, 2023. - ACM/IFIP International Middleware Conference, 2022. - IEEE International Conference on Distributed Computing Systems, 2022. - International Conference on Information and Communications Security, 2022, 2021, 2020, 2019. - International Conference on Network and System Security, 2020. Journal Reviewer: - IEEE Transactions on Dependable and Secure Computing. - IEEE/ACM Transactions on Networking. - IEEE Transactions on Cloud Computing. - IEEE Transactions on Services Computing. - IEEE Transactions on Parallel and Distributed Systems. - ACM Transactions on Sensor Network. - IEEE Internet of Things Journal. Teaching CISC 464/664 Introduction to Network Security – Spring 2024, 2022. CISC 450 / CPEG 419 Computer Networks I – Spring 2024, 2023, 2021. CISC 890 Colloquium: Computer Science – Fall 2023. CISC 849 Topics in Computer Applications – Fall 2024, 2022. CISC 449/649 Topics in Computer Applications - Internet Security with Mobile and IoT Devices – Fall 2022, 2021, 2020. COMP 7/8311 Advanced Computer Networks – Spring 2020. COMP 3825 Networking and Information Assurance – Fall 2019, 2018. COMP 7/8327 Network and Internet Security – Spring 2019. Awards NSF CAREER Award, 2024. NSF CRII Award, 2020. NDSS Distinguished Poster Award, 2016.",
  "content_length": 4174,
  "method": "requests",
  "crawl_time": "2025-12-01 14:48:54"
}