{
  "name": "Xinming Ou",
  "homepage": "http://www.cse.usf.edu/~xou",
  "status": "success",
  "content": "Xinming (Simon) Ou's Home Page Xinming (Simon) Ou Professor, Bellini College of Artificial Intelligence, Cybersecurity and Computing Director, Rapid7 Cyber Threat Intelligence Lab University of South Florida 4202 East Fowler Avenue, Office: ENC 2501, Mail Stop: ENG 030 Tampa, FL 33620, (813) 974-4522 xou AT usf DOT edu [Publications] [Google Scholar] [Curriculum Vitae] I am broadly interested in research that addresses pressing-need cybersecurity challenges. I am especially interested in research problems that arise from practical domains, with a focus on both experimental/empirical study and sound theoretical footings. My research findings have led me to the current interests in human-centric approach to security and computing in general. Computing is now so intimately integrated with all aspects of our social fabrics and this requires computing solutions be considered within the larger human/social contexts. We work with colleagues in anthropology and other social sciences backgrounds, to investigate security phenomena emanating within these larger contexts — from security operation centers to software development companies. The rapid advancement in artificial intelligence creates great opportunities to tightly integrate human and machine in security tasks, particularly for defense. If you are interested in joining my group, please contact me with your CV and a brief description of your research interest. Recent and upcoming professional activities Co-Chair, CCS'24 Doctoral Symposium Steering/Program Committee, Workshop on SOC Operations and Construction (WOSOC) Teaching Spring 2025: CNT 4419: Secure Coding Fall 2024: CIS 4622: Hands-on Cybersecurity Spring 2024: CIS 4622: Hands-on Cybersecurity CNT 4419: Secure Coding Spring 2023: CIS 4622: Hands-on Cybersecurity CNT 4419: Secure Coding Fall 2022: CIS 4622: Hands-on Cybersecurity Spring 2022: CIS 4622: Hands-on Cybersecurity Fall 2021: COP 4600: Operating Systems Students I am fortunate to work with these talented students. Guojun (Louis) Liu (PhD) Kumar Shashwat (PhD) Francis Hahn (PhD) Spencer Cherry (PhD) Faayed Faisal (PhD) Kritan Banstola (PhD) Laura Araujo Buldrini (Undergrad) Alumni Austin Holmes (Bachelor, Fall 2024) Armin Ziaie Tabari (PhD, 2021. Security Researcher, OPSWAT) Anwesh Tuladhar (PhD, 2021. Research Scientist, Facebook) Jaleel Ahmed (MS, 2019. Software Engineer, Cerner) Yuping Li (PhD, 2018. Security Engineer, Pinterest) Xiaolong (Daniel) Wang (PhD, 2018. Sr. Security Engineer, TuSimple) Fengguo Wei (PhD, 2018. Software Engineer, Google) Richard Habeeb (MS, 2018. PhD Student, Yale University) Sathya Chandran Sundaramurthy (PhD, 2017. Senior Security Engineer, Netflix) Alexandru Bardas (PhD, 2016. Assistant Professor, University of Kansas) Ali Ali (Undergraduate Student) Jacob Case (Undergraduate Student, 2013-2015) Jordan DeLoach (Undergraduate Student) Ian Unruh (Undergraduate Student, 2012-2014) Su Zhang (PhD, 2014. Security Architect, Pony.ai) Matej Dolezal (Exchange Student from Czech Technical University, 2013-2014) Loai Zomlot (PhD, 2014. Senior Software Engineer, Microsoft) Brian Cain (MS, 2014) Kui Luo (PhD student 2009-2012) Heqing Huang (PhD student 2010-2012) Dustin Seabourn (Bachelor, Spring 2012) Cory Hardman (Bachelor, Dec 2011) Nataraj Sundar (MS, 2011) Murali Vupputuri (MS, 2011) Tsung-Hsi Wu (MSE, 2010) Sakthiyuvaraja Sakthivelmurugan (MS, 2009) Robert Christie (Bachelor, Spring 2009) Ashok Varikuti (MS, 2009) John Homer (PhD, 2009. Faculty at Abilene Christian University) Abhishek Rakshit (MS, 2008) Hussain Almohri (MS, 2008) Bart Carroll (Bachelor, Fall 2007) Last update: March 25, 2025.",
  "content_length": 3646,
  "method": "requests",
  "crawl_time": "2025-12-01 14:49:02"
}