{
  "name": "Xinming Shi",
  "homepage": "https://pure.qub.ac.uk/en/persons/xinming-shi",
  "status": "success",
  "content": "Xinming Shi - Queen's University Belfast View Scopus Profile Xinming Shi Dr Lecturer, School of Electronics, Electrical Engineering and Computer Science https://orcid.org/0000-0002-2053-6924 Emailx.shiqub.acuk Accepting PhD Students 20182025 Research activity per year Personal profile Research FocusInspired by the human brain, the development of brain-inspired intelligence is a rapidly expanding area in AI. Facing the constraints of traditional von Neumann architectures and the diminishing of Moore's Law, the computing performance of the intelligent hardware needs to be continuously improved. We delve into devices, algorithms, circuits, and architecture, focusing on the use of brain-inspired learning, memory, and evolution in designing software algorithms and hardware, targeting applications in edge computing, robotics, and large language models. Neuromorphic Computing Hardware & SoftwareEvolutionary LearningTrustworthy Brain-inspired Intelligence Fingerprint Dive into the research topics where Xinming Shi is active. These topic labels come from the works of this person. Together they form a unique fingerprint. Reservoir Computing Computer Science 100% SPICE Engineering 100% Memristor Physics 100% Pattern Recognition Engineering 75% Genetic Programming Computer Science 50% Analog Circuit Computer Science 50% Series Prediction Computer Science 50% Pulse Generator Engineering 50% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output Research output per year 2018 2018 2022 2024 2025 2025 6 Conference contribution 6 Article 1 Paper Research output per year Research output per year Jumping memory for memristive reservoir computingShi, X., 01 Feb 2025, (Accepted).Research output: Contribution to conference › Paper › peer-review Memristive dynamical spiking neural networks with spatiotemporal heterogeneityShi, X., Zhou, P., McTaggart, C. & Yao, X., 01 Aug 2025, (Accepted) 2025 International Conference on Machine Intelligence and Nature-InspireD Computing (MIND): Proceedings. Institute of Electrical and Electronics Engineers Inc.Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Novel memristive reservoir computing with evolvable topology for time series predictionShi, X., Minku, L. L. & Yao, X., 14 Jun 2025, 31st International Conference on Neural Information Processing (ICONIP): Proceedings. Springer, Vol. 2287. p. 397-412 16 p. (Communications in Computer and Information Science; vol. 2287).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open AccessFile Series Prediction 100% Reservoir Computing 100% Reservoir Performance 100% Experimental Result 50% Predictive Performance 50% 7 Downloads (Pure) Evolving memristive reservoirShi, X., Minku, L. L. & Yao, X., Oct 2024, In: IEEE Transactions on Neural Networks and Learning Systems. 35, 10, p. 13574 - 13588 15 p.Research output: Contribution to journal › Article › peer-review Open AccessFile Wave Generation 100% 6 Citations (Scopus) 39 Downloads (Pure) Memristor modeling with homeostatic threshold variation for simulation and applicationShi, X. & Wang, Z., 19 Mar 2024, 2023 International Conference on Neuromorphic Computing (ICNC): Proceedings. Institute of Electrical and Electronics Engineers Inc., p. 281-290 Research output: Chapter in Book/Report/Conference proceeding › Conference contribution SPICE 100% Neuromorphic Computing 100% Homeostasis 57% Pattern Recognition 50% Nanoscale 50% View all 13 research outputs Prizes Excellent Science & Technology Academic PapersShi, X. (Recipient), 2022Prize: Prize (including medals and awards) Shenzhen Artificial Intelligence Industry Application AwardShi, X. (Recipient), 14 Mar 2025Prize: Prize (including medals and awards) Activities Activities per year 2022 2025 2025 7 Participation in workshop, seminar, course 5 Participation in conference 3 Editorial activity 3 Oral presentation 8 More 2 Publication peer-review 2 Invited talk 2 Public lecture/debate/seminar 1 Work on advisory panel to industry or government or non-government organisation 1 Membership of peer review panel or committee Activities per year Memristor-based Bionic Decision-making Circuit Inspired by Self-awarenessShi, X. (Organiser) & Wang, Z. (Invited speaker)20 Oct 2025Activity: Talk or presentation types › Public lecture/debate/seminar NeuMat kickoff meetingShi, X. (Speaker)Sept 2025Activity: Participating in or organising an event types › Participation in workshop, seminar, course IEEE UK & Ireland Signal Processing Society Early Career Research SeminarShi, X. (Invited speaker)06 Aug 2025Activity: Talk or presentation types › Public lecture/debate/seminar International Workshop on Reliable and Sustainable Neuromorphic HardwareShi, X. (Invited speaker)28 May 2025Activity: Participating in or organising an event types › Participation in workshop, seminar, course Jumping Memory for Memristive Reservoir ComputingShi, X. (Speaker)27 May 2025Activity: Talk or presentation types › Oral presentation View all 26 activities",
  "content_length": 5383,
  "method": "requests",
  "crawl_time": "2025-12-01 14:48:58"
}