{
  "name": "Xinruo Zhang",
  "homepage": "https://www.essex.ac.uk/people/zhang32812/xinruo-zhang",
  "status": "success",
  "content": "Xinruo Zhang | University of Essex University of Essex homepage Skip to content I'm looking for... Courses Research People Something else Course query Course level Select Level Undergraduate Postgraduate Prefer to see our subject areas? Browse courses by subject Research query Looking for funded postgraduate opportunities? View doctoral training partnerships Browse postgraduate research opportunities Person query We are different and we are the same. #WeAreEssex Search query Looking for student or staff information? Student Directory Staff Directory Courses Course query Course level Select Level Undergraduate Postgraduate Prefer to see our subject areas? Browse courses by subject Research Research query Looking for funded postgraduate opportunities? View doctoral training partnerships Browse postgraduate research opportunities People Person query We are different and we are the same. #WeAreEssex Something else Search query Looking for student or staff information? Student Directory Staff Directory University of Essex homepage Xinruo Zhang People Dr Xinruo Zhang Lecturer School of Computer Science and Electronic Engineering (CSEE) Email xinruo.zhang@essex.ac.uk Location 5A.539, Colchester Campus Academic support hours My Academic Support Hours are Thursday 12-2pm, either in-person or Zoom (link available on Moodle). Profile Research Teaching and supervision Publications Grants and funding Contact Profile Research Teaching and supervision Publications Grants and funding Contact Profile Biography Dr. Xinruo Zhang is currently a Lecturer (Assistant Professor) in the School of Computer Science and Electronic Engineering (CSEE), University of Essex. Prior to that, she was a Research Associate with Wolfson School of Mechanical, Electrical and Manufacturing Engineering, Loughborough University. Her research interests lie in privacy-aware, energy, communication and data-efficient machine learning for wireless communications, semantic communications, vehicular networks and edge intelligence. Qualifications PhD Telecommunications Research King's College London, MSc Satellite Communications Engineering University of Surrey, Appointments University of Essex Lecturer, Computer Science and Electronic Engineering, University of Essex (2020 - present) Other academic Post-Doctoral Research Associate, Wolfson School of Mechanical, Electrical and Manufacturing Engineering, Loughborough University (2018 - 2020) Research and professional activities Research interests Radio Resource Management Beamforming/Precoding, Power control, Spectrum sharing, User scheduling, Edge caching & computing Open to supervise Machine Learning for Communications Privacy-aware, energy-, communication- and data-efficient machine learning, including continuous learning, few-shot learning, federated learning, reinforcement learning Open to supervise Next Generation Wireless Networks Semantic communications, Cell-free massive MIMO, IoT, V2X, Space-Air-Ground integrated network Open to supervise Teaching and supervision Current teaching responsibilities Network Fundamentals (CE155) Foundations of Electronics I (CE163) Network Fundamentals (CE169) Publications Journal articles (15) Li, S., Cai, Y., Deng, Z., Ba, X., Zheng, Q., Zhang, X. and Su, B., (2025). Federated Learning for Semantic Communication Based on CNNs and Transformer. International Journal of Intelligent Systems. 2025 (1) Cai, Y., Li, S., Liu, J., Zhang, X. and Shen, X., (2025). Multiple RIS-assisted federated learning system based on channel quality device selection algorithm. Complex & Intelligent Systems. 11 (10) Cai, Y., Li, S., Liu, J., Zhang, Q., Qin, Z. and Zhang, X., (2025). Federated-Learning-Assisted RIS Active and Passive Beamforming with ADMM for IoT Devices. IEEE Internet of Things Journal, 1-1 Chen, T., Zhang, X., You, M., Zheng, G. and Lambotharan, S., (2023). Federated Learning Enabled Link Scheduling in D2D Wireless Networks. IEEE Wireless Communications Letters. 13 (1), 89-92 Chen, T., Zhang, X., You, M., Zheng, G. and Lambotharan, S., (2022). A GNN based Supervised Learning Framework for Resource Allocation in Wireless IoT Networks. IEEE Internet of Things Journal. 9 (3), 1712-1724 Wan Ariffin, WNSF., Zhang, X., Nakhai, MR., Rahim, HA. and Ahmad, RB., (2021). Online Learning Approach for Predictive Real-Time Energy Trading in Cloud-RANs.. Sensors. 21 (7), 2308-2308 Zhang, X., Zheng, G., Lambotharan, S., Nakhai, MR. and Wong, K-K., (2020). A Reinforcement Learning-Based User-Assisted Caching Strategy for Dynamic Content Library in Small Cell Networks. IEEE Transactions on Communications. 68 (6), 3627-3639 Xia, W., Zhang, X., Zheng, G., Zhang, J., Jin, S. and Zhu, H., (2020). The Interplay Between Artificial Intelligence and Fog Radio Access Networks. IEEE China Communications. 17 (8), 1-13 You, M., Zhang, X., Zheng, G., Jiang, J. and Sun, H., (2020). A Versatile Software Defined Smart Grid Testbed: Artificial Intelligence Enhanced Real-Time Co-Evaluation of ICT Systems and Power Systems. IEEE Access. 8, 88651-88663 Khan, AS., Zhang, X., Lambotharan, S., Zheng, G., AsSadhan, B. and Hanzo, L., (2020). A Machine Learning Aided Blockchain Assisted Framework for Wireless Networks. IEEE Network. 34 (5), 262-268 Zhang, X., Nakhai, MR., Zheng, G., Lambotharan, S. and Chambers, JA., (2019). Distributed Foresighted Energy Management in Smart-Grid-Powered Cellular Networks. IEEE Transactions on Vehicular Technology. 68 (4), 4064-4068 Zhang, X., Nakhai, MR., Zheng, G., Lambotharan, S. and Ottersten, B., (2019). Calibrated Learning for Online Distributed Power Allocation in Small-Cell Networks. IEEE Transactions on Communications. 67 (11), 8124-8136 Wan Ariffin, WNSF., Zhang, X. and Nakhai, MR., (2017). Sparse Beamforming for Real-Time Resource Management and Energy Trading in Green C-RAN. IEEE Transactions on Smart Grid. 8 (4), 2022-2031 Zhang, X., Nakhai, MR. and Wan Ariffin, WNSF., (2017). A Bandit Approach to Price-Aware Energy Management in Cellular Networks. IEEE Communications Letters. 21 (7), 1609-1612 Zhang, X., Nakhai, MR. and Ariffin, WNSFW., (2017). Adaptive Energy Storage Management in Green Wireless Networks. IEEE Signal Processing Letters. 24 (7), 1044-1048 Show all Conferences (10) Zhang, X., Zheng, G. and Lambotharan, S., (2020). Trajectory Design for UAV-Assisted Emergency Communications: A Transfer Learning Approach Zhang, X., Nakhai, MR., Zheng, G., Lambotharan, S. and Ottersten, B., (2019). A Calibrated Learning Approach to Distributed Power Allocation in Small Cell Networks Zhang, X., Zheng, G., Lambotharan, S., Nakhai, MR. and Wong, K-K., (2019). A Learning Approach to Edge Caching with Dynamic Content Library in Wireless Networks Ariffin, WNSFW., Zhang, X. and Nakhai, MR., (2016). Sparse beamforming for real-time energy trading in CoMP-SWIPT networks Ariffin, WNSFW., Zhang, X. and Nakhai, MR., (2016). Combinatorial multi-armed bandit algorithms for real-time energy trading in green C-RAN Zhang, X. and Nakhai, MR., (2016). Robust chance-constrained distributed beamforming for multicell interference networks Zhang, X., Nakhai, MR. and Wan Ariffin, WNSF., (2016). A Multi-Armed Bandit Approach to Distributed Robust Beamforming in Multicell Networks Zhang, X. and Nakhai, MR., (2016). A Distributed Algorithm for Robust Transmission in Multicell Networks with Probabilistic Constraints Ariffin, WNSFW., Zhang, X. and Nakhai, MR., (2015). Real-time power balancing in green CoMP network with wireless information and energy transfer Ariffin, WNSFW., Zhang, X. and Nakhai, MR., (2015). Real-time energy trading with grid in green cloud-RAN Show all Grants and funding 2024 Optimization of Resource Allocation in Broadcast and Multicast Systems Based on Non-Binary Polar Codes The Royal Society Contact xinruo.zhang@essex.ac.uk Location: 5A.539, Colchester Campus Academic support hours: My Academic Support Hours are Thursday 12-2pm, either in-person or Zoom (link available on Moodle). STUDY Course Finder Undergraduate study Postgraduate study Doctoral and Postdoctoral College Short courses and CPD International students Study online Apprenticeships Summer Schools Find a course LIFE Our campuses Student accommodation Essex Sport Careers and Employability Student support RESEARCH Research excellence Research showcase Media requests Research Excellence Framework (REF) Research institutes and centres EXPLORE About us Departments Contact us How to pay your fees Jobs A-Z Students Alumni Staff Business CONTACT US Contact General - enquiries@essex.ac.uk Undergraduate - admit@essex.ac.uk Postgraduate - pgadmit@essex.ac.uk +44 (0) 1206 873333 University of Essex Wivenhoe Park Colchester CO4 3SQ Cookie settings Disclaimer Accessibility Our privacy statements Our transparency return Modern slavery and human trafficking CONNECT WITH US University of Essex Instagram University of Essex TikTok University of Essex Youtube University of Essex Facebook University of Essex LinkedIn University of Essex Twitter University of Essex Weibo © 2025 University of Essex. All rights reserved UNRVLD Digital Agency website",
  "content_length": 9089,
  "method": "requests",
  "crawl_time": "2025-12-01 14:48:59"
}