{
  "name": "Xinyu Wang 0006",
  "homepage": "https://web.eecs.umich.edu/~xwangsd",
  "status": "success",
  "content": "Xinyu Wang Xinyu Wang Assistant Professor Computer Science and Engineering University of Michigan, Ann Arbor Email: xwangsd@umich.edu Office: 4620 Beyster Twitter: @xwangsd [Research] [Teaching] [Publications] [Team] [Service] [CV] What's new?! PhD positions available for Fall 2026. Research positions for undergraduates and masters students: take a look at this link. I am a tenure-track assistant professor in the Electrical Engineering and Computer Science Department at the University of Michigan. My research interests are in the areas of programming languages, formal methods, software engineering, and artificial intelligence. Previously I was a researcher at Microsoft. I obtained my Ph.D. from the University of Texas at Austin. Research My work is centered around program synthesis—more generally, AI-assisted programming—with the goal of transforming how software is created. Specifically, my work aims to develop general principles that can reliably scale program synthesis, and build synthesis-aided programming systems to enable easy creation of software across of a wide range of application domains. The particular methodology I've been taking to realize this vision is largely application-driven, by synergistically combining (1) insights from the application domain and (2) techniques from the areas of formal methods, programming languages, AI/ML, and human-centered computing. The hope is that, by better solving very hard technical problems from important domains, we can also develop new insights around program synthesis that can generalize to and benefit other domains. Below are some directions that we have been working on lately... AI-Assisted Programming for Computational Science New direction. Details forthcoming... We are hiring at all levels. Please reach out if you're interested! Formal Methods for Optimizing Analytic Queries Publications: Polygon [PLDI 2025], VeriEQL [OOPSLA 2024, VLDB 2024 demo], SlabCity [VLDB 2023] TL;DR: We've been developing synthesis-aided techniques that can optimize a significantly larger class of queries than existing work—specifically targeting complex analytical workloads. Realizing this vision requires more powerful program reasoning techniques (including synthesis as well as verification, testing, etc.) tailored towards database query languages (like SQL), but we believe the resulting ideas will also advance formal methods and programming languages in general. Neuro-Symbolic Agents for Process Automation Publications: Arborist [POPL 2024], MIWA [UIST 2023], DiLogics [UIST 2023], WebRobot [PLDI 2022], SemanticOn [UIST 2022], WebQA [PLDI 2021] TL;DR: We've been developing new synthesis algorithms and interaction mechanisms to enable easy creation of web automation programs (to automate web-related tasks such as data scraping, data entry, form filling, etc.), by simply describing the task logic in natural language and demonstrating how to perform it in a web browser. The goal is to eventually simplify the creation, deployment, management, and maintenance of such automation programs to enable automation of tasks that involve interactions across multiple applications. Teaching EECS 481. Software Engineering [Winter 2026] CSE 598. Intelligent Programming Systems [Fall 2025] EECS 498. Intelligent Programming Systems [Fall 2025] EECS 481. Software Engineering [Winter 2025] EECS 481. Software Engineering [Winter 2024] EECS 598. Intelligent Programming Systems [Fall 2023] EECS 498. Intelligent Programming Systems [Fall 2023] EECS 481. Software Engineering [Winter 2023] EECS 481. Software Engineering [Fall 2022] EECS 481. Software Engineering [Winter 2022] EECS 598. Intelligent Programming Systems [Fall 2021] EECS 498. Intelligent Programming Systems [Fall 2021] EECS 203. Discrete Mathematics [Winter 2021] EECS 598. Program Synthesis: Techniques and Applications [Fall 2020] Selected Publications Polygon: Symbolic Reasoning for SQL using Conflict-Driven Under-Approximation Search [pdf] [code] Pinhan Zhao, Yuepeng Wang, Xinyu Wang PLDI 2025 Data-Driven Insight Synthesis for Multi-Dimensional Data [pdf] Best Paper Nomination Junjie Xing, Xinyu Wang, H. V. Jagadish VLDB 2024 VeriEQL: Bounded Equivalence Verification for Complex SQL Queries with Integrity Constraints [pdf] [code] Distinguished Paper Award Yang He*, Pinhan Zhao*, Xinyu Wang, Yuepeng Wang OOPSLA 2024 Efficient Bottom-Up Synthesis for Programs with Local Variables [pdf] Xiang Li*, Xiangyu Zhou*, Rui Dong, Yihong Zhang, Xinyu Wang POPL 2024 SlabCity: Whole-Query Optimization using Program Synthesis [pdf] Rui Dong*, Jie Liu*, Yuxuan Zhu, Cong Yan, Barzan Mozafari, Xinyu Wang VLDB 2023 MIWA: Mixed-Initiative Web Automation for Better User Control and Confidence [pdf] Weihao Chen, Xiaoyu Liu, Jiacheng Zhang, Ian Iong Lam, Zhicheng Huang, Rui Dong, Xinyu Wang, Tianyi Zhang UIST 2023 DiLogics: Creating Web Automation Programs with Diverse Logics [pdf][demo] Kevin Pu, Jim Yang, Angel Yuan, Minyi Ma, Rui Dong, Xinyu Wang, Yan Chen, Tovi Grossman UIST 2023 SemanticOn: Specifying Content-Based Semantic Conditions for Web Automation Programs [pdf][demo] Kevin Pu, Rainey Fu, Rui Dong, Xinyu Wang, Yan Chen, Tovi Grossman Best Paper Honorable Mention Award UIST 2022 INTENT: Interactive Tensor Transformation Synthesis [pdf] [code] Zhanhui Zhou*, Man To Tang*, Qiping Pan*, Shangyin Tan, Xinyu Wang, Tianyi Zhang UIST 2022 WebRobot: Web Robotic Process Automation using Interactive Programming-by-Demonstration [pdf] Rui Dong, Zhicheng Huang, Ian Iong Lam, Yan Chen, Xinyu Wang PLDI 2022 Web Question Answering with Neurosymbolic Program Synthesis [pdf] [code] Jocelyn Chen, Aaron Lamoreaux, Xinyu Wang, Greg Durrett, Osbert Bastani, Isil Dillig PLDI 2021 Synthesizing Data Structure Refinements from Integrity Constraints [pdf] Shankara Pailoor, Yuepeng Wang, Xinyu Wang, Isil Dillig PLDI 2021 Interpretable Program Synthesis [pdf][code] Tianyi Zhang, Zhiyang Chen, Yuanli Zhu, Priyan Vaithilingam, Xinyu Wang, Elena Glassman CHI 2021 Automated Policy Synthesis for System Call Sandboxing [pdf] Distinguished Paper Award Shankara Pailoor, Xinyu Wang, Hovav Shacham, Isil Dillig OOPSLA 2020 Interactive Program Synthesis by Augmented Examples [pdf][code] Tianyi Zhang, London Lowmanstone, Xinyu Wang, Elena Glassman UIST 2020 Multi-Modal Synthesis of Regular Expressions [pdf][code] Qiaochu Chen, Xinyu Wang, Xi Ye, Greg Durrett, Isil Dillig PLDI 2020 An Efficient Programming-by-Example Framework [pdf] Xinyu Wang PhD dissertation 2019 Relational Program Synthesis [pdf] Yuepeng Wang, Xinyu Wang, Isil Dillig OOPSLA 2018 Learning Abstractions for Program Synthesis [pdf] Xinyu Wang, Greg Anderson, Isil Dillig, Ken McMillan CAV 2018 Automated Migration of Hierarchical Data to Relational Tables using Programming-by-Example [pdf][code] Navid Yaghmazadeh, Xinyu Wang, Isil Dillig VLDB 2018 Program Synthesis using Abstraction Refinement [pdf] Xinyu Wang, Isil Dillig, Rishabh Singh POPL 2018 Synthesis of Data Completion Scripts using Finite Tree Automata [pdf] Xinyu Wang, Isil Dillig, Rishabh Singh OOPSLA 2017 FIDEX: Filtering Spreadsheet Data using Examples [pdf] Xinyu Wang, Sumit Gulwani, Rishabh Singh OOPSLA 2016 EXPLORER : Query- and Demand-Driven Exploration of Interprocedural Control Flow Properties [pdf] Yu Feng, Xinyu Wang, Isil Dillig, Calvin Lin OOPSLA 2015 Team Ruyi Ji (Postdoctoral Fellow, 2025-) Zheng Guo (Postdoctoral Fellow co-advised with Brian Kiedrowski, 2024-) Jesse Slater (PhD student co-advised with Max New, 2024-) Qingyue Wu (PhD student, 2024-) Pinhan Zhao (PhD student, 2023-) Hanchi Li (PhD student, 2023-) Rui Dong (PhD student, 2021-) Service 2025: PLDI (web co-chair), POPL (PC), OOPSLA (PC) 2024: PLDI (web co-chair) 2023: PLDI (AEC co-chair), OOPSLA (ERC) 2022: PLDI (AEC co-chair and PC), OOPSLA (PC) 2021: PLDI (PC) 2020: CAV (AEC co-chair and PC)",
  "content_length": 7857,
  "method": "requests",
  "crawl_time": "2025-12-01 14:49:03"
}