{
  "name": "Xinyu Chen 0002",
  "homepage": "https://xinychen.github.io/news.html",
  "status": "success",
  "content": "Xinyu Chen About Me News Publications Projects Talks Services Teaching News 2025 November 19: Great material to recommend from YouTube \"Understanding Calculus (for engineers),\" explaining calculus concepts related to engineering. November 9: Great material to recommend from YouTube \"The Physics of AI,\" including the explanation of Hopfield network, Gaussian process, and quantum field theory. October 27: I will be speaking at the INFORMS Annual Meeting 2025 in Atlanta on October 28, 2025. The topic is \"Quantifying time series periodicity with interpretable machine learning,\" within the invited session \"Recent Advances in Tensor Decomposition and Completion Algorithms and Their Applications\" chaired by Dr. Mehrdad Ghadiri. September 7: We released the Wikipedia hourly page view time series dataset (January 2024) on Zenodo. This dataset includes the hourly page view time series of 3 million most frequently-viewed Wikipedia pages, crafted based on the previously available Analytics Datasets: Pageviews with a novel perspective. July 14: I will join the Artificial Intelligence (AI) Initiative and the Institute of Artificial Intelligence at the University of Central Florida (UCF) as a tenure-track Assistant Professor. My research focuses on machine learning and optimization for understanding spatiotemporal systems. I conduct interdisciplinary research in scientific and engineering fields, applying cutting-edge computational technologies to real-world data science challenges. At the UCF AI Institute, I will be a strong advocate for open-source and reproducible research. June 24: Our LinkedIn post \"Ever heard of the Orthogonal Procrustes Problem (OPP)?\" (check out the slides) has received 500+ reactions and 60k+ impressions. June 1: Our paper \"Dynamic autoregressive tensor factorization for pattern discovery of spatiotemporal systems\" (authors: Xinyu Chen, Dingyi Zhuang, HanQin Cai, Shenhao Wang, Jinhua Zhao) was accepted to IEEE Transactions on Pattern Analysis and Machine Intelligence. May 22: I am delighted to give a job talk in the Artificial Intelligence (AI) Initiative at the University of Central Florida (UCF). The topic is about \"Machine learning and optimization for understanding spatiotemporal systems\" (see talk post). April 26: We built an interactive visualization tool for showing time series periodicity of Chicago ridesharing trips over two weeks starting April 1, 2024. March 16: Our GitHub repositories have received more than 5,000 stars. Among these repositories, one of the most popular projects awesome-latex-drawing has received more than 1,500 stars. March 12: Our open-source project \"Spatiotemporal Data Computing\" has been viewed by 3,000+ unique visitors. March 9: Our paper \"Correlating time series with interpretable convolutional kernels\" (authors: Xinyu Chen, HanQin Cai, Fuqiang Liu, Jinhua Zhao) was accepted to IEEE Transactions on Knowledge and Data Engineering. March 8: Our papers have received 1,500 citations on Google Scholar until now. February 10: Our paper \"Forecasting sparse movement speed of urban road networks with nonstationary temporal matrix factorization\" (authors: Xinyu Chen, Chengyuan Zhang, Xi-Le Zhao, Nicolas Saunier, Lijun Sun) was accepted to Transportation Science. This paper received a lot of insightful feedback and suggestions from reviewers. Thank you for the great contributions to this work in the reviewing process. February 9: Our research tutorial about \"Time Series Convolution\" is available at the Spatiotemporal Data Computing project. February 7: I am delighted to give a job talk in the Department of Industrial and Systems Engineering at the University of Tennessee, Knoxville (UTK). The topic is about \"Machine learning and optimization for data-driven transportation analytics and beyond,\" highlighting the importance of formulating real-world transportation analytics problems and beyond with machine learning and optimization techniques. February 3: I will host the JTL Research Seminar from February 6, 2025 to July 10, 2025 in MIT Urban Mobility Lab. January 10: I changed my homepage photo as this one, which was took at MIT, Cambridge, USA. 2024 December 16: I am delighted to give a virtual talk in the Machine Learning for Smart Mobility (MLSM) group at the Technical University of Denmark (DTU). The topic is about \"Machine learning and optimization for data-driven transportation analytics,\" highlighting the importance of formulating real-world transportation analytics problems with machine learning and optimization techniques. December 6: I am delighted to give a job talk in the School of Management at the Technical University of Munich (TUM) in Germany. The topic is about \"Machine learning and optimization for data-driven transportation analytics,\" highlighting the importance of formulating real-world transportation analytics problems with machine learning and optimization techniques. The teaching sample is \"The relevance of t-statistics for small sample sizes\" within 10 minutes. November 20: It is a great pleasure to have Dr. Mehrdad Ghadiri from MIT Sloan School of Management as our guest speaker, sharing his work on \"Approximately Optimal Core Shapes for Tensor Decompositions\" at the SRB seminar of MIT Urban Mobility Lab. November 13: It is a great pleasure to have Dr. T. Konstantin Rusch from MIT CSAIL Lab as our guest speaker, sharing his recent work on \"Message-Passing Monte Carlo: Generating low-discrepancy point sets via graph neural networks\" (the latest paper published in PNAS) at the SRB seminar of MIT Urban Mobility Lab. November 13: It is a great pleasure to have Prof. Filipe Rodrigues from the Machine Learning for Smart Mobility group at the Technical University of Denmark (DTU) as our guest speaker, sharing his recent work on \"Reinforcement Learning for Network Optimization in Transportation\" at the SRB seminar of MIT Urban Mobility Lab. November 6: It is a great pleasure to have Prof. Qiusheng Wu from the Department of Geography & Sustainability at the University of Tennessee, Knoxville (UTK) as our guest speaker, sharing his substantial work on \"Open-source Python package and software development in geospatial data science\" at the SRB seminar of MIT Urban Mobility Lab. October 18: I will host the invited session at 2024 INFORMS Annual Meeting on October 21th in Seattle, USA. The topic is \"Simulation and learning for smart transportation systems.\" In this session, I will give a talk about \"Modeling urban traffic data with matrix and tensor approaches\" (check out the slides). October 16: It is a great pleasure to have Prof. Vassilis Digalakis Jr from the Information Systems and Operations Management Department at HEC Paris as our guest speaker, sharing his recent work on \"Structural stability in machine learning\" (including the latest paper \"Slowly varying regression under sparsity\" published in Operations Research) at the SRB seminar of MIT Urban Mobility Lab. September 2: I revisit three very common methods for data dimensionality reduction by watching Latent Space Visualisation: PCA, t-SNE, UMAP | Deep Learning Animated on YouTube. I really like this kind of explanation approach. August 19: Our paper \"Forecasting urban traffic states with sparse data using Hankel temporal matrix factorization\" (authors: Xinyu Chen, Xi-Le Zhao, Chun Cheng) was accepted to INFORMS Journal on Computing. This paper received a lot of insightful feedback and suggestions from reviewers. Thank you for the great contributions to this work in the reviewing process. June 23: Our paper \"Laplacian convolutional representation for traffic time series imputation\" (authors: Xinyu Chen, Zhanhong Cheng, HanQin Cai, Nicolas Saunier, Lijun Sun) was accepted to IEEE Transactions on Knowledge and Data Engineering. This paper received a lot of insightful feedback and suggestions from reviewers. Thank you for the great contributions to this work in the reviewing process. May 16: I am delighted to give a talk at Northeastern University (invited by Prof. Ryan Qi Wang with the Department of Civil and Environmental Engineering) in Boston, USA. The topic is about \"Modeling temporal correlations and dynamics in spatiotemporal data systems,\" highlighting the importance of temporal modeling (e.g., local time series trends and time-varying system behaviors) in real-world data. March 31: We provide slides for understanding the most basic definition, properties, and derivatives of matrix traces in matrix computations and machine learning. March 20: I gave a comment (i.e., Rethink equation (15) for the iterative shrinkage thresholding algorithm) for Attention: Self-expression is all you need on OpenReview. This work has tried to connect transformers with the prior art, a very good attempt! March 15: I moved from Montreal to Boston, starting a new position as Postdoctoral Associate at MIT with Prof. Jinhua Zhao. February 13: I changed my homepage photo as this one, which was took at Casa Loma, Toronto, Canada. February 12: Our papers have received 1,000 citations on Google Scholar. Many thanks to the research community! January 11: I gave a presentation with my supervisor Prof. Nicolas Saunier about \"Open-source project: Machine learning for transportation data imputation and prediction\" (check out the slides) at the Reproducible Research Workshop of the 103rd Transportation Research Board (TRB) Annual Meeting in Washington D.C., USA. 2023 December 28: I gave a virtual talk about \"Matrix and tensor methods for spatiotemporal traffic data imputation and forecasting\" (check out the slides) at Southern University of Science and Technology (SUSTech) Forum with the Department of Statistics and Data Science. December 13: We write a blog post for understanding and reproducing our paper \"Discovering dynamic patterns from spatiotemporal data with time-varying low-rank autoregression.\" The content includes an intuitive explanation of time-varying autoregression, spatiotemporal data processing, and the algorithm im",
  "content_length": 23501,
  "method": "requests",
  "crawl_time": "2025-12-01 14:49:00"
}