{
  "name": "Xinyuan Wang 0005",
  "homepage": "http://cs.gmu.edu/~xwangc",
  "status": "success",
  "content": "Xinyuan Wang's Home Page Home | Research| Publications| Grants| Teaching |Students | Awards| Curriculum Vitae | GRA Openings Dr. Xinyuan (Frank) Wang Associate Professor Department of Computer Science Volgenau School of Engineering George Mason University 4400 University Drive, MS 4A5 Fairfax, Virginia 22030 Office: Room 5331 Engineering Building Office Hours: Monday 4:30 - 6:00PM Email: xwangc at gmu dot edu Voice: 703-993-9461 Fax: 703-993-1710 Research Interests My research interests are around computer network and system security, including malware analysis and defense, cyberattack detection and attribution, privacy and anonymity, VoIP security, steganography, digital forensics. Selected Publications Fabian Martin Ramos, Xinyuan Wang. Detecting Stealthy Cobalt Strike C&C Activities via Multi-Flow based Machine Learning. In Proceedings of the 22nd International Conference on Machine Learning and Application (ICMLA 2023), December 2023. Fabian Martin Ramos, Xinyuan Wang. A Machine Learning Based Approach to Detect Stealthy Cobalt Strike C&C Activities from Encrypted Network Traffic. In Proceedings of the 5th International Conference on Machine Learning for Networking (MLN 2022), November 2022. Xinyuan Wang. Practical Protection of Binary Applications via Transparent Immunization. In Proceedings of the 18th Annual International Conference on Privacy, Security and Trust (PST2021), December 2021. Xinyuan Wang. On the Feasibility of Detecting Software Supply Chain Attacks . In Proceedings of the 2021 MILCOM, November 2021. Xinyuan Wang. CloudImmu: Transparent Protection of Binary Applications in the Cloud. In Proceedings of the 2021 MILCOM, November 2021. Xinyuan Wang. On the Feasibility of Real-Time Cyber Attack Attribution on the Internet. In Proceedings of the 2016 MILCOM, November 2016. Xinyuan Wang and Douglas S. Reeves. Traceback and Anonymity. Monograph. SpringerBriefs in Computer Science. Springer-Verlag, Novembe 2015. Ryan Farley, Xinyuan Wang. CodeXt:Automatic Extraction of Obfuscated Attack Code from Memory Dump. In Proceedings of the 17th Information Security Conference (ISC 2014), October 2014. Ryan Farley, Xinyuan Wang. Exploiting VoIP Softphone Vulnerabilities to Disable Host Computers Threat and Mitigation. In International Journal of Critical Infrastructure Protection (IJCIP), August 2014. Xin Li, Xinyuan Wang, and Wentao Chang. CipherXRay: Exposing Cryptographic Operations and Transient Secrets from Monitored Binary Execution. In IEEE Transactions on Dependable and Secure Computing (TDSC), 11(2): 101-114, March 2014. Songqing Chen, Lei Liu, Xinyuan Wang, Xinwen Zhang and Zhao Zhang. A Host-based Approach for Unknown Fast Spreading Worm Detection and Containment. In ACM Transactions on Autonomous and Adaptive Systems Special Issue on Adaptive Security Systems, 8(4) , January 2014. Ryan Farley and Xinyuan Wang. Disabling a Computer by Exploiting Softphone Vulnerabilities: Threat and Mitigation. In Proceedings of the 9th International Conference on Security and Privacy in Communication Networks (SecureComm 2013), September 2013. Best Paper Award Young June Pyun, Young Hee Park, Douglas S. Reeves, Xinyuan Wang and Peng Ning. Interval-based Flow Watermarking for Tracing Interactive Traffic. In Computer Networks Journal, 56(5):1646-1665, March 2012. Xinyuan Wang, and Douglas S. Reeves. Robust Correlation of Encrypted Attack Traffic through Stepping Stones by Flow Watermarking. In IEEE Transactions on Dependable and Secure Computing (TDSC), 8(3):434-449, May 2011. Xinyuan Wang, and Ruishan Zhang. VoIP Security: Vulnerabilities, Exploits and Defenses. In Elsevier’s book series Advances in Computers, 81:1-49, March 2011. Xinyuan Wang, and Xuxian Jiang. Artificial Malware Immunization based on Dynamically Assigned Sense of Self. In Proceedings of the 13th Information Security Conference (ISC 2010), October 2010. Ruishan Zhang, Xinyuan Wang, Xiaohui Yang, and Xuxian Jiang. On the Billing Vulnerabilities of SIP-based VoIP Systems. In Computer Networks Journal, 54(11):1837-1847, August 2010. Ryan Farley, and Xinyuan Wang. Roving Bugnet: Distributed Surveillance Threat and Mitigation. In Computers & Security Journal, 29(5):592-602, July 2010. Xuxian Jiang, Xinyuan Wang, and Dongyan Xu. Stealthy Malware Detection and Monitoring through VMM-based “Out of the Box” Semantic View Reconstruction. In ACM Transactions on Information and System Security (TISSEC), 13(2), Februrary 2010. Zhi Wang, Xuxian Jiang, Weidong Cui, Xinyuan Wang and Mike Grace. Reformat: Automatic Reverse Engineering of Encrypted Messages. In Proceedings of the 14th European Symposium on Research in Computer Security (ESORICS 2009), September 2009. Jing Jin and Xinyuan Wang. On the Effectiveness of Low-Latency Anonymous Network in the Presence of Timing Attack. In Proceedings of the 39th Annual IEEE/IFIP International Conference on Dependable Systems and Networks (DSN 2009), July 2009. Ruishan Zhang, Xinyuan Wang, Ryan Farley, Xiaohui Yang, and Xuxian Jiang. On the Feasibility of Launching the Man-In-The-Middle Attacks on VoIP from Remote Attackers. In Proceedings of the 2009 ACM Symposium on Information, Computer & Communication Security (ASIACCS 2009), March 2009. Xinyuan Wang, Ruishan Zhang, Xiaohui Yang, Xuxian Jiang, and Duminda Wijesekera. Voice Pharming Attack and the Trust of VoIP. To appear in Proceedings of the 4th International Conference on Security and Privacy in Communication Networks (SecureComm 2008), September 2008. Daniel Ramsbrock, Xinyuan Wang, and Xuxian Jiang. A First Step Towards Live Botmaster Traceback. In Proceedings of the 11th International Symposium on Recent Advances in Intrusion Detection (RAID 2008), September 2008. Zhi Wang, Xuxian Jiang, Weidong Cui, and Xinyuan Wang. Countering Persistent Kernel Rootkits Through Systematic Hook Discovery. In Proceedings of the 11th International Symposium on Recent Advances in Intrusion Detection (RAID 2008), September 2008. Xuxian Jiang, Xinyuan Wang, and Dongyan Xu. Stealthy Malware Detection Through VMM-Based 'Out-of-the-Box' Semantic View Reconstruction. In Proceedings of the 14th ACM Conference on Computer and Communications Security (CCS 2007), November 2007. Xuxian Jiang, Xinyuan Wang. 'Out-of-the-box' Monitoring of VM-based High-Interaction Honeypots. In Proceedings of the 10th International Symposium on Recent Advances in Intrusion Detection (RAID 2007), September 2007. Ruishan Zhang, Xinyuan Wang, Xiaohui Yang, and Xuxian Jiang. Billing Attacks on SIP-Based VoIP Systems. In Proceedings of the the 1st USENIX Workshop on Offensive Technologies (WOOT 2007), August 2007. Xinyuan Wang, Shiping Chen and Sushil Jajodia. Network Flow Watermarking Attack on Low-Latency Anonymous Communication Systems. In Proceedings of the 2007 IEEE Symposium on Security & Privacy (S&P 2007), May 2007. Young June Pyun, Young Hee Park, Xinyuan Wang, Douglas S. Reeves and Peng Ning. Tracing Traffic through Intermediate Hosts that Repacketize Flows. In Proceedings of the 26th Annual IEEE Conference on Computer Communications (Infocom 2007). May 2007. Songqing Chen, Xinyuan Wang, Lei Liu, Xinwen Zhang and Zhao Zhang. WormTerminator: An Effective Containment of Unknown and Polymorphic Fast Spreading Worms. In Proceedings of the 2nd ACM/IEEE Symposium on Architectures for Networking and Communications Systems (ANCS 2006). December 2006 Xinyuan Wang. The Loop Fallacy and Deterministic Serialization in Tracing Intrusion Connections through Stepping Stones. In International Journal of Security and Networks, 1(3/4) , 2006 Shiping Chen, Xinyuan Wang and Sushil Jajodia. On the Anonymity and Traceability of Peer-to-Peer VoIP Calls. In IEEE Network Special Issue on Securing Voice over IP, 20(5):32-37, September 2006. Songqing Chen, Shiping Chen, Xinyuan Wang and Sushil Jajodia. Data-Transparent Authentication Without Communication Overhead. In Proceedings of the 2nd International Conference on Security and Privacy in Communication Networks (SecureComm 2006), August 2006. Xinyuan Wang, Shiping Chen and Sushil Jajodia. Tracking Anonymous Peer-to-Peer VoIP Calls on the Internet. In Proceedings of the 12th ACM Conference on Computer Communications Security (CCS 2005), November 2005. Xinyuan. Wang, Douglas S. Reeves. Robust Correlation of Encrypted Attack Traffic through Stepping Stones by Manipulation of Interpacket Delays, In Proceedings of the 10th ACM Conference on Computer and Communications Security (CCS 2003), October, 2003. Teaching INFS 766/ISA 666 Internet Security Protocols: F2004, S2005 ISA 774/ISA674 Intrusion Detection : F2005, F2006, S2007, F2007, F2008, F2010, F2011, F2013, F2014, F2016 ISA 656 Network Security: S2009, S2010, F2012, S2014, S2015, F2015 ISA 764 Security Experimentation: F2009, S2011, F2012 ISA 564 Security Laboratory: S2010, F2014, S2015 ISA 673 Operating Systems Security: S2011, S2014, S2016 MSEC 620 Networking Security: S2012 CS 471 Operating Systems: S2013, F2015, F2016 CS 468 Secure Programming and Systems: S2016 Spring 2017: ISA 656 Network Security Selected Profesional Activities Journal Editorial Board Associate Editor, IEEE Transactions on Dependable and Secure Computing (TDSC). 2010 - present Conference/Workshop Technical Program Committee TPC, The 28th International Conference on Distributed Computing Systems (ICDCS 2008) TPC, The 4th International Conference on Security and Privacy in Communication Networks (SecureComm 2008) TPC, 2009 IEEE Symposium on Computational Intelligence in Cyber Security (CICS 2009) TPC, 2009 International Workshop on Ubiquitous Computing Security (UC-Sec 2009) TPC, The 3rd International Conference on Network and System Security (NSS 2009) TPC, 2009 International Conference on Security and Cryptography (SECRYPT 2009) TPC, The 28th IEEE Symposium on Reliable Distributed Systems (SRDS 2009) TPC, 2009 IEEE International Conference on Information Privacy, Security, Risk and Trust (PASSAT 2009) TPC, IEEE Globecom 2010 - Communication & Information",
  "content_length": 13668,
  "method": "requests",
  "crawl_time": "2025-12-01 14:49:03"
}