{
  "name": "Xinyu Zhang 0002",
  "homepage": "https://faculty.ecnu.edu.cn/_s43/zxy2/main.psp",
  "status": "success",
  "content": "软件工程学院 Group 3 Created with Sketch. 教师个人主页 English 返回首页 欢迎登录 张新宇 教授教授/博士生导师/系主任 软件工程学院 导航 个人资料 研究方向 招生与培养 开授课程 科研项目 学术成果 荣誉及奖励 个人资料 部门： 软件工程学院/智能机器人实验室 毕业院校： 浙江大学 学位： 博士 学历： 博士 邮编： 200062 联系电话： 传真： 021-62235706 电子邮箱： xyzhang@sei.ecnu.edu.cn 办公地址： 数学馆东219室/西211 通讯地址： 上海 中山北路3663号 教育经历 浙江大学博士（2001-2004）浙江大学硕士（1997-2000）浙江大学本科（1993-1997） 工作经历 华为顾问科学家（2021-现在）华东师范大学 智能机器人运动与视觉实验室/VR创新实验室（2014-现在）华东师范大学软件工程学院嵌入式软件与智能系统系系主任（2022-现在）教育部软硬件协同设计研究与应用工程中心副主任（2019-现在）美国北卡大学（UNC-Chapel Hill）计算机系研究科学家（2012-2013）韩国梨花女子大学/韩国图形学与虚拟现实研究中心博士后/讲师/研究教授（2005-2012）新加坡南洋理工大学访问交流（2006-2007）新加坡国立大学访问交流（2003） 个人简介 2013年回国后在华东师范大学创建“智能机器人运动与视觉实验室”，“虚拟现实VR/AR创新中心”，研究方向为机器人运动规划、计算机视觉、虚拟现实、基于物理的计算机模拟等，2015年发起举办全国机器人操作系统（ROS）及其应用暑期学校，与国内外同行共同推进机器人操作系统ROS在中国的普及与产业应用，至今已经10届，共有近5百所高校，上万名本科生、硕士、博士生参加。2024年与OSRF联合举办ROSCon China（ROS开发者大会），担任大会主席。负责国家自然科学基金项目《面向虚拟着装和试衣仿真的碰撞检测与碰撞响应算法研究》，国家自然科学基金委-香港研究资助局联合基金项目《面向个性化服装制造的三维设计与灵巧机器人缝纫技术研究》，教育部留学回国人员科研启动基金项目《智能虚拟人的实时碰撞检测与碰撞响应》。指导毕业研究生/博士生：符国和（2013级）：深圳悟时创新创始人（自主移动机器人ARM/具身智能）田 浩（2014级，博士生）：贵州师范大学（灵巧手抓取）刘 要（2014级）：大疆创新DJI（无人机）周响南（2014级）：上海亮风台（AR头显）张曼妮（2014级）：上海思科（机器人安全的形式化验证）刘法亮（2014级）：上海虚拟现实协会秘书长（上海）郭 娟（2015级）：腾讯上海（人工智能）陈 宇（2015级）：狗尾草、流利说（自然语言理解）任 花（2015级）：华为上海（计算机视觉）裴麒凯（2015级）：Bilibili（视频处理）黄 楠（2015级）：上海游戏公司李宇鹏（2015级）：上海机器人公司（激光雷达定位）孙 斌（2016级）：如本科技（工业机器人创业公司）蒋振斌（2016级）：杭州大华（计算机视觉）胡 军（2016级）：杭州银行赵 耀（2017级）：华为海思（杭州）麻贵龙（2017级）：百度（上海）汤景韬（2018级）：加拿大多伦多大学博士生孙 淳（2018级）：华为（上海）肖建业（2018级）：上海互联网公司代锦（2018级）：百度（上海）汪天阳（2018级）：北京机器人教育公司（语音识别）吴 强（2018级）：上海VR/AR集成系统公司（视觉）侍晓如（2018级）：互联网公司（上海）王文卓（2018级）：上海移动机器人AGV创业公司创始人（上海）桂秀秀（2019级）：Intel上海(深度图估计)周妙英（2019级）：杭州华为（机器人碰撞规避）卓海鹏（2019级）：上海理想汽车（云机器人）车 瑞（2019级）：上海游戏公司（图形学/高效渲染）王金龙（2019级）：上海机器人公司（大语言模型与机器人控制）孙垚杰（2019级）：上海游戏公司（人工智能AIGC）魏明泽（2020级）：上海研究所(灵巧手抓取)谢名丞（2020级）：上海携程(四足机器人)巩 科（2020级）：上海华为(移动机器人运动规划)黄小龙（2020级）：苏州机器人公司（割草机控制）王群元（2020级）：杭州医疗设备公司（医疗图像检测Transformer）徐振宇（2021级，硕博士连读）：在读田壮壮（2021级）：南京某银行（四足机器狗运动控制）毛宇哲（2021级）：上海华为（复杂地形四足机器人运动规划）葛 旭（2021级）：上海禾赛科技（激光雷达/多传感器SLAM融合算法）卢偲帆（2021级）：上海某机器人公司（机器人导航）钱 康（2021级）：杭州吉利汽车（元宇宙渲染）喻凯罗（2022级，博士生）：在读刘喜峻（2022级）：上海某游戏公司（物理引擎）周焕博（2022级）：广州某游戏公司（物理引擎）张 杨（2022级）：上海华为（图神经网络加速柔性物体仿真）何俊杰（2022级）：在读程一鸣（2022级）：在读康燕（2022级）：在读吴鑫海（2023级，硕博士连读）：在读王瑛辉（2023级）：在读庞亚鹏（2023级）：在读徐俊杰（2023级）：在读吴俊杰（2023级）：在读薛闯（2023级）：在读吴圆梦（2023级）：在读南昊天（2023级）：在读史研研（2023级）：在读赵涛（2023级）：在读王帆（2024级）：在读倪略柯（2024级）：在读王田田（2024级）：在读冯栋栋（2024级，博士生）：在读唐慧（2024级，博士生）：在读张伊（2024级）：在读邓振宇（2024级）：在读李亮（2024级）：在读 社会兼职 国际会议委员会委员 4th Smart Robotics Workshop, Shanghai（Co-Chair, 2018） 3rd Asia-Europe Symposium on Simulation & Serious, Zhuhai（Co-Chair, 2016） ACM SIGGRAPH ASIA Technical Sketches and Posters, HongKong （2011） GPU Computing and Applications, Singapore （2013,2014,2015） NVIDIA GPU Poster Contest, Singapore (2014,2015) ACM International Conference on Virtual Reality Continuum and Its Applications in Industry（2014,2015,2016,2017,2018） 国内会议委员会委员 中国虚拟现实大会 （2016,2017,2018） 国际期刊审稿人 ACM Transactions on Graphics IEEE Transactions on Visualization and Computer Graphics Computer Graphics Forum The Visual Computer Computers & Graphics IEEE Transactions on Robotics Robotics and Computer-Integrated Manufacturing IEEE Transactions on Haptics ETRI Journal International Journal of Robotics and Computer-Integrated Manufacturing 国际会议审稿人 ACM SIGGRAPH 2012,2013 ACM SIGGRAPH ASIA 2011，2014 Eurographics 2012 IEEE Virtual Reality 2011 Solid Modeling and Physics 2009,2010 Pacific Graphics 2009,2010 IEEE International Conference on Robotics & Automation(ICRA), 2012, 2015 IEEE/ASME International Conference on Advanced Intelligent Mechatronics (AIM), 2015 Computer Graphics, Visualization and Computer Vision in Central Europe 2012 European Workshop on Computational Geometry 2011 研究方向 智能机器人运动控制，计算机视觉，虚拟现实从2014年起招硕士研究生、博士研究生、全职博士后更多信息参见实验室网站：http://www.robotics.sei.ecnu.edu.cn/机器人操作系统（ROS）教育基金会 http://www.roseducation.org.cn/【机器人操作系统ROS开发者大会 ROSCon China（2024年12.7-8）】http://www.roscon.cn/2024/【2025机器人操作系统ROS暑期学校（2025年7.26-8.1）】http://www.roseducation.org.cn/ros2025【2024机器人操作系统ROS暑期学校（2024年7.29-8.3）】http://www.roseducation.org.cn/ros2024【2023机器人操作系统ROS暑期学校（2023年7.29-8.5）】http://www.roseducation.org.cn/ros2023【2022机器人操作系统ROS暑期学校（2022年8月10-16）】http://www.roseducation.org.cn/ros2022【2021机器人操作系统ROS暑期学校（2021年8月7-13）】http://www.roseducation.org.cn/ros2021【2020机器人操作系统ROS暑期学校（2020年8月24-29）】http://www.roseducation.org.cn/ros2020【2019机器人操作系统ROS暑期学校（2019年7.27-8.3）】http://www.roseducation.org.cn/ros2019【2018机器人操作系统ROS暑期学校（2018年7月21-28）】http://www.roseducation.org.cn/ros2018【2017机器人操作系统ROS暑期学校（2017年7月22-29）】http://www.roseducation.org.cn/ros2017【2016机器人操作系统ROS暑期学校（2016年7月22-28）】http://www.roseducation.org.cn/ros2016【2015机器人操作系统ROS暑期学校（2015年7月23-26）】http://www.roseducation.org.cn/ros2015中央电视台10套《创新进行时》主题节目报道实验室科研历程【创新进行时-“沙漠卫士”（一）】CCTV-10链接（2022年11月21日）【创新进行时-“沙漠卫士”（二）】CCTV-10链接（2022年11月22日）主持研究项目面向个性化服装制造的三维设计与灵巧机器人缝纫技术研究（国家自然科学基金委-香港研究资助局联合2017-2020）面向虚拟着装和试衣仿真的碰撞检测与碰撞响应算法研究（国家自然科学基金2016-2019）智能虚拟人的实时碰撞检测与碰撞响应（教育部留学回国人员科研启动基金2015-2016）面向3D打印的三维模型快速重构技术研究（上海市自然科学基金2014-2017）低成本智能眼镜OpenGlass与增强现实应用（浙江大学CAD/CG国家重点实验室开放课题2015-2016） 招生与培养 开授课程 机器人系统设计（拔尖班课程，2025春）机器人技术/研究生课程(2016春，2017春，2018春,2019春，2020春，2021春，2022春，2023春，2024春，2025春)机器人学导论(2017春,2018春，2019春，2020春，2021春，2022春，2023春，2024春)机器人开发实践(2021春，2022春，2023春，2024春，2025春)人机交互技术(2018春,2019春，2020春，2023春)开发实践[机器人方向](2018春,2019春)机器人运动学与动力学(2017秋)机器人操作系统（ROS）(2015夏-2023夏)多媒体检索技术(2015秋)虚拟现实(2015秋，2016秋)用户界面设计(2014春, 2015春, 2016春)计算机网络(2014秋)计算机视觉(2013秋)计算机游戏引擎(2013暑期)机器人技术（2021华为机器人团队内部课程）机器人灵巧操作与碰撞检测（2022美的AI研究院内部课程） 科研项目 [1] 开放通用高端智能控制器设计理论与方法（科技创新2030-“新一代人工智能”重大项目）[2] 中央厨房分餐机器人（校企合作项目）[3] 3D轻量化引擎（校企合作项目）[4] 机器人环境感知与导航(校企合作项目)[5] 敏捷四足机器人运动控制与视觉导航技术研究（华为合作项目）[6] 灵巧机器人的运动控制技术研究（美的AI合作项目）[7] 面向个性化服装制造的三维设计与灵巧机器人缝纫技术研究（国家自然科学基金委-香港研究资助局联合2017-2020）[8] 面向虚拟着装和试衣仿真的碰撞检测与碰撞响应算法研究（国家自然科学基金2016-2019）[9] 智能虚拟人的实时碰撞检测与碰撞响应（教育部留学回国人员科研启动基金2015-2016）[10] 面向3D打印的三维模型快速重构技术研究（上海市自然科学基金2014-2017）[11] 低成本智能眼镜OpenGlass与增强现实应用（浙江大学CAD/CG国家重点实验室开放课题2015-2016） 学术成果 出版物参见： https://github.com/TopHillRoboticsZhenyu Xu, Junjie Wu, Zhiyan Piao, Xiaoqi Sheng, Yu Xiao, Xinyu Zhang. AnyStyleDiffusion: Flexible Style Transfer with Consistent Content Adaptation Across Diffusion Models.  ACM International Conference on Multimedia, 2025 (CCF-A)Yang Zhang, Kailuo Yu, Xinyu Zhang. FastClothGNN: Optimizing Message Passing in Graph Neural Networks for Accelerating Real-time Cloth Simulation. Graphical Models, 2025 (CCF-B)Huanbo Zhou, Zhenyu Xu, Xijun Liu,  Xinyu ZHANG. A Robust and Generalized Gauss-Seidel Solver for Physically-Correct Simultaneous Collisions, ACM SIGGRAPH Symposium on Interactive 3D Graphics and Games (I3D), 2025, USA. (CCF-B)Hao Tian, Chaoyang Song, Changbo Wang, Xinyu ZHANG, Jia Pan. Sampling-based Object Retrieval Planning in Cluttered Scenes using Hierarchical Graphs, IEEE Transactions on Robotics, 2023, 39(1) . (CCF-B)Mingze Wei, Yaomin Huang, Zhiyuan Xu, Ning Liu, Zhengping Che, Xinyu Zhang(通讯作者）, Chaomin Shen, Feifei Feng, Chun Shan, and Jian Tang. CMG-Net: An End-to-End Contact-based Multi-Finger Dexterous Grasping Network,  IEEE International Conference on Robotics and Automation (ICRA), May 29-June 2 2023, London, UK. (CCF-B)Ku Gong, Zhiyuan Xu, Xinyu Zhang. Bounded-DWA: An Efficient Local Planner for Ackermann-driven Vehicles on Sandy Terrain. IEEE International Conference on Real-time Computing and Robotics (RCAR), 2023Xiuxiu Gui, Xinyu Zhang. An Efficient Dense Depth Map Estimation Algorithm Using Direct Stereo Matching For Ultra-wide-angle Images, Computer Graphics International 2022 (CCF-C)Dai Jin, Zhang Xinyu,  Automatic Image Caption Generation using Deep Learning and Multimodal Attention， Journal of Computer Animation and Virtual Worlds (Special Issue of CASA 2022, CCF-C).Zhou Miaoying, Zhang Xinyu(通讯作者）, Fast Collision Checking for Dual-Arm Collaborative Robots Working in Close Proximity,  IEEE International Conference on Robotics and Automation (ICRA), May 23-27 2022, Philadelphia (PA), USA.(CCF-B)Ning Tan, Wenka Zheng, Xinyu Zhang, Fenglei Ni. Adaptive Neural Networks for Image-Based Visual Servoing with Uncertain Parameters. International Joint Conference on Neural Networks (IJCNN), 2022 Ning Tan, Peng Yu, Xinyu Zhang, Tao Wang. Model-free motion control of continuum robots based on a zeroing neurodynamic approach, Neural Networks.  vol.133, January 2021, Pages 21-31.Ren Hua, Zhang Xinyu(通讯作者）, Efficient Facial Reconstruction and Real-time Expression for VR Interaction Using RGB-D Videos ,  In: Cai Y., van Joolingen W., Veermans K. (eds) Virtual and Augmented Reality, Simulation and Serious Games for Education, Gaming Media and Social Effects.  page 177-188, August 2021, Springer, Singapore.Sun Chun, Tang Jintao, Zhang Xinyu(通讯作者）, FT-MSTC*: An Efficient Fault Tolerance Algorithm for Multi-robot Coverage Path Planning ,  2021 IEEE International Conference on Real-time Computing and Robotics(RCAR), 15 July 2021, Xining, China.Tang Jintao, Sun Chun, Zhang Xinyu(通讯作者）, MSTC*:Multi-robot Coverage Path Planning under Physical Constraints ,  IEEE International Conference on Robotics and Automation (ICRA), 1 June 2021, Xi'an, China.(CCF-B)Tian Hao,Wang Changbo,Manocha Dinesh,Zhang Xinyu(通讯作者）, Realtime Hand-Object Interaction using Learned Grasp Space for Virtual Environments, IEEE Transactions on Visualization & Computer Graphics, 2019. (SCI影响因子6.49,CCF-A)Zhenbin Jiang, Juan Guo, Zhang Xinyu(通讯作者）, Fast Custom Apparel Design and Simulation for Future Demand-driven Manufacturing, International Journal of Clothing Science and Technology, 2019 (SCI，服装制造顶级期刊).Xiao Jianye, Tang Jingtao,Zhang Xinyu(通讯作者）, A Genralized Cubemap for Encoding 360 VR Videos using Polynomial Approximation, Pacific Graphics, Seoul, Korea, 14-17, Oct. 2019 (Computer Graphics Forum) (SCI影响因子2.046,CCF-B) Sun Bin, Zhang Xinyu(通讯作者）, A New Electrostatic Gripper for Flexible Handling of Fabrics in Automated Garment Manufacturing,  IEEE International Conference on Automation Science and Engineering (CASE), 22-26 August 2019, Vancouver, Canada.(自动化顶级会议)Sun Bin, Zhang Xinyu(通讯作者）,Efficient Pose Estimation using Random Forest",
  "content_length": 18346,
  "method": "requests",
  "crawl_time": "2025-12-01 14:49:02"
}