{
  "name": "Xipeng Shen",
  "homepage": "https://research.csc.ncsu.edu/picture/xshen5/index.htm",
  "status": "success",
  "content": "Dr. Xipeng (Gracen) Shen Dr. Xipeng (Gracen) Shen Professor, Computer Science University Faculty Scholars Director of High Performance Intelligent Computing Office: Engineering Building II, Room 3276 Tel. 919-513-7577 xshen5@ncsu.edu Prof. Shen is a full professor in Computer Science and the Director of High Performance Intelligent Computing at North Carolina State University (NCSU). He joined NCSU in August 2014 as a Chancellor’s Faculty Excellence Program cluster hire as a tenured associate professor. Before that, he was an Adina Allen Term Distinguished Associate Professor at the College of William and Mary. He received his Ph.D. from University of Rochester in 2006. He leads the PICTure research group. His Researchlies in the broad fields of Programming Systems and Machine Learning, with an emphasis on enabling extreme-scale data-intensive computing and intelligent computing through innovations in compilers,runtime systems, and Machine Learning algorithms. As a pioneer in manycore and GPU code compilation and optimizations, his research has influenced the development of modern heterogeneous programming systems and machine learning systems. His contributions to the field have been recognized through awards such as the DOE Early Career Award, NSF CAREER Award, Google Faculty Research Award, and IBM CAS Faculty Fellow Award, alongside the NCSU University Faculty Scholars Award. His research has been sponsored by NSF, DOE, and NIH. He is an ACM Distinguished Member, ACM Distinguished Speaker, and a senior member of IEEE. In addition to his academic pursuits, Dr. Shen co-founded CoCoPIE Inc., a company dedicated to enhancing AI deployment. He has been a consultant or member of the advisory boards to several leading IT companies, including Intel, Microsoft, Huawei, Cisco, Meta. Current Research Areas (Publications) High-Performance Machine Learning & Real-Time AI Meets the relentless demands of Machine Learning and AI for efficiency, quality, and scalability in various settings through innovations in algorithms, infrastructures, and implementations. Heterogeneous Massively Parallel Computing Bridges the gap between productivity needs of programmers and the extreme power and complexity of modern heterogeneous massively parallel computing devices (e.g., GPU) through innovations in programming systems. Foundations of Programming Systems & Languages Tackles fundamental challenges that prevent modern software from tapping into the full potential of computing hardware by advancing compilers, runtime, and programming language implementations in general. Research Group: PICTure Ph.Ds with their placement upon graduation Hsin-Hsuan Sung (2024, Qualcomm) Jou-An Chen (2024, Qualcomm) Yuanchao Xu (2023, Assist. Prof @ UC Santa Cruz) Zifan Nan (2022, Huawei Research) Guoqiang Zhang (2022, Meta) Hui Guan (2020, Assist. Prof @ UMass Amherst) Lin Ning (2020, Google) Shuai Yang (2020, Meta) Yue Zhao (2018, Facebook) Yufei Ding (2017, Assist. Prof @ UC Santa Barbara) Guoyang Chen (2016, Qualcomm) Zhijia Zhao (2015, Assist. Prof @ UC Riverside) Mingzhou Zhou (2015, IBM) Bo Wu (2014, Assist. Prof @ Colorado School of Mines) Zheng (Eddy) Zhang (2012, Assist. Prof @ Rutgers University) Kai (Kelvin) Tian (2012, Microsoft) Yunlian Jiang (2011, Google) Teaching CSC766 - Code Optimization for Scalar and Parallel Programs (Spring 2024,Spring 2023,Spring 2020,Spring 2019,Spring 2018,Spring 2017, Spring 2016, Spring 2015) CSC412/512 - Compiler Construction (Fall 2025, Fall 2024, Fall 2023, Fall 2019, Fall 2018, Fall 2017, Fall 2016, Fall 2015) CSC591/791 - Real-time AI and Machine Learning Systems (Fall 2024, Fall 2022) CSC501 - Operating Systems Principles (Fall 2014) Recent Professional Activities Program Committees:IPDPS'25 (Programming Systems Track Chair), HPCA'25 (ERC), CGO'25, NeurIPS'25, SC'24, PLDI'24, ISCA'24 (ERC), ASPLOS'24, Micro'23, ASPLOS'23, HPCA'23, ISCA'23 (ERC), MLSys'23, SC'23, Micro'22 PLDI'22, ASPLOS'22, SC'22, ISCA'22 (ERC), AAAI'22, SC'21, ICS'21, Micro'21, AAAI'21, HPCA'21, PPOPP'21, CGO21 Micro'20, PPOPP'20 (PC Chair), ASPLOS'20 (ERC), CGO'20, ICPP'20 (PC Co-Chair), PACT'20, LCTES'20, Micro'19, ASPLOS'19, ISCA'19(ERC), SC'19, PPOPP'19, OOPSLA'19 (ERC), IPDPS'19, ISC'19, Micro'18, PLDI'18, PPOPP'18, SC'18, ECOOP'18, CC'18, IPDPS'18, WWW'18 (PhD Syposium), ISCA'18 (External), APLAS'18, AsHES'18, ASPLOS'17, PACT'17, SC'17, CCGrid'17, IPDPS'17, Cluster'17, WWW'17 (PhD Symposium), ASPLOS'16, PACT'16 (PC & SRC), ICS'16, ECOOP'16 (ERC), CCGrid'16, CC'16, ICPP'16 Organizing Committees: CC'23 (PC Chair), ASPLOS Steering Committe (2018-2021), PPOPP Steering Committee, PPOPP'20 (PC Chair), ICPP'20 (PC Co-Chair), SC'19 (Program. System Track Co-Chair), CGO'19 (Workshop Chair), ISC'19 (AI & Machine Learning Track Chair), ASPLOS'18 (General Co-Chair) IBM CDP Workshop'16 (Chair), ICPADS'16 (Program Co-Chair), ICPP'16 (Program Co-Chair of Programming Systems Track), LCPC'15 (Organizing Co-Chair), CCGrid'15 (Program Vice Co-Chair of Programming Models and Runtime Systems), PACT'15 (SRC committee), ASPLOS'15 (SRC Judge)",
  "content_length": 5094,
  "method": "requests",
  "crawl_time": "2025-12-01 14:49:04"
}