{
  "name": "Xiting Wang",
  "homepage": "https://gsai.ruc.edu.cn/english/wangxt",
  "status": "success",
  "content": "Xiting Wang Xiting Wang Tenure-track Associate Professor Xiting Wang obtained her Bachelor's degree and Ph.D. from Tsinghua University and was previously a principal researcher at Microsoft Research Asia. Her research interest is explainable and trustworthy AI. She has published around 50 papers on top conferences or journals. Two of her papers were selected as the spotlight article by IEEE TVCG (one spotlight each issue). The technologies developed by Xiting have been applied in multiple products like Microsoft Bing and Microsoft News. Xiting is an area chair of IJCAI and AAAI. She was the archive chair of IEEE VIS, joined the editorial board of Visual Informatics, and was awarded Best SPC by AAAI 2021. She was invited to give a keynote speech in the SIGIR Workshop on explainable recommendation on 2022 and 2020, and is an IEEE senior member. Enter Personal Website Education 2011-2017 Tsinghua University. PhD in Computer Science. 2007-2011 Tsinghua University. B.E. in Electronic Engineering. Work Experience 2024-Present Renmin University of China, Associate Professor. 2023-2024 Renmin University of China, Assistant Professor. 2022-2023 Microsoft Research Asia. Principal Researcher. 2018-2022 Microsoft Research Asia. Senior Researcher. 2017-2018 Microsoft Research Asia. Researcher. RESEARCH INTERESTS Explaining, aligning, and evaluating general-purpose AI, especially large language models Publications 2025Neural Recommendation Reasoning with Logic Rules Jing Yao, Xiting Wang, Jianxun Lian, Xiaoyuan Yi, Xing XieACM Transactions on Information Systems (TOIS) 2025Optimal Transport-Based Token Weighting Scheme for Enhanced Preference OptimizationMeng Li, Guangda Huzhang, Haibo Zhang, Xiting Wang, Anxiang ZengAnnual Meeting of the Association for Computational Linguistics (ACL Main Conference) 2025Internal Value Alignment in Large Language Models through Controlled Value Vector ActivationHaoran Jin, Meng Li, Xiting Wang, Zhihao Xu, Minlie Huang, Yantao Jia, Defu LianAnnual Meeting of the Association for Computational Linguistics (ACL Main Conference) 2025Entropy-based Exploration Conduction for Multi-step ReasoningJinghan Zhang, Xiting Wang, Fengran Mo, Yeyang Zhou, Wanfu Gao, Kunpeng LiuAnnual Meeting of the Association for Computational Linguistics (ACL Findings) 2025Select, Read, and Write: A Multi-Agent Framework of Full-Text-based Related Work GenerationXiaochuan Liu, Ruihua Song, Xiting Wang, Xu ChenAnnual Meeting of the Association for Computational Linguistics (ACL Findings 2025)Controlling Large Language Models Through Concept Activation VectorsHanyu Zhang, Xiting Wang, Chengao Li, Xiang Ao, Qing HeAAAI Conference on Artificial Intelligence (AAAI) 2025RATT: A Thought Structure for Coherent and Correct LLM ReasoningJinghan Zhang, Xiting Wang, Weijieying Ren, Lu Jiang, Dongjie Wang, Kunpeng LiuAAAI Conference on Artificial Intelligence (AAAI) 2025https://arxiv.org/abs/2406.027462024Uncovering Safety Risks of Large Language Models through Concept Activation VectorZhihao Xu, Ruixuan Huang, Changyu Chen, Xiting WangNeural Information Processing Systems (NeurIPS) 2024https://arxiv.org/pdf/2404.12038Evaluating Readability and Faithfulness of Concept-based ExplanationsMeng Li, Haoran Jin, Ruixuan Huang, Zhihao Xu, Defu Lian, Zijia Lin, Di Zhang, Xiting WangConference on Empirical Methods in Natural Language Processing (EMNLP Main Conference) 2024https://arxiv.org/pdf/2404.18533 BSharedRAG: Backbone Shared Retrieval-Augmented Generation for the E-commerce DomainKaisi Guan, Qian Cao, Yuchong Sun, Xiting Wang, Ruihua SongConference on Empirical Methods in Natural Language Processing (EMNLP Findings) 2024https://bsharedrag.github.io/index.html#:~:text=We%20propose%20a%20novel%20Backbone%20Shared See or Guess: Counterfactually Regularized Image CaptioningQian Cao, Xu Chen, Ruihua Song, Xiting Wang, Xinting Huang, Yuchen RenACM International Conference on Multimedia (ACM MM) 2024https://arxiv.org/pdf/2408.16809 Prototypical Reward Network for Data Efficient Model AlignmentJinghan Zhang, Xiting Wang, Yiqiao Jin, Changyu Chen, Xinhao Zhang, Kunpeng LiuAnnual Meeting of the Association for Computational Linguistics (ACL Main Conference, Oral) 2024https://aclanthology.org/2024.acl-long.748/Masked Thought: Simply Masking Partial Reasoning Steps Can Improve Mathematical Reasoning Learning of Language ModelsChangyu Chen, Xiting Wang, Ting-En Lin, Ang Lv, Yuchuan Wu, Xin Gao, Ji-Rong Wen, Rui Yan, Yongbin LiAnnual Meeting of the Association for Computational Linguistics (ACL Main Conference) 2024https://aclanthology.org/2024.acl-long.320/ Persuading across Diverse Domains: a Dataset and Persuasion Large Language ModelChuhao Jin, Kening Ren, Lingzhen Kong, Xiting Wang, Ruihua Song, Huan ChenAnnual Meeting of the Association for Computational Linguistics (ACL Main Conference) 2024https://aclanthology.org/2024.acl-long.92/ Distillation with Explanations from Large Language ModelsHanyu Zhang, Xiting Wang, Xiang Ao, Qing HeJoint International Conference on Computational Linguistics, Language Resources and Evaluation (COLING) 2024https://aclanthology.org/2024.lrec-main.449/2023A Causality Inspired Framework for Model InterpretationChenwang Wu, Xiting Wang, Defu Lian, Xing Xie, Enhong ChenACM SIGKDD International Conference on Knowledge Discovery and Data Mining (ACM SIGKDD) | August 2023Semi-Offline Reinforcement Learning for Optimized Text GenerationChangyu Chen, Xiting Wang, Yiqiao Jin, Victor Ye Dong, Li Dong, Jim Cao, Yi Liu, Rui YanInternational Conference on Machine Learning (ICML) | July 2023Towards Explainable Collaborative Filtering with Taste Clusters LearningYuntao Du, Jianxun Lian, Jing Yao, Xiting Wang, Mingqi Wu, Lu Chen, Yunjun Gao, Xing Xiethe Web Conference 2023 | April 2023Prototypical Fine-tuning: Towards Robust Performance Under Varying Data SizesYiqiao Jin, Xiting Wang, Yaru Hao, Yizhou Sun, Xing XieAAAI Conference on Artificial Intelligence (AAAI) | April 2023Put Your Voice on Stage: Personalized Headline Generation for News ArticlesXiang Ao, Ling Luo, Xiting Wang, Zhao Yang, Jiun-hung Chen, Ying Qiao, Qing He, Xing Xie.ACM Transactions on Knowledge Discovery from Data (TKDD) 2023 2022A Unified Understanding of Deep NLP Models for Text ClassificationZhen Li, Xiting Wang, Weikai Yang, Jing Wu, Zhengyan Zhang, Zhiyuan Liu, Maosong Sun, Hui Zhang, Shixia LiuIEEE Transactions on Visualization and Computer Graphics (IEEE TVCG) | December 2022, Vol 28(12)Self-explaining deep models with logic rule reasoningSeungeon Lee, Xiting Wang, Sungwon Han, Xiaoyuan Yi, Xing Xie, Meeyoung ChaNeural Information Processing Systems (NeurIPS) | November 2022Generating Multiple-Length Summaries via Reinforcement Learning for Unsupervised Sentence SummarizationDongmin Hyun, Xiting Wang, Chanyoung Park, Xing Xie, Hwanjo YuConference on Empirical Methods in Natural Language Processing (EMNLP Findings) | October 2022Reinforcement Subgraph Reasoning for Fake News DetectionRuichao Yang, Xiting Wang, Yiqiao Jin, Chaozhuo Li, Jianxun Lian, Xing XieACM SIGKDD International Conference on Knowledge Discovery and Data Mining (ACM SIGKDD) | June 2022Personalized Chit-Chat Generation for Recommendation Using External Chat CorporaChangyu Chen, Xiting Wang, Xiaoyuan Yi, Fangzhao Wu, Xing Xie, Rui YanACM SIGKDD International Conference on Knowledge Discovery and Data Mining (ACM SIGKDD) | May 2022 (Applied Data Science Track)Multi-level Recommendation Reasoning over Knowledge Graphs with Reinforcement LearningXiting Wang, Kunpeng Liu, Dongjie Wang, Le Wu, Yanjie Fu, Xing XieThe Web Conference 2022 | April 2022Clickbait Detection via Contrastive Variational Modelling of Text and LabelXiaoyuan Yi, Jiarui Zhang, Wenhao Li, Xiting Wang, Xing XieInternational Joint Conference on Artificial Intelligence (IJCAI) | March 2022Reinforcement Routing on Proximity Graph for Efficient RecommendationChao Feng, Defu Lian, Xiting Wang, Zheng Liu, Xing Xie, Enhong ChenACM Transactions on Information Systems (TOIS) | February 2022ProFairRec: Provider Fairness-aware News RecommendationTao Q, Fangzhao Wu, Chuhan Wu, Peijie Sun, Le Wu, Xiting Wang, Yongfeng Huang, Xing XieACM SIGIR Conference on Research and Development in Information Retrieval [SIGIR] | January 20222021Towards Fine-Grained Reasoning for Fake News DetectionYiqiao Jin, Xiting Wang, Ruichao Yang, Yizhou Sun, Wei Wang, Hao Liao, Xing XieAAAI 2022 | December 2021Learning Groupwise Explanations for Black-Box ModelsJingyue Gao, Xiting Wang, Yasha Wang, Yulan Yan, Xing XieInternational Joint Conference on Artificial Intelligence (IJCAI) | August 2021PENS: A Dataset and Generic Framework for Personalized News Headline GenerationXiang Ao, Xiting Wang, Ling Luo, Ying Qiao, Qing He, Xing XieThe Annual Meeting of the Association for Computational Linguistics (ACL) | August 2021Reinforcing Pretrained Models for Generating Attractive Text AdvertisementsXiting Wang, Xinwei Gu, Jie Cao, Zihua Zhao, Yulan Yan, Bhuvan Middha, Xing XieACM SIGKDD International Conference on Knowledge Discovery and Data Mining (ACM SIGKDD) | August 2021 (Applied Data Science Track)Reinforced Anchor Knowledge Graph Generation for News Recommendation ReasoningDanyang Liu, Jianxun Lian, Zheng Liu, Xiting Wang, Guangzhong Sun, Xing XieKDD 2021 | August 2021Fairness-aware News Recommendation with Decomposed Adversarial LearningChuhan Wu, Fangzhao Wu, Xiting Wang, Yongfeng Huang, Xing XieAAAI Conference on Artificial Intelligence (AAAI) | June 2021Learning Fair Representations for Recommendation: A Graph-based PerspectiveLe Wu, Lei Chen, Pengyang Shao, Richang Hong, Xiting Wang, Meng WangThe Web Conference | June 2021Interactive Graph Construction for Graph-Based Semi-Supervised LearningChangjian Chen, Zhaowei Wang, Jing Wu, Xiting Wang, Lan-Zhe Guo, Yu-Feng Li, Shixia LiuIEEE Transactions on Visualization and Computer Graphics (IEEE TVCG) | May 2021, Vol 1(1)Discovering Protagonist of Sentiment with Aspect Reconstructed Capsule NetworkChi Xu, Hao F",
  "content_length": 15603,
  "method": "requests",
  "crawl_time": "2025-12-01 14:49:03"
}