{
  "name": "Xu-Ming He 0001",
  "homepage": "https://xmhe.bitbucket.io",
  "status": "success",
  "content": "Xuming He Xuming He Home About Research Project Publication Student Teaching Course@SIST Reading Group Links PLUS@ShanghaiTech CECS@ANU Xuming He Associate Professor PLUS Lab School of Information Science and Technology (SIST) ShanghaiTech University Address Room 1A-221, SIST Building 393 Middle Huaxia Road Pudong, Shanghai, 201210, China Contact Phone: +86 21 20685378 Email: hexm at shanghaitech dot edu dot cn News [08/2023] One paper on interactive segmentation accepted in BMVC 2023. [08/2023] One paper on long-tailed NCD accepted in TMLR. [07/2023] One paper on 3D object detection accepted in ACM MM 2023. [07/2023] Two papers on relational reasoning/novel class discovery accepted in ICCV 2023. [06/2023] Congratulations to Qian He for successfully completing her Phd Degree. [06/2023] Congratulations to Chuanyang Hu for successfully completing Master's Degree. [04/2023] One paper accepted in IJCAI 2023. [03/2023] One paper accepted in CVPR 2023. [01/2023] Two papers accepted in ICLR 2023. Research Interest Weakly-supervised/Few-shot learning Continual learning/Knowledge discovery Semantic segmentation and Scene parsing Vision and language representations Interpretable machine learning and reasoning Prospective students Prospective graduate students: please check admission website. å­¦ç§æ¹å: è®¡ç®æºç§å­¦ä¸ææ¯. We also have multiple research projects (minimal 6 months) for undergrad students in SIST. Selected Recent Publications Yu Wu, Yana Wei, Haozhe Wang, Yongfei Liu, Sibei Yang, Xuming He. Grounded Image Text Matching with Mismatched Relation Reasoning, International Conference on Computer Vision (ICCV), 2023 Shan Ning*, Longtian Qiu*, Yongfei Liu, Xuming He. HOICLIP: Efficient Knowledge Transfer for HOI Detection with Visual Linguistic Model, IEEE Conference on Computer Vision and Pattern Recognition (CVPR), 2023 Zhitong Gao, Yucong Chen, Chuyu Zhang, Xuming He. Modeling Multimodal Aleatoric Uncertainty in Segmentation with Mixture of Stochastic Experts, International Conference on Learning Representation (ICLR), 2023 Shipeng Yan, Lanqing Hong, Hang Xu, Jianhua Han, Tinne Tuytelaars, Zhenguo Li, Xuming He. Generative Negative Text Replay for Continual Vision-Language Pretraining, European Conference of Computer Vision (ECCV), 2022 Jiangwei Xie, Shipeng Yan, Xuming He. General Incremental Learning with Domain-aware Categorical Representations, IEEE Conference on Computer Vision and Pattern Recognition (CVPR), 2022 Rongjie Li, Songyang Zhang, Xuming He. SGTR: End-to-end Scene Graph Generation with Transformer, IEEE Conference on Computer Vision and Pattern Recognition (CVPR), 2022 Shipeng Yan, Jiangwei Xie, Xuming He. DER: Dynamically Expandable Representation for Class Incremental Learning, IEEE Conference on Computer Vision and Pattern Recognition (CVPR), 2021 Yongfei Liu, Xiangyi Zhang, Songyang Zhang, Xuming He. Part-aware prototype Network for Few-shot Semantic Segmentation, European Conference of Computer Vision (ECCV), 2020 Haozhe Wang, Jiale Zhou, Xuming He. Learning Context-aware Task Reasoning for Efficient Meta-reinforcement Learning, International Conference on Autonomous Agents and Multiagent Systems (AAMAS), 2020 Bo Wan*, Desen Zhou*, Yongfei Liu, Rongjie Li, Xuming He. Pose-aware Multi-level Feature Network for Human Object Interaction Detection, International Conference on Computer Vision (ICCV), 2019 Songyang Zhang, Shipeng Yan, Xuming He. LatentGNN: Learning Efficient Non-local Relations for Visual Recognition, International Conference on Machine Learning (ICML),2019 Page generated 2023-08-27 21:09:18 CST, by jemdoc+MathJax.",
  "content_length": 3621,
  "method": "requests",
  "crawl_time": "2025-12-01 14:49:09"
}