{
  "name": "Xu Chen 0004",
  "homepage": "https://sites.google.com/view/xcsysu/home",
  "status": "success",
  "content": "HomeSearch this siteEmbedded FilesSkip to main contentSkip to navigationXu ChenFull Professor and Assistant Dean, School of Computer Science and Engineering, Sun Yat-sen University (SYSU), Guangzhou, ChinaDirector, Institute of Advanced Networking & Computing Systems (IANCS)Vice Director, National Engineering Research Laboratory of Digital HomesWebsite@SYSU：https://cse.sysu.edu.cn/teacher/ChenXu Google Scholar:  https://scholar.google.com/citations?user=BmiiIaoAAAAJ&hl=enEmail: chenxu35 -AT- mail.sysu.edu.cnShort BiographyDr. Xu Chen is currently a Full Professor and Assistant Dean at School of Computer Science and Engineering, Sun Yat-sen University, Guangzhou, China. He obtained the Ph.D. degree in Information Engineering from The Chinese University of Hong Kong, Hong Kong, China, in 2012. Before that, he received the B.Eng. degree in Electronic Engineering from South China University of Technology, Guangzhou, China, in 2008. From August 2012 to February 2014, Dr. Chen was a Postdoctoral Research Fellow with Arizona State University, USA. From April 2014 to Aug. 2016, he was a Humboldt Scholar Fellow with Institute of Computer Science of University of Goettingen, Germany.Dr. Chen has published over 300 scientific papers in leading international conferences and journals, many of which appear in top-tier conferences such as MOBICOM, MOBIHOC, and INFOCOM and top-tier journals such as IEEE TON, JSAC, and TMC. His research results have been highly visible, with multiple publications being selected as 1‰ ESI Hot Papers by Web of Science. For his high-quality research works, Dr. Chen received the prestigious Humboldt research fellowship awarded by Alexander von Humboldt Foundation, 2014 Hong Kong Young Scientist Runner-up Award, 2022 IEEE Communications Society Asia Pacific Outstanding Paper Award, 2022 IEEE Internet of Things Journal Best Paper Runner-Up Award, 2022 IEEE Computer Society Best Paper Awards Runner-up , 2017 IEEE Communication Society Asia-Pacific Outstanding Young Researcher Award, 2017 IEEE ComSoc Young Professional Best Paper Award, Best Paper Runner-up Award of 2014 IEEE International Conference on Computer Communications (INFOCOM), and Best Paper Award of 2017 IEEE International Conference on Communications (ICC). Dr. Chen is an IEEE ComSoc Distinguished Lecturer, and serves as an area editor for IEEE Open Journal of the Communications Society, and associate editors for IEEE Transactions on Mobile Computing, IEEE Transactions on Wireless Communications, IEEE Transactions on Vehicular Technology, IEEE Internet of Things Journal, and IEEE Journal on Selected Areas in Communications (JSAC) Series on Network Softwarization and Enablers. He also serves as TPC members for a series of top tier conferences including MOBIHOC and INFOCOM. Research InterestsEdge and Cloud Computing, Edge Intelligence, Edge Foundation AI Model, Federated LearningAI for Networking, Networking for AI,  AIoT, Game Theory, Dynamic OptimizationEditorshipAssociate Editor, IEEE Transactions on Mobile Computing (TMC), , 2024 – PresentAssociate Editor, IEEE Transactions on Vehicular Technology (TVT), 2021 – PresentArea Editor, IEEE Open Journal of the Communications Society (IEEE OJ-COM), 2019 – 2024Associate Editor, IEEE Transactions on Wireless Communications (TWC), 2019 – 2024Associate Editor, IEEE Internet of Things Journal (IoTJ), 2018 – 2024Editor, IEEE Journal on Selected Areas in Communications (JSAC), Series on Network Softwarization and Enablers, 2018 –2021Associate Editor, IEEE Access Journal, 2017 -- 2020Associate Editor, EURASIP Journal on Wireless Communications and Networking, 2014 -- 2017Section Editor, Springer Handbook of Cognitive Radio (Section Book on Cognitive Radio Resource Management), 2016 - 2018Editorial Board Member, Frontiers of Information Technology & Electronic Engineering, Since 2016 Selected AwardsHighly Cited Researcher awarded by Clarivate Analytics, 2024IEEE ComSoc Distinguished Lecturer, 2023Best Paper Award Finalist of IEEE/ACM International Symposium on Quality of Service (IWQoS), 2023Best Paper Award Nomination of IEEE Wireless Communications and Networking Conference (WCNC), 2023IEEE Communications Society Asia Pacific Outstanding Paper Award, 2022This award honors outstanding original papers authored by members in the Asia Pacific region and published in IEEE ComSoc journals and conferences over the last three yearsIEEE Internet of Things Journal Best Paper Runner-Up Award, 2022This award recognizes the best papers published in the IEEE IoT Journal during the previous three yearsIEEE Computer Society's Best Paper Awards Runner-up, 2022This award honors the best publications in  IEEE Computer Society Journals during the year of 2020 ELSEVIER Highly-Cited Researchers in China, 2022-2023Best Computer Science Scientists and Best Rising Stars of Science Recognized by Research.com, 2022IEEE OJ-COMS Editor Award, 2021World's Top 2% Scientists by Stanford University, in both Career-Long and Single Year Categories, 2020-2023IEEE Communication Society Asia-Pacific Outstanding Young Researcher Award, 2017IEEE ComSoc Young Professional Best Paper Award, 2017  Best Paper Award in IEEE International Conference on Communications (ICC), 20172014 Hong Kong Young Scientist Award Runner-Up in the Physical/Mathematical Science.Best Paper Runner-up Award in IEEE International Conference on Computer Communications (INFOCOM), 2014. Humboldt Research Fellowship (洪堡学者) awarded by Alexander von Humboldt-Foundation, Germany, 2014-2016 Honorable Mention Award (the first runner-up of the best paper award) in IEEE international conference on Intelligence and Security Informatics,2010Selected Publications ( Google Scholar : >20000 citations )[BOOK] Sen Lin, Zhi Zhou, Zhaofeng Zhang, Xu Chen, and Junshan Zhang, Edge Intelligence in the Making: Optimization, Deep Learning, and Applications, Morgan & Claypool Publishers, 2020.[BOOK] Yang Yang, Xu Chen, Yong Xiao, and Rui Tang, Intelligent IoT for the Digital World, Wiley, 2021.[BOOK] X. Wang, Y. Han, V. C. M. Leung, D. Niyato, X. Yan, and Xu Chen, Edge AI - Convergence of Edge Computing and Artificial Intelligence, Springer, 2020.[PIEEE] Zhi Zhou, Xu Chen*, En Li, Liekang Zeng, Ke Luo, and Junshan Zhang,“Edge Intelligence: Paving the Last Mile of Artificial Intelligence with Edge Computing,” Proceedings of the IEEE, May 2019. (>1500 citations)[COMST] Xiaofei Wang, Yiwen Han, Victor C.M. Leung, Dusit Niyato, Xueqiang Yan, and Xu Chen,“Convergence of Edge Computing and Deep Learning: A Comprehensive Survey,”  IEEE Communications Surveys and Tutorials, Jan. 2020. (>800 citations)[TON] X. Chen, L. Jiao, W. Li and X. Fu, “Efficient Multi-User Computation Offloading for Mobile-Edge Cloud Computing,” IEEE/ACM Transactions on Networking, Vol. 24, No. 5, pp. 2795 - 2808, Oct. 2016. (>2500 citations)[TON]  Zhicheng Luo, Qianyi Huang, Xu Chen, RuiWang, FanWu, Guihai Chen, and Qian Zhang, “Spectrum Sensing Everywhere: Wide-band Spectrum Sensing with Low-Cost UWB Nodes,” accepted by IEEE/ACMTransactions on Networking (ToN), Nov. 2023.[TON] Liekang Zeng, Haowei Chen, Daipeng Feng, Xiaoxi Zhang, and Xu Chen*, “A3D: Adaptive, Accurate, and Autonomous Navigation for Edge-Assisted Drones,” accepted by IEEE/ACM Transactions on Networking (ToN), July 2023.[TON] Liekang Zeng, Xu Chen*, Peng Huang, Ke Luo, Xiaoxi Zhang, Zhi Zhou, “Serving Graph Neural Networks with Distributed Fog Servers for Smart IoT Services,” accepted by IEEE/ACM Transactions on Networking, June 2023.[TON] Xuezheng Liu, Zirui Yan, Yipeng Zhou, Di Wu, Xu Chen, Hui Wang, “Optimizing Parameter Mixing under Constrained Communications in Parallel Federated Learning,” accepted by IEEE/ACM Transactions on Networking (ToN), March 2023.[TON] Guocheng Liao, Xu Chen, and Jianwei Huang, “Privacy Protection under Incomplete Social and Data Correlation Information,” accepted by IEEE/ACM Transactions on Networking (ToN), Jan. 2023.[TON] Xuezheng Liu, Zhicong Zhong, Yipeng Zhou, Di Wu, Xu Chen, Min Chen, and Quan Z. Sheng, “Accelerating Federated Learning via Parallel Servers: A Theoretically Guaranteed Approach,” accepted by IEEE/ACM Transactions on Networking (ToN), March 2022.[TON] QiongWu, Kaiwen He, Xu Chen*, Shuai Yu, and Junshan Zhang, “Deep Transfer Learning Across Cities for Mobile Traffic Prediction,” accepted by IEEE/ACM Transactions on Networking, Dec. 2021.[TON] Guocheng Liao, Xu Chen, and Jianwei Huang, “Privacy-Aware Online Social Networking with Targeted Advertisement,” accepted by IEEE/ACM Transactions on Networking (ToN), Dec. 2021.[TON] Qiong Wu, Xu Chen*, Zhi Zhou, Lian Chen, and Junshan Zhang, “Deep Reinforcement Learning with Spatio-temporal Traffic Forecasting for Data-Driven Base Station Sleep Control,” accepted by IEEE/ACM Transactions on Networking (ToN), Jan. 2021.[TON] Liekang Zeng, Xu Chen*, Lei Yang, Zhi Zhou, and Junshan Zhang, “CoEdge: Cooperative DNN Inference with AdaptiveWorkload Partitioning over Heterogeneous Edge Devices,”accepted by IEEE/ACM Transactions on Networking (ToN), Nov. 2020.[TON] Guocheng Liao, Xu Chen, and Jianwei Huang, “Social-Aware Privacy-Preserving Mechanism for Correlated Data,” accepted by IEEE/ACM Transactions on Networking, April 2020.[TON] Guocheng Liao, Xu Chen, and Jianwei Huang, “Prospect Theoretic Analysis of Privacy-Preserving Mechanism,” accepted by IEEE/ACMTransactions on Networking, Oct. 2019.[TON] X. Gong, X. Chen*, K. Xing, D. Shin, M. Zhang, and J. Zhang, “From Social Group Utility Maximization to Personalized Location Privacy in Mobile Networks,” accepted by IEEE/ACM Transactions on Networking, Dec. 2016.[TON] X. Chen, X. Gong, L. Yang and J. Zhang, “Exploiting Social Tie Structure for Cooperative Wireless Networking: A Social Group Utility Maximization Framework,” IEEE/ACM Transactions on Networking , Vol. 24, No. 6, Dec. 2016.[TON] X. Chen, X. Gong, L. Yang and J. Zhang, “Amazon in the White Space: Social Recommendation Aided Distributed Spectrum Access,” accepted by",
  "content_length": 33912,
  "method": "requests",
  "crawl_time": "2025-12-01 14:49:05"
}