{
  "name": "Xu Liu 0006",
  "homepage": "https://web.xidian.edu.cn/xuliu",
  "status": "success",
  "content": "刘旭 | 个人信息 | 西安电子科技大学个人主页 学术信息网 西电导航 关于 使用说明 搜索 系统首页 登录 控制面板 收藏 刘旭的留言板 刘旭的主页:个人信息科学研究论文成果荣誉奖励科研团队课程教学招生信息English 基本信息刘  旭 华山学者菁英副教授陕西省优秀博士学位论文入选者西安市青年人才托举计划入选者 联系方式工作单位：人工智能学院通信地址：西安市雁塔区太白南路2号科研邮箱：xuliu361@163.com办公邮箱：xuliu@xidian.edu.cn 个人简介刘旭，博士，博士后，西安电子科技大学副教授、华山学者菁英副教授，IEEE/CAAI/CCF/CIE/CAA Senior Member，“陕西省优秀博士学位论文”入选者；“西安市科协青年人才托举计划”入选者。人工智能学院、人工智能研究院、智能感知与图像理解教育部重点实验室成员。主持国家自然科学基金，中国博士后科学基金等多个国家级项目，及中国电科36所，商汤科技，华为，微众银行等公司关键技术项目。目前，主要从事人工智能核心算法，机器视觉，深度学习，多模态基础大模型，雷达卫星无人机图像与智能信号处理等方面的研究，相关工作发表在了TNNLS、TCYB、TGRS、TAI等领域内国际主流期刊上，并指导学生在CVPR、ICCV、ECCV、IGRASS、互联网+，等多项国内外大赛中获得冠军。 推免与考研招生情况： 焦李成院士团队刘旭副教授课题组主要致力于智能感知与图像理解、深度学习与类脑计算、进化优化与遥感解译等方向的研究。 欢迎积极上进、勤奋好学的同学联系我们。相关招生要求如下： 1，对学习和科学研究有较强的积极主动性； 2，具有扎实的数学基础和较强的编程能力； 3，学生本人有浓厚的研究兴趣和学术追求； 4，善于沟通，具有较强的抗干扰和抗压能力。 同时，也非常欢迎学有余力的本科生参与到课题组的科研与项目中来。 论文成果： 期刊论文(Google Scholar) Lu Xiaoqiang, Li Lingling, Jiao Licheng, Liu Xu, Liu Fang, Ma Wenping, Yang Shuyuan. Uncertainty-aware semi-supervised learning segmentation for remote sensing images[J]. IEEE Transactions on Multimedia, 2025. Zhou Huaji, Hao Xiaoyu, Liu Xu*, Sun Xinyu, Li Lingling, Liu Fang, Jiao Licheng. Diffusion SigFormer for Interference Time-series Signal Recognition[J]. IEEE Transactions on Instrumentation and Measurement, 2025. Gao Zihan, Li Lingling, Liu Xu, Jiao Licheng, Liu Fang, Yang Shuyuan. Uncertainty guided progressive few-shot learning perception for aerial view synthesis[J]. IEEE Transactions on Multimedia, 2024. Li Yang, Jiao Licheng, Liu Xu, Liu Fang, Li Lingling, Chen Puhua. LGSNet: Local-global semantics learning object detection[J]. IEEE Transactions on Multimedia, 2024. Jiao Licheng, Wang Yuhan, Liu Xu, Li Lingling, Liu Fang, Ma Wenping, Guo Yuwei, Chen Puhua, Yang Shuyuan, Hou Biao. Causal inference meets deep learning: A comprehensive survey[J]. Research, 2024, 7: 0467. Zhang Xiaowen, Jiao Licheng, Liu Xu, Li Lingling, Liu Fang, Ma Wenping, Yang Shuyuan. Globally-aware continuous-time redistribution learning for RS image change detection[J]. IEEE Transactions on Geoscience and Remote Sensing, 2024. Jiao Licheng, Zhao Jiaxuan, Wang Chao, Liu Xu, Liu Fang, Li Lingling, Shang Ronghua, Li Yangyang, Ma Wenping, Yang Shuyuan. Nature-inspired intelligent computing: A comprehensive survey[J]. Research, 2024, 7: 0442. Geng Xueli, Jiao Licheng, Liu Xu, Li Lingling, Chen Puhua, Liu Fang, Yang Shuyuan.‌ A Spatial--Spectral Relation-Guided Fusion Network for Multisource Optical RS Image Classification[J]. ‌IEEE Transactions on Neural Networks and Learning Systems‌, 2024. Wu Yinan, Jiao Licheng, Liu Xu, Liu Fang, Yang Shuyuan, Li Lingling.‌ Domain adaptation-aware transformer for hyperspectral object tracking[J]. ‌IEEE Transactions on Circuits and Systems for Video Technology‌, 2024. Yang Yuting, Jiao Licheng, Liu Xu, Liu Fang, Yang Shuyuan, Li Lingling, Chen Puhua, Li Xiufang, Huang Zhongjian. Efficient wavelet pooling with progressive learning for image classification[J]. IEEE Transactions on Circuits and Systems for Video Technology, 2024. Zuo Yi, Li Lingling, Liu Xu, Gao Zihan, Jiao Licheng, Liu Fang, Yang Shuyuan. Robust instance-based semi-supervised learning change detection for remote sensing images[J]. IEEE Transactions on Geoscience and Remote Sensing, 2024. Jiao Licheng, Zhang Xin, Liu Xu, Liu Fang, Yang Shuyuan, Ma Wenping, Li Lingling, Chen Puhua, Feng Zhixi, Guo Yuwei. Transformer Meets Remote Sensing Video Detection and Tracking: A Comprehensive Survey[J]. IEEE Journal of Selected Topics in Applied Earth Observations and Remote Sensing, 2023. Jiao Licheng, Huang Zhongjian, Liu Xu, Yang Yuting, Ma Mengru, Zhao Jiaxuan, You Chao, Hou Biao, Yang Shuyuan, Liu Fang. Brain-inspired Remote Sensing Interpretation: A Comprehensive Survey[J]. IEEE Journal of Selected Topics in Applied Earth Observations and Remote Sensing, 2023. Jiao, Licheng and Huang, Zhongjian and Lu, Xiaoqiang and Liu, Xu and Yang, Yuting and Zhao, Jiaxuan and Zhang, Jinyue and Hou, Biao and Yang, Shuyuan and Liu, Fang. Brain-inspired Remote Sensing Foundation Models and Open Problems: A Comprehensive Survey, IEEE Journal of Selected Topics in Applied Earth Observations and Remote Sensing, 2023. Gao Jie, Jiao Licheng, Liu Xu, Li Lingling, Chen Puhua, Liu Fang, Yang Shuyuan. Multiscale Dynamic Curvelet Scattering Network[J]. IEEE Transactions on Neural Networks and Learning Systems, 2022. Liu Mengkun, Jiao Licheng, Liu Xu, Li Lingling, Liu Fang, Zhang Xiangrong, et al. Bio-Inspired Multi-scale Contourlet Attention Networks[J]. IEEE Transactions on Multimedia, 2023. Jie Chen, Licheng Jiao, Xu Liu, Lingling Li, Fang Liu, Puhua Chen, Shuyuan Yang, Biao Hou. Hierarchical Dynamic Graph Clustering Network[J]. IEEE Transactions on Knowledge and Data Engineering, 2023. Yang Yuting, Jiao Licheng, Liu Xu, Liu Fang, Yang Shuyuan, Li Lingling, Chen Puhua, Li Xiufang, Huang Zhongjian. Dual wavelet attention networks for image classification[J]. IEEE Transactions on Circuits and Systems for Video Technology, 2022, 33(4): 1899-1910. Xu Liu, Yu Liu, Licheng Jiao, Lingling Li, Fang Liu, Shuyuan Yang, Biao Hou, MutSimNet: Mutually Reinforcing Similarity Learning for RS Image Change Detection[J], IEEE Transactions on Geoscience and Remote Sensing, vol. 62, pp. 1-13, 2024. Liu Xu, Jiao Licheng, Li Lingling, Cheng Lin, Liu Fang, Yang Shuyuan, Hou Biao, Deep Multiview Union Learning Network for Multi-Source Image Classification[J]. IEEE Transactions on Cybernetics, 2022, 52(6),4534-4546.(ESI高被引论文) Liu, Xu; Li, Lingling; Liu, Fang; Hou, Biao; Yang, Shuyuan; Jiao, Licheng. GAFnet: Group Attention Fusion Network for PAN and MS Image High-Resolution Classification, IEEE Transactions on Cybernetics, 2022, 52(10),10556-10569.(ESI热点、高被引论文) 刘旭, 李玲玲, 刘芳, 杨淑媛, 侯彪, 焦李成, 基于散射图卷积网络的PolSAR影像地物分类. 中国科学: 信息科学,  2022, 52(10): 1900-1914. https://doi.org/10.1360/SSI-2021-0126. Liu Xu, Li Lingling, Liu Fang, Jiao Licheng. Scattering graph convolutional network-based PolSAR image classification (in Chinese). Sci Sin Inform, 2022, 52: 1900–1914,doi: 10.1360/SSI-2021-0126. Liu, Xu, Jiao, Licheng; Li, Lingling; Tang Xu; Guo Yuwei. Deep Multi-Level Fusion Network for Multi-Source Image Pixel-Wise Classification, Knowledge-Based Systems, 2021, 221: 106921. Liu Xu, Jiao Licheng, Tang Xu, Sun Qigong, Zhang Dan, Polarimetric Convolutional Network for PolSAR Image Classification[J]. IEEE Transactions on Geoscience and Remote Sensing, 2019. 57(5):3040-3054. Liu Xu, Jiao Licheng, Zhao Jiaqi, Zhao Jin, Zhang Dan, Liu Fang, Yang Shuyuan and Tang Xu. Deep Multiple Instance Learning-Based Spatial-Spectral Classification for PAN and MS Imagery[J]. IEEE Transactions on Geoscience and Remote Sensing, 2018, 56(1):461-473. Mengkun Liu, Licheng Jiao, Xu Liu, Lingling Li, Fang Liu, Shuyuan Yang. C-CNN: Contourlet Convolutional Neural Networks. IEEE Transactions on Neural Networks and Learning Systems, 2020, 32(6): 2636-2649. Jiao Licheng, Gao Jie, Liu Xu, Liu Fang, Yang Shuyuan, Hou Biao. Multi-Scale Representation Learning for Image Classification: A Survey[J]. IEEE Transactions on Artificial Intelligence, 2021. 会议论文 Xu Liu, Yihong Huang, Dan Zhang, Lingling Li, Long Sun, Licheng Jiao, SOAR: Semi-Supervised Open-Vocabulary Aerial Object Detection via Dual-Aware Enhanced Prior Denoising, In AAAI, 2026. Liu Biao, Liu Xu*, Li Lingling, Jiao Licheng, Liu Fang, Sun Xinyu, Huang Youlin, \"Language-Guided Hybrid Representation Learning for Visual Grounding on Remote Sensing Images, In IJCAI, 2025 Zhang Dan, Liu Xu, Jiao Licheng, Liu Fang. Multi-scale co-attention learning for SAR image change detection[C]. In: 2024 IEEE International Geoscience and Remote Sensing Symposium (IGARSS), 2024: 10436–10440. Liu Xu, Liu Yu, Jiao Licheng, Li Lingling, Liu Fang, Zhang Dan, SWIN RESNET: Swin Transformers For Change Detection In Remote Sensing Images [C]//IGARSS 2023-2023 IEEE International Geoscience and Remote Sensing Symposium. IEEE, 2023. Liu Xu, Jiao Licheng, Fang Liu, Zhang Dan, Xin Hou. Feature Correlation Analysis Of Two-Branch Convolutional Networks For Multi-Source Image Classification [C]//IGARSS 2020-2020 IEEE International Geoscience and Remote Sensing Symposium. IEEE, 2020. Liu Xu, Jiao Licheng, Zhang Dan, Liu Fang, PolSAR Image Classification Based on Polarimetric Scattering Coding and Sparse Support Matrix Machine[C]//IGARSS 2019-2019 IEEE International Geoscience and Remote Sensing Symposium. IEEE,  2019:3181-3184. Zhang Xin, Jiao Licheng, Liu Xu, Li Xiaotong, Zhang Wenhua, Zhu Hao, Zhang Jie. A Deep Learning Filter for Visual Drone Single Object Tracking[C]//European Conference on Computer Vision(ECCV). Springer, Cham, 2020: 638-650. Zhang, Wenhua and Jiao, Licheng and Liu, Xu and Liu, Jia. Multi-Scale Feature Fusion Network for Object Detection in VHR Optical Remote Sensing Images[C]//IGARSS 2019-2019 IEEE International Geoscience and Remote Sensing Symposium. IEEE, 2019: 330-333. Sun, Qigong and Li, Xiufang and Li, Lingling and Liu, Xu and Liu, Fang and Jiao, Licheng. Semi-Supervised Complex-Valued GAN for Polarimetric SAR Image Classification[C]//IGARSS 2019-2019 IEEE International Geoscience and Remote Sensing Symposium. IEEE, 2019: 3245-3248. Wang, Zexin and Wang, Haoran and Jiao, Licheng and Liu, Xu. Semi-Supervised Pyramid Feature Co-Training Network for Lidar Data Classification[C]//IGARSS 2019-2019 IEEE International Geoscience and Remote Sensing Symposium. IEEE, 2019: 2471-2474. 开源的数据集： Liu Xu, Jiao Licheng, Liu Fang, Dan Zhang, Xu Tang. PolSF: PolSAR image dataset on San Francisco[C]//International Conference on Intelligence Science. Springer, Cham, 2022: 214-219. https://github.com/liuxuvip/PolSF, https://gitee.com/liuxu-vip/PolSF, 百度飞浆下载链接 专利成果： 焦李成，刘旭，张丹，赵佳琦，赵进，尚荣华，侯彪，杨淑媛，马文萍，马晶晶。基于CNN和SMM的极化SAR图像地物分类方法[P]，中国，ZL201610186867.X (授权专利) 焦李成，刘旭，张丹，赵佳琦，赵进，尚荣华，侯彪，杨淑媛，马文萍，马晶晶。基于深度多示例学习的极化SAR图像地物分类[P]，中国，ZL201610188365.0 (授权专利) 焦李成，刘旭，张丹，唐旭，马文萍，侯彪，杨淑媛，尚荣华。一种基于稀疏散射全卷积网络的极化SAR图像分类方法[P],中国，ZL201710786485.5 (授权专利) 刘旭，焦李成，张丹，刘芳，李玲玲，杨淑媛，侯彪. 基于散射图卷积网络的极化SAR图像分类方法、介质及设备:ZL202011511666.5(授权专利) 刘旭，",
  "content_length": 11916,
  "method": "requests",
  "crawl_time": "2025-12-01 14:49:06"
}