{
  "name": "Xu Liu 0001",
  "homepage": "https://xl10.github.io",
  "status": "success",
  "content": "Xu Liu's Homepage @ NCSU Xu Liu 刘旭 Associate Professor Joint Faculty with Oak Ridge National Laboratory Department of Computer Science NC State University Office: 3272 EB II Phone: 919-515-9605 Email: xliu88 (at) ncsu (.) edu Dr. Xu Liu joined Computer Science Department of North Carolina State University in August 2020. Before joining NCSU, Dr. Liu has been working as an assistant professor at The College of William and Mary since August 2014. He received Ph.D. from Rice University in 2014, working with Dr. John Mellor-Crummey. Before coming to Rice, he completed his master degree from Institute of Computing Technology, Chinese Academy of Sciences, and bachelor degree from Beihang University. Dr. Xu Liu’s research interests lie in parallel computing, compiler techniques, and systems. He focuses on developing tool infrastructures to measure and analyze program executions on emerging parallel architectures. The insights obtained can be used to optimize code performance, which not only improves productivities but also reduces energy consumption. We always have openings for self-motivated students who are interested in doing system research. Research Artifacts The artifacts are available. Awards 2023: Best Paper Finalist, ICPE'23 2023: Better Scientific Software (BSSw) Fellowship, Honorable Mention 2022: Distinguished Artifact Award, ASPLOS'22 2021: Runner Up, A-HUG Cloud HPC Hackathon (with Chongxin, Qidong, and Yueming) 2020: Best Paper Finalist, SC'20 2020: Phi Beta Kappa John D Rockefeller Jr. Faculty Award for the Advancement of Scholarship 2019: IEEE-CS TCHPC Early Career Researchers Award for Excellence in High Performance Computing 2019: Jeffress Trust Award 2019: ACM SIGPLAN Research Highlight 2019: Distinguished Paper Award, ICSE'19 2019: Best Paper Award, PPoPP'19 2018: Best Paper Finalist, IISWC'18 2018: ASPLOS'18 paper nominated to ACM SIGs for CACM Research Highlights 2018: Google Faculty Research Award 2018: Best Paper Award, PPoPP'18 2017: Best Paper Finalist, ASPLOS'17 2017: HiPEAC Paper Award 2015: Best Paper Award, SC'15 2013: Award of Excellence for the internship at Samsung, Austin, TX 2013-2014: The Numerical Algorithms Group (NAG) Fellowship, Rice University 2012-2013: BP Fellowship, Rice University 2011-2012: Schlumberger Fellowship, Rice University Students Probir Roy (Ph.D., graduated in 2019. First employment: assistant professor at University of Michigan-Dearborn) Qingsen Wang (Ph.D., graduated in 2019. First employment: Google) Shasha Wen (Ph.D., graduated in 2019. First employment: Amazon) Pengfei Su (Ph.D. graduated in 2020, First employment: assistant professor at University of California-Merced) Du Shen (Ph.D. graduated in 2021, Linkedin) Hao Xu (Ph.D. graduated in 2021, Linkedin) Bolun Li (Ph.D. graduated in Fall 2022, Tiktok) Zhuoran Liu (MS, graduated in Fall 2022, IBM) Yuchen Liang (MS, graduated in Spring 2023, Trilliant Networks) Jialiang Tan (Ph.D. candidate, Started in Fall 2019) Yueming Hao (Ph.D. candidate, Started in Fall 2019) Jinku Cui (Ph.D. student, Started in Fall 2020) Qidong Zhao (Ph.D. student, Started in Fall 2021) Yi Wang (Ph.D. student, Started in Fall 2021) Chongxin Zhong (Ph.D. student, Started in Fall 2022) Yanbo Zhao (Ph.D. student, Started in Fall 2022) Recent and Selected Publications (Full List) [MobiCom'23] \"DroidPerf: Profiling Memory Objects on Android Devices\", Bolun Li, Qidong Zhao, Shuyin Jiao, Xu Liu. The 29th International Conference on Mobile Computing and Networking. [ICPE'23] \"DrGPU: A Top-Down Profiler for GPU Applications\", Yueming Hao, Nikhil Jain, Rob Van der Wijngaart, Nirmal Saxena, Yuanbo Fan, Xu Liu. The 14th ACM/SPEC International Conference on Performance Engineering Best Paper Finalist [CGO'23] \"DJXPerf: Identifying Memory Inefficiencies via Object-centric Profiling for Java\", Bolun Li, Pengfei Su, Milind Chabbi, Shuyin Jiao, Xu Liu. IEEE/ACM International Symposium on Code Generation and Optimization, February 25th – March 1st, 2023, Montreal, Canada. [SC'22] \"Graph Neural Networks Based Memory Inefficiency Detection Using Selective Sampling\",Pengcheng Li, Yixin Guo, Yingwei Luo, Xiaolin Wang, Zhenlin Wang, Xu Liu. The International Conference for High Performance Computing, Networking, Storage and Analysis, November 13–18, 2022. [ICSE'22] \"OJXPerf: Featherlight Object Replica Detection for Java Programs\", Bolun Li, Hao Xu, Qidong Zhao, Pengfei Su, Milind Chabbi, Shuyin Jiao, Xu Liu. The International Conference on Software Engineering. [ASPLOS'22] \"ValueExpert: Exploring Value Patterns in GPU-accelerated Applications\", Keren Zhou, Yueming Hao, John Mellor-Crummey, Xiaozhu Meng, Xu Liu. The 27th International Conference on Architectural Support for Programming Languages and Operating Systems (Keren and Yueming are co-first authors) Distinguished Artifact Award [FSE'21] \"Toward Efficient Interactions between Python and Native Libraries\", Jialiang Tan, Yu Chen, Zhenming Liu, Bin Ren, Shuaiwen Leon Song, Xipeng Shen, Xu Liu. The 29th ACM Joint European Software Engineering Conference and Symposium on the Foundations of Software Engineering [ICS'21] \"NumaPerf: Predictive NUMA Profiling\", Xin Zhao, Jin Zhou, Hui Guan, Wei Wang, Xu Liu, Tongping Liu. The 35th International Conference on Supercomputing [SC'20] \"DRCCTPROF: A Fine-grained Call Path Profiler for ARM-based Clusters\", Qidong Zhao, Xu Liu, Milind Chabbi, The International Conference for High Performance Computing, Networking, Storage and Analysis, Nov 15-20, 2020, Atlanta, GA, USA. Best Paper Finalist [SC'20] \"GVPROF: A Value Profiler for GPU-based Clusters\", Keren Zhou, Yueming Hao, John Mellor-Crummey, Xiaozhu Meng, Xu Liu, The International Conference for High Performance Computing, Networking, Storage and Analysis, Nov 15-20, 2020, Atlanta, GA, USA. [SC'20] \"Zerospy: Exploring the Software Inefficiencies with Redundant Zeros\", Xin You, Hailong Yang, Zhongzhi Luan, Depei Qian, Xu Liu, The International Conference for High Performance Computing, Networking, Storage and Analysis, Nov 15-20, 2020, Atlanta, GA, USA. [SC'20] \"ScalAna: Automating Scaling Loss Detection with Graph Analysis\", Yuyang Jin, Haojie Wang, Teng Yu, Xiongchao Tang, Torsten Hoefler, Xu Liu, Jidong Zhai, The International Conference for High Performance Computing, Networking, Storage and Analysis, Nov 15-20, 2020, Atlanta, GA, USA. [TOPC'20] \"Efficient Abortable-locking Protocol for Multi-level NUMA Systems: Design and Correctness\", Milind Chabbi, Abdelhalim Amer, Xu Liu, ACM Transactions on Parallel Computing, 2020. [ICS'20] \"What Every Scientific Programmer Should Know About Compiler Optimizations?\", Jialiang Tan, Shuyin Jiao, Milind Chabbi, Xu Liu, The 34th ACM International Conference on Supercomputing, Jun 29 - Jul 2, 2020, Barcelona, Spain. Acceptance ratio: 30% (40/132). [CGO'20] \"ATMem: Adaptive Data Placement in Graph Applications on Heterogeneous Memories\", Yu Chen, Ivy B. Peng, Zhen Peng, Xu Liu, Bin Ren, The 2020 International Symposium on Code Generation and Optimization, Feb 22-26, 2020, San Diego, CA, USA. Acceptance ratio: 27% (26/95). [TPDS'19] \"Evaluating Modern GPU Interconnect: PCIe, NVLink, NV-SLI, NVSwitch and GPUDirect\", Ang Li, Shuaiwen Leon Song, Jieyang Chen, Jiajia Li, Xu Liu, Nathan Tallent, and Kevin Barker, IEEE Transactions on Parallel and Distributed Systems, 2019. [SC'19] \"Pinpointing Performance Inefficiencies via Lightweight Variance Profiling\", Pengfei Su, Shuyin Jiao, Milind Chabbi, Xu Liu, The International Conference for High Performance Computing, Networking, Storage and Analysis, Nov 17-22, 2019, Denver, CO, USA. Acceptance ratio: 25.3% (87/344). [ESEC/FSE'19] \"Pinpointing Performance Inefficiencies in Java\", Pengfei Su, Qingsen Wang, Milind Chabbi, Xu Liu, The 27th ACM Joint European Software Engineering Conference and Symposium on the Foundations of Software Engineering , Aug 26 - 30, 2019, Tallinn, Estonia. Acceptance ratio: 24% (74/303). [ICS'19] \"Can We Trust Profiling Results?\", Hao Xu, Qingsen Wang, Shuang Song, Lizy John, Xu Liu, The 33rd ACM International Conference on Supercomputing, Jun 26 - Jun 28, 2019, Phoenix, AZ. Acceptance ratio: 23% (45/193). [ICSE'19] \"Redundant Loads: A Software Inefficiency Indicator\", Pengfei Su, Shasha Wen, Hailong Yang, Milind Chabbi, Xu Liu, The International Conference on Software Engineering, May 25 - Jun 1, 2019, Montreal, Canada. Acceptance ratio: 21% (109/529). Distinguished Paper Award. [PPoPP'19] \"Lightweight Hardware Transactional Memory Profiling\", Qingsen Wang, Pengfei Su, Milind Chabbi, Xu Liu, The 24th ACM SIGPLAN Symposium on Principles and Practice of Parallel Programming, Feb 16-20, 2019, Washington, D.C.. Acceptance ratio: 19% (29/152). Best Paper Award. [HPCA'19] \"Featherlight Reuse-distance Measurement\", Qingsen Wang, Milind Chabbi, Xu Liu, The 25th IEEE International Symposium on High-Performance Computer Architecture, Feb 16-20, 2019, Washington, D.C.. Acceptance ratio: 19.7% (46/233). U.S. patent application No. 16/440,405 [CGO'19] \"Transforming Query Sequences for High-Throughput B+ Tree Processing on Many-core Processors\", Ruiqin Tian, Junqiao Qiu, Zhijiao Zhao, Xu Liu, Bin Ren, The 2019 International Symposium on Code Generation and Optimization, Feb 16-20, 2019, Washington, D.C.. [VLDB'19] \"Start Late or Finish Early: A Distributed Graph Processing System with Redundancy Reduction\", Shuang Song, Xu Liu, Qinzhe Wu, Andreas Gerstlauer, Tao Li, Lizy John, The Forty-fifth International Conference on Very Large Data Bases, Aug 26-30, 2019, Los Angeles, CA, USA. [IISWC'18] \"Tartan: Evaluating Modern GPU Interconnect via a Multi-GPU Benchmark Suite\", Ang Li, Shuaiwen Leon Song, Jieyang Chen, Xu Liu, Nathan Tallent, Kevin Barker, 2018 IEEE International Symposium on Workload Characterization, Sep 30-Oct 2, 2018, Raleigh, NC, USA. Nominated as Best Paper Award. [TPDS'18] \"LWPTool: A Lightweight Profiler to Guide Data Layout Optimization\", Chao Yu, Probir Roy, Yuebin Bai, Hailong Yang, Xu Liu, IEEE Transactio",
  "content_length": 21507,
  "method": "requests",
  "crawl_time": "2025-12-01 14:49:06"
}