{
  "name": "Xuan Liu 0006",
  "homepage": "https://liuxuan.website",
  "status": "success",
  "content": "DSOS - XUAN Group Dr. Xuan Liu (yusuf)College of Information and Artificial Intelligence (College of Industrial Software), Yangzhou University, China Follow Email ResearchGate Twitter Facebook Google Scholar ORCIDDistributed Systems Observability and SecurityBiographyXuan Liu (S’11-M’17-SM’21) received his PhD degree from the School of Computer Science and Engineering at Southeast University, China. He is currently a lecturer and master’s supervisor at the College of Information and Artificial Intelligence (College of Industrial Software) at Yangzhou University, China. Additionally, he serves as an editor for several publications, namely IEEE Transactions on Dependable and Secure Computing, IEEE Networking Letters, Computer Communications, Telecommunication Systems, etc. His current research focuses on the observability and security within distributed systems.Personal Website (Chinese Version)Recent News[Organizational activity]: Appointed as Student Support Committee member for NDSS’26 in November, 2025[Editorial Service]: Appointed as Associate Editor for IEEE Transactions on Dependable and Secure Computing in September, 2025[Exciting news!]: Our paper “Eagle: Toward Scalable and Near-Optimal Network-Wide Sketch Deployment in Network Measurement” has been accepted by SIGCOMM 2024.[Organizational activity]: Appointed as TPC member for IEEE GlobeCom 2024 NGNI (CCF C) in March, 2024[Organizational activity]: Appointed as TPC member for IEEE ICC 2024(CCF C) in July, 2023[Editorial Service]: Appointed as Associate Editor for IEEE Networking Letters in May, 2023[Organizational activity]: Appointed as TPC member for IEEE GlobeCom 2023 MWN (CCF C) in April, 2023[Organizational activity]: Appointed as TPC member for APNOMS 2023(CCF C) in March, 2023[Organizational activity]: Appointed as TPC member for IEEE WCNC 2023(CCF C) in August, 2022[Organizational activity]: Appointed as TPC member for IEEE ICC 2023(CCF C) in July, 2022[Organizational activity]: Appointed as TPC member for GIIS 2022 in July, 2022[Organizational activity]: Appointed as TPC member for APNOMS 2022(CCF C) in March, 2022[Editorial Service]: Appointed as Associate Editor for IET Networks in Feburary, 2022[Organizational activity]: Appointed as TPC member for IEEE GlobeCom 2022 NGNI/MWN (CCF C) in December, 2021[Organizational activity]: Appointed as TPC member for IEEE NOMS 2022 in September, 2021",
  "content_length": 2400,
  "method": "requests",
  "crawl_time": "2025-12-01 14:49:09"
}