{
  "name": "Xuan Wang 0008",
  "homepage": "https://xuanwang91.github.io",
  "status": "success",
  "content": "Welcome to Xuan’s Homepage! - Xuan Wang Xuan WangAssistant Professor Follow Data and Decision Sciences 376 Virginia Tech Email Twitter LinkedIn Github Google ScholarI am an Assistant Professor in the Department of Computer Science at Virginia Tech (VT). I am also a faculty member of the Sanghani Center for Artificial Intelligence and Data Analytics at VT. I was a recipient of the NSF CAREER Award 2025, Nvidia Academic Grant 2025, Cisco Research Award 2025, NSF NAIRR Pilot Award 2024 - 2025, and NAACL Best Demo Paper Award 2021. I received my Ph.D. in Computer Science from the University of Illinois at Urbana-Champaign (UIUC) under the supervision of Dr. Jiawei Han. During my Ph.D. study, I also worked at IBM Research as a summer intern. I received my M.S. in Statistics and my M.S. in Biochemistry from UIUC. I received my B.S. in Biological Science from Tsinghua University, China. Here is my full CV.Research InterestsMy primary research interests are Natural Language Processing, Data Mining, AI for Sciences, and AI for Healthcare. Some current research directions include:Natural Language Understanding with Limited Supervision:Information extraction, knowledge graph construction, text classification, …Weakly-supervised/few-shot/zero-shot learningComplex Reasoning and Planning with Language Model Agents:Complex reasoning with large language models (multi-hop, long-context, …)Multi-agent large language models for reasoning and planningEfficient small language models for reasoning and planningMulti-Modal Science Foundation Models (FMs):Systematic integration of multi-modal FMsInterpretability, explainability, and causal inference of science FMsText data, multi-omics data, brain signal data, …News and Highlights(11/7/25) One paper is accepted by AAAI’26. Congratulations to my student Zhenyu for their work on small language models as a judge for reasoning evaluation!(10/31/25) I am honored to give an invited talk at UMass Lowell CS Colloquia on small, open-source, and multi-modal language model agents for science and society!(10/29/25) I am honored to receive the ICDM Young Female Scholar Award in Data Science at ICDM’25!(10/20/25) One paper and one demo are accepted by AACL’25. Congratulations to my student Zhenyu for their work on multi-agent LLM collaboration!(10/8/25) I am honored to give an invited talk at William & Mary on small, open-source, and multi-modal language model agents for science and society!(9/28/25) We are thrilled to share that our pitch video on “MERA: (Meta)Genome-based Risk Assessment Web Server” has been deemed Awardable by the DARPA ERIS Marketplace!(9/15/25) We are excited to present our tutorial of “AI-Driven Multimodal Frameworks for Healthcare Decision-Making” at ICDM’25. Looking forward to seeing everyone in DC!(9/10/25) I am honored to give an invited talk at UIUC I-School CIRSS Seminar on small, open-source, and multi-modal language model agents for science and society!(8/20/25) Four papers are accepted by EMNLP’25. Congratulations to my students, Gaurav, Jun, and Manar, for their work on LLM agents, multi-modal learning, and trustworthy LLMs!(8/4/25) We are thrilled to share that our pitch video on “Towards Intelligent and Resilient U.S. Pharmaceutical Supply Chains via Multi-Agent AI” has been deemed Awardable by the DARPA ERIS Marketplace!(7/28/25) We are grateful to receive the Google Cloud Research Credits to support our research on multi-agent language model systems.(7/14/25) We are grateful to receive the NSF CAREER Award to support our research on scientific information extraction from massive text data. (VT News)(6/30/25) We are grateful to receive the NVIDIA Academic Grant to support our research on small language model agent systems.(6/30/25) We are excited to present at Agentic AI Summit in Berkeley this August, discussing effective and efficient multi-agent language model systems.(6/3/25) We are excited to organize a BoF session on Bridging Human Study and LLM Agents for Social Simulation at ACL’25. Looking forward to seeing everyone at ACL’25!(5/16/25) I am honored to share my thoughts in an interview with the VT CoE AI Magazine on the future of AI in healthcare. (VT CoE AI Magazine)(5/15/24) Two papers are accepted by ACL’25. Congratulations to my student Meng for his work on multi-agent LLM for zero-shot IE, and to Priya for her work on improving consensus in multi-agent LLM systems! Load More(4/25/25) I am honored to give an invited talk at I-School UIUC on 5/9/25. We will discuss effective and efficient multi-agent language model systems. Thanks to Dr. Yun Huang for the invitation!(4/25/25) I am honored to give a keynote talk at the Data Science for Smart Manufacturing and Healthcare (DS2-MH) Workshop at SDM'25. Thanks to the workshop organizers for the invitation!(4/12/25) We are excited to organize the 2025 CCI Workshop on AI for Science with Foundation Models. Looking forward to seeing everyone at the workshop!(4/12/25) We are excited to organize the RAiM 2025: The First International Workshop on Resilient Artificial Intelligence for Manufacturing at ICDM'25. Looking forward to seeing everyone in DC this year!(4/12/25) I am excited to serve as the co-chair for the Undergraduate and High School Symposium at ICDM'25. Looking forward to seeing more bright young AI scientists in DC this year!(4/7/25) One paper is accepted by ISMB'25. Congratulations to my student Sindhura for her work on the joint single-cell foundation model and graph-based learning!(12/19/24) We are grateful to receive a new grant from Cisco Research to support our research on complex reasoning and planing with large language models.(10/29/24) We are excited to present our tutorial of \"AI for Science in the Era of Large Language Models\" at AAAI'25. Looking forward to seeing everyone in Philadelphia!(10/26/24) One paper is accepted by IEEE-BigData'24. Congratulations to my student Hanwen for his work on EEG-to-text translation with multi-view Transformer!(10/2/24) We are grateful to receive yet another award from NSF NAIRR Pilot to support our research on network-regulated large language models for multi-omics data analysis.(9/20/24) We are excited to present our tutorial of \"AI for Science in the Era of Large Language Models\" at EMNLP'24. Looking forward to seeing everyone in Miami!(9/20/24) One paper is accepted by EMNLP'24. Congratulations to my student Meng for his work on better multi-agent collaboration for LLM-based clinical triage!(9/9/24) Congratulations to my student Daniel for receiving the Davenport Leadership Scholarship from CS@VT!(7/22/24) We are grateful to receive a new grant from the Amazon + VT Center for Efficient and Robust ML to support our research on long-context reasoning with large language models. (VT News)(6/28/24) We are grateful to receive a new grant from the Commonwealth Cyber Initiative (CCI) to support our research on EHR digital twin generation with large language models. (6/16/24) Three papers are accepted by ICML'24 AI4Science. Congratulations to my students, Meng whose paper was accepted as a spotlight, and Hanwen and Sindhura whose papers were accepted as posters! (5/21/24) We are excited and grateful to receive an award from NSF NAIRR Pilot to support our research on complex reasoning in large language models. (VT News) (5/17/24) One paper is accepted by ACL'24 and one paper is accepted by KDD'24. Congratulations to all the authors! (3/26/24) Check out our new survey paper on LLMs for diverse biomedical data! We explored three critical categories of biomedical data: 1) textual data (biomedical literature and health records), 2) biological sequences (DNA/RNA/protein sequences and multi-omics sequencing data), and 3) brain signals (time-series EEG data). (3/3/24) We are grateful to receive a new grant from the Virginia Tech Brain Tech One Health Initiative to support our research on open-vocabulary brain-to-text translation with large language models. (1/18/24) We are grateful to receive a new grant from the Children's National Hospital + Virginia Tech Initiative to support our research on weakly-supervised clinical variable extraction with large language models. (VT News) (10/10/23) We are grateful to receive a new grant from the Virginia Tech Institute for Critical Technology and Applied Science (ICTAS) to support our research on multi-omics encoding with LLMs for disease progression prediction. (10/7/23) Three papers are accepted by EMNLP'23. Congratulations to all the authors!(9/6/23) We are grateful to receive a new grant from the Amazon + VT Center for Efficient and Robust ML to support our research on fact-checking in LLMs. (VT News)(6/7/23) We are grateful to receive a new grant from the Center for Health Behaviors Research at Fralin Biomedical Research Institute to support our research on AI-guided behavioral health modifier prediction for fetal growth disorder detection.(5/11/23) We are grateful to receive a new grant from the Commonwealth Cyber Initiative (CCI) to support our research on trustworthy multimodal machine learning in healthcare. (VT News)(5/1/23) Two papers are accepted by ACL'23. Congratulations to all the authors!(1/1/23) I started a new journey as an Assistant Professor in CS@VT.My ScheduleYou can find my schedule here. The “Week” view will present you the details of slots.Prospective StudentsMy lab at Virginia Tech has openings for PhD/Master students and Post-doc researchers and research internship opportunities for undergrad students. We are looking for students with a strong background in NLP, data mining, deep learning, or bioinformatics.Please email me (with your CV) if you’re interested in working with me. Due to the high volume of emails, I may not be able to respond to every one I receive.For prospective PhD/MS students outside of VT, please include my name as one of your interested faculty members in your graduate application. This will make it easier for me to locate your application during the review process.For current PhD",
  "content_length": 10406,
  "method": "requests",
  "crawl_time": "2025-12-01 14:49:09"
}