{
  "name": "Xubo Song",
  "homepage": "http://www.ohsu.edu/xd/education/schools/school-of-medicine/departments/basic-science-departments/csee/csee-people/song.cfm",
  "status": "success",
  "content": "Xubo Song Ph.D. | OHSU People | OHSU Biography The research interests of the Song lab are machine learning and its applications in the biomedical domain, specifically in biomedical image computing. The lab work on innovative machine learning and computational algorithms to extract the rich information in biomedical data to enable researchers and physicians in biomedical discovery and precision medicine. Teaching: CS/EE 559/659 Machine Leaning CS/EE606 Advanced Topics in Machine Learning EE 584/684 Introduction to Image Processing Education and training Degrees B.S., Tsinghua University M.S., California Institute of Technology Ph.D., California Institute of Technology Areas of interest Artificial Intelligence, Machine Learning, Deep Learning, Computer Vision, Image Analysis Publications Selected publications K Kogachi, P Lalitha, N. Prajna, R Gunasekaran, J Keenan, J Campbell, Xubo Song, and Travis Redd, Deep Convolutional Neural Networks Detect No Morphologic Differences Between Culture Positive and Culture Negative Infectious Keratitis Images, Journal of Translational Vision Science and Technology, 2023 Jan 3;12(1):12. doi: 10.1167/tvst.12.1.12.  PMID: 36607623 PMCID: PMC9836011. M. Mooney, C Neighbor, E Nousen, J Tipsord, M Nikolas, N Dieckmann, S Karalunas, X Song, J Nigg, Prediction of ADHD diagnosis using brief, low-cost, clinical measures: a competitive model evaluation, Clinical Psychological Science, December 2022. DOI:10.1177/21677026221120236. C Newgard; S Babcock; X Song; Remick, K; Gausche-Hill, M; Lin, A; Malveau, S; Mann, C; Nathens, A; Cook, J; Jenkins, P; Burd, S.; Hewes, H.; Glass, N.; Jensen, A; Fallat, Mary E.; Ames, S; Salvi, A; McConnell, K; Ford, R; Auerbach, M; Bailey, J; Riddick, T.; Xin, H; Kuppermann, N, Machine Learning Analysis of Components Associated with Survival, Annals of SuSurvival, Annals of Surgery, 2022. Sina Mehdinia, Thomas Schumacher, Eric Wan, Xubo Song, \"A Pipeline for Enhanced Multimodal 2D Imaging of Concrete STRUCTURES\", Journal of Materials and Structures, 2022. Travis Redd, N  Prajna; M Srinivasan; P Lalitha, M; T Krishnan; R Rajaraman; A Venugopal;  N Acharya; G Seitzman; T Lietman; J Keenan; J P Campbell; Xubo Song, Image-Based Differentiation of Bacterial and Fungal Keratitis Using Deep Convolutional Neural Networks, Journal of Ophthalmology, 2022 Jun; 2(2): 100119. PMCID: PMC9560557 PMID: 36249698. Phillip Wallis, Xubo Song, Efficient Fine-tuning of Deep Neural Networks with Effective Parameter Allocation, International Conference on Image Processing, 2022. Walid Bousselham, Guillaume Thibault, Lucas Pagano, Archana Machireddy, Joe Gray, Young Hwan Chang, Xubo Song, Efficient Self-Ensemble for Semantic Segmentation, British Ma- chine Vision Conference, 2022. Ebrahim al Safadi, Xubo Song, Learning-based Image Registration with Meta-regularization, IEEE Compuer Society Conference on Computer Vision and Pattern Recognition (CVPR), 2021. Ebrahim al Safadi, Xubo Song, ”Spatial Transformer Spectral Kernels for Deformable Image Registration”, British Machine Vision Conference (oral presentation), 2019. Ebrahim al Safadi, Xubo Song, \"Spatial Transformer Spectral Kernels for Deformable Image Registration\", British Machine Vision Conference (oral presentation), 2019. Archana Machireddy, et al, “Early Prediction of Breast Cancer Therapy Response using Multi-Resolution Fractal Analysis of DCE-MRI Parametric Maps\", Tomography - A Journal for Imaging Research, special Quantitative Imaging Networks (QIN) issue, Mar;5(1):90-98, 2019 Archana Machireddy, Jan Van Santen, Jenny Wilson, Julianne Myers, Mijna Hadders-Algra, Xubo SONG, “A Video/IMU Hybrid System for Movement Estimation in Infants”, Proceedings of the 39th AnnualInternational Conference of the IEEE Engineering in Medicine & Biology Society (EMBC'17). Zhijun Zhang, Feng Liu, Hungtat Tsui, Yunwong Lau, Xubo Song. \"A Multi-scale Adaptive Mask Method for Rigid Intraoperative Ultrasound and Preoperative CT Image Registration\", Medical Physics,Vol.41, no.10, pages 102903(1-10), 2014 Chao Wang, Xubo Song, “Robust Head Pose Estimation via Supervised Manifold Learning\", Neural Networks, 2014. Zhijun Zhang, D.J. Sahn, Xubo Song, “Cardiac Motion Estimation by Optimizing Transmural Homogeneity of the Myofiber Strain and its Validation with Multimodal Sequences”, Medical Image Computing and Computer-Assisted Intervention (MICCAI), 2013, pp 493-500. Myronenko A., Song X. (2010): \"Intensity-based Image Registration by Minimizing Residual Complexity\", IEEE Trans. on Medical Imaging, 2010, 29(11): 1882 – 1891. Myronenko A., Song X.(2010): \"Point-Set Registration: Coherent Point Drift\", IEEE Trans. on Pattern Analysis and Machine Intelligence, 2010, 32(12): 2262 – 2275. Myronenko A., Song X.(2009): \"Global Active Contour-based Image Segmentation via Probability Align ment.\", Computer Vision and Pattern Recognition, (CVPR'09) , pp.2798-2804. Song X., Myronenko A., Sahn D.J. (2007): \"Speckle Tracking in 3D Echocardiography with Motion Coherence\", Computer Vision and Pattern Recognition, (CVPR'07)",
  "content_length": 5064,
  "method": "requests",
  "crawl_time": "2025-12-01 14:49:13"
}