{
  "name": "Xucong Zhang",
  "homepage": "https://www.ccmitss.com/zhang",
  "status": "success",
  "content": "Xucong ZhangSearch this siteEmbedded FilesSkip to main contentSkip to navigationHome        PublicationXucong Zhang(Tenured) Assistant ProfessorIntelligent Systems DepartmentFaculty of EEMCSDelft University of Technology (TU Delft) E-Mail: xucong.zhang [AT] tudelft.nlOffice: Room 6.E.320 Van Mourik Broekmanweg 6 (building 28) 2628 XE  Delft NetherlandsLinks: Google Scholar, LinkedInI am on an academic visit from October 2025 to April 2026 and working in the VLG group at ETH Zürich.Research InterestFrom Gaze to Full-body Intelligence: Building on my experience in gaze estimation and its applications, I focus on embodied visual intelligence through holistic human motion modeling and AI motion generation, including gaze, face, hand, and full-body dynamics. This research aims to support the development of human-robot collaboration and realistic avatar generation.Heathcare: I am working on the intersection of computer vision, medical, and healthcare research, aiming to develop tools that support clinical practice and benefit society at large.Short BioI joined TU Delft in 2021 as an assistant professor and was granted a permanent position in 2023. I was a postdoc from 2018 to 2021 at ETH Zurich in Switzerland, led by Prof. Otmar Hilliges. I received my PhD (summa cum laude) from the Max Planck Institute for Informatics in Germany, under the supervision of Prof. Andreas Bulling.I am also a Guest Scientist at the Max Planck Institute for Intelligent Systems, an ELLIS Scholar, and an IEEE senior member. Funding (1.5M EUR, including 950k EUR as sole PI)DFG UGaze Programme, \"WeGaze: Large-scale Gaze Analysis via Multi-camera System for Social Interactions\". EUR 300k, co-PI with Senya Polikovsky, 2026 - 2029.Honda Research Institute (Japan) + Netherlands TKI program, \"Intelligent Human-robot Interaction\". EUR 950k, sole PI, 2023 - 2028.Internal funding from our INSY department for the upgrade of INSYGHT Lab, EUR 250k, leading PI of 17 PIs, 2023  - 2024.Meta Research Award Gift, \"Privacy-preserving Eye Tracking for AR/VR with Adversarial Learning\". USD 70k, co-PI with Guohao Lan, 2022 - 2024.MediaI gave a talk at the ETH AI Center:From Gaze to Full-Body Intelligence: Modeling Human Behavior for Natural Human-AI InteractionI coordinated the upgrade and Open Day of the INSYGHT Lab:Open Day of the Newly Upgraded INSYGHT LabI am thrilled to be promoted from ELLIS Member to Scholar:9 researchers from ELLIS Unit Delft honoured with Fellows or Scholars titleOur capture system is reported on our faculty news:Cutting-Edge Multi-Camera System for Multi-Modal Data CaptureMy collaboration with HRI is reported in our faculty news:Honda Research Institute (HRI) Japan and EEMCS collaborate on human-centred computing for intelligent communication and social interactionLatest News[11.2025] UniGaze is accepted at WACV 2026.[10.2025] I have been elevated to the IEEE senior member.[10.2025] I start my six-month visit at ETH Zürich.[08.2025] The project page and demo of our work, UniGaze, are online.[08.2025] Together with Dr. Senya Polikovsky, we have secured 300k Euro DFG UGaze funding for one PhD at MPI-IS.[07.2025] I have been granted the IDEA League Fellowship to visit ETH for six months from October.[07.2025] One paper is accepted by IMWUT. [06.2025] One paper is accepted by the IROS 2025.[04.2025] One paper is accepted by the \"International Journal of Computer Assisted Radiology and Surgery\". [04.2025] I will give a talk at the ETH AI Center in June.[02.2025] I will serve as Area Chair of NeurIPS 2025. More newsTeachingBSc course \"Image Processing\", responsible, 2022 -- present.MSc course \"Computer Vision by Deep Learning\", co-teach, 2022 -- present.BSc course \"Image Analysis\", guest lecturer, 2024. Professional Activities, Awards and Talks Organizing Committee Area Chairs: NeurIPS 2024 & 2025, CVPR 2025.Co-chair of short paper track: ETRA 2024 & 2025.Organizer:Workshop \"GAZE\" at ICCV/ECCV/CVPR from 2019 to 2024.Workshop \"Nonverbal Cues for Human-Robot Cooperative Intelligence\" at IROS 2024 and ICRA 2025.The Netherlands Conference on Computer Vision (NCCV) 2023.ReviewingCVPR 2023 Outstanding ReviewersHighlighted Reviewers of ICLR 2022Journals: TPAMI, MM, TIP, CVIU, Nature CommunicationsConferences: CVPR, ECCV, ICCV, ICLR, NeurIPS, CHI, UIST, IMWUT, BMVC, WACV, ETRATalksJune 2025, Google Zurich. Hosted by Dr. Thoba Beeler. June 2025, ETH Zurich. Hosted by Prof. Siyu Tang.June 2025, ETH AI Center. Hosted by Dr. Manuel Kaufmann. May 2025,  keynote in GenEAI: Generative AI meets Eye Tracking workshop at ETRA.June 2024, University of California, San Diego. Hosted by Prof. Pamela Cosman. April 2024,  The University of Tokyo, Japan. Keynote at  International Workshop on Human-Centered Vision and Media Technologies.February 2024, University of Stuttgart. Hosted by Prof. Andreas Bulling.August 2022, Max Planck Institute for Intelligent Systems (MPI-IS). Hosted by Prof. Michael Black.August 2022, Microsoft UK. Hosted by Dr. David Wong.November 2021, Facebook Reality Labs Pittsburgh.May 2018, ETH Zurich, Switzerland. Hosted by Prof. Otmar Hilliges. March 2018, The University of Tokyo, Japan. Hosted by Prof. Yoichi Sato. March 2018, Osaka University, Japan. Hosted by Prof. Yusuke Sugano. March 2018, Keio University, Japan. Hosted by Prof. Kai Kunze. Funding:Report abuseReport abuse",
  "content_length": 5343,
  "method": "requests",
  "crawl_time": "2025-12-01 14:49:11"
}