{
  "name": "Xue Lin 0001",
  "homepage": "https://web.northeastern.edu/xuelin",
  "status": "success",
  "content": "High Energy-Efficiency & Performance System Lab – Just another Sites at Northeastern site Skip to content Dr. Xue (Shelley) Lin Google scholar Associate ProfessorDepartment of Electrical and Computer EngineeringCollege of Engineering Khoury College of Computer Science (Courtesy Appointment)Northeastern University 320 Dana360 Huntington AveBoston MA 02115Phone: 617-373-4030Email: xue.lin@northeastern.edu Biography: Dr. Xue (Shelley) Lin is an associate professor in the Department of Electrical and Computer Engineering at Northeastern University. She received her bachelor’s degree in Microelectronics from Tsinghua University, China and her PhD degree from the Department of Electrical Engineering at University of Southern California in 2016. Her research interests include deep learning, machine learning and computing in cyber-physical systems, high-performance and mobile computing systems, and VLSI. Her research work has been recognized by multiple NSF awards and supported by Air Force Research Lab, Office of Naval Research, Lawrence Livermore National Lab, DARPA, and U.S. Department of Transportation. Her work got multiple research awards including the Third Place Winner in Stage II of the national 2022 Inclusive Design Challenge from U.S. Department of Transportation (DOT), a Spotlight Paper at NeurIPS 2021, the Top Highest Score Award in VNN-COMP’21 at the 33rd ICCAV, the Best Paper Award at HAET Workshop at ICLR 2021, an Oral Paper at CVPR 2021, the Stage I Cash Prize Award in DOT’s Inclusive Design Challenge, the 1st Place Winner of the Best Presentation at WISE 2020, the 1st Place at ISLPED 2020 Design Contest, a Spotlight Paper at ECCV 2020, the Best Technical Poster Award at NDSS 2020, the Top Paper Award at CLOUD 2014, and the Best Paper Award at ISVLSI 2014. News: 2023/09/17: I will attend the “Career perspectives in academia vs. Industry” panel at ESWEEK’23 in Hamburg, Germany. 2022/10/17: Our paper on Efficient Vision Transformer FPGA Accelerator was accepted in HPCA 2023. 2022/08/17: Mengshu defended her PhD thesis and will join Beijing Institute of Artificial Intelligence at Beijing University of Technology (BJUT) as an Assistant Professor. Congratulations! 2022/07/26: Dr. Lin wins U.S. DOT Inclusive Design Challenge Stage II together with VEMI Lab at U Maine. The award was announced at the 2022 DOT Americans with Disabilities Act Anniversary Ceremony. 2022/07/21: Siyue defended her PhD thesis and will join Microsoft Research & Azure AI/ML Team as a Research Scientist. Congratulations! 2022/01/20: Our paper on reverse engineering of deception was accepted at ICLR 2022. 2021/11/22: Our paper on FPGA DNN accelerator using quantization was accepted at FPGA 2022. 2021/10/15: Our paper on DNN fingerprinting was accepted at BMVC 2021. 2021/9/28: Our paper on edge training was accepted as Spotlight paper at NeurIPS 2021. 2021/9/28: Our paper on certified deep learning robustness was accepted at NeurIPS 2021. 2021/8/15: I gave an invited talk ““Secure Deep Learning — Adversarial T-shirt, Attack Detection, and Robust Ensemble” in the 3rd Workshop on Adversarial Learning Methods for Machine Learning and Data Mining at KDD 2021. 2021/8/10: Pu will join the ECE Department of Northeastern University as an assistant research professor starting from Fall 2021. 2021/8/10: Pu defended his PhD thesis. 2021/8/02: Kaidi won the Top Highest Score Award in 2021 VNN-COMP co-located with the 33rd International Conference on Computer-Aided Verification 2021/7/22: Pu’s work was accepted at ICCV 2021. 2021/7/22: Mengshu’s work was accepted at ICCV 2021. 2021/07/07: Kaidi defended his PhD thesis. 2021/6/11: Chenan’s paper was accepted at AdvML Workshop at KDD 2021. 2021/6/11: Yize’s paper was accepted at AdvML Workshop at KDD 2021. 2021/04/29: Siyue and Pu’s work was accepted at IJCAI 2021. 2021/04/29: Zhen’s work won the best paper award in the Hardware Aware Efficient Training Workshop at ICLR 2021. 2021/04/29: Siyue and Pu’s work was accepted in the Security and Safety in Machine Learning Systems Workshop at ICLR 2021. 2021/04/29: Hao, Kaidi, and Chenan’s work was accepted in the Robust and Reliable Machine Learning in the Real World Workshop at ICLR 2021. 2021/04/20: Yize defended his MS thesis. 2021/04/05: Chenan’s work was accepted at NEHWS 2021 as Poster Presentation. 2021/03/31: Kaidi will join the CS Department of Drexel University as an assistant professor starting from Fall 2021. [News] 2021/03/04: I presented a talk in the SARA Workshop at SysML’20. 2021/03/03: Zhengang and Pu’s work was accepted at CVPR 2021 as Oral Paper. 2021/03/03: Pu’s work was accepted at DAC 2021. 2021/01/12: Kaidi’s paper was accepted at ICLR 2021. 2021/01/06: Dr. Lin teaming up with U Maine Prof. Nicholas Giudice won in the U.S. Department of Transportation’s (DOT) Inclusive Design Challenge to receive a Stage I cash prize award in the amount of $300,000 and to advance to Stage II as a Semifinalist. 2020/12/18: Pu and Zhengang’s got two papers accepted at AccML 2021. 2020/12/14: Siyue presented her work at WISE2020 and won the 1st Place in the Best Presentation [Award Certificate]. 2020/12/07: Together with Prof. Yunsi Fei and Prof. Thomas Wahl, I presented a tutorial talk “Protecting confidentiality and integrity of deep neural networks” at IEEE International Symposium on Hardware Oriented Security and Trust (HOST). 2020/12/02: Zhengang and Mengshu’s paper was accepted by AAAI 2021. 2020/10/27: Mengshu’s paper was accepted by HPCA 2021. 2020/10/01: I received a $1M DARPA Grant together with Professors Xiaoming Liu and Sijia Liu from Michigan State University. 2020/9/30: News@Northeastern reported our seed project funded from a new joint initiative by the Roux Institute at Northeastern University and the University of Maine. 2020/9/25: Kaidi’s paper was accepted by NeurIPS 2020. 2020/9/17: I received Northeastern University and University of Maine joint seed funding program with Profs. Nicholas Giudice and Richard Corey from U Maine. 2020/9/16: I received an NSF MRI award as the Co-PI, together with PI Prof. David Kaeli, and Profs. Devesh Tiwari and Yanzhi Wang in our department. 2020/8/18: In collaboration with W&M, our Team won the ISLPED 2020 Design Contest 1st Place. 2020/7/2: Kaidi and Mengshu’s adversarial T-shirt paper was accepted by ECCV 2020 as a spotlight paper (top 5%). 2020/6/2: I gave an online talk on adversarial T-shirt and neural networks to learners from NEU’s SFBA, Seattle, and Vancouver campuses. 2020/5/11: Kaidi will work as a research intern at Tecent Media Lab in Summer 2020. 2020/5/11: Pu will work as a research intern at Google Research in Summer 2020. 2020/5/11: Siyue will work as a research intern at Google Research in Summer 2020. 2020/5/11: Our work on adversarial T-shirt was reported by WIRED. 2020/5/5: Our work on mode connectivity and adversarial robustness was reported by The Next Web. 2020/4/21: Pu’s paper was accepted by IJCAI-PRICAI 2020. 2020/3/4: I gave a talk in the workshop “SARA: Secure and Resilient Autonomy” at SysML’20. 2020/2/27: I gave a talk “Towards robust and efficient deep learning systems” at the Civil & Environmental Engineering Department of the University of Massachusetts Lowell. 2020/2/27: Our collaborative work with University of California Irvine on “Security of Deep Learning based Lane Keeping Assistance Systems under Physical-World Adversarial Attack” received the Best Technical Poster Award at Network and Distributed System Security Symposium (NDSS) 2020. 2020/2/10: Mengshu and Pu’s paper was accepted by DAC 2020. 2020/2/10: Siyue and Zhengang’s paper was accepted by DAC 2020. 2020/1/24: Kaidi and Mengshu’s paper was accepted by ICASSP 2020. 2020/1/24: Siyue’s paper was accepted by ICASSP 2020. 2019/12/29: Kaidi will work as an intern at IBM Research AI at Cambridge, MA in Spring 2020. 2019/12/19: Pu’s paper was accepted by ICLR2020. 2019/12/2: Our work on adversarial T-shirt was reported by Communications of the ACM. 2019/11/25: Our work on adversarial T-shirt was reported by Quartz. 2019/11/25: Our work on adversarial T-shirt was reported by Boston Globe. 2019/11/14: Our work on adversarial T-shirt was reported by News@Northeastern. 2019/11/10: Pu’s two papers were accepted by AAAI2020. 2019/11/4: Our work on adversarial T-shirt was reported by The Register. 2019/10/29: Our work on adversarial T-shirt was reported by VentureBeat. 2019/9/13: I received an NSF CPS Small award as the lead PI, together with Prof. Alfred Chen at University of California, Irvine. 2019/9/3: Kaidi’s paper was accepted by NeurIPS2019. 2019/7/22: Pu and Kaidi’s paper was accepted by ICCV2019. 2019/7/22: Kaidi’s paper was accepted by ICCV2019. 2019/7/10: I received an NSF SaTC Medium award as the Co-PI, together with PI Prof. Yunsi Fei in our department and Co-PI Prof. Thomas Wahl from Khoury College of Computer Sciences. 2019/5/31: I received an NSF Core Medium award as the PI, together with Co-PI Prof. Miriam Leeser in our department and Prof. Massoud Pedram at University of Southern California. 2019/5/30: Siyue’s paper was accepted by AdvML@KDD’19. 2019/5/10: Kaidi’s paper was accepted by IJCAI 2019. 2019/5/10: Siyue’s paper was accepted by IJCAI 2019. 2019/4/20: Siyue will work as an intern at the System Technology Lab in Adobe Research in Summer 2019. 2019/4/20: Kaidi will work as an intern at Lawrence Livermore National Lab  in Summer 2019. 2019/2/18: Mengshu and Pu’s paper was accepted by GLSVLSI 2019. 2019/2/1: Pu and Siyue’s paper was accepted by DAC 2019. 2018/12/21: Kaidi and Pu’s paper was accepted by ICLR 2019. 2018/12/20: Pu will work as an intern at IBM Thomas J. Watson Research Center in Spring 2019. 2018/11/5: Pu’s paper was invited for a presentation at ASP-DAC 2019. 2018/10/20: Pu’s paper was accepted by IEEE GlobalSIP 2018. 2018/10/20: Siyue’s paper was accepted by IEEE GlobalSIP 2018. 2018/7/1: Pu’s paper was accepted by ACM Multimedia 2018. 2018/6/26: Siyue’s paper was accepted by IC",
  "content_length": 10359,
  "method": "requests",
  "crawl_time": "2025-12-01 14:49:14"
}