{
  "name": "Xue Li 0001",
  "homepage": "http://staff.itee.uq.edu.au/xue",
  "status": "success",
  "content": "﻿ Prof. Xue Li`s Web Page ProfessorXue Li Google Scholar Time Table Dr Xue Li is honoured as one of \"the most powerful people in Australia\" on Big Data by the Financial Review - the Power Issue 2015 Dr Xue Li is a Professor in the School of Information Technology and Electrical Engineering at the University of Queensland (UQ) in Brisbane, Queensland, Australia. Dr Xue Li holds a Professor title in School of Medicine in Griffith University, Gold Coast, Queensland, Australia. His major areas of research interests and expertise include: Health Data Analytics, Data Mining, Social Computing, and Intelligent Web Information Systems. More About Me Education •\tPhD (Information Systems), Queensland University of Technology, 1997 •\tMsc (Computer Science), The University of Queensland, 1989 •\tBSc (Computer Science), Chongqing University, 1982 Committees •\tFounder and Chair of Steering Committee of ADMA (International Conferences on Advanced Data Mining and Applications) since 2004, Published with Springer Germany. •\tPresident of QCF (Queensland Chinese Forum) for joint of 22 Chinese Associations in Queensland 2010-2011. •\tPresident of CCCPCC (Chinese Community Crime Prevention Consultative Committee) with Queensland Police Department, Queensland Government, 2010 – 2011. •\tPresident and Board member of Miaomiao Chinese School (2004-2006, operating on 4 campuses with more than 1000 students learning Chinese Language in Brisbane). •\tEditor on Board, (2004-2007) International Journal of Information Systems and Management & Technology, Elsevier. •\tProgram Committee Chair for the 12th AusDM conference in 2014 (the premier Australasian Data Mining Conference). •\tLocal Chair of 2015 ACM Multimedia International Conference (ERA A) Brisbane, •\tPublicity Chair of REID 1999 International Conference (in conjunction to ICDE Data Engineering). •\tProgram (PC) Chairs for five international conferences (ADMA05, ADMA06, FSKD06, AIDM05, ICISW05). •\tExpert Reviewer for Australian ARC Funding Applications (since 2001). •\tMember of ACS (Australian Computer Society), IEEE, ACM. Work Experience •\tProfessor in School of Information Technology and Electrical Engineering, at the University of Queensland, St Lucia, Brisbane. Current •\tSenior Lecturer in School of Information Systems, Technology and Management, at University of New South Wales, Sydney. 1998 – 2000 •\tLecturer in School of Information Systems & School of Computing at Queensland University of Technology, Gardens Point, Brisbane. 1990 – 1998 Publication 168 2017 2016 2015 2014 2013 2012 2011 2010 2009 2008 2007 2006 2005 2004 2003 2002 and before Teaching Reseach Awards Supervision PhD & MPhil Student Post-Doctor 2017 Journal Sen Wang, Xue Li, Xiaojun Chang, Lina Yao, Quan Z. Sheng, and Guodong Long (2017) Learning Multiple Diagnosis Codes for ICU Patients with Local Disease Correlation Mining. ACM Trans. Knowl. Discov (ACM TKDD). Data 11, 3, Article 31 (March 2017), DOI: https://doi.org/10.1145/3003729 Lina Yao, Quan Z Sheng, Xue Li, Tao Gu, Mingkui Tan, Xianzhi Wang, Wan Zou (2017) Compressive Representation for Device-Free Activity Recognition with Passive RFID Signal Strength. IEEE Transactions on Mobile Computing (IEEE TMC), 5 June 2017 DOI: 10.1109/TMC.2017.2706282 http://ieeexplore.ieee.org/abstract/document/7938705/ Ibrahim A Ibrahim, Abdullah M Albarrak, Xue Li (2017) Constrained recommendations for query visualizations. Knowledge and Information Systems. Springer London. 2(51) pp499-529. 1 May 2017, https://link.springer.com/article/10.1007/s10115-016-1001-5 Conference Hongxu Chen, Hongzhi Yin, Xue Li, Meng Wang, Weitong Chen, Tong Chen (2017) People Opinion Topic Model: Opinion-based User Clustering in Social Networks, 2017 International World Wide Web Conference Committee (IW3C2), WWW 2017 Companion, April 3–7, 2017, Perth, Australia. Wenjie Ruan, Peipei Xu, Quan Z Sheng, Nickolas JG Falkner, Xue Li, Wei Emma Zhang (2017) Recovering Missing Values from Corrupted Spatio-Temporal Sensory Data via Robust Low-Rank Tensor Completion. (DASFAA 2017) International Conference on Database Systems for Advanced Applications, Suzhou, China, March27-30 2017, pp607-622. https://link.springer.com/chapter/10.1007/978-3-319-55753-3_38 2016 Journal Ling Chen, Xue Li, Quan Z. Sheng, Wen-Chih Peng, John Bennett, Hsiao-Yun Hu, and Nicole Huang (2016) Mining Health Examination Records - A Graph-based Approach, IEEE Transaction on Knowledge and Data Engineering (TKDE), accepted in April 2016. Sen Wang, Xiaojun Chang, Xue Li, Guodong Long, Lina Yao, Michael Q.Z. Sheng (2016) Diagnosis Code Assignment Using Sparsity-based Disease Correlation Embedding, IEEE Transaction on Knowledge and Data Engineering (TKDE), accepted in August 2016. Conference Sanad Al-Maskari, Eve B´elisle, Xue Li, S´ebastien Le Digabel, Amin Nawahda, and Jiang Zhong, (2016) Classification with Quantification for Air Quality Monitoring, (PAKDD), The 20th Pacific Asia Conference on Knowledge Discovery and Data Mining, April 19-22, Auckland, New Zealand (ERA A) Lina Yao, Feiping Nie, Quan Z. Sheng, Tao Gu, Xue Li, and Sen Wang (2016) “Learning from Less for Better: Semi-Supervised Activity Recognition via Shared Structures Discovery, In Proc. of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp 2016) (CORE A*)) Xianzhi Wang, Quan Z. Sheng, Lina Yao, Xue Li, Xiu Susie Fang, Xiaofei Xu, and Boualem Benatallah (2016) Truth Discovery via Exploiting Implications from Multi-Source Data, In Proc. of the 25th International Conference on Information and Knowledge Management (CIKM 2016 ). Indianapolis, USA, October 24-28, 2016. Xianzhi Wang, Quan Z. Sheng, Lina Yao, Xue Li, Xiu Susie Fang, Xiaofei Xu, and Boualem Benatallah (2016) Empowering Truth Discovery with Multi-Truth Prediction, In Proc. of the 25th International Conference on Information and Knowledge Management (CIKM 2016 ). Indianapolis, USA, October 24-28, 2016. Wenjie Ruan, Peipei Xu, Quan Z. Sheng, Nguyen Khoi Tran, Nickolas J.G. Falkner, Xue Li, and Wei Emma Zhang (2016) Recovering Missing Values in Noisy Sensory Data Using Robust Tensor Completion, In Proc. of the 25th International Conference on Information and Knowledge Management (CIKM 2016). Indianapolis, USA, October 24-28, 2016. (short) Wenjie Ruan, Quan Z. Sheng, Peipei Xu, Nguyen Khoi Tran, Nickolas J.G. Falkner, Xue Li, and Wei Emma Zhang (2016) Forecasting Seasonal and Trending Time Series Using Weighted Gradient RBF Network based Autoregressive Model, In Proc. of the 25th International Conference on Information and Knowledge Management (CIKM 2016). Indianapolis, USA, October 24-28, 2016. (short) 2015 Journal Ling, Chen, Xue Li, et al, (2015) Personal health indexing based on medical examinations: a data mining approach, Journal of Decision Support Systems (DSS), Elsevier, Paper accepted on 1st November 2015 (ERA A*). Sen Wang, Xue Li, Micheal Q.Z. Sheng et al. (2015) Representation for Large-Scale Unconstrained Video Analysis, WWWJ (World Wide Web Journal), Accepted, May 2015. (ERA A) Lina Yao, Quan Z. Sheng, Anne. H. H. Ngu, Byron Gao, Xue Li and Sen Wang. (2015) Multi-Label Classification via Learning a Unified Object-Label Graph with Sparse Representation. WWWJ (World Wide Web Journal), to appear 2015 (ERA A). Sen Wang, Xiaojun Chang, Xue Li, Quan Z. Shen and Weitong Chen (2015) Multi-Task Support Vector Machines for Feature Selection. Signal Processing, Elsevier, 2015 (Available online 19 December 2014) doi: 10.1016/j.sigpro.2014.12.012. (ERA A) Lina Yao, Quan Z. Sheng, Anne H.H. Ngu, and Xue Li (2015) Things of Interest Recommendation by Leveraging Heterogeneous Relations in the Internet of Things. ACM Transactions on Internet Technology (TOIT), 2015. (to appear) . (ERA A) Conference Xue Li (2015) Data Analytics on Social Media & Social Networks, Tutorial (CIKM 2015), Melbourne, Australia, October 19-23, 2015. (ERA A) Lina Yao, Quan Z. Sheng, Xue Li, Sen Wang, Wenjie Ruan, Wan Zou (2015) Online Activity Recognition via Dictionary-based Sparse Representation of RFID Sensing Data, IEEE ICDM (IEEE International Conference on Data Mining) Atlantic City, NJ, USA 14-17 Nov. 2015. (ERA A) Sen Wang, Feiping Nie, Xiaojun Chang*, Lina Yao, Xue Li and Quan Z. Sheng (2015) Unsupervised Feature Analysis with Class Margin Optimization, European Conference on Machine Learning and Principles and Practice of Knowledge Discovery in Databases, ECML/PKDD , Porto, Portugal, 7-11 Sep. 2015 (ERA A) Sayan Unankard, Xue Li, and Guodong Long (2015) Invariant Event Detection in Social Networks, DASFAA 2015, Hanoi, Vietnam, 20-23 April 2015, Best Demo Paper. (ERA A) Xianzhi Wang, Quan Z. Sheng, Xiu Susie Fang, Xue Li, Xiaofei Xu, and Lina Yao (2015) Approximate Truth Discovery via Problem Scale Reduction, In Proc. of the 24th International Conference on Information and Knowledge Management (CIKM 2015), Melbourne, Australia, October 19-23, 2015. (ERA A) Xianzhi Wang, Quan Z. Sheng, Xiu Susie Fang, Lina Yao, Xiaofei Xu, and Xue Li (2015) An Integrated Bayesian Approach for Effective Multi-Truth Discovery, In Proc. of the 24th International Conference on Information and Knowledge Management (CIKM 2015), Melbourne, Australia, October 19-23, 2015. (ERA A) 2014 Journal Sen Wang, Zhigang Ma, Yi Yang, Xue Li, Chaoyi Pang, Alexander G. Hauptmann (2014) Semi-supervised Multiple Feature Analysis for Action Recognition. IEEE Transactions on Multimedia (TMM), Feb. 2014, pp289-299. Xin Zhao, Xue Li, Chaoyi Pang, Michael Sheng (2014) Structured Streaming Skeleton – a New Feature for Online Human Gesture Recognition. ACM Transactions on Multimedia Computing, Communications and Applications (TMCCA), accepted, (June 2014). Sayan Unankard, Xue Li, Mohamed A. Sharaf (2014) Emerging Event Detection in Social Networks with Location Sensitivity, WWWJ (World Wide Web Journal), Accepted, March 2014. Liu Q., Li X., Ye M., Ge S.S. and Du X. (2014) Drift compensation for electr",
  "content_length": 51917,
  "method": "requests",
  "crawl_time": "2025-12-01 14:49:17"
}