{
  "name": "Xuebo Liu 0002",
  "homepage": "https://sunbowliu.github.io",
  "status": "success",
  "content": "Xuebo Liu (刘学博) | HIT Shenzhen Xuebo Liu 刘学博 Associate Professor School of Computer Science and Technology Harbin Institute of Technology, Shenzhen Shenzhen, Guangdong, China 中 Biography I am an Associate Professor in School of Computer Science and Technology and Institute of Computing and Intelligence at Harbin Institute of Technology, Shenzhen, working with Prof. Min Zhang. Before that, I received my PhD degree at University of Macau (2021), advised by Prof. Derek F. Wong and was a member of NLP2CT Lab. I was a postgraduate intern at Tsinghua NLP Group (2018), advised by Prof. Yang Liu and a research intern at Tencent AI Lab (2019-2021), advised by Dr. Zhaopeng Tu and Dr. Longyue Wang. Looking for Students: Looking for self-motivated students and interns to join our team. Please feel free to contact me if you have interests! Research Interests Natural Language Processing Representation Learning Multimodal Processing Diverse Evaluation Large Language Models Synthetic Data Superalignment Domain Adaptation Machine Translation Long-Context Translation Massive Multimodal Translation Multi-agent Systems Theory Architecture Efficiency Applications News [08.2025] Seven papers are accepted to EMNLP 2025 and its findings. [05.2025] Five papers are accepted to ACL 2025 and its findings. [05.2025] Serving as Senior Area Chair of AACL 2025. [05.2025] Serving as Senior Area Chair of EMNLP 2025. [01.2025] One paper is accepted to ICLR 2025. [12.2024] One paper is accepted to AAAI 2025. [11.2024] One paper is accepted to COLING 2025. [10.2024] Serving as Area Chair of NAACL 2025. [09.2024] Two papers are accepted to NeurIPS 2024. [09.2024] Five papers are accepted to EMNLP 2024 and its findings. [06.2024] Serving as Area Chair of EMNLP 2024. [05.2024] Eight papers are accepted to ACL 2024 and its findings. [02.2024] Serving as Area Chair of ACL 2024. [02.2024] One paper is accepted to CVPR 2024. [02.2024] Two papers are accepted to COLING 2024. Publications View the complete list of published works. View Publications Experiences 01.2025 - Present Associate Professor School of Computer Science and Technology, Harbin Institute of Technology, Shenzhen 09.2021 - 12.2024 Assistant Professor School of Computer Science and Technology, Harbin Institute of Technology, Shenzhen 03.2016 - 06.2021 Research Assistant NLP2CT Lab, University of Macau (Advised by Prof. Derek F. Wong) 12.2019 - 03.2021 Research Intern NLP Center, Tencent AI Lab (Advised by Dr. Zhaopeng Tu & Dr. Longyue Wang) 05.2018 - 11.2018 Postgraduate Intern NLP Lab, Tsinghua University (Advised by Prof. Yang Liu) Professional Services Senior Area Chair: EMNLP 2025; AACL 2025 Area Chair: ACL 2022, 2024-2025; EMNLP 2022-2024; NAACL 2024-2025; EACL 2024; CCL 2023-2025; NLPCC 2024 Journal Reviewer: TASLP 2022-2024; CL 2021; Neurocomputing 2020-2022; TALLIP 2018-2019, 2021-2024 Conference Reviewer: ICLR 2022-2025; ICML 2022-2025; NeurIPS 2020-2025; ACL 2019, 2021-2024; EMNLP 2021-2024; NAACL 2021-2024; AAAI 2019, 2021-2024; IJCAI 2022-2024; COLING 2020-2025; NLPCC 2019-2024 Miscellaneous My first name Xuebo means studying (Xue) for a doctorate (Bo). I have achieved it on May 27, 2021. If you are also interested in Vision Transformer, please take a look at my friend Dr. Xiaodong Cun.",
  "content_length": 3278,
  "method": "requests",
  "crawl_time": "2025-12-01 14:49:14"
}