{
  "name": "Xuechen Zhang 0001",
  "homepage": "https://labs.wsu.edu/xuechen-zhang",
  "status": "success",
  "content": "Xuechen Zhang’s Research Site | Washington State University Skip to main content Skip to navigation Search Contact Share Welcome to Intelligent Storage System Laboratory! Directed by Dr. Xuechen Zhang Email: xuechen [dot] zhang [at] wsu [dot] edu Research interest: File and storage systems Operating systems High performance computing Systems for AI 1. Summer internship at the Berkeley Lab: multiple positions are available for undergraduate and graduate students. These projects require C/C++ and are related to high-performance computing, OS, and system programming. If selected, the lab will pay $600/week for 9 weeks for undergraduate students plus a housing supplement of $3000. (The minimum GPA requirement is 3.0/4 and students must be US citizens or permanent residents at the time of applying.) 2. NSF REU site for Advancing Data-Driven Computational Simulations and Experiments: more information can be found here (https://reu.encs.vancouver.wsu.edu/). Weijian Chen, Shuibing He, Haoyang Ou, and Xuechen Zhang. “LeapGNN: Accelerating Distributed GNN Training Leveraging Feature-Centric Model Migration”.  In the 23rd USENIX Conference on File and Storage Technologies (FAST ’25), Santa Clara, CA, February 2025. Siling Yang, Shuibing He, Wenjiong Wang, Yanlong Yin, Tong Wu, Weijian Chen, Xuechen Zhang, Xina-He Sun, and Dan Feng, “GOPIM: GCN-Oriented Pipeline Optimization for PIM Accelerators”. In The 31st IEEE International Symposium on High-Performance Computer Architecture (HPCA-31), Las Vegas, NV, March 2025. Rubayet Rongon, Chen Cao, and Xuechen Zhang, “A Study of Data-Path Bugs in PyTorch with a Focus on Memory Management”. In Proceedings of the 2024 IEEE International Conference on Big Data (BigData’24), Washington DC, December 2024. Zhe Pan, Shuibing He, Xu Li, Xuechen Zhang, Yanlong Yin, Rui Wang, Lidan Shou, Mingli Song, Xian- He Sun, and Gang Chen. “Enumeration of Billions of Maximal Bicliques in Bipartite Graphs without Using GPUs”. In Proceedings of the ACM/IEEE International Conference for High Performance Computing, Networking, Storage and Analysis (SC’24), Atlanta, GA, November 2024. Dang Zheng, Shuibing He, Xuechen Zhang, Peiyi Hong, Zhenxin Li, Xinyu Chen, Haozhe Song, Xian-He Sun, and Gang Chen, “PMAlloc: A Holistic Approach to Improving Persistent Memory Allocation”. ACM Transactions on Computer Systems, 2024. Zhenxin Li, Shuibing He, Zheng Dang, Peiyi Hong, Xuechen Zhang, Rui Wang, and Fei Wu, “CCL- BTree: A Crash-Consistent Locality-Aware B+-Tree for Reducing XPBuffer-Induced Write Amplification in Persistent Memory”. In Proceedings of The European Conference on Computer Systems (EuroSys ’24), Athens, Greece, April 2024. Zhe Pan, Shuibing He, Xu Li, Xuechen Zhang, Rui Wang, and Gang Chen, “Efficient Maximal Biclique Enumeration on GPUs”, In Proceedings of ACM/IEEE International Conference for High Performance Computing, Networking, Storage and Analysis (SC’23), Denver, CO, November 2023. Weijian Chen, Shuibing He, Yaowen Xu, Xuechen Zhang, Siling Yang, Shuang Hu, Xian-He Sun, and Gang Chen, “iCACHE: An Importance-Sampling-Informed Cache for Accelerating I/O-Bound DNN Model Training”, In Proceedings of the 29th IEEE International Symposium on High-Performance Computer Architecture (HPCA-29), Montreal, QC, Canada, February 2023. Zheng Dang, Shuibing He, Peiyi Hong, Zhenxin Li, Xuechen Zhang, Xian-He Sun, and Gang Chen, “NVAlloc: Rethinking Heap Metadata Management in Persistent Memory Allocators”, In Proceedings of the 27th International Conference on Architectural Support for Programming Languages and Operating Systems (ASPLOS’22), Lausanne, Switzerland, February 2022. Siling Yang, Weijian Chen, Xuechen Zhang, Shuibing He, Yanlong Yin, and Xian-He Sun, “Automated DNN Pruning and Mapping for ReRAM-based Accelerator”, In Proceedings of the International Conference on Supercomputing 2021 (ICS’21), Worldwide online event, June 2021. Tyler Coy, Shuibing He, Bin Ren, and Xuechen Zhang, “Compiler Aided Checkpointing using Crash-Consistent Data Structures in NVMM Systems”, In Proceedings of the International Conference on Supercomputing 2020 (ICS’20), Barcelona, Spain, June 2020. Soklong Lim, Zaixin Lu, Bin Ren, Xuechen Zhang, “Enforcing Crash Consistency of Evolving Network Analytics in Non-Volatile Main Memory Systems”, In Proceedings of the 28th International Conference on Parallel Architectures and Compilation Techniques (PACT’19), Seattle, WA, September 2019. Ian Kosen, Can Huang, Zhi Chen, Xuechen Zhang, Emma Stewart, Liang Min, Dao Zhou, Lin Zhu, and Yilu Liu. “UPS: Unified PMU-Data Storage System to Enhance T+D PMU Data Usability”. IEEE Transactions on Smart Grid (TSG), 2019. Bao Nguyen, Tan Hua, and Xuechen Zhang,  “Large-scale Adaptive Mesh Simulations Through Non-Volatile Byte-Addressable Memory”, ACM/IEEE International Conference for High Performance Computing, Networking, Storage and Analysis (SC’17), Denver, CO, November 2017. Jian Huang, Michael R. Allen-Bond, and Xuechen Zhang, “Semantic-Aware Checking for Finding Deep Bugs in Fast Path”, Proceedings of 22nd International Conference on Architectural Support for Programming Languages and Operating Systems (ASPLOS’17), Xi’an, China, 2017. Jian Huang, Xuechen Zhang, and Karsten Schwan, “Understanding Issue Correlations: A Case Study of the Hadoop System”, The ACM Symposium on Cloud Computing 2015 (SOCC’15), Kohala Cost, HI, August 2015. Ajay Gulati, Ganesha Shanmuganathan, Xuechen Zhang, and Peter Varman, ”Demand Based Hierarchical QoS Using Storage Resource Pools”, USENIX Annual Technical Conference (ATC’12), Boston, MA, June 2012. Xuechen Zhang, Kei Davis, and Song Jiang, “QoS Support for End Users of I/O-intensive Applications using Shared Storage Systems”, ACM/IEEE International Conference for High Performance Computing, Networking, Storage and Analysis (SC’11), Seattle, WA, November 2011. Xuechen Zhang, Kei Davis, and Song Jiang, ”IOrchestrator: Improving the Performance of Multi-node I/O Systems via Inter-Server Coordination”, ACM/IEEE International Conference for High Performance Computing, Networking, Storage and Analysis (SC’10), New Orleans, LA, November 2010.",
  "content_length": 6152,
  "method": "requests",
  "crawl_time": "2025-12-01 14:49:19"
}