{
  "name": "Xuefu Zhou",
  "homepage": "http://homepages.uc.edu/~zhoxu",
  "status": "success",
  "content": "Dr. Xuefu Zhou, College of Engineering and Applied Science, University of Cincinnati ã ã Xuefu (Frank) Zhou,  Ph.D. ã Associate Professor Director, Master of Engineering (MENG) Graduate Program Director, B.S. Degree in EET Director, Wireless and Mobile Communication Lab (WMCL) ã Department of Electrical  and Computer Engineering (ECE) ã College of Engineering and Applied Science (CEAS) ã University of Cincinnati, OH 45221 ã Office: 838 Rhodes Hall ã Phone: (513) 556-6552 ã Email:  xuefu.zhou at uc.edu Home Teaching Research Service Personal Links Xuefu (Frank) Zhou received the M.S. and Ph.D. degrees in Electrical Engineering in 2002 and 2006, respectively, both from the University of Cincinnati where he joined the faculty as an Assistant Professor in September 2005, and was promoted to Associate Professor in September 2010.   From 1995 to 2000, he worked as a R&D Engineer, then Senior Engineer and Project Manager in the industry designing and developing distributed computer control systems, real-time embedded systems for various process controls. He is the recipient of 2011 and a co-recipient of 2012 William E. Restemeyer Teaching Excellence Award from DEECS. He is also a recipient of 2013 and 2018 CEAS Master Educator Award.  He is a senior member of IEEE and a member of ASEE. Research Interests Wireless/Mobile  Communications and Networking Biomedical Signal (ECG) Processing & Automated  Identification of Abnormalities Communication Signal Processing Digital Video Processing, Digital Image Processing Cross-Layer Design and Optimization for Wireless Networks Deep-Learning Based Video/Image Processing Smart and Connected Health Teaching Digital Signal Processing Digital Communications Video Processing and Communications (co-taught) Wireless Communications and Networks Computer Networks Computer Security Feedback Control Signals and Systems Topics of Operating Systems ã Service Professional Activities Associate Editor, the Journal of Circuits, Systems and Computers (JCSC), 10/2009--2013 Ohio Board of Regents (OBR) TAG Faculty Review Panel,    09/2008--present Secretary of  IEEE Cincinnati Section (Two-year term of 2011 and 2012) IEEE Cincinnati Section Executive Committee, and PACE Chair, 08/2007-present Track Chair (Physical Layer II), the 10th Wireless Telecommunications Symposium, 2011 International Program Committee, IEEE International Conference on Service Operations, Logistics and Informatics,  2009 Technical Program Committee, International Workshop on Wireless Ad Hoc and Mesh Networks,  2008 Technical Program Committee, The First International Workshop on Next Generation of Wireless and Mobile Networks, 2008 Technical Program Committee, The 4th IEEE International Workshop on Heterogeneous Multi-Hop Wireless and Mobile Networks, 2008 Technical Program Committee, The Third IEEE International Workshop on Heterogeneous Multi-Hop Wireless and Mobile Networks, 2007 Reviewer for: IEEE Communications Letters (Journal) International Journal of Interdisciplinary Telecommunications and Networking (IJITN) IEEE International Conference on Mobile Ad-hoc and Sensor Systems IEEE Wireless Communications and Networking Conference IEEE International Conference on Communications International Conference on Wireless Networks IEEE Wireless Telecommunications Symposium IEEE International Midwest Symposium on Circuits and Systems ASEE Annual Conference Earth & Space Conference (2010) Department College/UC Service Master of Engineering (MENG) Graduate Program Director,  DEECS, 12/2017-present Council for Graduate Affairs, DEECS, 2011-present Council  for Undergraduate Affairs (UNCL) , DEECS, 07/2010-present ABET Coordinator, 2010-present Faculty Advisory Board for the Office of College Computing, College of Engineering and Applied Science, 2010-2015 UC Cross-College Semester Conversion Committee, 05/2009-2012 College of Engineering and Applied Science Honors Program Steering Committee, 2009-2016 Personal Links Teammates Outside of My Office :)",
  "content_length": 4020,
  "method": "requests",
  "crawl_time": "2025-12-01 14:49:18"
}