{
  "name": "Xueliang Li 0005",
  "homepage": "https://www.sustech.edu.cn/en/faculties/lixueliang.html",
  "status": "success",
  "content": "LI Xueliang - Faculty - SUSTech Menu News E-Hall ä¸­æ Academic Calendar Notice News Academic Calendar Notice Library News Admissions Global  ä¸­æ   Â© 2019 All Rights Reserved.ç½ç«è®¾è®¡æ¯æ ç²¤ICPå¤14051456å· ä¸­æ Home News Events About Overview Mission & Vision Leadership The Development Plan University Governance Milestones Facts Gallery Contact us Faculty Overview High-level Talents Talent Program Directory Academics Overview View Programs Undergraduate Education Graduate Education Overseas Studies Schools and Colleges International students Research Overview Research Centers & Facilities Technology Transfer Research News Research Administration Go Global Campus Life Overview Residential College Housing & Dining Clubs & Organizations Email Library Admissions Give University Intranets Old Site Faculty ä¸­æ Go Back Search LI Xueliang Assistant Professor lixl6@sustech.edu.cn Personal Homepage Professor LI, Assistant Professor of the School of Design at Southern University of Science and Technology, is a researcher of interaction design and design for mental health. After obtaining his bachelorâs degree in industrial design from Hebei University of Technology and masterâs degree in design from Jiangnan University, LI continues his study in pursuit of a Ph.D. degree at the faculty of Industrial Design Engineering, Delft University of Technology (Netherlands). His Ph.D. thesis focuses on designing smart wearables to help people, in particular those who are with post-traumatic stress disorder (PTSD), to deal with stress in everyday contexts. In his Ph.D. research, he works with an interdisciplinary team across the domains of computer science, electronic engineering, mental healthcare, fashion design, and interaction design. Based on his Ph.D. research, he has extended his interest into the topics of design for emotion and subjective wellbeing and designing everyday objects as intelligent agents that provide care and companionship. Trained as a designer and has grown to be a design researcher, LI has adopted a research-through-design approach. He is enthusiastic about conducting design activities to pursue research goals and employing research methods to generate design concepts and improve design outcomes. Apply Now Careers@SUSTech Cooperation With SUSTech",
  "content_length": 2314,
  "method": "requests",
  "crawl_time": "2025-12-01 14:49:16"
}