{
  "name": "Xuemin Lin 0001",
  "homepage": "https://www.acem.sjtu.edu.cn/en/faculty/linxuemin.html",
  "status": "success",
  "content": "Faculty - Antai College of Economics & Management, Shanghai Jiao Tong University Location: Home Faculty & Research Faculty Overview Xuemin LIN Department:Data and Business Intelligence Phone:+86 (0)21 62933646 Title:Professor Email:xuemin.lin@sjtu.edu.cn Profile Xuemin Lin is a chair professor in the Department of Data and Business Intelligence at the Antai College of Economics and Management, Shanghai Jiao Tong University, and currently the head of Department of Data and Business Intelligence. Prof Lin is a foreign member of Academia Europaea and a fellow of IEEE.Xuemin Lin got his PhD in Computer science from the University of Queensland in 1992 and his BSc in Applied Math from Fudan University in 1984. During 1984-1988, he studied for PhD in Applied Math at Fudan University.Xuemin Lin started his teaching in the Computer Science Department at the University of Western Australia in Nov 1994 after a 2 years research fellow appointment at the University of Queensland. He joined the School of Computer Science and Engineering at the University of New South Wales in Nov 1997. In 2005, he was a visiting researcher in Microsoft Asia Research Lab and visited Tokyo University as a JSPS fellow. He is a distinguished visiting Professor at Tsinghua University and a visiting Chair Professor at Fudan University. He has been an adiunct Professor at East Normal University, Zhejiang Gongshang University, and Guangzhou University. Xuemin was the Editor-in-Chief of IEEE Transactions on Knowledge and Data Engineering (2017 Jan - 2021 Dec). He was also an Associate Editor-in-Chief of IEEE Transactions on Knowledge and Data Engineering (2015 Jan - 2017 Jan). He was an associate editor of ACM Transactions on Database Systems (2008-2014) and an associate editor of IEEE Transactions on Knowledge and Data Engineering (2013 Feb - 2015 Jan).CV:XMLCV.pdfPublications:all publications.pdf Fold Research Xuemin Lin‘s principal research areas are databases and graph visualization.In databases, his research areas include data mining, data streams, distributed database systems, spatial database systems and web databases. Currently, he is working on data streams,approximate query processing, spatial data processing, probabilistic queries, Graph Databases and web information processing.Graph visualization is to display a graph according to the aesthetics from applications; for example, one may wish to draw a graph symmetrically if possible. Graph visualization serves as a tool in many applications. A number of topic have been covered by Xuemin Lin in graph drawing, which include drawing trees, undirected graphs, directed graphs and hierarchical graphs. Xuemin Lin's main focus has been on understanding inherent difficulties of drawing problems and then developing effective drawing algorithms. Fold Teaching Fold",
  "content_length": 2827,
  "method": "requests",
  "crawl_time": "2025-12-01 14:49:16"
}