{
  "name": "Xuemeng Song",
  "homepage": "https://xuemengsong.github.io",
  "status": "success",
  "content": "Welcome to Song Xuemeng's Homepage Xuemeng Song Associate Professor Department of Computer Science and Engineering Southern University of Science and Technology Address： Office 618, South Tower, CoE Building, SUSTech, 1088 Xueyuan Avenue, Nanshan District, Shenzhen, China Email： sxmustc at gmail dot com News Biography Awards Services Publications Research News Opening for master/PhD students: I am recruiting self-motivated master/PhD students, postdocs, and RAs to collaborate on research domains such as multimodal learning and multimodal large language models. (Enrollment of 2026 Sep). Biography Xuemeng Song is an associate professor at Southern University of Science and Technology, and IEEE senior member. She got her PhD degree from National University of Singapore (NUS) and her Bachelor degree from Universitiy of Science and Technology of China (USTC) in 2016 and 2012, respectively. Her research interests are multimodal learning and multimodal large language models. She has published more than 90 papers in the top venues (e.g., IEEE TIP, IEEE TMM, ACM SIGIR, ACM MM, and ACM TOIS) and 4 books by Morgan & Claypool Publishers and Springer. In addition, she has served as reviewers for many top conferences and journals, such as TKDD, TMM, ICMR, and MMM. Google Scholar: https://scholar.google.com/citations?user=29gP4okAAAAJ&hl=enDBLP: https://dblp.org/pid/147/9141.html Awards 2025, The World's Top 2% Scientists, Stanford/Elsevier 2025, First Place Award in Track 1 of Multimodal Information Retrieval Challenge, EReL@MIR Workshop of The Web Conference (WWW), 2025 2022, Global Top Chinese Young Scholars in Artificial Intelligence, Baidu 2022, Fellow of 2022 Women in AI, AMiner (Only 23 Chinese Women Scholars) 2022, AI 2000 Most Influential Scholar Award Honorable Mention, AMiner 2021, First Prize of Science and Technology Progress Award, Shandong Province of China 2021, Best Paper Honorable Mention, ChinaMM 2018, Future Talent Scholars, Shandong University Services Tutorial Co-Chair of the ACM ICMR, 2025 Action Editor of Neural Networks since 2025 Associate Editor for IEEE TMM since 2024 Associate Editor for IEEE TCSVT since 2023 Associate Editor for IET Image Processing since 2023 Chair of the ACM MM workshop on “Multimedia Computing towards Fashion Recommendation”, 2022 Invited keynote speaker of the workshop \"Towards a Complete Analysis of People: From Face and Body to Clothes (T-CAP)\" on ICIAP, 2022 Guest editor of the special issue “Research on multimodal representation learning with pretraining” for the Journal of Software, 2022 Invited speaker of the CCF-TCVRV (The sixth forum at Wuhan Textile University), 2021 Participate in the course construction of \"Exploration of demonstration teaching on pattern recognition\" of college artificial intelligence teaching resources construction project of the Ministry of Education, 2020 Guest editor of the special issue “Deep Learning for Multi-modal Social Media Analysis and Applications” for the journal Information Processing and Management, 2018 Editor board member of the journal Information Processing and Management since 2018 Program committee member of top conferences such as ACM SIGIR, MM, SIGKDD, WSDM, AAAI, IJCAI, and reviewers for top journals, such as ACM TOIS, IEEE TMM, IEEE TIP, and IEEE TKDE. Publications Advanced Multimodal Compatibility Modeling and Recommendation. Wenqi Liu, Xuemeng Song, Jiaxi Li, Yinwei Wei, Na Zheng, Jianhua Yin, Liqiang Nie. Mitigating Hallucination Through Theory-Consistent Symmetric Multimodal Preference Optimization. NeurIPS, 2025. Advanced Multimodal Compatibility Modeling and Recommendation. Weili Guan, Xuemeng Song, Dongliang Zhou, Liqiang Nie. Synthesis Lectures on Information Concepts, Springer Nature, 2025. TR-Adapter: Parameter-Efficient Transfer Learning for Video Question Answering. Yuanyuan Wang, Meng Liu, Xuemeng Song, Liqiang Nie. IEEE TMM, 2025. Interactive Garment Recommendation with User in the Loop. Federico Becattini, Xiaolin Chen, Andrea Puccia, Haokun Wen, Xuemeng Song, Liqiang Nie, Alberto Del Bimbo. ACM ToMM, 2025. Domain-aware Multimodal Dialog Systems with Distribution-based User Characteristic Modeling. Xiaolin Chen, Xuemeng Song, Jianhui Zuo, Yinwei Wei, Liqiang Nie, Tat-Seng Chua. ACM ToMM, 2025. Content-aware Balanced Spectrum Encoding in Masked Modeling for Time Series Classification. Yudong Han, Haocong Wang, Yupeng Hu, Yongshun Gong, Xuemeng Song, Weili Guan. In AAAI, 2025. Prompt-based and weak-modality enhanced multimodal recommendation. Xue Dong, Xuemeng Song, Minghui Tian, Linmei Hu. Inf. Fusion, 2024. Multimodal matching-aware co-attention networks with mutual knowledge distillation for fake news detection. Linmei Hu, Ziwang Zhao, Weijian Qi, Xuemeng Song, Liqiang Nie. Inf. Fusion, 2024. Self-Training Boosted Multi-Factor Matching Network for Composed Image Retrieval. Haokun Wen, Xuemeng Song, Jianhua Yin, Jianlong Wu, Weili Guan, Liqiang Nie. IEEE TPAMI, 2024 Query-Oriented Micro-Video Summarization. Mengzhao Jia, Yinwei Wei, Xuemeng Song, Teng Sun, Min Zhang, Liqiang Nie. IEEE TPAMI, 2024 Audio-Semantic Enhanced Pose-Driven Talking Head Generation. Meng Liu, Da Li, Yongqiang Li, Xuemeng Song, Liqiang Nie. IEEE TCSVT, 2024 Muti-Modal Emotion Recognition via Hierarchical Knowledge Distillation. Teng Sun, Yinwei Wei, Juntong Ni, Zixin Liu, Xuemeng Song, Yaowei Wang, Liqiang Nie. IEEE TMM, 2024 Xue Dong, Xuemeng Song, Na Zheng, Jianlong Wu, Hongjun Dai, Liqiang Nie. TryonCM2: Try-on-Enhanced Fashion Compatibility Modeling Framework. IEEE TNNLS, 2024 Stylized Data-to-text Generation: A Case Study in the E-Commerce Domain. Liqiang Jing, Xuemeng Song, Xuming Lin, Zhongzhou Zhao, Wei Zhou, Liqiang Nie. ACM TOIS, 2024 Multimodal Dialog Systems with Dual Knowledge-enhanced Generative Pretrained Language Model. Xiaolin Chen, Xuemeng Song, Liqiang Jing, Shuo Li, Linmei Hu, Liqiang Nie. ACM TOIS, 2024 Breaking Through the Noisy Correspondence: A Robust Model for Image-Text Matching. Haitao Shi, Meng Liu, Xiaoxuan Mu, Xuemeng Song, Yupeng Hu, Liqiang Nie. ACM TOIS, 2024 Universal Relocalizer for Weakly Supervised Referring Expression Grounding. Panpan Zhang, Meng Liu, Xuemeng Song, Da Cao, Zan Gao, Liqiang Nie. ACM ToMM, 2024 Harnessing Representative Spatial-Temporal Information for Video Question Answering. Yuanyuan Wang, Meng Liu, Xuemeng Song, Liqiang Nie. ACM ToMM, 2024 Similarity-Induced Weighted Consensus Laplacian Matrix Learning for Multiview Clustering. Hui Liu, Xiao Yu, Yuxiu Lin, Xuemeng Song, Liqiang Nie. IEEE Trans. Syst. Man Cybern. Syst, 2024 Exploiting the Social-Like Prior in Transformer for Visual Reasoning. Yudong Han, Yupeng Hu, Xuemeng Song, Haoyu Tang, Mingzhu Xu, Liqiang Nie. In AAAI, 2024 VK-G2T: Vision and Context Knowledge Enhanced Gloss2text. Liqiang Jing, Xuemeng Song, Xinxing Zu, Na Zheng, Zhongzhou Zhao, Liqiang Nie. In ICASSP, 2024 Multi-Factor Adaptive Vision Selection for Egocentric Video Question Answering. Haoyu Zhang, Meng Liu, Zixin Liu, Xuemeng Song, Yaowei Wang, Liqiang Nie. In ICML, 2024 Simple but Effective Raw-Data Level Multimodal Fusion for Composed Image Retrieval. Haokun Wen, Xuemeng Song, Xiaolin Chen, Yinwei Wei, Liqiang Nie, Tat-Seng Chua. In SIGIR, 2024 Fine-grained Textual Inversion Network for Zero-Shot Composed Image Retrieval. Haoqiang Lin, Haokun Wen, Xuemeng Song, Meng Liu, Yupeng Hu, Liqiang Nie. In SIGIR, 2024 Egocentric Early Action Prediction via Multimodal Transformer-Based Dual Action Prediction. Weili Guan, Xuemeng Song, Kejie Wang, Haokun Wen, Hongda Ni, Yaowei Wang, Xiaojun Chang. IEEE TCSVT, 2023. Adaptive Collaborative Soft Label Learning for Unsupervised Multi-View Feature Selection. Dan Shi, Lei Zhu, Xiao Dong, Xuemeng Song, Jingjing Li, Zhiyong Cheng. ACM TKDD, 2023. ROLE: Rotated Lorentzian Graph Embedding Model for Asymmetric Proximity. Shanshan Feng, Lisi Chen, Kaiqi Zhao, Wei Wei, Xuemeng Song, Shuo Shang, Panos Kalnis, Ling Shao. IEEE TKDE, 2023. MM-FRec: Multi-Modal Enhanced Fashion Item Recommendation. Xuemeng Song, Chun Wang, Changchang Sun, Shanshan Feng, Min Zhou, Liqiang Nie. IEEE TKDE, 2023. Dual Consistency-Enhanced Semi-Supervised Sentiment Analysis Towards COVID-19 Tweets. Teng Sun, Liqiang Jing, Yinwei Wei, Xuemeng Song, Zhiyong Cheng, Liqiang Nie. IEEE TKDE, 2023. DualGNN: Dual Graph Neural Network for Multimedia Recommendation. Qifan Wang, Yinwei Wei, Jianhua Yin, Jianlong Wu, Xuemeng Song, Liqiang Nie. IEEE TMM, 2023. Modality-Oriented Graph Learning Toward Outfit Compatibility Modeling. Xuemeng Song, Shi-Ting Fang, Xiaolin Chen, Yinwei Wei, Zhongzhou Zhao, Liqiang Nie. IEEE TMM, 2023. DualGNN: Dual Graph Neural Network for Multimedia Recommendation. Qifan Wang, Yinwei Wei, Jianhua Yin, Jianlong Wu, Xuemeng Song, Liqiang Nie. IEEE TMM, 2023. Dual Preference Distribution Learning for Item Recommendation. Xue Dong, Xuemeng Song, Na Zheng, Yinwei Wei, Zhongzhou Zhao. ACM TOIS, 2023. DBiased-P: Dual-Biased Predicate Predictor for Unbiased Scene Graph Generation. Xianjing Han, Xuemeng Song, Xingning Dong, Yinwei Wei, Meng Liu, Liqiang Nie. IEEE TMM, 2023. Egocentric Early Action Prediction via Adversarial Knowledge Distillation. Na Zheng, Xuemeng Song, Tianyu Su, Weifeng Liu, Yan Yan, Liqiang Nie. ACM ToMM, 2023. Egocentric Early Action Prediction via Adversarial Knowledge Distillation. Na Zheng, Xuemeng Song, Tianyu Su, Weifeng Liu, Yan Yan, Liqiang Nie. ACM ToMM, 2023. Mutual-Enhanced Incongruity Learning Network for Multi-Modal Sarcasm Detection. Yang Qiao, Liqiang Jing, Xuemeng Song, Xiaolin Chen, Lei Zhu, Liqiang Nie. In AAAI, 2023. Multi-source Semantic Graph-based Multimodal Sarcasm Explanation Generation. Liqiang Jing, Xuemeng Song, Kun Ouyang, Mengzhao Jia, Liqiang Nie. In ACL, 2023. Target-Guided Composed Image Retrieval. Haokun Wen, Xian Zhang, Xuemeng Song, Yinwei Wei, Liqiang Nie. In ACM MM, 2023. Adapting Generative Pretrained Language Model for Open-domain Multimodal Sentence Summarization. Dengtian Lin, Liqiang ",
  "content_length": 23140,
  "method": "requests",
  "crawl_time": "2025-12-01 14:49:17"
}