{
  "name": "Xueru Zhang",
  "homepage": "https://xueruzhang.github.io",
  "status": "success",
  "content": "Xueru Zhang I am an Assistant Professor in the Department of Computer Science and Engineering at The Ohio State University. I am also affiliated with the Translational Data Analytics Institute. My research focuses on the societal aspects of machine learning and algorithmic decision-making. I aim to understand the societal implications of machine learning and develop learning systems that are aligned with social norms and reliable in dynamic environments. The research topics of my recent works are: (1) Trustworthy machine learning (e.g., fairness, privacy, security, robustness, interpretability); (2) Learning in uncertain and dynamic environment (e.g., strategic classification, out-of-distribution generalization); (3) Learning from distributed agents (e.g., federated learning); (4) AI for Science (e.g., healthcare, earth sciences). For more details, please see my publications. Our research is generously supported by the National Science Foundation, Cisco, Center for Clinical and Translational Science, and Nationwide Children's Hospital, and OSU Translational Data Analytics Institute. Prior to joining OSU, I completed my PhD under the supervision of Mingyan Liu at the University of Michigan. I am always looking for highly motivated students! Please see group page for details. News [12/2023] - I will lead the discussion on \"long-term fairness\" in Algorithmic Fairness through the Lens of Time workshop at NeurIPS. [12/2023] - One paper \"Performative Federated Learning: A Solution to Model-Dependent and Heterogeneous Distribution Shifts\" got accpeted in AAAI 2024. [9/2023] - Check out our paper \"Counterfactually Fair Representation\" in NeurIPS 2023! [06/2023] - Our paper \"Loss Balancing for Fair Supervised Learning\" got accpeted in ICML 2023. [05/2023] - I gave a talk about strategic classification at \"Midwest Machine Learning Symposium\". Check out the slide here. [03/2023] - Thrilled to receive Translational Data Analytics Institute (TDAI) Interdisciplinary Research Pilot Awards at OSU! [01/2023] - Our paper \"Fairness and Accuracy under Domain Generalization\" got accpeted in ICLR 2023. [10/2022] - Thanks Cisco for supporting our research! [09/2022] - New grant from NSF to work on fairness in machine learning. [08/2022] - Thrilled to receive Center for Clinical and Translational Science (CCTS) Pilot Award at OSU. [06/2022] - I gave a talk \"Towards Ethical AI: Improving Model Fairness and Privacy in Online Marketing and Advertising\" at Walmart Global Tech. [06/2022] - I am co-organizing the Deep Learning Summer School at OSU. [05/2022] - Our paper \"Fairness Interventions as (Dis)Incentives for Strategic Manipulation\" got accpeted in ICML 2022. [05/2022] - Our paper \"Incentive Mechanisms for Strategic Classification and Regression Problems\" got accpeted in EC 2022. [05/2022] - Our paper \"Differentially Private Real-Time Release of Sequential Data\" got accpeted in ACM Transactions on Privacy and Security. [04/2022] - I served as a penalist at CogFest 2022. [04/2022] -Thrilled to receive President’s Research Excellence Accelerator Award at OSU. [01/2022] - I am co-organizing the ICLR 2022 Workshop on Socially Responsible Machine Learning (SRML). Please submit your paper here. [12/2021] - I am invited to give a talk in USC ML Symposium. [10/2021] - One paper got accepted to the 35th Conference on Neural Information Processing Systems (NeurIPS). [10/2021] - One paper got accepted to IEEE International Conference on Data Mining (ICDM). [6/2021] - I am invited to give a talk in Caltech's Young Investigator Forum. [6/2021] - I am co-organizing the Workshop on Socially Responsible Machine Learning in ICML 2021. Please submit your paper here. [12/2020] - One paper got accepted to the 35th AAAI Conference on Artificial Intelligence (AAAI). [10/2020] - I was selected to participate in EECS Rising Stars workshop. [09/2020] - One paper got accepted to the 34th Conference on Neural Information Processing Systems (NeurIPS). [07/2020] - I gave a talk at the University of Michigan-Shanghai Jiao Tong University Joint Institute. [07/2020] - We (with Swetasudha Panda and Emily Black) organized the session Fairness and bias in ML and NLP at the WiML Un-Workshop at ICML 2020. [04/2020] - I was awarded Rackham Predoctoral Fellowship. [03/2020] - One paper got accepted to 2020 American Control Conference (ACC). [02/2020] - I gave a talk on Graduation Day at Information Theory and Applications (ITA) Workshop.",
  "content_length": 4459,
  "method": "requests",
  "crawl_time": "2025-12-01 14:49:18"
}