{
  "name": "Xuesu Xiao",
  "homepage": "https://cs.gmu.edu/~xiao",
  "status": "success",
  "content": "Xuesu Xiao's Homepage Home | News | Education | Academia | Industry | Press | Publications | Teaching | Service Xuesu Xiao Assistant Professor Computer Science, George Mason University Office: Fuse 3311  Email: xiao@gmu.edu  Lab: RobotiXX In Loving Memory of News 11/2/2025: Congratulations to Haiyue Chen for winning the Best Student Presenter Award with her very first presentation at her very first academic conference! During her presentation, Haiyue ran a live robot demo on our Verti-Arena in Northen Virginia, 3000 miles / 5000 kms away across the Atlantic, from Galway, Ireland! [Paper] [Video] [Demo] [Award Certificate] 10/26/2025: Tied at 6th, Professor XX is listed among the IROS 2025 top 10 conference paper contributors overall with 13 papers! [Rank] 10/24/2025: Our paper \"Towards Human-Like Instruction Navigation in Real-World\" has won the Best Poster Award at the Human-aware Embodied AI (HEAI) Workshop at IROS 2025! [Award Certificate] 10/24/2025: Professor XX gave an invited talk, \"Learning Extreme Off-Road Mobility\", at the Workshop on Towards Resilient Navigation in the Wild at IROS 2025! 09/09/2025: Professor XX gave a TEDx talk, \"When Robots Start Learning on the Job\", at the TEDxChantilly HS event! [Recording] 06/15/2025: The RobotiXX lab will present 13 papers at IROS 2025 (12 conference and 1 RA-L)! Hope to see everyone in Hangzhou in October! [Paper 1] [Paper 2] [Paper 3] [Paper 4] [Paper 5] [Paper 6] [Paper 7] [Paper 8] [Paper 9] [Paper 10] [Paper 11] [Paper 12] [Paper 13] 05/01/2025: Professor XX receives George Mason University Presidential Award for Faculty Excellence in Research. [Award Plaque] 04/01/2025: Professor XX receives George Mason University College of Engineering and Computing 2025 Faculty Excellence Award for Research. [Award Plaque] 03/27/2025: Professor XX gave three invited talks, \"Deployable Robots that Learn\", at University of Colorado Boulder, University of Delaware, and University at Buffalo. Professor XX will also give a talk at New York University on May 6 2025. 12/01/2024: The RobotiXX lab will present three Robotics and Automation Letters (RA-L) papers at ICRA 2025! Congrats to all XX-Men and XX-Women! Thanks to all collaborators from UMD GAMMA! [Paper 1] [Paper 2] [Paper 3] ... 10/31/2024: The RobotiXX lab has presented six papers at IROS 2024! Congrats to all XX-Men and XX-Women! Thanks to all collaborators from GMU MICO, CRADL, and RAIL and UMD GAMMA! [Paper 1] [Paper 2] [Paper 3] [Paper 4] [Paper 5] [Paper 6] 10/31/2024: Professor XX gave an invited talk, \"Learning Planning and Control for Extreme Vehicle Mobility\", at the 14th Workshop on Planning, Perception and Navigation for Intelligent Vehicles in IROS 2024! [Recording] [Workshop] 09/11/2024: Our report for The 3rd BARN Challenge at ICRA 2024 is officially published in IEEE Robotics & Automation Magazine! [BARN 24 Report] [BARN 24 Website] 05/17/2024: Professor XX has been selected in the ICRA 2024 New Generation Star Project! [Certificate] 04/30/2024: Professor XX gave an invited talk, \"Learning Robot Navigation in Challenging Environments\", at Center of Excellence in Command, Control, Communications, Computing, Cyber, and Intelligence (C5I Center) 35-Year Anniversary. 04/26/2024: Professor XX gave three invited talks, \"Deployable Robots that Learn\", at Virginia Tech (National Capital Region and Blacksburg) and Worcester Polytechnic Institute. 03/29/2024: Professor XX gave an invited talk about Human-Interactive Mobile Robots at SoRAIM Winter School in Inria and University Grenoble Alpes in Grenoble, France! It was such a pleasant experience meeting European researchers in Social Robotics, Artificial Intelligence, and Multimedia in the lovely French city Grenoble! [Slides] [Recording] 02/01/2024: The RobotiXX lab will present six papers at ICRA 2024! Congrats to all XX-Men and XX-Women! Thanks to all collaborators from UT LARG and AMRL and UMD GAMMA! [Paper 1] [Paper 2] [Paper 3] [Paper 4] [Paper 5] [Paper 6] 12/21/2023: With the report on our 2nd ICRA 2023 BARN Challenge officially published in IEEE Robotics & Automation Magazine, we are launching our 3rd The BARN Challenge 2024 at ICRA 2024 again. Please reference our results and findings of the challenge last year and two years ago and participate in this year's competition! [BARN 23 Report] [BARN 22 Report] [BARN 22 Press] [BARN 24 Website] [BARN 24 Submission] [Dataset] 10/25/2023: Congratulations to XX-Men Duc (Aaron) M. Nguyen, Mohammad Nazeri, Amir Payandeh, and Aniket Datar for being nominated the 2023 AAAI Fall Symposium Artificial Intelligence for Human-Robot Interaction (AI-HRI) Best Paper Award for their paper Toward Human-Like Social Robot Navigation: A Large-Scale, Multi-Modal, Social Human Navigation Dataset! [Website] [PDF] [Video] [Dataset] [Code] [Poster] 10/03/2023: Congratulations to XX-Woman Manshi Limbu for being nominated a finalist of IROS 2023 Best Paper Award on Cognitive Robotics for her paper Team Coordination on Graphs with State-Dependent Edge Cost! [PDF] [Video] [Poster] 09/15/2023: Congratulations to XX-Man Dibyendu Das for being awarded the GMU IDIA Predoctoral Fellowship! Dibyendu will be focusing on developing motion memory techniques to leverage past planning experiences to accelerate future motion planning! 07/23/2023: We are co-organizing the CoRL 2023 Workshop on Bridging the Gap between Cognitive Science and Robot Learning in the Real World that will be held on November 6, 2023 in Atlanta GA! [Website] 07/04/2023: Working on social robot navigation and wondering how to evaluate your research? Check out our paper \"Principles and Guidelines for Evaluating Social Robot Navigation Algorithms\"! [PDF] [Website] 06/01/2023: Congratulations to the winners of The BARN Challenge at ICRA 2023 in London! [Website] [Dataset] 03/27/2023: Our Multi-Modal Social Human Navigation Dataset (MuSoHu) is available on GMU Dataverse, which contains ~50 km, 10 hours, 150 trials, 7 humans of data in the wild and allows future robots to learn socially compliant navigation from humans, natural-born experts at such a task! [Website] [PDF] [Video] [Dataset] [Code] 03/18/2023: Our XX-Man Amir and XX-Bot Go1 from the RobotiXX lab appear in ABC News Good Morning America featuring our Northern Virginia's congressman Don Beyer attending George Mason University to study AI at 72 years old! [ABC News] 03/06/2023: To empower conventional wheeled robots with capability to move through vertically challenging terrain (e.g., large boulders or fallen tree trunks), our Verti-Wheelers project is officially public! [Website] [PDF] [Video] [Datasets] [Code] 03/03/2023: Another Google AI Blog features our Performer-MPC, a 8.3M-parameter Transformer model with <10ms on-robot latency paired with Model Predictive Control, navigating robots in the real world! [Blog] [PDF] [Website] [Video] 02/14/2023: Our Performer-MPC, a 8.3M-parameter Transformer model with <10ms on-robot latency paired with Model Predictive Control, is mentioned by the Robotics@Google AI Blog! [Blog] [PDF] [Website] [Video] 12/31/2022: After a successful ICRA 2022 BARN Challenge, we are launching The BARN Challenge 2023 at ICRA 2023 again. Please reference our results and findings of the challenge last year and participate in this year's competition! [BARN 22 Report] [BARN 22 Press] [BARN 23 Website] [BARN 23 Submission] [Dataset] 10/21/2022: Professor XX will give two invited talks at two IROS 2022 workshops in Kyoto: \"Evaluating Motion Planning \"in-the-Loops\"\" at the Evaluating Motion Planning Performance workshop and \"Learning Agile Ground Maneuvers in Highly Constrained and Off-Road Conditions\" at the Agile Robotics: Perception, Learning, Planning, and Control workshop. [Workshop 1] [Workshop 2] [Tweet] 09/15/2022: Our new DynaBARN dataset, as a dynamic extension to our static BARN dataset, with 300 navigation environments with dynamic obstacles is accepted as a SSRR2021 paper and is available for use by the community. [PDF] [Website] [Dataset] [Code] 05/27/2022: Congratulations to the winners of The BARN Challenge at ICRA 2022 in Philadelphia! [PDF] [PDF w. Refs.] [Press] [Website] [Dataset] [Sign-up] [Submission] 03/01/2022: Our Socially CompliAnt Navigation Dataset (SCAND) consists of demonstrations for mobile robot social navigation collected on a wheeled and legged robot in the wild indoors and outdoors. [PDF] [Video] [Website] [Dataset] 06/01/2021: I will be joining the faculty of Department of Computer Science at George Mason University in Fall 2022 as a tenure-track Assistant Professor. Future Professor XX is recruiting Ph.D. students who are interested in robotics, motion planning, and machine learning. Drop me a line if you are interested in becoming one of the future XX-men. [Research Statement] [Hiring Flyer] 06/01/2021: I am spending some time as a roboticist at X, The Moonshot Factory (formerly Google[x]), building learning everyday robots. 05/31/2021: Recording of our ICRA 2021 Workshop \"Machine Learning for Motion Planning\" is available. [Recording] 03/24/2021: Recording of our AAAI Spring Symposium \"Machine Learning for Mobile Robot Navigation in the Wild\" is available. [Day 1] [Day 2] [Day 3] 11/06/2020: Our Benchmark for Autonomous Robot Navigation (BARN) dataset with 300 navigation environments is presented at SSRR2020 and available for use by the community. [Dataset] [PDF] [Video] [Presentation] 10/01/2020: I am on the faculty market for a tenure-track assistant professor position. Statements: [Research] [Teaching] [Diversity] [External Engagement] [References] 08/24/2020: We are organizing AAAI Spring Symposium \"Machine Learning for Mobile Robot Navigation in the Wild\" on March 22-24 2021 at Standord University in Palo Alto, CA, a 2.5-day symposium of talks, presentations, breakout sessions, and panel discussions, with actual mobile robots. Submissions are welcome. [Website] [Newsletter] Read More Education Ph.D. (Computer Science, 2019)  Texas A&M University, College Sta",
  "content_length": 45921,
  "method": "requests",
  "crawl_time": "2025-12-01 14:49:19"
}