{
  "name": "Xuetao Wei",
  "homepage": "http://cse.sustech.edu.cn/faculty/~weixt",
  "status": "success",
  "content": "Xuetao Wei Associate Professor Southern University of Science and Technology Xuetao Wei ï¼å±å­¦æ¶ï¼ Associate Professorï¼ç ç©¶åï¼, Ph.D. Advisor ï¼åå£«çå¯¼å¸ï¼ Department of Computer Science and Engineering Southern University of Science and Technology E-mail: weixt x sustech y edu y cn (where x = AT and y = DOT) Xuetao Wei has been a tenured associate professor in the department of Computer Science and Engineering, and also affiliated with Research Institute of Trustworthy Autonomous Systems, at the Southern University of Science and Technology(SUSTech) since 2019. He was an assistant professor and then promoted to associate professor with tenure at the University of Cincinnati, USA. He received his Ph.D. in Computer Science (CSRankings.org) from University of California, Riverside. He has published over 100 research papers in prestigious academic conferences and journals such as CCF-A and IEEE Transactions. His research has been supported by funding agencies such as National R&D Program(å½å®¶éç¹ç åè®¡å), NSFC(å½å®¶èªç¶ç§å­¦åºé), GD-BABRF(å¹¿ä¸çåºé), GD-DST(å¹¿ä¸çç§æå ), SZ-STI(æ·±å³å¸ç§åå±), NSF(ç¾å½å½å®¶ç§å­¦åºé) , DARPA(ç¾å½å½é²é«çº§ç ç©¶è®¡åå±) and Industry Grants(ä¼ä¸æ¨ªåé¡¹ç®). Research Interests å¸¸å¹´æèï¼äººå·¥æºè½ç­ç¸å ³èæ¯çåå£«ç/ç¡å£«ç/åå£«å/ç ç©¶å©çææ I direct the WEI Lab (We Explore Interests Lab). Currently, I focus more on developing interdisciplinary approaches to computationally solve ethics and safety problems of Artificial Intelligence. AI must do the right thing (ethics) and do it right (safety). One interesting concept: Agent Factors Engineeringï¼Aå å·¥ç¨ï¼ Agent Factors Engineering Xuetao Wei Preprint in ResearchGate, May 2025 (DOI: 10.13140/RG.2.2.16990.55362) Teaching Course List Recent Publications(Full list) Please find the source code of publications on our Lab GitHub. GeWu: A Culturally-Grounded Chinese Benchmark for Multi-Stage Social Bias Evaluation in Large Language Models. AAAI, 2026 Oral The Silent Amplifier: In-Context Examples Fuel Bias in Large Language Models. AAAI, 2026 Oral Mitigating Stereotypes in Text-to-Image Generation: A Novel Perspective of Selective Neural Suppression. ACM Multimedia, 2025 An Experimental Study on Embodiment Forms and Interaction Modes in Affective Robots for Anxiety Relief and Emotional Connection. IJHCS, 2025 LLMs Trust Humans More, That's a Problem! Unveiling and Mitigating the Authority Bias in Retrieval-Augmented Generation. ACL, 2025 The Elephant in the Room: Exploring the Role of Neutral Words in Language Model Group-Agnostic Debiasing. ACL Findings, 2025 Association of Objects May Engender Stereotypes: Mitigating Association-Engendered Stereotypes in Text-to-Image Generation. NeurIPS, 2024 Spotlight Unveiling the Bias Impact on Symmetric Moral Consistency of Large Language Models. NeurIPS, 2024 Does Egalitarian Fairness Lead to Instability? The Fairness Bounds in Stable Federated Learning Under Altruistic Behaviors. NeurIPS, 2024 Surviving in Diverse Biases: Unbiased Dataset Acquisition in Online Data Market for Fair Model Training. AIES, 2024 Anti-Matthew FL: Bridging the Performance Gap in Federated Learning to Counteract the Matthew Effect. ECAI, 2024 Boosting Fine-Grained Urban Flow Inference via Lightweight Architecture and Focalized Optimization. AAAI, 2026 Oral Renormalization Group Guided Tensor Network Structure Search AAAI, 2026 UniTraj: Learning a Universal Trajectory Foundation Model from Billion-Scale Worldwide Traces. NeurIPS, 2025 ImPart: Importance-Aware Delta-Sparsification for Improved Model Compression and Merging in LLMs. ACL, 2025 DANCE: Resource-Efficient Neural Architecture Search with Data-Aware and Continuous Adaptation. IJCAI, 2025 Learning Generalized and Flexible Trajectory Models from Omni-Semantic Supervision. KDD, 2025 Multi-task Offline Reinforcement Learning for Online Advertising in Recommender Systems. KDD, 2025 SeqAR: Jailbreak LLMs with Sequential Auto-Generated Characters. NAACL, 2025 Behavior Modeling Space Reconstruction for E-Commerce Search. TheWebConf, 2025 GARLIC: GPT-Augmented Reinforcement Learning with Intelligent Control for Vehicle Dispatching. AAAI, 2025 Oral DreaMark: Rooting Watermark in Score Distillation Sampling Generated Neural Radiance Fields . AAAI, 2025 Mesh Watermark Removal Attack and Mitigation: A Novel Perspective of Function Space. AAAI, 2025 GLINT-RU: Gated Lightweight Intelligent Recurrent Units for Sequential Recommender Systems. ACM KDD, 2025 STAR-Rec: Making Peace with Length Variance and Pattern Diversity in Sequential Recommendation. SIGIR, 2025 G3: An Effective and Adaptive Framework for Worldwide Geolocalization Using Large Multi-Modality Models. NeurIPS, 2024 Achieving Resolution-Agnostic DNN-based Image Watermarking: A Novel Perspective of Implicit Neural Representation. ACM Multimedia, 2024 Rethinking Mesh Watermark: Towards Highly Robust and Adaptable Deep 3D Mesh Watermarking. AAAI, 2024 Bi-level User Modeling for Deep Recommender Systems. IEEE ICDM, 2024 ControlTraj: Controllable Trajectory Generation with Topology-Constrained Diffusion Model. ACM KDD, 2024 Efficient and Robust Regularized Federated Recommendation. CIKM, 2024 Alumni ï¼å­¦çæ¯ä¸å»åï¼ Year 2025 Ke Mu (Ph.D. 2025, First job: Assistant Professor@Dongguan University Of Technology ä¸èçå·¥å­¦é¢) Jiashi Gao (Ph.D. 2025ï¼æé´è·å¾æ¯äºè¿ªå¥å­¦éåä¼ç§æ¯ä¸çï¼, First job: Postdoc@Hong Kong Baptist University é¦æ¸¯æµ¸ä¼å¤§å­¦) Yuchen Wang (M.S. 2025, First job: PhD@NJU åäº¬å¤§å­¦) Yuchen Jiang (M.S. 2025, First job: PhD@SJTU ä¸æµ·äº¤éå¤§å­¦) Zhipeng Zheng (M.S. 2025, First job: OPPO) Peijia Qin (B.S. 2025ï¼æ ¡åä½³æ¬ç§æ¯ä¸çï¼, First job: PhD@UCSD å å·å¤§å­¦å£å°äºå¥åæ ¡) Jiacheng Zhou (B.S. 2025, First job: PhD@SUSTech åæ¹ç§æå¤§å­¦) Songjian Dai (B.S. 2025, First job: MS@SUSTech åæ¹ç§æå¤§å­¦) Chenyi Liao (B.S. 2025, First job: MS@SUSTech åæ¹ç§æå¤§å­¦) Year 2024 Shiyao Zhang (RAP 2024, First job: Tenure-Track Assistant Professor@Great Bay University å¤§æ¹¾åºå¤§å­¦) Guanhui Ye (M.S. 2024, First job: Tencent è ¾è®¯) Zuji Zhang (B.S. 2024, First job: PhD@CUHK é¦æ¸¯ä¸­æå¤§å­¦) Jianlin Li (B.S. 2024, First job: MS@CMU å¡èåºæ¢ éå¤§å­¦) Haozhang li (B.S. 2024, First job: MS@IIE, CAS ä¸­å½ç§å­¦é¢ä¿¡æ¯å·¥ç¨ç ç©¶æ) Yuxuan Li (B.S. 2024, First job: MS@SUSTech åæ¹ç§æå¤§å­¦) Yi Lin (B.S. 2024, First job: MS@SUSTech åæ¹ç§æå¤§å­¦) Ziyi Zhou (B.S. 2024, First job: MS@SUSTech åæ¹ç§æå¤§å­¦) Lei Chen (B.S. 2024, First job: MS@SUSTech åæ¹ç§æå¤§å­¦) Year 2023 Yixuan Li (B.S. 2023, First job: MS@SUSTech åæ¹ç§æå¤§å­¦) Year 2022 Haotian Lu (B.S. 2022, First job: MS@UIUC ä¼å©è¯ºä¼å¤§å­¦åå·´çº³-é¦æ§åæ ¡) Yuchen Wang (B.S. 2022, First job: MS@SUSTech åæ¹ç§æå¤§å­¦) Dibo Xian (M.S. 2022, First job: Huawei åä¸º) Wenhui Wang (M.S. 2022, First job: Parametrix(An interesting AI startup)) Ziwei Wang (RA 2020-2022, First job, PhD@U of Birmingham ä¼¯æç¿°å¤§å­¦) Xiangyu Liu (Postdoc 2022ï¼æé´è·å¾çèªç¶éå¹´åºéåå½èªç¶éå¹´åºéï¼, First job: Associate Professor@SYLU æ²é³çå·¥å¤§å­¦ ) Year 2021 Guanhui Ye (B.S. 2021, First job: MS@SUSTech åæ¹ç§æå¤§å­¦) Xingyu Zhu (B.S. 2021, First job: PhD@HKPolyU é¦æ¸¯çå·¥å¤§å­¦) Year 2020 Qinghua Zheng (B.S. 2020, First job: Tencent è ¾è®¯) Sen wang (B.S. 2020, First job: Tencent è ¾è®¯) Weiming Zhao (B.S. 2020, First job: Tencent è ¾è®¯) Yujie Yang (B.S. 2020, First job: Huawei åä¸º) Lida Zhao (B.S. 2020, First job: MS@NTU åæ´çå·¥å¤§å­¦) Min Chen (B.S. 2020, First job: MS@SUSTech åæ¹ç§æå¤§å­¦)",
  "content_length": 7726,
  "method": "requests",
  "crawl_time": "2025-12-01 14:49:18"
}