{
  "name": "Xueyan Tang",
  "homepage": "https://www3.ntu.edu.sg/home/asxytang",
  "status": "success",
  "content": "Xueyan Tang's Homepage Xueyan Tang Associate Professor College of Computing and Data Science Nanyang Technological University Nanyang Avenue Singapore 639798 Office: N4-02a-08 Tel: (+65) 6790-5356 Fax: (+65) 6792-6559 Short Biography Xueyan Tang is currently an Associate Professor in the College of Computing and Data Science at Nanyang Technological University, Singapore. He received his Ph.D. degree in Computer Science from the Hong Kong University of Science and Technology in 2003, and his B.Eng. degree in Computer Science and Engineering from Shanghai Jiao Tong University in 1998. Prior to his undergraduate study, he received his secondary education in the No.2 Secondary School Attached to East China Normal University from 1988 to 1994. Research Interests Distributed systems, cloud computing, resource allocation. Professional Activities Associate Editor, IEEE Transactions on Cloud Computing (2021-present) Associate Editor, IEEE Transactions on Parallel and Distributed Systems (2010-2014) Program Co-Chair, ICPADS'2012, CloudCom'2014, ICDCS'2020, ICPP'2026 TPC Member, INFOCOM'2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022 TPC Member, ICDCS'2012, 2015, 2022, 2023, 2024 TPC Member, ICDE'2010, 2011 TPC Member, SPAA'2021 TPC Member, IPDPS'2024 TPC Member, CLUSTER'2024 TPC Member, SC'2025 Selected Publications Note: To download papers from the ACM Digital Library with its Author-Izer Service, please ensure that you are accessing this page at the URL of http://personal.ntu.edu.sg/asxytang/ M. Liu and X. Tang. Tight Bounds for Dynamic Bin Packing with Predictions. Proceedings of the ACM on Measurement and Analysis of Computing Systems, vol. 8, issue 3, article no. 47, pp. 1-28, December 2024. Abstract in Proceedings of the 2025 ACM SIGMETRICS / International Conference on Measurement and Modeling of Computer Systems, pp. 94-96, June 2025. H. Zhao, X. Tang, P. Chen, and S. Deng. Learning-Augmented Algorithms for the Bahncard Problem. In Proceedings of the 38th Annual Conference on Neural Information Processing Systems (NeurIPS), pp. 1-48, December 2024. T. Zuo, X. Tang, and B. S. Lee. Cost-Driven Data Replication with Predictions. In Proceedings of the 36th ACM Symposium on Parallelism in Algorithms and Architectures (SPAA), pp. 309-320, June 2024. T. Zuo, X. Tang, and B. S. Lee. A Randomized Caching Algorithm for Distributed Data Access. In Proceedings of the 43rd IEEE Conference on Computer Communications (INFOCOM), pp. 1-10, May 2024. X. He, X. Tang, W. Cai, and J. Li. A Stochastic Process Approach for Multi-agent Path Finding with Non-asymptotic Performance Guarantees. Artificial Intelligence, vol. 329, article no. 104084, pp. 1-30, April 2024. Y. Zhu, J. Tang, X. Tang, S. Wang, and A. Lim. 2-hop+ Sampling: Efficient and Effective Influence Estimation. IEEE Transactions on Knowledge and Data Engineering, vol. 35, no. 2, pp. 1088-1103, February 2023. M. Liu and X. Tang. Busy-Time Scheduling on Heterogeneous Machines: Algorithms and Analysis. IEEE Transactions on Parallel and Distributed Systems, vol. 33, no. 12, pp. 3942-3958, December 2022. M. Liu and X. Tang. Dynamic Bin Packing with Predictions. Proceedings of the ACM on Measurement and Analysis of Computing Systems, vol. 6, issue 3, article no. 45, pp. 1-24, December 2022. Abstract in Proceedings of the 2023 ACM SIGMETRICS / International Conference on Measurement and Modeling of Computer Systems, pp. 57-58, June 2023. Y. Zhu, J. Tang, and X. Tang. Optimal Price Profile for Influential Nodes in Online Social Networks. The VLDB Journal, vol. 31, no. 4, pp. 779-795, July 2022. Y. Guan and X. Tang. On Task Assignment and Scheduling for Distributed Job Execution. In Proceedings of the 22nd IEEE/ACM International Symposium on Cluster, Cloud and Internet Computing (CCGrid), pp. 726-735, May 2022. J. Tang, Y. Zhu, X. Tang, and K. Han. Distributed Influence Maximization for Large-Scale Online Social Networks. In Proceedings of the 38th IEEE International Conference on Data Engineering (ICDE), pp. 81-95, May 2022. Y. Zhu, J. Tang, X. Tang, and L. Chen. Analysis of Influence Contribution in Social Advertising. In Proceedings of the VLDB Endowment, vol. 15, no. 2, pp. 348-360, October 2021. X. Wu, Y. Liu, X. Tang, W. Cai, F. Bai, G. Khonstantine, and G. Zhao. Multi-Agent Pickup and Delivery with Task Deadlines. In Proceedings of the 20th IEEE/WIC/ACM International Conference on Web Intelligence and Intelligent Agent Technology (WI-IAT), pp. 360-367, December 2021. R. Ren and X. Tang. Generalized Skyline Interval Coloring and Dynamic Geometric Bin Packing Problems. In Proceedings of the 50th International Conference on Parallel Processing (ICPP), article no. 52, pp. 1-10, August 2021. [Presentation] M. Liu and X. Tang. Analysis of Busy-Time Scheduling on Heterogeneous Machines. In Proceedings of the 33rd ACM Symposium on Parallelism in Algorithms and Architectures (SPAA), pp. 340-350, July 2021. [Presentation] J. Tang, X. Tang, A. Lim, K. Han, C. Li, and J. Yuan. Revisiting Modified Greedy Algorithm for Monotone Submodular Maximization with a Knapsack Constraint. Proceedings of the ACM on Measurement and Analysis of Computing Systems, vol. 5, issue 1, article no. 08, pp. 1-22, March 2021. Abstract in Proceedings of the 2021 ACM SIGMETRICS / International Conference on Measurement and Modeling of Computer Systems, pp. 63-64, May 2021. Y. Li, C. Zhao, X. Tang, W. Cai, X. Liu, G. Wang, and X. Gong. Towards Minimizing Resource Usage with QoS Guarantee in Cloud Gaming. IEEE Transactions on Parallel and Distributed Systems, vol. 32, no. 2, pp. 426-440, February 2021. R. Ren, Y. Zhu, C. Li, and X. Tang. Interval Job Scheduling with Machine Launch Cost. IEEE Transactions on Parallel and Distributed Systems, vol. 31, no. 12, pp. 2776-2788, December 2020. Y. Zhu, J. Tang, and X. Tang. Pricing Influential Nodes in Online Social Networks. In Proceedings of the VLDB Endowment, vol. 13, no. 10, pp. 1614-1627, June 2020. R. Ren and X. Tang. Busy-Time Scheduling on Heterogeneous Machines. In Proceedings of the 34th IEEE International Parallel and Distributed Processing Symposium (IPDPS), pp. 306-315, May 2020. C. Li and X. Tang. On Fault-Tolerant Bin Packing for Online Resource Allocation. IEEE Transactions on Parallel and Distributed Systems, vol. 31, no. 4, pp. 817-829, April 2020. Y. Li, X. Tang, W. Cai, J. Tong, X. Liu, and G. Wang. Resource-Efficient Index Shard Replication in Large Scale Search Engines. IEEE Transactions on Parallel and Distributed Systems, vol. 30, no. 12, pp. 2820-2835, December 2019. Y. Guan, C. Li, and X. Tang. On Max-min Fair Resource Allocation for Distributed Job Execution. In Proceedings of the 48th International Conference on Parallel Processing (ICPP), article no. 55, pp. 1-10, August 2019. M. M. Tan, R. Ren, and X. Tang. Cloud Scheduling with Discrete Charging Units. IEEE Transactions on Parallel and Distributed Systems, vol. 30, no. 7, pp. 1541-1551, July 2019. J. Tang, K. Huang, X. Xiao, L. V. S. Lakshmanan, X. Tang, A. Sun, and A. Lim. Efficient Approximation Algorithms for Adaptive Seed Minimization. In Proceedings of the 2019 ACM SIGMOD International Conference on Management of Data (SIGMOD), pp. 1096-1113, July 2019. Y. Li, C. Shan, R. Chen, X. Tang, W. Cai, S. Tang, X. Liu, G. Wang, X. Gong, and Y. Zhang. GAugur: Quantifying Performance Interference of Colocated Games for Improving Resource Utilization in Cloud Gaming. In Proceedings of the 28th ACM International Symposium on High-Performance Parallel and Distributed Computing (HPDC), pp. 231-242, June 2019. Y. Li, Y. Deng, X. Tang, W. Cai, X. Liu, and G. Wang. Cost-Efficient Server Provisioning for Cloud Gaming. ACM Transactions on Multimedia Computing, Communications, and Applications, vol. 14, issue 3s, article no. 55, pp. 1-22, August 2018. Y. Li, X. Tang, W. Cai, J. Tong, X. Liu, G. Wang, C. Gao, X. Cao, G. Geng, and M. Li. Index Shard Replication Strategies for Improving Resource Utilization in Large Scale Search Engines. In Proceedings of the 47th International Conference on Parallel Processing (ICPP), article no. 84, pp. 1-10, August 2018. J. Tang, X. Tang, and J. Yuan. Profit Maximization for Viral Marketing in Online Social Networks: Algorithms and Analysis. IEEE Transactions on Knowledge and Data Engineering, vol. 30, no. 6, pp. 1095-1108, June 2018. J. Tang, X. Tang, X. Xiao, and J. Yuan. Online Processing Algorithms for Influence Maximization. In Proceedings of the 2018 ACM SIGMOD International Conference on Management of Data (SIGMOD), pp. 991-1005, June 2018. Y. Deng, Y. Li, R. Seet, X. Tang, and W. Cai. The Server Allocation Problem for Session-based Multiplayer Cloud Gaming. IEEE Transactions on Multimedia, vol. 20, no. 5, pp. 1233-1245, May 2018. J. Tang, X. Tang, and J. Yuan. Traffic-Optimized Data Placement for Social Media. IEEE Transactions on Multimedia, vol. 20, no. 4, pp. 1008-1023, April 2018. J. Tang, X. Tang, and J. Yuan. Towards Profit Maximization for Online Social Network Providers. In Proceedings of the 37th IEEE Conference on Computer Communications (INFOCOM), pp. 1178-1186, April 2018. [Full Version] Y. Li, Y. Deng, X. Tang, W. Cai, X. Liu, and G. Wang. On Server Provisioning for Cloud Gaming. In Proceedings of the 25th ACM International Conference on Multimedia (MM), pp. 492-500, October 2017. J. Tang, X. Tang, and J. Yuan. Influence Maximization Meets Efficiency and Effectiveness: A Hop-Based Approach. In Proceedings of the 9th IEEE/ACM International Conference on Advances in Social Networks Analysis and Mining (ASONAM), pp. 64-71, August 2017. [Full Version] R. Ren and X. Tang. Online Flexible Job Scheduling for Minimum Span. In Proceedings of the 29th ACM Symposium on Parallelism in Algorithms and Architectures (SPAA), pp. 55-66, July 2017. C. Li and X. Tang. Brief Announcement: Towards Fault-Tolerant Bin Packing for Online Cloud Resource Allocation. In Proceedings of the 29th ACM Symposium on Parallelism in Algorithms and Architecture",
  "content_length": 22675,
  "method": "requests",
  "crawl_time": "2025-12-01 14:49:18"
}