{
  "name": "Xuhui Fan 0001",
  "homepage": "https://xuhuifan.github.io",
  "status": "success",
  "content": "Xuhui Fan menu Home Publication Activities Xuhui Fan Lecturer (eq. to Assistant Professor) in Artificial Intelligence, School of Computing, Macquarie University Email: XUHUI.FAN [@] MQ [DOT] EDU [DOT] AU Github, Google Scholar About me I am currently a Lecturer (eq. to Assistant Professor) in the School of Computing at the Macquarie University. Before that, I worked as a lecturer in the School of Information and Physical Sciences at the University of Newcastle, as a postdoctoral fellow in the School of Mathematics and Statistics at the University of New South Wales, and at Data61, CSIRO. My Ph.D degree is obtained at the University of Technology, Sydney on May, 2015. Prior to coming to Australia, I received my Bachelor degree in Mathematical Statistics from the University of Science and Technology of China in 2010. Research Scholarship Opportunities I am looking for highly motivated and focused students with strong backgrounds or interests in Generative AI and large language models. Available Opportunities: Demestic Research Scholarship Round (PhD & MRes) — Deadline: 31 October 2025 International Research Scholarship Round (PhD & Master by Research) — Deadline: January 2026 International Road to Research Scholarship (Master by Research) — Deadline: 31 October 2025 China Scholarship Council (CSC) – PhD Studentships - Deadline: 16 January 2026 Visiting Studentships and Research Internships Research themes Generative AI is my current research focus. I am leading the Macquarie Generative AI research group. Also, I have extensive research experience in: Gaussian Processes Deep Generative Models Variational Inference methods Stochastic Point Processes Bayesian Nonparametric Space Partitions Markov chain Monte Carlo methods Representative Publications Hui Chen, Xuhui Fan, Hengyu Liu, Yaqiong Li, Zhilin Zhao, Feng Zhou, Christopher John Quinn, Longbing Cao “Federated Neural Nonparametric Point Processes”. Artificial Intelligence (AI). Xuhui Fan, Bin Li, Prosha A. Rahman, Scott A. Sisson “Data-Dependent Rectangular Bounding Processes”. IEEE Transaction on Pattern Analysis and Machine Intelligence (T-PAMI). Zhangkai Wu, Xuhui Fan*, Hongyu Wu, Longbing Cao “SCoT: Unifying Consistency Models and Rectified Flows via Straight-Consistent Trajectories”. The 39th Conference on Neural Information Processing Systems (NeurIPS-25). Yididiya Y. Nadew, Xuhui Fan, Christopher J. Quinn. “Conditionally-Conjugate Gaussian Process Factor Analysis for Spike Count Data via Data Augmentation”. The 41st International Conference on Machine Learning (ICML-24). Xuhui Fan, Edwin V. Bonilla, Terence J. O'Kane, Scott A. Sisson. “Free-Form Variational Inference for Gaussian Process State-Space Models”. The 40th International Conference on Machine Learning (ICML-23) Code. Xuhui Fan, Yaqiong Li, Ling Chen, Bin Li, Scott A. Sisson. “Hawkes processes with stochastic exogenous effects for continuous-time interaction modelling”. IEEE Transaction on Pattern Analysis and Machine Intelligence (T-PAMI) Code. Xuhui Fan, Bin Li, Feng Zhou, Scott A. Sisson. “Continuous-Time Edge Modelling using Non-Parametric Point Processes”. The 35th Conference on Neural Information Processing Systems (NeurIPS-21) Code. Xuhui Fan, Bin Li, Yaqiong Li, Scott A. Sisson. “Poisson-Randomised DirBN: Large Mutation is Needed in Dirichlet Belief Networks”. The 38th International Conference on Machine Learning (ICML-21) Code. Xuhui Fan, Bin Li, Scott A. Sisson. “Online Binary Space Partitioning Forests”. The 23rd International Conference on Artificial Intelligence and Statistics (AISTATS-20) Code. Xuhui Fan, Bin Li, Scott A. Sisson, Caoyuan Li, Ling Chen. “Scalable Deep Generative Relational Models with High-Order Node Dependence”. The 33rd Conference on Neural Information Processing Systems (NeurIPS-19) Code. Xuhui Fan, Bin Li, Scott A. Sisson. “Binary Space Partitioning Forests”. The 22nd International Conference on Artificial Intelligence and Statistics (AISTATS- 19) Code. Xuhui Fan, Bin Li, Scott A. Sisson. “Rectangular Bounding Process”. The 32nd Conference on Neural Information Processing Systems (NeurIPS-18) Code. Xuhui Fan, Bin Li, Scott A. Sisson. “The Binary Space Partitioning-Tree process”. The 21st International Conference on Artificial Intelligence and Statistics (AISTATS- 18) Code.",
  "content_length": 4300,
  "method": "requests",
  "crawl_time": "2025-12-01 14:49:19"
}