{
  "name": "Xumin Liu",
  "homepage": "https://www.cs.rit.edu/people/faculty/xl",
  "status": "success",
  "content": "Department of Computer Science | Golisano College of Computing and Information Sciences | RIT RIT Logo with Text Department of Computer Science Department of Computer Science Contact Student Services Office GOL-3005 585-475-2995 cs-dept@rit.edu Overview The computer science program provides students with a broad and deep foundation in theory and modern software and hardware concepts as well as introduces students to numerous programming languages and paradigms. Students have an opportunity to engage in significant programming and software development work, learning to innovate as well as invent new technologies, and we also offer students opportunities to collaborate on both traditional and applied research. In addition to required computer science courses, students have an opportunity to take electives in areas such as architecture and operating systems, computer graphics and visualization, data management, distributed systems, artificial intelligence, languages and tools, security, and theory. We take immense pride in shaping the next generation of leaders in computer science and are dedicated to advancing the field through cutting-edge research and excellence in education. from the Department Chair Department Chair Dukka KC A Note from the Department Chair Welcome to the Department of Computer Science at RIT (CS@RIT)! With over 50 faculty and staff and more than 1,550 students, our department is a vibrant hub of innovation and learning. We take immense pride in shaping the next generation of leaders in computer science and are dedicated to advancing the field through cutting-edge research and excellence in education. This is an exhilarating time for CS@RIT as we undergo significant growth—not only in our student recruitment, retention, and graduation rates, but also in faculty and research initiatives. In addition to strengthening core Computer Science areas, we are enhancing offerings in AI-related disciplines by expanding faculty, developing new curricula, and positioning CS@RIT at the forefront of AI research. Our commitment to interdisciplinary research drives us to build robust collaborations within RIT and beyond, fostering advancements that span multiple domains. This dedication is reflected in our program rankings: our Bachelor’s in Computer Science is ranked 54th, our Master’s in Computer Science is ranked 71st by U.S. News & World Report, and the Ph.D. program in Computing and Information Sciences stands at 56th according to CSRankings. At CS@RIT, we are excited about the future and invite current and prospective students, alumni, colleagues, stakeholders to connect and engage with us. Join us as we explore new opportunities and contribute to the ever-evolving field of computer science. Go Tigers! Computer Science Webinar CS Overview Video FAQs - Hear from our students Why CS@RIT? How was the transition to college? Women in CS What advice would you give to incoming freshmen? Campus and student life Minoring Research in CS@RIT Coursework AP Transfer Credit What should you do over the summer to prepare for RIT? What is the best part of being a CS student? Housing Co-op Latest News November 24, 2025 RIT partners with Gallaudet University to launch research traineeship program in Universal AI RIT is teaming up with Gallaudet University to prepare the next generation of artificial intelligence (AI) researchers and practitioners who will develop AI for everyone. November 20, 2025 Cross-disciplinary collaborations lead to growth for double-major students From satellite debris to artificial intelligence, double major students find research success by combining expertise in computer science and economics. November 19, 2025 Manifesting quantum: How RIT researchers are navigating the next frontier of physics RIT researchers are zeroing in on quantum photonics, the creation, control, and detection of light. Photonics has long been a specialty of the university. RIT led the team that developed the first quantum photonic wafer, which is key to the future of mass-produced quantum communication systems. February 9, 2024 Congratulations to our 2024 Computer Science Scholarship award winners! Computer Science Department is pleased to announce the winners of our annual scholarships. Several students majoring in Computer Science have been awarded scholarships ranging from $800 to $3,000 for remarkable academic achievement and making significant contributions to the Department. March 17, 2023 CS@RIT hosts regional programming competition CS@RIT recently hosted regional competitors of the International Collegiate Programming Contest (ICPC), with 84 registered teams from 19 universities competing. The top four universities will advance to the North America Championship, from which the top teams will advance to the World Finals. Two RIT teams performed well, placing 13th and 17th overall. The contest involves teams of up to three students solving problems within five hours, using a single computer. October 3, 2022 CS@RIT Hiring in Computer Vision The Department of Computer Science at the Rochester Institute of Technology invites applications for a full-time tenure-track assistant professor position in the area of computer vision. More News Featured Work and Profiles Coding Meets Capital: RIT Co-op Student Innovates in Financial Tech Startup Ben McManus, a fifth-year computer science student, gained firsthand experience in automation and IT in his co-op at Indivisible Partners, a national startup finance company. Read More about Coding Meets Capital: RIT Co-op Student Innovates in Financial Tech Startup Co-op Program Leads Student to NASA Opportunity Conor Gagliardi ‘25 secured a prestigious co-op at NASA's Lyndon B. Johnson Space Center where he programs autonomous rovers and contributes to NASA’s SUITS Challenge framework. Read More about Co-op Program Leads Student to NASA Opportunity RIT Alumnus Named to Forbes 30 Under 30 for Gaming Innovation Through the company that he co-founded while in college, McDonald is now making it easier for millions of people to play and explore in the video game Minecraft. Read More about RIT Alumnus Named to Forbes 30 Under 30 for Gaming Innovation Exploding Kittens Game Created by RIT Alumnus Debuts on Netflix Read More about Exploding Kittens Game Created by RIT Alumnus Debuts on Netflix 2024 Fulbright Scholar: Joseph Casale Casale, a double major in computational mathematics and computer science, will travel back to Malaysia to analyze aerial hyperspectral imagery to map trees species in Taman Negara... Read More about 2024 Fulbright Scholar: Joseph Casale Student researchers pave the way for human-centered AI advances Student summer researchers work to build a mobile app for interactive machine learning and visualization tool to verify data in support of human-centered models. Read More about Student researchers pave the way for human-centered AI advances Previous Next Explore All Faculty Thomas Borrelli Principal Lecturer Abeer Ahmad Lecturer Scott Johnson Senior Lecturer View Department Directory Affiliated Faculty Staff Jason Harrison Staff Assistant Lucieann Condino Stollery Staff Assistant Jennifer Burt Manager Student Services View Department Directory Undergraduate Programs The Bachelor of Science in computer science program provides students with a solid background in foundational computer science, as well as in-depth knowledge in specialized areas. Students are exposed to programming and software developmental work, as well as traditional and applied research. Combined with mandatory co-ops, the program prepares students for exciting careers.  Check out the Five Years Curriculum at a Glance. View Undergraduate Student Resources Computer Science BS (Accelerated dual degree available) Specialize in AI, robotics, cybersecurity, graphics, and more with RIT’s flexible and powerful computer science degree. Learn more about the Computer Science BS program Graduate Programs The Master of Science in computer science program admits students with varying backgrounds and prepares them for exciting careers in computing. The program includes foundational and advanced courses, electives and a capstone project. Students have the opportunity to specialize in such areas as artificial intelligence, data science, distributed systems, languages and tools, security, and theory. View Graduate Student Resources Cognitive Science Ph.D. Explore the human mind through psychology, neuroscience, AR, and more in RIT’s interdisciplinary Ph.D. This degree program is offered jointly between the College of Liberal Arts, the Kate Gleason College of Engineering, the Golisano College of Computing and Information Sciences, the College of Science, and the National Technical Institute for the Deaf. Learn more about the Cognitive Science Ph.D. program Computing and Information Sciences Ph.D. Earn a Ph.D. in computing from RIT. Conduct advanced research with expert faculty and explore challenges in and beyond computing. Learn more about the Computing and Information Sciences Ph.D. program Computer Science MS Specialize in AI, data, and graphics in this dynamic, future-focused computer science degree. Learn more about the Computer Science MS program Artificial Intelligence in Computer Science Adv. Cert. Advance your understanding of artificial intelligence in computer science by learning to implement AI to solve a range of problems in business, computing, engineering, and more. Learn more about the Artificial Intelligence in Computer Science Adv. Cert. program Big Data Analytics Adv. Cert. A big data certificate that will develop your expertise in managing, analyzing big data. Learn more about the Big Data Analytics Adv. Cert. program Minors and Immersions Artificial Intelligence Minor Learn more about the Artificial Intelligence Minor program Computer Science Minor Explore an in-depth study of programming or sample selected theoretical or applied areas within the computer science field. At least two of the four el",
  "content_length": 25837,
  "method": "requests",
  "crawl_time": "2025-12-01 14:49:21"
}