{
  "name": "Xun Cao",
  "homepage": "https://cite.nju.edu.cn/People/Faculty/20190621/i5054.html",
  "status": "success",
  "content": "Xun Cao, Professor Xun Cao, Professor Professor Lab for Computational Imaging Technology and Engineering (CITE) School of Electronic Science and Engineering, Nanjing University Email: caoxun@nju.edu.cn Phone: 025-89681091 Bio     Xun Cao received his Ph.D. degree from the department of Automation, Tsinghua University, Beijing, China. He has been a visiting researcher at Philips Research, Aachen, Germany in 2008 and Microsoft Research Asia, in 2009 and 2010, and a visiting scholar at The University of Texas at Austin from 2010 to 2011, he joined the School of Electronic Science and Engineering, Nanjing University from 2012.    Prof. Cao’s research interests include Image Based Modeling and Rendering, 2D-to-3D Conversion and Computational Photography. He developed the CMVS algorithm together with Dr. Yebin Liu, which was Ranked No.1 according to the Middlebury vision evaluation. His 2D-to-3D conversion algorithm has been applied in the commercial software “Roxio Creator”, which has a major market share in the North America. Prof. Cao also developed one of the first spectral video camera – PMVIS (Prism-mask Modulation Video Imaging Spectrometer), which is able to capture spectral information at video rates. Currently, the CITE Lab mainly focus on three kinds of Computational Cameras: Spectral video camera; 3D capture and reconstruction system; Gigapixel camera. Research InterestsSpectral Video Acquisition2D-to-3D Conversion, Image-based Modeling and RenderingNano-Scale Gigapixel ImagingPlease refer to publicationsAcademic ServicesConference Chair:  -- General Co-Chair, SPIE Optical Instrument and Technology (OIT'2019),    -- General Chair, SPIE Optical Instrument and Technology (OIT'2017):      Optoelectronic Imaging/Spectroscopy and Signal Processing Technology  -- Area Chair, IEEE Computer Vision and Pattern Recognition (CVPR'2021),   -- Area Chair, International Conference on 3D Vision (3DV'2020)Program Committee Member:  -- ICCV/ACCV/CVPR/ECCV, 2011 - Now  -- IEEE IC3D, 2011 - Now  -- IEEE IVMSP, 2011 - Now  -- China Society of Image and Graphics, 3D Imaging Professional Committee, 2011 - NowEditor and Reviewer:  -- IEEE Transactions on Circuits and Systems for Video Technology (CSVT), Associate Editor, 2021 - Now  -- IEEE Signal Processing Letters (SPL), Associate Editor, 2020 - Now  -- Frontiers of Computer Science (SCI), Young Associate Editor, 2013 - 2015  -- Wiley Publishing Inc, 2011 - Now  -- IEEE Transactions on Computational Imaging (T-CI), 2011 - Now  -- IEEE Transactions on Pattern Analysis and Machine Intelligence (T-PAMI), 2011 - Now  -- IEEE Transactions on Circuits and Systems for Video Technology (T-CSVT), 2011 - Now  -- IEEE Transactions on Image Processing (T-IP), 2011 - Now  -- IEEE Transactions on Visualization and Computer Graphics (T-VCG), 2011 - Now  -- IEEE Transactions on Broadcasting, 2011 - Now  -- Journal of Visual Communication and Image Representation, 2011 - Now  -- SIGGRAPH / SIGGRAPH ASIA(ACM Transactions on Graphics, TOG), 2011 - Now  -- Light: Science & Applications, 2011 - Now  -- Optics Express / Optics Letters, 2011 - NowLinksLab for Computational Imaging Technology and EngineeringSchool of Electronic Science and Technology, Nanjing UniversityBBNC Lab of Tsinghua University",
  "content_length": 3271,
  "method": "requests",
  "crawl_time": "2025-12-01 14:49:19"
}