{
  "name": "Xusheng Xiao",
  "homepage": "https://xusheng-xiao.github.io",
  "status": "success",
  "content": "RISE Lab@ASU - Xusheng Xiao Xusheng XiaoAssociate Professor Arizona State University Follow BYENG 428 +1-480-965-3199 xusheng.xiao@asu.edu Google Scholar DBLP ORCIDDr. Xusheng Xiao is leading the Reliable, Intelligent, Secure, and Efficient (RISE) Software and System lab at ASU. His general research interests span between software engineering and computer security, with the emphasis on AI-enhanced software and system analysis approaches that synergistically combine software analysis and artificial intelligence to improve the reliability and the security of software and computer systems. Specifically, his lab is working on the research in Large Language Model (LLM) enhanced software analysis, mobile app analysis, cyber threat detection and investigation, blockchain/smart contract security, and software testing and debugging. His research in cyber threat investigation has been integrated into a security product in NEC, which won the Grand Prix award at CEATEC Award 2016. His lab developed HyperService, the first interoperability blockchain platform with programmability and strong security guarantees, presented in IEEE Blockchain Cleveland and Blockland Solutions Conference. His research in mobile app security produced a static analysis technique that was deployed in Microsoft Research for two years and was granted a US patent. His collaboration with industry partners has resulted in 6 US patents.PositionsI am always looking for PhD students and interns with strong background in SE, Security, or ML. Please apply to ASU SCAI by Dec. 31th (PhD only), and/or send me an email (with your CV). [Read more]ServicesASE 2025 NIER Co-Chair, IEEE S&P 2025, ICSE 2025, ISSTA 2025, FSE 2025News10/2025: Congratulations to my student Fei Shao and my collaborators! Our paper “ProGQL: A Provenance Graph Query System for Cyber Attack Investigation” has been accepted in ICDE 2026!9/2025: Congratulations to my student Zichen Liu! Our paper “AppBDS: LLM-Powered Description Synthesis for Sensitive Behaviors in Mobile Apps” has been accepted in ASE 2025!8/2025: Congratulations to my student Shang Ma and my collaborators! Our paper “PsyScam: A Benchmark for Psychological Techniques in Real-World Scams” has been accepted in EMNLP 2025!8/2025: We have received API credits from the OpenAI Cybersecurity Grant Program! Thank you, OpenAI!7/2025: We have received a grant from TensorBlock to support our collaboration on Forge! What an exciting product to unify the access to various LLMs!1/2025: Congratulations to my collaborators! Our paper “Privacy and Accuracy-Aware AI/ML Model Deduplication” has been accepted to SIGMOD 2025!8/2024: Congratulations to my student Shang Ma and my collaborators! Our paper “Careful About What App Promotion Ads Recommend! Detecting and Explaining Malware Promotion via App Promotion Graph” has been accepted in NDSS 2025!7/2024: Our application for the OpenAI Researcher Access Program has been accepted! Thank you, OpenAI!7/2024: Congratulations to my student Liangyi Huang! Our paper “CTIKG: LLM-Powered Knowledge Graph Construction from Cyber Threat Intelligence” has been accepted in COLM 2024! Check out our project website for more details!6/2024: Congratulations to my student Pengcheng Fang and my collaborators! Our paper “vFix: Facilitating Software Maintenance of Smart Contracts via Automatically Fixing Vulnerabilities” has been accepted in ICSME 2024! Check out our project website for more details!5/2024: Congratulations to my student Shang Ma and my collaborators! Our paper “Completing the App Promotion Graph with Symbolic Prompting” has been accepted in ECML PKDD 2024!12/2023: Congratulations to my collaborators! Our paper “MalCertain: Enhancing Deep Neural Network Based Android Malware Detection by Tackling Prediction Uncertainty” has been accepted to ICSE 2024!8/2023: Congratulations to my student Fei Shao and my collaborators! Our paper “NODLINK: An Online System for Fine-Grained APT Attack Detection and Investigation” has been accepted in the NDSS 2024!8/2023: Congratulations to my collaborators! Our paper “WeMinT: Tainting Sensitive Data Leaks in WeChat Mini-Programs” has been accepted in the ASE 2023!5/2023: Congratulations to my student Liangyi Huang and my collaborators! Our paper “Are we there yet? An Industrial Viewpoint on Provenance-based Endpoint Detection and Response Tools” has been accepted in CCS 2023!5/2023: Congratulations to my student Pengcheng Fang and my collaborators! Our paper “iSyn: Semi-Automated Smart Contract Synthesis from Legal Financial Agreements” has been accepted in ISSTA 2023!5/2023: Congratulations to my collaborators! Our paper “On the Security Risks of Knowledge Graph Reasoning” has been accepted in the USENIX Security 2023!More…BiographyXusheng Xiao is an Associate Professor in the School of Computing and Augmented Intelligence at Arizona State University. He got his Ph.D. in June 2014 from the Department of Computer Science at North Carolina State University, under the supervision of Prof. Tao Xie and Prof. Laurie Williams. From Feb 2017 to August 2022, he was an Assistant Professor in the Department of Computer and Data Sciences at Case Western Reserve University (CWRU). From July 2014 to Feb 2017, he worked as a researcher in the system security group at NEC Labs America. He is a recipient of NSF CAREER Award, NSF CRII Award, Samsung GRO Award, and the 2021 Case School of Engineering Faculty Research Award at CWRU. His research has been supported by NSF, DOE-ARPA-E, and Samsung.",
  "content_length": 5522,
  "method": "requests",
  "crawl_time": "2025-12-01 14:49:21"
}