{
  "name": "Xuyu Wang",
  "homepage": "https://users.cs.fiu.edu/~xuywang",
  "status": "success",
  "content": "Xuyu Wang's Homepage Home Research Publications Teaching Group Hornors Services Useful Links Wireless Data Xuyu Wang Assistant Professor Knight Foundation School of Computing and Information Sciences Florida International University Contact Information Email: xuywang@fiu.edu Office: CASE 388 Mailing Address: 11200 SW 8th Street, CASE 388, Miami, FL 33199, USA Google Scholar : Citation = 7784, H-index=37 Brief Biography Dr. Xuyu Wang is an Assistant Professor in the Knight Foundation School of Computing and Information Sciences at Florida International University. Before joining FIU, he was an Assistant Professor in the Department of Computer Science at California State University, Sacramento. He received his Ph.D. from the Department of Electrical and Computer Engineering at Auburn University in 2018. His research interests include wireless sensing, trustworthy AI, generative AI, Internet of Things, smart health, wireless localization, wireless networks, quantum machine learning, and IoT security. He received the NSF CRII Award in 2021. He was a co-recipient of the ACM FAcct 2023 Best Paper Award, the 2022 Best Journal Paper Award of IEEE ComSoc eHealth Technical Committee, the IEEE INFOCOM 2022 Best Demo Award, the IEEE ICC 2022 Best Paper Award, the IEEE Vehicular Technology Society 2020 Jack Neubauer Memorial Award, the IEEE GLOBECOM 2019 Best Paper Award, the IEEE ComSoc MMTC Best Journal Paper Award in 2018, the IEEE PIMRC 2017 Best Student Paper Award, and the IEEE SECON 2017 Best Demo Award. He was also selected in the 2020-2025 Stanford's list of World Top 2% scientists. Dr. Xuyu Wang was invited to organize AI health tutorials at CVPR 2020, ICC 2022, CVPR 2022-2025, a special session at IEEE BHI 2021, and give a keynote speech at CVPM 2020. He is an editor of Elsevier Book titled \"Contactless Vital Signs Monitoring\". He is also an associate editor of IEEE Transactions on Mobile Computing, and a guest editor of ACM Transactions on Sensor Networks. He is also a co-chair of IEEE INFOCOM 2023-2026 Workshop on Deep Learning for Wireless Communications, Sensing, and Security (DeepWireless), a TPC co-chair of IEEE ICC/GLOBECOM 2024-2026 Workshop on Machine Learning and Deep Learning for Wireless Security, a symposium co-chair of AI and Machine Learning for Communications and Networking (AMCN) in ICNC 2025-2026, a tutorials co-chair of IEEE CCNC 2024, a workshop co-chair of IEEE Healthcom 2024, a demo/posters co-chair of IEEE Healthcom 2026, a publicity co-chair of IEEE/ACM CHASE 2023, an EDAS and Publications Co-chair of IEEE MILCOM 2025, and a co-chair of IEEE/ACM CHASE 2025 Workshop on Generative AI for Smart and Connected Health: Innovations, Challenges, and Applications. RA Positions Available (Starting Spring 2026 and Fall 2026) I am looking for highly self-motivated graduate students (PhD students and Master students) and undergraduate students who are interested in (i)trustworthy AI (e.g., robustness, privacy, explainability, fairness, and generalization), generative AI, LLM, federated learning, edge AI, and multimodal AI in wireless, smart health, digital twins, HCI, drone, LEO satellite, and other IoT systems; (ii)AI-driven next-generation wireless and sensing systems by using SDR devices (e.g., USRP), RFID, mmWave, Wi-Fi, FPGA, or PCB hardware; (iii)AI-driven IoT security and privacy in device fingerprinting, wireless sensing/localization, LEO satellite, smart speaker, autonomous car/drone/robot, and AR/VR/MR in 2025-2030 year. If you are interested, please send me an email with your CV and transcripts. News 2025.11   Our LLM-based vulnerability detection paper titled \"Revisiting Pre-trained Language Models for Vulnerability Detection,\" will appear in Proc. ACM ASIACCS 2026, Bangalore, India from 1-5 June 2026. Acceptance rate: 33/260=12.7%. (Note: accepted without changes) 2025.11   Our quantum ML for robust RF sensing paper titled \"Hybrid quantum-classical convolutional neural network for robust RF sensing,” will appear in IEEE ICNC 2026. Acceptance rate: 27%. 2025.11   Our star graph neural networks for mmWave sensing paper titled “Exploring Spatial-Temporal Representation via Star Graph for mmWave Radar-based Human Activity Recognition,” will appear in IEEE Transactions on Mobile Computing, 2025. 2025.10   Our trustworthy AI for RF fingerprinting paper titled “Unveiling the Threat: Data-Free Backdoor Attacks on Pre-Trained Models for RF Fingerprinting,” will appear in IEEE Transactions on Mobile Computing, 2025. Congratulations, my fourth-year PhD student, Tianya Zhao. 2025.10   I am invited to serve as a TPC of IEEE ICCCN 2026. Please consider submitting your papers. 2025.09   I am invited to serve as a TPC of IEEE ICC 2026. Please consider submitting your papers. 2025.09   I attended NSF PI Meeting of the Computer Systems Research (CSR) Program at Florida Atlantic University. 2025.09   I am selected in the 2025 Stanford's list of World Top 2% scientists. 2025.08   Our FDA-driven LLM for network traffic prediction paper titled “FDALLM+: A Functional Data Analysis-Driven Large Language Model Framework for Network Traffic Prediction,” will appear in IEEE Internet of Things Journal, 2025. 2025.08   Our FDA-driven LLM for RFID sensing and localization paper titled \"Functional Data Analysis-Guided Prompt Design for RFID Sensing and Localization Using LLMs,” will appear in IEEE GLOBECOM 2025. 2025.07   Our three trustworthy and generative AI-driven wireless system papers will appear in Proc. IEEE MASS 2025, Chicago, USA in Oct. 2025. The title of the first paper is \"An Efficient and Explainable KAN Framework for Wireless Radiation Field Prediction\", the title of the second paper is \"Data-Free Backdoor Attacks on Self-Supervised Human Activity Recognition Models\", and the title of the third paper is \"RFID-Based Vital Sign Monitoring Under Motion Using Physics-Informed Generative Models\". Congratulations, my PhD students, Tianya Zhao, Jingzhou Shen, and Yiting Wang. Jingzhou Shen also received NSF student travel grant. 2025.07 I attended an NSF Broadening Participation in Computing (BPC) workshop at Auburn University from July 1 to July 3. The workshop will involve more than 10 REU students and one wireless spectrum project. 2025.06   Our LLM for traffic data prediction paper titled \"FDALLM: Traffic Data Prediction with Functional Data Analysis and Large Language Models,” will appear in IEEE ICC 2025. 2025.06   Our large-scale indoor localization paper titled “Large-Scale Indoor Localization via Outdoor Crowdsourcing Trajectories on Ride-Hailing Platform,” will appear in ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies (IMWUT), Vol. 9, No. 2, Article 66. Publication date: June 2025. 2025.06   I am invited to serve as a TPC co-chair of IEEE GLOBECOM 2025 Workshop on Machine Learning and Deep Learning for Wireless Security, Taipei, Taiwan in Dec. 2025. Please consider submitting your papers. 2025.06  I co-orgnized a tutorial at CVPR 2025 on June 12 about \"Intelligent Healthcare based on Cameras and Wireless Sensors\" and gave a talk about \"Wireless-based Vital Sign Monitoring and Activity Monitoring\". 2025.05   I am invited to serve as a symposium co-chair of AI and Machine Learning for Communications and Networking (AMCN) in ICNC 2026. Please consider submitting your papers. 2025.04   Our trustworthy AI for wireless sensing paper titled “Evasion attacks and countermeasures in deep learning-based Wi-Fi gesture recognition,” will appear in IEEE Transactions on Mobile Computing, 2025. 2025.03   Our trustworthy AI for RF fingerprinting paper titled “Explanation-Guided Backdoor Attacks Against Model-Agnostic RF Fingerprinting Systems,” will appear in IEEE Transactions on Mobile Computing, 2025. Congratulations, my third-year PhD student, Tianya Zhao. 2025.03   Our quantum contrastive learning for HAR paper titled “Quantum contrastive learning for human activity recognition,” will appear in Elsevier Smart Health Journal, 2025. 2025.03   I am invited to serve as an EDAS and Publications Co-chair of IEEE MILCOM 2025. Please consider submitting your papers. 2025.02   Our AI-driven wireless sensing for healthcare paper titled “Artificial Intelligence-Driven Wireless Sensing for Health Management,” will appear in Bioengineering, 2025. 2025.02   Master student, Luis Lago Enamorado, joined FIU AIoT Lab in Spring 2025. He will work on wireless measurements and 6G ISAC under the support by NSF CNS grant. 2025.01   Our quantum machine learning paper titled “Wireless Sensing in Artificial Intelligence of Things: A General Quantum Machine Learning Framework,” will appear in IEEE Network, 2025. 2025.01   Our trustworthy AI-driven wireless and IoT sensing system paper titled \"Membership Inference Against Self-supervised IMU Sensing Applications \" will appear in Proc. IEEE ACM SenSys 2025, Irvine, CA in May 2025. Acceptance rate: 46/245=18.8%. Congratulations, my third-year PhD student, Tianya Zhao. 2025.01   I am invited to serve as a co-chair of IEEE/ACM CHASE 2025 Workshop on Generative AI for Smart and Connected Health: Innovations, Challenges, and Applications, Manhattan, New York City, June 2025. Please consider submitting your papers. 2025.01 I am invited to serve as an associate editor of IEEE Transactions on Mobile Computing. 2024.12   Our two trustworthy AI-driven wireless system papers will appear in Proc. IEEE INFOCOM 2025, London, UK in May 2025. The title of the first paper is \"Protocol-agnostic and Data-free Backdoor Attacks on Pre-trained Models in RF Fingerprinting\", and the title of the second paper is \"Privacy-Preserving Wi-Fi Data Generation via Differential Privacy in Diffusion Models\". Acceptance rate: 272/1458=18.6%. Congratulations, my third-year PhD student, Tianya Zhao and second-year PhD student, Ningning Wang. 2024.10   I am invited to serve as a co-chair of IEEE INFOCOM 2025 Workshop on Deep Learning for Wireless Communications, Sensing, and Security (DeepWireless), London, Unit",
  "content_length": 33123,
  "method": "requests",
  "crawl_time": "2025-12-01 14:49:22"
}