{
  "name": "Xuyun Zhang",
  "homepage": "https://researchers.mq.edu.au/en/persons/xuyun-zhang",
  "status": "success",
  "content": "Xuyun Zhang - Macquarie University View Scopus Profile Xuyun Zhang Associate Professor, Dr Associate Professor, School of Computing https://orcid.org/0000-0001-7353-4159 Emailxuyun.zhangmq.eduau h-index 8746 Citations 52 h-index Calculated based on number of publications stored in Pure and citations from Scopus 20092025 Research activity per year Personal profile BiographyDr Xuyun Zhang is currently working as a Associate Professor in School of Computing at Macquarie University in Australia. Research interestsHe is a mid-career researcher with an international track record of research in areas including scalable and secure machine learning, big data privacy and cyber security, big data mining and analytics, cloud/edge/service computing and IoT, etc.TeachingMachine Learning Application in Cybersecurity Data Science Machine Learning Applied Cryptography Test-Driven Software Development Software Engineering Education/Academic qualificationComputer and Information Science, PhD, University of Technology Sydney1 Aug 2011 → 20 Nov 2014Award Date: 20 Nov 2014Computer and Science and Technology, Master of Engineering, Nanjing University1 Sept 2008 → 20 Jun 2011Award Date: 20 Jun 2011Computer Science and Technology, Bachelor of Science, Nanjing University1 Sept 2004 → 20 Jun 2008Award Date: 20 Jun 2008 Fingerprint Dive into the research topics where Xuyun Zhang is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 12 Similar Profiles Edge Computing Computer Science 100% Big Data Computer Science 76% Privacy Preservation Computer Science 72% Cloud Computing Computer Science 72% Service Recommendation Computer Science 66% Privacy Preserving Computer Science 62% Quality of Service Computer Science 60% Internet-Of-Things Computer Science 59% View full fingerprint Projects Projects per year 2016 2021 2022 2023 2028 3 Active 7 Finished Projects per year Next-Gen Banking: Towards Customized and Personalized Banking Solutions through Generative AI TechnologiesBeheshti, A. (Primary Chief Investigator), Wu, J. (Chief Investigator), Zhang, X. (Chief Investigator), Qi, Y. (Chief Investigator), Xue, E. (Chief Investigator) & Alinejad Rokny, H. (Chief Investigator)1/07/24 → 30/06/28Project: Research Intelligent Storytelling with Business DataBeheshti, A. (Primary Chief Investigator), Sheng, M. (Chief Investigator), Wu, J. (Chief Investigator), Yang, J. (Chief Investigator), Zhang, X. (Chief Investigator), Alinejad Rokny, H. (Chief Investigator) & Asghari, P. (Partner Investigator)3/11/22 → 1/01/27Project: Research Scalable and Extensible Document intelligence PlatformBeheshti, A. (Primary Chief Investigator), Zhang, X. (Chief Investigator), Mans, B. (Chief Investigator), Wu, J. (Chief Investigator), Liu, G. (Chief Investigator), Sheng, M. (Chief Investigator), Yang, J. (Chief Investigator), Asadnia, M. (Chief Investigator), Ghezelbash, D. (Chief Investigator) & Simpson, M. (Other)14/10/22 → 1/01/27Project: Research Linking Cognitive Science and Data Science for Enhanced Therapeutic InterventionsBeheshti, A. (Primary Chief Investigator), Afzoon, S. (PhD Student), Zhang, X. (Chief Investigator), Xue, E. (Chief Investigator), Wu, J. (Chief Investigator), Liu, G. (Chief Investigator) & McMahon, J. (Partner Investigator)15/12/23 → 15/12/24Project: Research MQBS-e61RPS: Measuring and Monitoring Australian Household Financial Distress in Real TimeLiao, Y. (Primary Chief Investigator), Bu, D. (Primary Chief Investigator), Haliassos, M. (Primary Chief Investigator), Pagel, M. (Primary Chief Investigator), Zhang, X. (Chief Investigator), La Cava, G. (Primary Chief Investigator) & Garvin, N. (Chief Investigator)10/08/23 → 10/08/24Project: Research View all 10 projects Research Outputs Research output per year 2009 2019 2020 2021 2022 2023 2024 2025 127 Conference proceeding contribution 112 Article 15 Editorial 3 Edited Book/Anthology 11 More 3 Conference abstract 3 Conference paper 2 Chapter 1 Entry for encyclopedia/dictionary/reference book 1 Foreword/postscript/introduction 1 Doctoral Thesis Research output per year Research output per year Advanced Data Mining and Applications: 20th International Conference, ADMA 2024, Sydney, NSW, Australia, December 3–5, 2024, proceedings, part IIZ. Sheng, Q. (Editor), Dobbie, G. (Editor), Jiang, J. (Editor), Zhang, X. (Editor), Zhang, W. E. (Editor), Manolopoulos, Y. (Editor), Wu, J. (Editor), Mansoor, W. (Editor) & Ma, C. (Editor), 2025, Singapore: Springer, Springer Nature. 432 p. (Lecture Notes in Computer Science; vol. 15388)Research output: Book/Report › Edited Book/Anthology › peer-review CETN: contrast-enhanced through network for click-through rate predictionLi, H., Sang, L., Zhang , Y., Zhang, X. & Zhang, Y., Jan 2025, In: ACM Transactions on Information Systems. 43, 1, p. 1-34 34 p., 4.Research output: Contribution to journal › Article › peer-review Feature Interaction 100% Recommender System 14% Information Retrieval 14% Prediction Model 14% Parallel Structure 14% 3 Citations (Scopus) Incomplete multi-view multi-label classification via diffusion-guided redundancy removalOu, S., Xue, Z., Qin, L., Li, Y., Liang, M., Wu, J., Zhang, X., Beheshti, A. & Qi, Y., 2025, In: Proceedings of the AAAI Conference on Artificial Intelligence. 39, 18, p. 19758-19766 9 p.Research output: Contribution to journal › Conference paper › peer-review Multi-Label Classification 100% Diffusion Model 66% Classification Task 33% Data Distribution 33% Difficulty Level 33% Integrated resource allocation for sequential task offloading in edge computingTeng, M., Li, X., Zhang, X., Bu, Y., Zhu, K., Mahmood, A., Wu, J. & Sheng, Q. Z., 2025, In: IEEE Transactions on Services Computing. 18, 4, p. 2115-2128 14 p.Research output: Contribution to journal › Article › peer-review Resource Allocation 100% Task Offloading 100% Edge Computing 100% Network Resource 50% Energy Consumption 50% PrefaceSheng, Q. Z., Dobbie, G., Jiang, J., Zhang, X., Zhang, W. E., Manolopoulos, Y., Wu, J., Mansoor, W. & Ma, C., 2025, Advanced Data Mining and Applications: 20th International Conference, ADMA 2024, Sydney, NSW, Australia, December 3–5, 2024, proceedings, part III. Sheng, Q. Z., Dobbie, G., Jiang, J., Zhang, X., Zhang, W. E., Manolopoulos, Y., Wu, J., Mansoor, W. & Ma, C. (eds.). Singapore: Springer, Springer Nature, p. v-vi 2 p. (Lecture Notes in Computer Science; vol. 15389).Research output: Chapter in Book/Report/Conference proceeding › Conference proceeding contribution › peer-review View all 268 research outputs Prizes Chancellor's Award for Best PhD ThesisZhang, X. (Recipient), 2015Prize Chinese Government Award for Outstanding Self-Financed Student Abroad Zhang, X. (Recipient), 2012Prize Tuition Fee 100% Chinese 100% Chinese Government 100% China 50% Administrative Structure 50% CSIRO Top-Up Scholarship Zhang, X. (Recipient), 2011Prize Early-Career Research Excellence Award (ECREA)Zhang, X. (Recipient), 2019Prize IRS Scholarship Zhang, X. (Recipient), 2011Prize Activities Activities per year 2017 2017 2019 5 Organising a conference, workshop or event series Activities per year 9th EAI International Conference on Cloud ComputingZhang, X. (Organiser)4 Dec 2019 → 5 Dec 2019Activity: Participating in or organising an event › Organising a conference, workshop or event series The 11th International Conference on Mobile Computing and Ubiquitous NetworkingZhang, X. (Chair)2018Activity: Participating in or organising an event › Organising a conference, workshop or event series The 15th Australasian Information Security ConferenceZhang, X. (Chair)2017Activity: Participating in or organising an event › Organising a conference, workshop or event series The 9th International Symposium on Cyberspace Safety and SecurityZhang, X. (Chair)2017Activity: Participating in or organising an event › Organising a conference, workshop or event series 8th International Conference on Applications and Techniques in Information Security, ATIS 2017Zhang, X. (Chair)2017Activity: Participating in or organising an event › Organising a conference, workshop or event series",
  "content_length": 8115,
  "method": "requests",
  "crawl_time": "2025-12-01 14:49:24"
}