{
  "name": "Y. Annie Liu",
  "homepage": "http://www3.cs.stonybrook.edu/~liu",
  "status": "success",
  "content": "Yanhong Annie Liu Yanhong Annie Liu Y. Annie Liu, Professor Computer Science Department, Room 237 Stony Brook University Stony Brook, New York 11794-2424, USA +1 631-632-8463,  fax: 631-632-8334 liu@cs.stonybrook.edu https://www.cs.stonybrook.edu/~liu Ph.D., Cornell University, 1996 (CV) Home Research Interests Publications Software Projects Overview Courses Others Research Interests My primary research interests are in the areas of programming languages, compilers, and software systems. I am particularly interested in general and systematic methods for improving computation efficiency and software productivity. This includes (1) program analysis and transformation techniques for incremental computation and for parallel and concurrent computation, (2) applications in optimizing compilers, language-based interactive systems, real-time and reactive systems, algorithm design, program development, and software maintenance, and (3) supporting tools and user interfaces that allow convenient and efficient implementation of program analyses and transformations and facilitate their applications. My major research project, Incrementalization for Efficiency Improvement, together with derived projects, mainly on program dependence analysis and time and space analysis, encompasses all three aspects above. I have strong other interests in database management, semantic web, distributed systems, and security. These include, in particular, query languages and query optimization, incremental view maintenance, intelligent information retrieval, property detection for distributed systems, systematic approaches for fault-tolerance, information flow analysis, and access control and trust management frameworks. I have also worked on uncertainty reasoning and expert systems. Selected Publications copyright [a more complete list] [DBLP] [Google Scholar] ¶ Y. A. Liu and S. D. Stoller. From Datalog Rules to Efficient Programs with Time and Space Guarantees. ACM Transactions on Programming Languages and Systems (TOPLAS), 31(6)1-38, August 2009. (at ACM |pdf) An earlier version appeared in Proceedings of the 5th ACM SIGPLAN International Conference on Principles and Practice of Declarative Programming (PPDP), 2003. (at ACM |ps.gz |pdf) ¶ Y. A. Liu, S. D. Stoller, N. Li, and T. Rothamel. Optimizing aggregate array computations in loops. ACM Transactions on Programming Languages and Systems (TOPLAS), 27(1):91-125, January 2005. (at ACM |pdf) An earlier version appeared as Liu and Stoller, Loop optimization for aggregate array computations, in Proceedings of the 1998 IEEE International Conference on Computer Languages (ICCL). (at IEEE |abstract |ps.gz |pdf |slides.ps.gz) ¶ Y. A. Liu and S. D. Stoller. Dynamic programming via static incrementalization. Higher-Order and Symbolic Computation (HOSC), 16(1-2):37-62, March-June 2003. Special issue in memory of Bob Paige. (at Springer |ps.gz |pdf) An earlier version appeared in Proceedings of the 8th European Symposium on Programming (ESOP), 1999. (at Springer |abstract |ps.gz |pdf |slides.ps.gz) ¶ Y. A. Liu and S. D. Stoller. Eliminating dead code on recursive data. Science of Computer Programming (SCP), 47(2-3):221-242, May-June 2003. (at Elsevier |ps.gz |pdf) An earlier version appeared in Proceedings of the 6th International Static Analysis Symposium (SAS), 1999. (at Springer |abstract |ps.gz |pdf) ¶ Y. A. Liu and G. Gomez. Automatic accurate cost-bound analysis for high-level languages. IEEE Transactions on Computers (TC), 50(12):1295-1390, December 2001. (at IEEE |ps.gz |pdf) An earlier version appeared as Automatic accurate time-bound analysis for high-level languages, in Proceedings of the ACM SIGPLAN Workshop on Languages, Compilers, and Tools for Embedded Systems (LCTES), 1998. (at Springer |ps.gz |pdf) ¶ Y. A. Liu, S. D. Stoller, and T. Teitelbaum. Strengthening invariants for efficient computation. Science of Computer Programming (SCP), 41(2):139-172, October 2001. (at Elsevier |ps.gz |pdf) An earlier version appeared as Discovering auxiliary information for incremental computation, in Conference Record of the 23rd Annual ACM Symposium on Principles of Programming Languages (POPL), 1996. (at ACM |ps.gz |pdf) ¶ Y. A. Liu, S. D. Stoller, and T. Teitelbaum. Static caching for incremental computation. ACM Transactions on Programming Languages and Systems (TOPLAS), 20(3):546-585, May 1998. (at ACM |ps.gz |pdf) An earlier version appeared as Liu and Teitelbaum, Caching intermediate results for program improvement, in Proceedings of the ACM SIGPLAN Symposium on Partial Evaluation and Semantics-Based Program Manipulation (PEPM), 1995. (at ACM |ps.gz |pdf) ¶ Y. A. Liu and T. Teitelbaum. Systematic derivation of incremental programs. Science of Computer Programming (SCP), 24(1):1-39, February 1995. (at Elsevier |ps.gz |pdf) Some recent technical reports: ¶ From clarity to efficiency for distributed algorithms (LSLG-OOPSLA 12) (pdf) ¶ High-level executable specifications of distributed algorithms (LSL-SSS 12) (pdf) ¶ More efficient Datalog queries: Subsumptive tabling beats magic sets (TL-SIGMOD 11) (pdf) ¶ Precise complexity analysis for efficient Datalog queries (TL-PPDP 10) (pdf) ¶ Graph queries through Datalog optimizations (TGL-PPDP 10) (pdf) ¶ Composing transformations for instrumentation and incrementalization (GLSR-PEPM 12) (pdf) ¶ Alias analysis for optimization of dynamic languages (GLSRT-DLS 10) (pdf) ¶ A language and framework for invariant-driven transformations (LGS-GPCE 09) (pdf) ¶ Model checking linearizability via refinement (LCLS-FM 09) (pdf) ¶ From Datalog rules to efficient programs with time and space guarantees (LS-TOPLAS 09) (pdf) ¶ Generating incremental implementations of object-set queries (RL-GPCE 08) (pdf) ¶ Analysis and transformations for efficient query-based debugging (GTRSL-SCAM 08) (pdf) ¶ Generating specialized rules and programs for demand-driven analysis (THL-AMAST 08) (pdf) ¶ Efficient runtime invariant checking: A framework and case study (GRLS-WODA 08) (pdf) ¶ Efficient trust management policy analysis from rules (HTL-PPDP 07) (pdf) ¶ Efficient implementation of tuple pattern based retrieval (RL-PEPM 07) (pdf) ¶ Generating optimized code from SCR specifications (RLHL-LCTES 06) (pdf) ¶ Efficient type inference for secure information flow (HRLS-PLAS 06) (pdf) ¶ Core role-based access control: efficient implementations by transformations (LWGRCZZ-PEPM 06) (pdf) ¶ Role-based access control: a corrected and simplified specification (LS-ONR book 07) (slightly revised: pdf) ¶ Improved algorithm complexities for linear temporal logic model checking of pushdown systems (HL-VMCAI 06) (pdf) ¶ Querying complex graphs (LS-PADL 06) (pdf) ¶ Incrementalization across object abstraction (LSGRL-OOPSLA 05) (pdf) ¶ Parametric regular path queries (LRYSH-PLDI 04) (ps.gz |pdf) ¶ Iterate, incrementalize, and implement: A systematic approach to efficiency improvement and guarantees (Liu-ICC 03, abstract for an invited talk) (ps.gz |pdf) ¶ Optimizing Ackermann's function by incrementalization (LS-PEPM 03) (ps.gz |pdf) ¶ Optimized live heap bound analysis (USL-VMCAI 03) (ps.gz |pdf) ¶ A systematic incrementalization technique and its application to hardware design (JLZ-STTT 03) (ps.gz |pdf) ¶ Solving regular path queries (LY-MPC 02) (ps.gz |pdf) ¶ Program optimization using indexed and recursive data structures (LS-PEPM 02) (ps.gz |pdf) ¶ Automatic time-bound analysis for a higher-order language (GL-PEPM 02) (ps.gz |pdf) ¶ Automated software engineering using concurrent class machines (GLSSY-ASE 01) (ps.gz |pdf) ¶ Solving regular tree grammar based constraints (LLS-SAS 01) (ps.gz |pdf) ¶ Automatic live memory analysis for garbage-collected languages (USL-LCTES 01) (ps.gz |pdf) ¶ From recursion to iteration: what are the optimizations? (LS-PEPM 00) (ps.gz |pdf |slides.ps.gz) ¶ Efficiency by incrementalization: an introduction (Liu-HOSC 00) (ps.gz |pdf) Software Systems copyright ¶ DistAlgo. A language for distributed algorithms. Stony Brook University, 2010-. ¶ InvTL/InvTS. An invariant-driven program transformation language and system. SUNY Stony Brook, 2005-. ¶ A system for generating efficient implementations from Datalog rules. SUNY Stony Brook, 2003-. ¶ MultiRunner and MultiQuery. Assistants for traversing links and answering queries on the Web. SUNY Stony Brook, 2001-2006. ¶ ALPA. An automatic language-based performance analysis system that generates accurate worst-case time and space given bounds on input sizes. Indiana University and SUNY Stony Brook, 1997-2006. ¶ CACHET continued. A program transformation system for drastic program optimization based on automated incrementalization and powerful program analysis. Indiana University, 1997-2000. ¶ CACHET. An incremental-attribution-based interactive system that uses systematic program analysis and transformation techniques to derive efficient incremental programs. Cornell University, 1993-1996. ¶ OGGEB. An expert system for evaluation of oil and gas generation in basins, with interfaces to several graphical tools for geochemical analysis. Research Institute of Petroleum Exploration and Development (CD-RIED) and Tsinghua University, 1988-1990. Research Project: Incrementalization for Efficiency Improvement [some MS projects] Pervasive, intensive, and critical computations today require computer software to be highly efficient and reliable. Studies on this topic span almost all branches of computer science but have been relatively isolated in each area. The goal of our work has been to bring all techniques together in order to develop general systematic approaches and supporting tools for improving the efficiency of computations and facilitating the assurance of their correctness. This has involved exploring program analysis and transformation techniques and domain-specific knowledge for incrementalization. Incrementalization transforms batch programs into efficient and correct incremental programs that exploit (1) the result of,",
  "content_length": 20945,
  "method": "requests",
  "crawl_time": "2025-12-01 14:49:22"
}