{
  "name": "Ya-Ping Lin",
  "homepage": "http://csee.hnu.edu.cn/people/linyaping",
  "status": "success",
  "content": "林亚平-湖大信息科学与工程学院 教师登录 English 返回首页 学院概况 学院简介 学院领导 师资力量 机构设置 决策机构 教学单位 计算机科学系 软件工程系 通信工程系 信息工程系 计算机工程系 网络空间安全系 实验中心 基础教学部 研究机构 特色学院 条件装备 办事机构 人才培养 本科培养 研究生培养 博士生培养 留学生培养 学科专业方向 科学研究 科研项目 科研成果 成果转化 学术信息 工作流程 招生就业 本科招生 硕士招生 博士招生 学生就业 实习就业基地 学生工作 学生动态 学生党建 团学工作 日常管理 心理健康 奖励工作 社团组织 党群工作 党建工作 工会工作 关工委工作 学术资源 资源管理系统 精品课程 实验仪器设备 林亚平 我的位置在： 首页 > 学院概况 > 师资力量 > 林亚平 教师介绍 林亚平：教授，博士生导师。1982年获湖南大学授予的学士学位、1985年获国防科技大学授予的硕士学位、2000年获湖南大学授予的博士学位。2004年-2005年在美国Texas大学Arlington分校访问研究。长期从事计算机科学与技术和软件工程教学与科研工作。主要研究方向包括计算机网络、云安全和机器学习。 中文名： 林亚平 英文名： 学历： 博士 职称： 教授 联系电话： 电子邮件： 研究方向： 计算机网络、云安全和机器学习 联系地址： 湖南省长沙市岳麓区麓山南路2号,湖南大学信息科学与工程学院（410082） 所属机构： 软件工程系 可信计算与网络省重点实验室 学院教师 更多介绍 近年来，主持国家自然科学基金项目3项，国家863项目1项，中国移动-教育部重点项目1项,参与国家科技计划重大项目1项。在国内外重要期刊（包括IEEE 顶级会议和顶级期刊）发表论文200多篇次。已培养博士、硕士研究生100余人。获授权发明专利8项，软件著作权11项。曾获湖南省科技进步奖、湖南省教学成果二等奖。讲授计算机网络、传感器网络等课程。曾主持“基于WEB的软件工程”国家双语课程、 “面向企业需求的“做中学”软件人才培养模式创新实验区”等国家级教学质量工程建设项目。代表性科研项目：1 社交外包服务的隐私保护和可验证机制研究,（国家自然科学基金，编号：61872131）经费：60万2 面向云存储的多源数据安全查询机制和算法研究（国家自然科学基金，编号：61472125）经费：80万3 两层结构传感器网络中的安全查询机制研究（国家自然科学基金，编号：61173038）经费：80万4 传感器网络中不依赖MAC认证的虚假数据过滤机制研究（国家自然科学基金，编号：60973031）经费：56万5 异步无线传感器网络环境下的数据压缩关键技术（国家863专题项目，编号：2206A）经费：51万6 于手机传感器的用户身份识别方案研究与实现（教育部－中国移动科研基金，编号：MCM20122061）经费：100万 代表性论文 1 W.ZHANG, Y.LIN*, S.XIAO, J.WU, S.ZHOU, Privacy Preserving Ranked Multi-Keyword Search for Multiple Data Owners in Cloud Computing, IEEE TRANSACTIONS ON COMPUTERS (CCF A类期刊), 2015, 65（5）：1566-15772 J. ZHANG, Y.LIN*, Y. Lyu, G. Qu, A PUF-FSM Binding Scheme for FPGA IP Protection and Pay-per-Device Licensing, IEEE TRANSACTIONS ON INFORMATION FORENSICS AND SECURITY (CCF A 类期刊), 2015, 10(6):1137-11503 X.YAO, R.ZHANG, Y.ZHANG, Y.LIN, Verifiable Social Data Outsourcing, INFOCOM 2017，1-9 (CCF A类会议 ）4 Y.Yi, R.Li, F.Chen, A.Liu, Y.lin, A Digital Watermarking Approach to Secure and Precise Range Query Processing in Sensor Networks,  The 32nd IEEE INFOCOM Conference, 2013, Turin, ITALY, In: Proc. IEEE INFOCOM:1950-1958 (CCF A 类会议)5 Yao, Xin; Chen, Yimin; Zhang, Rui; Zhang, Yanchao; Lin, Yaping, Beware of What You Share: Inferring User Locations inVenmo, IEEE Internet of Things Journal, (中科院SCI一区, 影响因子5.86) DOI: 10.1109/JIOT.2018.2844218 6 张伟, 林亚平, 吴杰, 周婷, Inference Attack-Resistant E-Healthcare Cloud System with Fine-Grained Access Control, IEEE Transactions on Services Computing, （CCF B类, SCI 二区）DOI10.1109/TSC.2018.27909437 XC.ZHAO, YP. LIN*, Janne Heikkila , \"Dynamic Texture Recognition Using Volume Local Binary Count Patterns with an Application to 2D Face Spoofing Detection\". IEEE TRANSACTIONS ON MULTIMEDIA, 2018, 20(3):552-566, (CCF B类, 中科院SCI二区）8 H.Lin, Y.LIN*, J.Yu, Z.Te g. J.Yu, L.Wang, Weighing Fusion Method for Truck Scales Based on Prior Knowledge and Neural Network Ensembles, IEEE TRANSACTION ON INSTRUMENTATION and MEASUREMENT, 2014, 63(2):250-25969 W.ZHANG, Y.LIN*, Catch You if You Misbehave: Ranked KeywordSearch Results Verification in Cloud Computing, IEEE TRANSACTION ON CLOUD COMPUTING, DOI:10.1109/tcc.2015.248138910 J. ZHANG, Y.LIN*, G QU, Reconfigurable PUF-FSM Binding against FPGA ReplayAttacks,  ACM Transactions on DesignAutomation of Electronic Systems , 2015 , 20(2) : 3011 S.ZHANG,Q.ZHANG,S.XIAO,T.ZHU,Y.GU,Y.LIN, Cooperative Data Reduction in Wireless Sensor Network, ACM Transactions on Embedded Computing Systems, 2015,14(4), 84, DOI: http://dx.doi.org/10.1145/2786755 (CCF B 类期刊)12 祝团飞, 林亚平, 刘永和, Synthetic minorityoversampling technique for multiclass imbalance problems, Pattern Recognition, 2017, 72: 327-340 （CCF B类, 中科院分区二区)13 姚鑫, 林亚平等, A Secure Hierarchical Deduplication System in Cloud Storage, In Quality of Service (IWQoS), 2016 IEEE/ACM 24th International Symposium on, pp. 1-10. IEEE,  2016. CCF B类会议14 张吉良, 林亚平等, 基于混沌的公开可验证IP水印检测方案, 中国科学：信息科学, 2013,  43: 1096–111015 李睿, 林亚平, 易叶青, 胡玉鹏, 两层传感器网络中隐私与完整性保护的范围查询协议, 计算机学报, 2013, 36（6）：1194-120916 曾玮妮, 林亚平, 余建平, 王雷.传感器网络中基于随机混淆的组密钥管理机制. 软件学报, 2013, 24(4):873-886 个人专栏 http://ss.hnu.cn/Lnml/Page/Prof.Lin.aspx 湖大官网 湖大微信 湖大微博 版权所有©湖南大学2017          湖南大学党委宣传部          地址：湖南省长沙市岳麓区麓山南路麓山门          邮编：410082          Email：xiaoban@hnu.edu.cn          域名备案信息：[www.hnu.edu.cn,www.hnu.cn/湘ICP备05000239号]          [hnu.cn 湘教QS3-200503-000481 hnu.edu.cn 湘教QS4-201312-010059]",
  "content_length": 4193,
  "method": "requests",
  "crawl_time": "2025-12-01 14:49:23"
}