{
  "name": "Ya Zhang 0002",
  "homepage": "https://mediabrain.sjtu.edu.cn/yazhang",
  "status": "success",
  "content": "Ya Zhang – MediaBrain Skip to content Ya Zhang (张娅) , Ph.D Cooperative Medianet Innovation Center未来媒体网络协同创新中心Shanghai Jiao Tong University上海交通大学Email: ya_zhang at sjtu.edu.cnWeb: https://mediabrain.sjtu.edu.cn/yazhang/[Curriculum Vitae] No. 5 EIEE Building East 303A800 Dongchuan Rd. MinhangShanghai, 200240, ChinaTEL: +86-21-34205012FAX: +86-21-34204155 Bio Ya Zhang is currently a Professor in Cooperative Medianet Innovation Center, Shanghai Jiao Tong University, and chief AI scientist of State Key Laboratory of UHD video and audio production and presentation. Her research interest is mainly on machine learning with applications to multimedia and healthcare. Dr. Zhang holds a PhD degree in Information Sciences and Technology from Pennsylvania State University and a Bachelor’s degree from Tsinghua University in China. Before joining Shanghai Jiao Tong University, Dr. Zhang was a research manager at Yahoo! Labs, where she leaded a R&D team of researchers with strong background in data mining and machine learning to improve the web search quality of Yahoo international markets. Prior to joining Yahoo, Dr. Zhang was an assistant professor at University of Kansas with research focus on machine learning applications in bioinformatics and information retrieval. Dr. Zhang published more than 100 refereed papers in prestigious international conferences and journals including TPAMI, TIP, TNNLS, ICDM, CVPR, ICCV, ECCV, and ECML. She currently holds 5 US patents and 14 China patents. She is appointed as the Chief Expert for a 863 project by Ministry of science and technology of China. She was selected as a young star of science and technology in Shanghai, won several best paper awards of international journals and conferences, and directed one Outstanding Doctorate Dissertations awarded by Chinese Association for Artificial Intelligence. Publications Books: L. Cao, H. Motoda, J. Srivastava, E.-P. Lim, I. King, P. S.Yu, W. Nejdl, G. Xu, G. Li, Y. Zhang (Eds.). Behavior and Social Computing. Springer. International Workshop on Behavior and Social Informatics, BSI 2013, Gold Coast, Australia, April 14-17, and International Workshop on Behavior and Social Informatics and Computing, BSIC 2013, Beijing, China, August 3-9, 2013. Refereed Journal Papers: C. Huang, Q. Xu, Y. Wang, Y. Wang, Y. Zhang, “Self-Supervised Masking for Unsupervised Anomaly Detection and Localization“, IEEE Transactions on Multimedia, accepted. X. Chen, Y. Zhang*, I. Tsang, Y. Pan, J. Su, “Towards Equivalent Transformation of User Preferences in Cross Domain Recommendation“, ACM Transactions on Information Systems (TOIS), accepted. M. Li, S. Chen*, Y. Shen, G. Liu, I. Tsang, Y. Zhang*, “Online Multi-Agent Forecasting with Interpretable Collaborative Graph Neural Networks“, IEEE Transactions on Neural Networks and Learning Systems, accepted. M. Li, S. Chen, Y. Shen, G. Liu, I. Tsang, Y. Zhang, “Online Multi-Agent Forecasting with Interpretable Collaborative Graph Neural Networks“, IEEE Transactions on Neural Networks and Learning Systems, accepted. J. Liu, Y. Zhao, S. Chen, Y. Zhang*, “A 3D Mesh-Based Lifting-and-Projection Network for Human Pose Transfer“, IEEE Transactions on Multimedia, accepted. M. Li, S. Chen*, X. Chen, Y. Zhang*, Y. Wang, Q. Tian, “Symbiotic Graph Neural Networks for 3D Skeleton-based Human Action Recognition and Motion Prediction“, IEEE Transactions on Pattern Analysis and Machine Intelligence, accepted. P. Zhao, L. Xie, Y. Zhang*, Q. Tian, “Actionness-guided Transformer for Anchor-free Temporal Action Localization“, IEEE Signal Processing Letters, 29:194-198, 2022. F. Ye, C. Huang, J. Cao, M. Li, Y. Zhang*, C. Lu, “Attribute Restoration Framework for Anomaly Detection“, IEEE Transactions on Multimedia, 24:116-127, 2022. X. Chen, S. Chen, J. Yao, H. Zheng, Y. Zhang*, I. Tsang, “Learning on Attribute-Missing Graphs“, IEEE Transactions on Pattern Analysis and Machine Intelligence, 44(2):740-757, 2022. M. Li, S. Chen, Y. Zhao, Y. Zhang, Y. Wang, Q. Tian, “Multiscale Spatio-Temporal Graph Neural Networks for 3D Skeleton-Based Motion Prediction“, IEEE Transactions on Image Processing, 30:7760-7775, 2021. S. Feng, B. Liu, Y. Zhang*, X. Zhang, Y. Li, “Two-Stream Compare and Contrast Network for Vertebral Compression Fracture Diagnosis“, IEEE Transactions on Medical Imaging, 40(9):2496-2506, 2021. C. Ma, Q. Xu, X. Wang, B. Jin, X. Zhang, Y. Wang, Y. Zhang*, “Boundary-aware Supervoxel-level Iteratively Refined Interactive 3D Image Segmentation with Multi-agent Reinforcement Learning“, IEEE Transactions on Medical Imaging, 40(10):2563-2574, 2021. P. Zhao, L. Xie, Y. Zhang*, Q. Tian, “Universal-to-Specific Framework for Complex Action Recognition“, IEEE Transactions on Multimedia, 23:3441-3453, 2021. X. Chen, J. Yao, M. Li, Y. Zhang*, Y. Wang, “Decoupled Variational Embedding for Signed Directed Networks“, ACM Transactions on the Web, 15(1), Article 3 (October 2020), 31 pages. Y. Zhang, Y. Zhang*, “Learning Robust Shape-based Features for Domain Generalization“, IEEE Access, 8:63748-63756, 2020. Z. Tan, Y. Zhang*, W. Hu, “Online Prediction of Video Popularity in OVSs: A Video Age-Sensitive Model With Beyond Views Features“, IEEE Transactions on Broadcasting, 66(2):241-250, 2020. Y. Zhang, Y. Zhang*, W. Cai, “A Unified Framework for Generalizable Style Transfer: Style and Content Separation“, IEEE Transactions on Image Processing, 29(1):4085-4098, 2020. J. Yao, J. Wang, I. W. Tsang*, Y. Zhang*, J. Sun, C. Zhang, R. Zhang, “Deep Learning from Noisy Image Labels with Quality Embedding“, IEEE Transactions on Image Processing, 28(4):1909-1922, 2019. Z. Tan, Y. Zhang*, “Predicting the Top-N popular videos via a cross-domain hybrid model“, IEEE Transactions on Multimedia, 21(1):147-156, 2019. Z. Chen, Z. Xu, Y. Zhang*, X. Gu, “Query-free Clothing Retrieval via Implicit Relevance Feedback“, IEEE Transactions on Multimedia, 20(8):2126-2137, 2018. Z. Xu, S. Huang, Y. Zhang*, D. Tao*, “Webly-Supervised Fine-Grained Visual Categorization via Deep Domain Adaptation“, IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI), 40(5): 1100-1113, 2018. J. Yao, Y. Wang*, Y. Zhang*, J. Sun, J. Zhou, “Joint Latent Dirichlet Allocation for Social Tags“, IEEE Transactions on Multimedia, 20(1):224-237, 2018. Y. Zhang, W. Cai, W. Wang, Y. Zhang*, “Stopping Criterion for Active Learning with Model Stability“, ACM Transactions on Intelligent Systems and Technology, 9(2), Article No. 19, 2017. W. Cai, Y. Zhang, Y. Zhang*, S. Zhou, W. Wang, Z. Chen, C. Ding, “Active Learning for Classification with Maximum Model Change“, ACM Transactions on Information Systems (TOIS), 36(2), 15, 2017. W. Cai, M. Zhang, Y. Zhang*, “Batch Mode Active Learning for Regression with Expected Model Change“, IEEE Transactions on Neural Networks and Learning Systems, 28(7):1668-1681, 2017. Z. Xu, D. Tao, S. Huang, Y. Zhang*, “Friend or Foe: Fine-Grained Categorization with Weak Supervision“, IEEE Transactions on Image Processing, 26(1):135-146, 2017. Z. Tan, Y. Wang*, Y. Zhang, J. Zhou, “A Novel Time Series Approach for predicting the long-term popularity of Online Videos“, IEEE Trans. on Broadcasting, 62(2):436-445, 2016. Z. Xu, Z. Hong, Y. Zhang*, J. Wu, A. C. Tsoi, D. Tao, “Multinomial Latent Logistic Regression for Image Understanding“, IEEE Transactions on Image Processing, 25(2):973-987, 2016. B. Long, J. Bian, O. Chapelle, Y. Zhang, Y. Inagakiy, Y. Chang, “Active Learning for Ranking through Expected Loss Optimization“, IEEE Transactions on Knowledge and Data Engineering, 27(5):1180-1191, 2015. Y. Zhang*, W. Chen, H. Zha, X. Gu, “A Time-Topic Coupled LDA Model for IPTV User Behaviors“, IEEE Trans. on Broadcasting, 61(1):56-65, 2015. W. Cai, M. Zhang, Y. Zhang, “Active learning for ranking with sample density“, Information Retrieval Journal, 18(2):123-144, 2015. W. Cai, M. Zhang, Y. Zhang*, “Active Learning for Web Search Ranking via Noise Injection“, ACM Transactions on the Web (TWEB), 9(1): article No. 3, 2015 (Source code). Y. Liu, Y. Qian, N. Chen, T. Fu, Y. Zhang, K. Yu, “Deep Feature for Text-dependent Speaker Verification”, Speech Communication, 73:1-13, 2015. Z. Xu, Y. Zhang*, L. Cao, “Social Image Analysis from a Non-IID Perspective“, IEEE Transactions on Multimedia, 16(7):1986-1998, 2014. Y. Zhang, X. Yang, H. Zha, “Behaviors of IPTV Users“, IEEE Trans. on Intelligent Systems, 29(4):76-78, 2014. M. Li, J. Li, Y. Ou, Y. Zhang, D. Luo, M. Bahtia, L. Cao, “Coupled K-Nearest Centroid Classification for Non-iid Data“, T. Computational Collective Intelligence 15: 89-100, 2014. Y. Wang, D. He, W. Zhang, Y. Guan, Y. Wang, Y. Zhang, H. Hui, “An Urban-Rural Dual Structure for the Digital Terrestrial Television Broadcasting System of FOBTV“, IEEE Trans. on Broadcasting, 60(2): 287-290, 2014. Y. Zhang, W. Chen, Z. Yin, “Collaborative filtering with social regularization for TV program recommendation“, Knowledge-Based Systems, Vol. 54, pp. 310-317, 2013. (data and source code) K. Shen, J. Wu, Y. Zhang, Y. Han, X. Yang, and L. Song, “Reorder User’s Tweets“, ACM TIST, vol.4(1), 2013. O. Chapelle, P. Shivaswamy, S. Vadrevu, K. Weinberger, Y. Zhang, and B. Tseng, “Boosted Multi-task Learning“, Machine Learning, vol. 85(1-2), 149-173, 2011. (g-scholar) H. Xiong, Y. Zhang, X. Chen, and J. Yu, “Cross-platform Microarray Data Integration using the Normalised Linear Transform“, The International Journal of Data Mining and Bioinformatics, vol. 4(2), 142-157, 2010. (g-scholar) H. Xiong, Y. Zhang, and X. Chen, “Data-dependent Kernel Machines for Microarray Data Classification“, IEEE/ACM Transaction on Computational Biology and Bioinformatics (TCBB), vol. 4(4), 583-595, 2007. (g-scholar) Y. Zhang, H. Zha, C. Chu, and X. Ji, “Towards Inferring Protein Interactions: Challenges and Solutions“, EURASIP Journal on Applied Signal Processing 2006 (2006), Article ID 37349, 14 pages. (g-scholar) Y. Zhang, C. H. Chu, Y. Chen, H. Zha, and X. Ji, “Splice Site Prediction Using Support Vector Machines with a",
  "content_length": 34245,
  "method": "requests",
  "crawl_time": "2025-12-01 14:49:23"
}