{
  "name": "Yafeng Yin 0002",
  "homepage": "https://yafengnju.github.io",
  "status": "success",
  "content": "Welcome to Yafeng Yin's Homepage Yafeng Yin 殷亚凤 PhD, Assistant Professor, Gusu Young Professor, Ph.D. Advisor State Key Laboratory for Novel Software Technology, School of Intelligent Software and Engineering, Nanjing University, China Email: yafeng AT nju.edu.cn Office: Room 225, East of Nanyong Building, Suzhou Campus [Short Biography] [Research Interest] [Projects] [Teaching] [Publications] [Selected Awards] [Students] [Team/Group] Short Biography I am an assistant professor of School of Intelligent Software and Engineering at Nanjing University. I received my Ph.D. degree from Nanjing University in 2017 under the supervision of Prof. Sanglu Lu and Prof. Lei Xie, and received my BE degree from Nanjing University of Science and Technology in 2011. From Sep. 2014 to Sep. 2015, I was a visiting research scholar in Department of Computer Science at the College of William and Mary, supervised by Prof. Qun Li and sponsored in part by China Scholarship Council (CSC). From Jul. 2017 to Jun. 2023, I was an assistant, associate researcher in Department of Computer Science and Technology at Nanjing University. Research Interest My research interests focus on Intelligent Sensing and Visual Computing, including multimodal sensing and learning, human activity recognition, sign language translation and generation. I am recruiting motivated Ph.D. or master students who would like to work on the above-mentioned areas. Undergraduate students who are interested in the related topics are also encouraged to contact me. Projects 2022/01-2025/12: “Multi-modal Sensing based Activity Recognition on Mobile Devices”, sponsored by the National Natural Science Foundation of China, No. 62172208. (Principle Investigator) 2019/01-2021/12: “Efficient Activity Sensing and Recognition based on Mobile Devices”, sponsored by the National Natural Science Foundation of China, No. 61802169. (Principle Investigator) 2018/07-2021/06: “Multimodal Sensing and Activity Recognition based on Mobile Devices”, sponsored by the JiangSu Natural Science Foundation, No. BK20180325. (Principle Investigator) Teaching 计算机组织结构（2025秋） 互联网计算（2025春） 物联网应用软件开发（2024秋） Publications 2025 Shiwei Gan, Yafeng Yin*, Zhiwei Jiang, Lei Xie, Sanglu Lu, and Hongkai Wen. MixSignGraph: A Sign Sequence is Worth Mixed Graphs of Nodes. Accepted to appear in The Thirty-Ninth Annual Conference on Neural Information Processing Systems (NeurIPS), 2025. Bowen Guo, Shiwei Gan, Yafeng Yin*, Xiao Liu, Zhiwei Jiang, and Shunmei Meng. Sentence-level Segmentation for Long Sign Language Videos with Captions. Accepted to appear in ACM International Conference on Multimedia (ACM MM), 2025. Cong Wang, Zexuan Deng, Zhiwei Jiang*, Yafeng Yin*, Fei Shen, Shiwei Gan, Zifeng Cheng, Shiping Ge, and Qing Gu. Advanced Sign Language Video Generation with Compressed and Quantized Multi-Condition Tokenization. Accepted to appear in The Thirty-Ninth Annual Conference on Neural Information Processing Systems (NeurIPS), 2025. (Spotlight) Shiping Ge, Qiang Chen, Zhiwei Jiang, Yafeng Yin, Liu Qin, Ziyao Chen, and Qing Gu. Implicit Location-Caption Alignment via Complementary Masking for Weakly-Supervised Dense Video Captioning. Accepted to appear in AAAI Conference on Artificial Intelligence (AAAI), 2025. Yuchen Fu, Zifeng Cheng, Zhiwei Jiang, Zhonghui Wang, Yafeng Yin, Zhengliang Li, and Qing Gu. Token Prepending: A Training-Free Approach for Eliciting Better Sentence Embeddings from LLMs. Accepted to appear in Annual Meeting of the Association for Computational Linguistics (ACL), 2025. Zifeng Cheng, Zhonghui Wang, Yuchen Fu, Zhiwei Jiang, Yafeng Yin, Cong Wang, and Qing Gu. Contrastive Prompting Enhances Sentence Embeddings in LLMs through Inference-Time Steering. Accepted to appear in Annual Meeting of the Association for Computational Linguistics (ACL), 2025. Zifeng Cheng, Zhaoling Chen, Zhiwei Jiang, Yafeng Yin, Cong Wang, Shiping Ge, and Qing Gu. Multi-Prompting Decoder Helps Better Language Understanding. Accepted to appear in Annual Meeting of the Association for Computational Linguistics (ACL Findings), 2025. Shiping Ge, Zhiwei Jiang, Yafeng Yin, Cong Wang, Zifeng Cheng, and Qing Gu. Fine-Grained Alignment Network for Zero-Shot Cross-Modal Retrieval. Accepted to appear in ACM Transactions on Multimedia Computing, Communications and Applications (TOMM), 2025. 2024 Yafeng Yin, Lei Xie, Zhiwei Jiang, Fu Xiao, Jiannong Cao, and Sanglu Lu. A Systematic Review of Human Activity Recognition based on Mobile Devices: Overview, Progress and Trends. IEEE Communications Surveys and Tutorials, vol. 26, no. 2, pp. 890-929, 2024. (Impact Factor: 35.6) Shiwei Gan, Yafeng Yin*, Zhiwei Jiang, Hongkai Wen, Lei Xie, and Sanglu Lu. SignGraph: A Sign Sequence is Worth Graphs of Nodes. The IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR), 2024. Shiping Ge, Qiang Chen, Zhiwei Jiang, Yafeng Yin, Ziyao Chen, and Qing Gu. Short Video Ordering via Position Decoding and Successor Prediction. International Conference on Research and Development in Information Retrieval (SIGIR), 2024. 2023 Yafeng Yin, Zheng Wang, Kang Xia, Lei Xie, and Sanglu Lu. Acoustic-Based Lip Reading for Mobile Devices: Dataset, Benchmark and A Self Distillation-Based Approach. IEEE Transactions on Mobile Computing, 2023. Shiwei Gan, Yafeng Yin*, Zhiwei Jiang, Lei Xie, and Sanglu Lu. Towards Real-Time Sign Language Recognition and Translation on Edge Devices. ACM International Conference on Multimedia (ACM MM), 2023. Shiwei Gan, Yafeng Yin*, Zhiwei Jiang, Kang Xia, Lei Xie, and Sanglu Lu. Contrastive Learning for Sign Language Recognition and Translation. International Joint Conference on Artificial Intelligence (IJCAI), 2023. Shiping Ge, Zhiwei Jiang, Yafeng Yin, Cong Wang, Zifeng Cheng and Qing Gu. Learning Event-Specific Localization Preferences for Audio-Visual Event Localization. ACM International Conference on Multimedia (ACM MM), 2023. Zhiwei Jiang, Tianyi Gao, Yafeng Yin, Meng Liu, Hua Yu, Zifeng Cheng, and Qing Gu. Improving Domain Generalization for Prompt-Aware Essay Scoring via Disentangled Representation Learning. Annual Meeting of the Association for Computational Linguistics (ACL), 2023. Cong Wang, Zhiwei Jiang, Yafeng Yin, Zifeng Cheng, Shiping Ge, and Qing Gu. Aggregating Multiple Heuristic Signals as Supervision for Unsupervised Automated Essay Scoring. Annual Meeting of the Association for Computational Linguistics (ACL), 2023. Yuliang Liu, Zhiwei Jiang, Yafeng Yin, Cong Wang, Sheng Chen, Zhaoling Chen, and Qing Gu. Unsupervised Readability Assessment via Learning from Weak Readability Signals. International Conference on Research and Development in Information Retrieval (SIGIR), 2023. Cong Wang, Zhiwei Jiang, Yafeng Yin, Zifeng Cheng, Shiping Ge, and Qing Gu. Controlling Class Layout for Deep Ordinal Classification via Constrained Proxies Learning. AAAI Conference on Artificial Intelligence (AAAI), 2023. Zifeng Cheng, Zhiwei Jiang, Yafeng Yin, Cong Wang, Shiping Ge, and Qing Gu. A Consistent Dual-MRC Framework for Emotion-Cause Pair Extraction. ACM Transactions on Information Systems (TOIS), vol. 41, no. 4, article 105, 2023. Shiping Ge, Zhiwei Jiang, Zifeng Cheng, Cong Wang, Yafeng Yin, and Qing Gu. Learning Robust Multi-Modal Representation for Multi-Label Emotion Recognition via Adversarial Masking and Perturbation. The Web Conference (WWW), 2023. 2022 Hao Zhang, Yafeng Yin*, Lei Xie, Tao Gu, Minghui You and Sanglu Lu. DynaKey: Dynamic Keystroke Tracking using a Head-Mounted Camera Device. IEEE Internet of Things Journal, vol. 9, no. 9, pp. 6563-6577, 2022. Zifeng Cheng, Zhiwei Jiang, Yafeng Yin, Cong Wang, and Qing Gu. Learning to Classify Open Intent via Soft Labeling and Manifold Mixup. IEEE/ACM Transactions on Audio, Speech, and Language Processing (TASLP), 30:635-645, 2022. 2021 Shiwei Gan, Yafeng Yin*, Zhiwei Jiang, Lei Xie, and Sanglu Lu. Skeleton-Aware Neural Sign Language Translation. ACM International Conference on Multimedia (ACM MM), 2021. Yanling Bu, Lei Xie, Yafeng Yin, Chuyu Wang, Jingyi Ning, Jiannong Cao, and Sanglu Lu. Handwriting-Assistant: Reconstructing Continuous Strokes with Millimeter-level Accuracy via Attachable Inertial Sensors. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies (IMWUT), vol. 5, no. 4, article 146, 2021. (UbiComp 2022) Zhiwei Jiang, Meng Liu, Yafeng Yin, Hua Yu, Zifeng Cheng, and Qing Gu. Learning from Graph Propagation via Ordinal Distillation for One-Shot Automated Essay Scoring. The Web Conference (WWW), 2021. Zifeng Cheng, Zhiwei Jiang, Yafeng Yin, Na Li, and Qing Gu. A Unified Target-Oriented Sequence-to-Sequence Model for Emotion-Cause Pair Extraction. IEEE/ACM Transactions on Audio, Speech, and Language Processing (TASLP), 29:2779-2791, 2021. 2020 Xinchen Zhang, Yafeng Yin*, Lei Xie, Hao Zhang, Zefan Ge, and Sanglu Lu. TouchID: User Authentication on Mobile Devices via Inertial-Touch Gesture Analysis. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies (IMWUT), vol. 4, no. 4, article 162, 2020. (UbiComp 2021). Hao Zhang, Yafeng Yin*, Lei Xie, and Sanglu Lu. AirTyping: A Mid-Air Typing Scheme based on Leap Motion. In Adjunct Proceedings of the 2020 ACM International Joint Conference on Pervasive and Ubiquitous Computing and Proceedings of the 2020 ACM International Symposium on Wearable Computers, pp. 168-171. 2020. Lingyu Zhang, Yafeng Yin*, Lei Xie, and Sanglu Lu. HmwkCheck: A Homework Auto-Checking System based on Arithmetic Operation Recognition using Smartphones. In Adjunct Proceedings of the 2020 ACM International Joint Conference on Pervasive and Ubiquitous Computing and Proceedings of the 2020 ACM International Symposium on Wearable Computers, pp. 172-175. 2020. Xinran Lu, Lei Xie, Yafeng Yin, Wei Wang, Yanling Bu, Qing Guo, and Sanglu Lu. SpeedTalker: Automobile Speed Estimation via Mobile Phones. IEEE Transactions on Mobile Computing, 2020. DOI: 10.1109/TMC.2020.3034354. Fei Han, Lei Xie, Yafeng",
  "content_length": 15974,
  "method": "requests",
  "crawl_time": "2025-12-01 14:49:26"
}