{
  "name": "Yair Amir",
  "homepage": "http://www.cs.jhu.edu/~yairamir",
  "status": "success",
  "content": "Yair Amir Yair Amir Professor Emeritus, Department of Computer Science Johns Hopkins University Me and you shall change the world -- Arik Einstein -- אני ואתה נשנה את העולם -- אריק איינשטיין Department of Computer Science Johns Hopkins University Baltimore, MD 21218 E-mail: yairamir at cs.jhu.edu, Phone: 301-806-4803. Inventing high performance, resilient and secure distributed systems that make a difference, collecting friends along the way. Director of the Distributed Systems and Networks lab (DSN) at the Department of Computer Science here at Hopkins. Co-founder of Spread Concepts LLC (2000). Co-founder of LTN Global Communications (2008). Research interests: Systems: Intrusion-tolerant systems, critical infrastructure, clouds, distributed systems. Networks: Overlay networks, group communication, wireless mesh networks, multicast. Algorithms: Distributed algoithms, intrusion tolerance, fault tolerance, replication. Creator of the Spire intrusion-tolerant SCADA for the power grid (2017), the Prime intrusion-tolerant replication engine (2010), the SMesh seamless wireless backbone (2006), the Spines overlay network (2003), Wackamole N-Way Failover for servers and routers (2001), the Backhand clustering project (1999), and the Spread toolkit (1997). Some of these systems are deployed in thousands of mission critical systems, power data center applications, are included in commercial products, and are used for research and teaching in universities and research labs all over the world. Bio, Resume. My Don P. Giddens lecture, the Whiting School of Engineering, Johns Hopkins University, 16 Februray 2012. Lecture on You Tube: From Overlays to Clouds: Inventing a New Network Paradigm. Power point slides to go together with the lecture. Slides in PDF format. Publications: My latest publications including all the publications connected with my work at the DSN lab at Hopkins can be found at the lab's publications page. Here is an archive of my publications on the Transis and Totem projects and some later work not connected with the DSN lab. Teaching: Recipient of the Almuni Association Exellence in Teaching Award, Whiting School of Engineering, Johns Hopkins University, 2014. Distributed Systems (601.417/617) - see what students say: Fall 2021, Fall 2019, Fall 2016, Fall 2014, Fall 2012. Advanced Distributed Systems and Networks (601.717) - see what students say: Spring 2022, Spring 2020, Spring 2017, Spring 2015, Spring 2013. Software for Resilient Communities (601.310) - see what students say: Spring 2018. Intermediate Programming (601.220) - see what students say: Fall 2017, Fall 2015, Spring 2014, Fall 2013, Spring 2012, Fall 2011. Operating Systems (600.418) My lecture in M&Ms: CS Freshmen Experience (600.105) My Group: Students that completed graduate research with me Sahiti Bommareddy - Thesis: Real-Time Byzantine-Resilient Power Grid Infrastructure, Ph.D., 2025. Amy Babay - Thesis: Timely, Reliable, and Cost-Effective Internet Transport Service using Structured Overlay Networks, Ph.D., 2018. Tom Tantillo - Thesis: Intrusion-Tolerant SCADA for the Power Grid, Ph.D., 2018. Daniel Obenshain - Thesis: Practical Intrusion-Tolerant Networking, Ph.D., 2015. Jonathan Kirsch - Thesis: Intrusion-Tolerant Replication Under Attack, Ph.D., 2010. Raluca Musaloiu-E - Thesis: Practical Wireless Mesh Networks and Their Applications, Ph.D., 2010. John Lane - Thesis: Scaling Byzantine Replication to Wide-Area Networks, Ph.D., 2008. Nilo Rivera - Thesis: Seamless Connectivity and Mobility in Wireless Mesh Networks, Ph.D., 2008. Ciprian Tutu - Thesis: Distributed Algorithms for Consistent Replicated State. Ph.D., 2004. Claudiu Danilov - Thesis: Performance and Functionality in Overlay Networks, Ph.D., 2004. Cristina Nita-Rotaru - Thesis: High Performance Secure Group Communication, Ph.D., 2003. Jonathan Stanton - Thesis: Practical Wide-Area Group Communication, Ph.D., 2002. R. Sean Borgstrom - Thesis: A Cost-Benefit Approach to Resource Allocation in Scalable Metacomputers, Ph.D., 2000. Jerry Chen (co-advised with Brian Wheatman) - Project: Dependable AI for Traffic Light Control Systems, M.S.E., 2021. Daniel Qian - Project: An Intrusion Tolerant Architecture and Protocol for Substation Protection, M.S.E, 2021. Edmund (Ned) Duhaime (co-advised with Amy Babay) - Study: Seamless Overlays for Application Use, M.S.E, 2017. Trevor Aron (co-advised with Tom Tantillo) - Project: An Open-Source Event-Based SCADA System for the Power Grid, M.S.E, 2017. Emily Wagner (co-advised with Amy Babay) - Project: The Playback Network Simulator: Overlay Performance Simulations With Captured Data, M.S.E, 2016. Jeffrey DallaTezza - Project: Madaba: Starvation free, Scalable Transactions for Sharded Key-value Stores, M.S.E., 2015. Amy Babay - Thesis: The Accelerated Ring Protocol: Ordered Multicast for Modern Data Centers, M.S.E, 2014. Tom Tantillo - Thesis: Intrusion Tolernat Cloud Monitoring, M.S.E., 2013. Michael Kaplan - Study: Low-Overhead Routing for High-Performance Wireless Mesh Networks, M.S.E., 2006. Ryan Caudy - Project: Scalable Process Group Membership for the Spread Toolkit, M.S.E., 2004. Michael Hilsdale - Study: Toward a Practical and Seamless Wireless Backbone, M.S.E., 2004. Ashima Munjal - Project: A Highly Available Message Queue, M.S.E., 2004. John Schultz - Thesis: Partitionable Virtual Synchrony Using Extended Virtual Synchrony, M.S.E., 2001. Jacob Green - Project: Hyperdog - Up to Date Web Monitoring Through Metacomputers, M.S.E., 2000. David Shaw - Thesis: Walrus: A Low Latency, High Throughput Web Service Using Internet-wide Replication, M.S.E., 1998. Additional people that conducted published research in my lab Brian Wheatman - Graduate Student - Dependable AI (2019-2022). Samuel Beckley - Graduate Student - SCADA HMIs for the power grid (2017-2018). Dr. Marco Platania - Post Doctoral Fellow - intrusion tolerant systems (2012-2015). Dr. Claudiu Danilov - Research Scientist - wireless mesh networks and scalable Byzantine replication (2004-2006). Dr. Jonathan Stanton - Research Assistant Professor - secure group communication and overlay networks (2002). Theo Schlossnagle - Graduate Student - practical distributed information infrastructure (1997-2001). Alec Peterson - Undergraduate Student - replicated Web service (1997-1998). My own Ph.D. research One of the initiators and main developers of the Transis group communication project with Professor Danny Dolev at the Hebrew University of Jerusalem, Israel. One of the main developers of the Totem group communication project with Professors Michael Melliar-Smith and Louise Moser at the University of California, Santa Barbara. My Ph.D. presentation: Replciation Over a Partitioned Network, Novemebr 1994. My Ph.D. Thesis: Replication Using Group Communication Over a Partitioned Network, August 1995. Last modified: January 2025. :) Yair.",
  "content_length": 6889,
  "method": "requests",
  "crawl_time": "2025-12-01 14:49:28"
}