{
  "name": "Yajin Zhou",
  "homepage": "http://yajin.org",
  "status": "success",
  "content": "Yajin Zhou — Web3 & Systems Security Researcher (Zhejiang University) \"If you want to set off and go develop some grand new thing, you don't need millions of dollars of capitalization. You need enough pizza and Diet Coke to stick in your refrigerator, a cheap PC to work on, and the dedication to go through with it.\" — John Carmack About I am a ZJU 100‑Young Professor at the College of Computer Science and Technology, Zhejiang University. I earned my Ph.D. in Computer Science from North Carolina State University in 2015 (Advisor: Prof. Xuxian Jiang) and subsequently served as a Senior Security Researcher at Qihoo 360. I am also a co‑founder of BlockSec, a company providing blockchain security and compliance solutions. I have published 70+ papers with 10,000+ citations (see Google Scholar). One of my papers was included in the normalized list of Top‑100 Security Papers since 1981, and I received the Most Influential Scholar Award for contributions to Security and Privacy. I currently serve as Chief Scientist (PI) of a National Key R&D Program funded by China's Ministry of Science and Technology, a PC member/reviewer for IEEE S&P, USENIX Security, and ACM CCS, and an expert reviewer for funding programs in Singapore, France, and Hong Kong. At‑a‑Glance 70+ publications; 10,000+ citations Top‑100 influential security paper (normalized list) Most Influential Scholar Award (Security & Privacy) PI/Chief Scientist, National Key R&D Program PC: IEEE S&P, USENIX, CCS, FC Funding program reviewer: Singapore, France, Hong Kong Founding BlockSec, a blockchain security and compliance startup company backed by top-tier investors and serving 500+ global clients including exchanges, regulators, and enterprises. Research My research spans system and blockchain security, including software security, operating system security, and hardware-assisted security, with an increasing focus on emerging areas such as smart-contract security, DeFi security, and the underground cybercrime. I continue to advance problems across traditional system security while building end-to-end protection for modern blockchain ecosystems. Impact Many of my academic results have been adopted into production—not only at BlockSec, but earlier at Qihoo 360. This includes our early Android security work that advanced mobile security: techniques for malware detection and anti-repackaging/anti-piracy were productized and deployed at scale. Our blockchain research has helped prevent multi-million-dollar attacks and support on-chain investigations for regulators and law-enforcement worldwide. A tight two-way loop between industry and academia turns security incidents and real-world needs into sharper research questions, while academic inquiry abstracts root causes and opens new directions that feed back into products—sustaining true academy-industry synergy. Dataset Releases Shedding Light on Shadows: Automatically Tracing Illicit Money Flows on EVM-Compatible Blockchains (SIGMETRICS 2026) Unmasking the Shadow Economy: A Deep Dive into Drainer-as-a-Service Phishing on Ethereum (IMC 2025) Dissecting Payload-based Transaction Phishing on Ethereum (NDSS 2025) Toss a Fault to BpfChecker: Revealing Implementation Flaws for eBPF runtimes with Differential Fuzzing (CCS 2024) DeFiRanger: Detecting DeFi Price Manipulation Attacks (TDSC 2024) TxPhishScope: Towards Detecting and Understanding Transaction-based Phishing on Ethereum (CCS 2023) An Empirical Study on ARM Disassembly Tools (ISSTA 2020, TSE 2022) Publications Complete list available on Google Scholar, and DBLP. Papaer with * means I am the corresponding author. h-index: 32, Citations: 10,661 (Updated on 2025-10-11) Selected Highlights Complete List Selected Publications 2026 SIGMETRICS — Shedding Light on Shadows: Automatically Tracing Illicit Money Flows on EVM-Compatible Blockchains Yicheng Huo, Yufeng Hu, Yajin Zhou*, Ting Yu, Lei Wu, Cong Wang [Paper] 2025 IMC — Unmasking the Shadow Economy: A Deep Dive into Drainer-as-a-Service Phishing on Ethereum Bowen He, Yufeng Hu, Zhuo Chen, Yuan Chen, Ting Yu, Rui Chang, Lei Wu, Yajin Zhou* [Paper] TDSC — Minoris: Practical Out-of-Emulator Kernel Module Fuzzing Yangxi Xiang, Feng Wang, Yuan Chen, Qiang Liu, Haoyu Wang, Jiashui Wang, Lei Wu, Chaoyuan Chen, Yajin Zhou* [Paper] ESORICS — NLSaber: Enhancing Netlink Family Fuzzing via Automated Syscall Description Generation Lin Ma, Xingwei Lin, Ziming Zhang, Yajin Zhou* [Paper] SIGMETRICS — Phishing Tactics Are Evolving: An Empirical Study of Phishing Contracts on Ethereum Bowen He, Xiaohui Hu, Yufeng Hu, Ting Yu, Rui Chang, Lei Wu, Yajin Zhou* [Paper] SIGMETRICS — Towards Understanding and Analyzing Instant Cryptocurrency Exchanges Yufeng Hu, Yingshi Sun, Lei Wu, Yajin Zhou, Rui Chang [Paper] NDSS — Dissecting Payload‑based Transaction Phishing on Ethereum Zhuo Chen, Yufeng Hu, Bowen He, Dong Luo, Lei Wu, Yajin Zhou* [Paper] EuroSys — ParallelEVM: Operation‑Level Concurrent Transaction Execution for EVM‑Compatible Blockchains Haoran Lin, Hang Feng, Yajin Zhou*, Lei Wu [Paper] 2024 CCS — Toss a Fault to BpfChecker: Revealing Implementation Flaws for eBPF runtimes with Differential Fuzzing Chaoyuan Peng, Muhui Jiang, Lei Wu, Yajin Zhou* [Paper] USENIX ATC — SlimArchive: A Lightweight Architecture for Ethereum Archive Nodes Hang Feng, Yufeng Hu, Yinghan Kou, Runhuai Li, Jianfeng Zhu, Lei Wu, Yajin Zhou* [Paper] 2023 IEEE TDSC — DeFiRanger: Detecting DeFi Price Manipulation Attacks Siwei Wu, Zhou Yu, Dabao Wang, Yajin Zhou*, Lei Wu, Haoyu Wang, Xingliang Yuan [Paper] CCS — TxPhishScope: Towards Detecting and Understanding Transaction‑based Phishing on Ethereum Bowen He, Yuan Chen, Zhuo Chen, Xiaohui Hu, Yufeng Hu, Lei Wu, Rui Chang, Haoyu Wang, Yajin Zhou* [Paper] S&P — VIDEZZO: Dependency‑aware Virtual Device Fuzzing Qiang Liu, Flavio Toffalini, Yajin Zhou*, Mathias Payer [Paper] DAC — DriverJar: Lightweight Device Driver Isolation for ARM Huamao Wu, Yuan Chen, Yajin Zhou*, Yifei Wang, Lubo Zhang [Paper] USENIX Security — MorFuzz: Fuzzing Processor via Runtime Instruction Morphing enhanced Synchronizable Co-simulation Jinyan Xu, Yiyuan Liu, Sirui He, Haoran Lin, Yajin Zhou*, Cong Wang [Paper] S&P — When Top-down Meets Bottom-up: Detecting and Exploiting Use-After-Cleanup Bugs in Linux Kernel Lin Ma, Duoming Zhou, Hanjie Wu, Yajin Zhou*, Rui Chang, Hao Xiong, Lei Wu, Kui Ren [Paper] 2022 DAC — RegVault: Hardware Assisted Selective Data Randomization for Operating System Kernels Jinyan Xu, Haoran Lin, Ziqi Yuan, Wenbo Shen, Yajin Zhou, Rui Chang, Lei Wu, Kui Ren [Paper] EuroSys — OPEC: Operation-based Security Isolation for Bare-metal Embedded Systems Xia Zhou, Jiaqi Li, Wenlong Zhang, Yajin Zhou*, Wenbo Shen, Kui Ren [Paper] TOSEM — Time-Travel Investigation: Towards Building A Scalable Attack Detection Framework on Ethereum Siwei Wu, Lei Wu, Yajin Zhou*, Runhuai Li, Zhi Wang, Xiapu Luo, Cong Wang, Kui Ren [Paper] ASPLOS — EXAMINER: Automatically Locating Inconsistent Instructions between Real Devices and CPU Emulators for ARM Muhui Jiang, Tianyi Xu, Yajin Zhou*, Yufeng Hu, Ming Zhong, Lei Wu, Xiapu Luo, Kui Ren [Paper] USENIX Security — SGXLock: Towards Efficiently Establishing Mutual Distrust Between Host Application and Enclave for SGX Yuan Chen, Jiaqi Li, Guorui Xu, Yajin Zhou*, Zhi Wang, Cong Wang, Kui Ren [Paper] 2021 SOSP — Forerunner: Constraint-based Speculative Transaction Execution for Ethereum Yang Chen, Zhongxin Guo, Runhuai Li, Shuo Chen, Lidong Zhou, Yajin Zhou, Xian Zhang [Paper] CCS — ECMO: Peripheral Transplantation to Rehost Embedded Linux Kernels Muhui Jiang, Lin Ma, Yajin Zhou*, Qiang Liu, Cen Zhang, Zhi Wang, Xiapu Luo, Lei Wu, Kui Ren [Paper] ASE — FirmGuide: Boosting the Capability of Rehosting Embedded Linux Kernels through Model-Guided Kernel Execution Qiang Liu^, Cen Zhang^, Lin Ma, Muhui Jiang, Yajin Zhou*, Lei Wu, Wenbo Shen, Xiapu Luo, Yang Liu, Kui Ren [Paper] WWW — Towards Understanding and Demystifying Bitcoin Mixing Services Lei Wu, Yufeng Hu, Yajin Zhou*, Haoyu Wang, Xiapu Luo, Zhi Wang, Fan Zhang, Kui Ren [Paper] NDSS — POP and PUSH: Demystifying and Defending against (Mach) Port-oriented Programming Min Zheng, Xiaolong Bai, Yajin Zhou*, Chao Zhang, Fuping Qu [Paper] 2020 ISSTA — An Empirical Study on ARM Disassembly Tools Muhui Jiang, Yajin Zhou*, Xiapu Luo, Ruoyu Wang, Yang Liu, Kui Ren [Paper] ICDCS — HybrIDX: New Hybrid Index for Volume-hiding Range Queries in Data Outsourcing Services (Best Paper Award) Kui Ren, Yu Guo, Jiaqi Li, Xiaohua Jia, Cong Wang, Yajin Zhou, Sheng Wang, Ning Cao, Feifei Li [Paper] 2019 TDSC — PPSB: An Open and Flexible Platform for Privacy-Preserving Safe Browsing Helei Cui, Yajin Zhou*, Cong Wang, Xinyu Wang, Yuefeng Du, Qian Wang [Paper] CCS — Different is Good: Detecting the Use of Uninitialized Variables through Differential Replay Mengchen Cao, Xiantong Hou, Tao Wang, Hunter Qu, Yajin Zhou*, Xiaolong Bai, Fuwei Wang [Paper] 2017 USENIX Security — Malton: Towards On-Device Non-Invasive Mobile Malware Analysis for ART Lei Xue, Yajin Zhou, Ting Chen, Xiapu Luo, Guofei Gu [Paper] 2014 CCS — ARMlock: Hardware-based Fault Isolation for ARM Yajin Zhou, Xiaoguang Wang, Yue Chen, Zhi Wang [Paper] NDSS — AirBag: Boosting Smartphone Resistance to Malware Infection Chiachih Wu, Yajin Zhou, Kunal Patel, Zhenkai Liang, Xuxian Jiang [Paper] 2013 CCS — The Impact of Vendor Customizations on Android Security Lei Wu, Michael Grace, Yajin Zhou, Chiachih Wu, Xuxian Jiang [Paper] NDSS — Detecting Passive Content Leaks and Pollution in Android Applications Yajin Zhou, Xuxian Jiang [Paper] 2012 S&P — Dissecting Android Malware: Characterization and Evolution Yajin Zhou, Xuxian Jiang [Paper] NDSS — Hey, You, Get off of My Market: Detecting Malicious Apps in Official and Alternative Android Markets Yajin Zhou, Zhi Wang, Wu Zhou, Xuxian Jiang [Paper] NDSS — Systematic Detection o",
  "content_length": 26594,
  "method": "requests",
  "crawl_time": "2025-12-01 14:49:35"
}