{
  "name": "Yalin Bastanlar",
  "homepage": "http://ceng.iyte.edu.tr/people/yalin-bastanlar",
  "status": "success",
  "content": "Yalın Baştanlar - Computer Engineering Department Computer Engineering Department Izmir Institute of Technology Search Computer Engineering Department Izmir Institute of Technology Home About People Research Research Focus Projects Publications Collaborations Education Undergraduate Program MS Programs CENG MS Program SEDS MS Program PhD Program Minor Program Contact lidya multisite > Computer Engineering Department > Yalın Baştanlar Yalın Baştanlar Professor Professor Yalın Baştanlar studied civil engineering at the Middle East Technical University (METU) and obtained B.S. degree in 2001. He started to work on computer vision for his graduate studies and he obtained his M.S. (2005) and Ph.D. (2009) from the Information Systems Department of Informatics Institute. Apart from his administrative duties, he also runs the Computer Vision Research Group in the department. B.Sc. : Civil Engineering, Middle East Technical University (2001) M.Sc. : Information Systems, Middle East Technical University (2005) Ph.D. : Information Systems, Middle East Technical University (2009) CoursesPublicationsProjectsCourses CENG 115 - Discrete Structures CENG 611 - Advanced Design and Analysis of Algorithms CENG 508 - Digital Image Processing CENG 608 - 3D Photography CENG 631 - Cognitive Computing CENG 506 - Deep Learning CENG 218 - Analysis and Design of Algorithms Publications 2021 Semih Orhan; Yalın BaştanlarEfficient Search in a Panoramic Image Database for Long-Term Visual Localization Inproceedings Proceedings of the IEEE/CVF International Conference on Computer Vision (ICCV) Workshops, pp. 1727-1734, 2021.BibTeX@inproceedings{Orhan_2021_ICCV, title = {Efficient Search in a Panoramic Image Database for Long-Term Visual Localization}, author = { Semih Orhan and Yalın Ba\\c{s}tanlar}, year = {2021}, date = {2021-10-01}, booktitle = {Proceedings of the IEEE/CVF International Conference on Computer Vision (ICCV) Workshops}, pages = {1727-1734}, keywords = {}, pubstate = {published}, tppubtype = {inproceedings} } Close 2020 Zeynep Ekici İmamoğlu; Tuğkan Tuğlular; Yalın BaştanlarContainer damage detection and classification using container images Inproceedings 2020 28th Signal Processing and Communications Applications Conference (SIU), pp. 1–4, IEEE 2020.BibTeX@inproceedings{imamouglu2020container, title = {Container damage detection and classification using container images}, author = { Zeynep Ekici \\.{I}mamo\\u{g}lu and Tu\\u{g}kan Tu\\u{g}lular and Yalın Ba\\c{s}tanlar}, year = {2020}, date = {2020-01-01}, booktitle = {2020 28th Signal Processing and Communications Applications Conference (SIU)}, pages = {1--4}, organization = {IEEE}, keywords = {}, pubstate = {published}, tppubtype = {inproceedings} } Close Projects Detection of Some Animal Species in Photo Trap Images, TÜBİTAK ARDEB 1001 Vehicle Detection and Classification with Omnidirectional and PTZ Cameras in Traffic Scenes, TÜBİTAK ARDEB 3501 B.Sc. : Civil Engineering, Middle East Technical University (2001) M.Sc. : Information Systems, Middle East Technical University (2005) Ph.D. : Information Systems, Middle East Technical University (2009) Courses Publications Projects CENG 115 - Discrete Structures CENG 611 - Advanced Design and Analysis of Algorithms CENG 218 - Analysis and Design of Algorithms CENG 506 - Deep Learning CENG 508 - Digital Image Processing CENG 608 - 3D Photography CENG 631 - Cognitive Computing Conference Paper Çınaroğlu, İ., Baştanlar, Y., “Image Based Localization Using Semantic Segmentation for Autonomous Driving (in Turkish),” IEEE Conference on Signal Processing and Applications, SIU, 2019. Demiröz, B.E., Salah, A.A., Baştanlar, Y., Akarun, L., “Affordable person detection in omnidirectional cameras using radial integral channel features,” Machine Vision and Applications, pp.1-11, March 2019. Orhan, S., Baştanlar, Y., \"Training CNNs with Image Patches for Object Localisation\", Electronics Letters, vol.54, no.7, pp.424-426, 2018. Tekeli, U., Baştanlar, Y., “Detection of Images with Animals in Raw Camera-Trap Data (in Turkish),” IEEE Conference on Signal Processing and Applications, SIU, 2018. Karaimer, H.C., Barış, I., Baştanlar, Y., \"Detection and Classification of Vehicles from Omnidirectional Videos Using Multiple Silhouettes,\" Pattern Analysis and Applications, vol.20, no.3, pp.893-905, August 2017. Mezgil, B., Erdoğan, D., Alduran, Y., Yıldız, U.H., Arslan-Yıldız, A., Baştanlar, Y., \"Düşük Sükroz Derişimlerinin Görünür Bölge Spektroskopisi ve Yapay Sinir Ağları ile Kestirimi - Estimation of Low Sucrose Concentrations by UV-Vis Spectroscopy and Artificial Neural Networks,\" IEEE Sinyal İşleme ve İletişim Uygulamaları Kurultayı, SIU, 2017. Orhan, S., Baştanlar, Y., \"Parça Tabanlı Eğitimin Evri şimli Yapay Sinir Ağları ile Nesne Konumlandırma Üzerindeki Etkisi - Effect of Patch Based Training on Object Localization with Convolutional Neural Networks,\" IEEE Sinyal İşleme ve İletişim Uygulamaları Kurultayı, SIU, 2017. Barış, İ., Baştanlar, Y., \"Classification and Tracking of Traffic Scene Objects with Hybrid Camera Systems,\" IEEE International Transportation Systems Conference, ITSC, 2017. Baştanlar, Y., \"A Simplified Two-View Geometry Based External Calibration Method for Omnidirectional and PTZ Camera Pairs,\" Pattern Recognition Letters, vol.71, pp.1-7, February 2016. Çınaroğlu, İ., Baştanlar, Y. , \"A Direct Approach for Object Detection with Catadioptric Omnidirectional Cameras,\" Signal, Image and Video Processing, vol.10, no.2, pp. 413-420, February 2016. Barış, I., Baştanlar, Y., \"Tümyönlü ve PTZ Kameralar ile Taşıt Sınıflandırması - Classification of Vehicles with Omnidirectional and PTZ Cameras,\" IEEE Sinyal İşleme ve İletişim Uygulamaları Kurultayı, SIU, 2016. Orhan, S., Baştanlar, Y., \"Detecting Photos with Leopards Using Convolutional Neural Networks,\" International Conference on Computer Science and Engineering, UBMK, 2016. Karaimer, H.C., Baştanlar, Y., \"Zamanda Ortalaması Alınmış İkili Önplan İmgeleri Kullanarak Taşıt Sınıflandırması - Classification of Vehicles Using Binary Foreground Images Averaged Over Time,\" IEEE Sinyal İşleme ve İletişim Uygulamaları Kurultayı, SIU, 2015. Karaimer, H.C., Baştanlar, Y., \"Detection and Classification of Vehicles from Omnidirectional Videos using Temporal Average of Silhouettes,\" International Conference on Computer Vision Theory and Applications, VISAPP, 2015. Karaimer, H.C., Çınaroğlu, İ., Baştanlar, Y., \"Combining shape-based and gradient-based classifiers for vehicle classification,\" IEEE International Transportation Systems Conference, ITSC, 2015. Karaimer, H.C., Baştanlar, Y., \"Haar-Benzeri Öznitelikler ve Basamaklı Hızlandırma Kullanarak Tümyönlü Kameralar ile Binek Araç Tespiti - Car Detection with Omnidirectional Cameras Using Haar-Like Features and Cascaded Boosting,\" IEEE Sinyal İşleme ve İletişim Uygulamaları Kurultayı, SIU, 2014. Çınaroglu, İ., Baştanlar, Y., \"A Direct Approach for Human Detection with Catadioptric Omnidirectional Cameras,\" IEEE Sinyal İşleme ve İletişim Uygulamaları Kurultayı, SIU, 2014. Baştanlar, Y., Özuysal, M., \"Introduction to Machine Learning\", miRNomics: MicroRNA Biology and Computational Analysis, Springer Protocols, Humana Press. 2014. Baştanlar, Y., \"Reduced egomotion estimation drift using omnidirectional views,\" Electronic Letters on Computer Vision and Image Analysis, vol.13(3), p.1-12, 2014. Baştanlar, Y., Temizel, A., Yardımcı, Y., Sturm, P., \"Multi-view Structure-from-Motion for Hybrid Camera Scenarios,\" Image and Vision Computing, vol.30, no.8, p.557–572, 2012. Ladicky, L., Sturgess, P., Russell, C., Sengupta, S., Baştanlar, Y., Clocksin, W., Torr, P.H.S., \"Joint Optimization for Object Class Segmentation and Dense Stereo Reconstruction,\" International Journal of Computer Vision, vol.100, no.2, p.122–133, 2012. Puig, L., Baştanlar, Y., Sturm, P., Guerrero Campo, J., Barreto, J., \"Calibration of Central Catadioptric Cameras Using a DLT-Like Approach,\" International Journal of Computer Vision, vol.93, no.1, p.101–114, 2011. Baştanlar, Y., Temizel, A., Yardımcı, Y.,  \"Tümyönlü ve Perspektif Kameralar ile 3B Yapı Çıkarımı - 3D Structure Extraction with Omnidirectional and Perspective Cameras,\" IEEE Sinyal İşleme ve İletişim Uygulamaları Kurultayı, SIU, 2010. Baştanlar, Y., Temizel, A., Yardımcı, Y., \"Improved SIFT Matching for Image Pairs with a Scale Difference,\" Electronics Letters, vol.46, no.5, p.346-348, 2010. Baştanlar, Y., Temizel, A., Yardımcı, Y., Sturm, P., \"Effective Structure-from-Motion for Hybrid Camera Systems,\" Proc. of International Conference on Pattern Recognition, ICPR, 2010. Ladicky, L., Sturgess, P., Russell, C., Sengupta, S., Bastanlar, Y., Clocksin, W., Torr, P.H.S., \"Joint Optimisation for Object Class Segmentation and Dense Stereo Reconstruction,\" Proc. of British Machine Vision Conference, BMVC, 2010. Baştanlar, Y., Temizel, A., Yardımcı, Y., \"Karma Kamera Sistemleri için Otomatik Nokta Eşleştirme ve Gürbüz Temel Matris Kestirimi - Automatic Point Matching and Robust Fundamental Matrix Estimation for Hybrid Camera Scenarios,\" IEEE Sinyal İşleme ve İletişim Uygulamaları Kurultayı, SIU, 2009. Serce, H., Baştanlar, Y., Temizel, A., Yardımcı, Y, \"Tümyönlü İmgeler için Küresel Alanda Kenarların ve İlgi Noktalarının Tespiti Üzerine - On Detection of Edges and Interest Points for Omnidirectional Images in Spherial Domain,\" IEEE Sinyal İşleme ve İletişim Uygulamaları Kurultayı, SIU, 2008. Baştanlar, Y., Yardımcı, Y., \"Corner Validation based on Extracted Corner Properties,\" Computer Vision and Image Understanding, vol.112, p.243-261, 2008. Zabulis, X., Grammalidis, N., Baştanlar, Y., Yılmaz, E., Yardımcı, Y., \"3D Scene Reconstruction Based on Robust Camera Motion Estimation and Space Sweeping for a Cultural Heritage Virtual Tour System,\" 3DTV-Conference, 2008. Baştanlar, Y., Grammalidis, N., Zabulis, X., Yılmaz, E., Yardımcı, Y., Triantafyllidis, G., \"3D Reconstruction for a Cultural Heritage Virtual Tour System,\" ISPRS, 2008. Baştanlar, ",
  "content_length": 11957,
  "method": "requests",
  "crawl_time": "2025-12-01 14:50:05"
}