{
  "name": "Yan Yan 0002",
  "homepage": "https://tomyan555.github.io",
  "status": "success",
  "content": "Yan Yan | Personal Webpage Yan Yan Associate Professor Department of Computer Science University of Illinois Chicago office: LIB3-190G email: yyan55 [AT] uic.edu News: [Top] In Fall 2026 and Spring 2027, I have multiple openings for postdocs and Ph.D students in the fileds of computer vision, biomedical image analysis, multimedia and machine learning. Feel free to contact me with your CV. Bio Dr. Yan Yan is currently a tenured Associate Professor in the Department of Computer Science at the University of Illinois Chicago. He received his Ph.D. in Computer Science at the University of Trento. He has published 200+ research papers in the fields of computer vision, multimedia and machine learning. He received IBM Best Student Paper Award in ICPR 2014, Best Paper Award in ACM Multimedia 2015 and Best Paper Finalist in ACM Multimedia 2018. He has served as the General Chair for ACM ICMR 2025 and as Area Chairs for major computer vision and multimedia conferences including CVPR, ICCV, ECCV, BMVC, ACM Multimedia, ICLR and NeurIPS. He also served as associate editors in Neurocomputing, Computer Vision and Image Understanding (CVIU), Machine Vision and Applications (MVA), Image and Vision Computing (IVC), and guest editors in IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI), Computer Vision and Image Understanding (CVIU) and ACM Transactions on Multimedia Computing, Communications, and Applications (TOMM). Know more information please check the CVM-LAB. Publications Most recent publications on Google Scholar. Selected MIM4DD: Mutual Information Maximization for Dataset Distillation Yuzhang Shang, Zhihang Yuan, Yan Yan Conference on Neural Information Processing Systems (NeurIPS), 2023 Paper Boundary Guided Mixing Trajectory for Semantic Control with Diffusion Models Ye Zhu, Yu Wu, Zhiwei Deng, Olga Russakovsky, Yan Yan Conference on Neural Information Processing Systems (NeurIPS), 2023 Paper Code Towards Saner Deep Image Registration Bin Duan, Ming Zhong, Yan Yan IEEE International Conference on Computer Vision (ICCV), 2023 Paper Code Causal-DFQ: Causality Guided Data-free Network Quantization Yuzhang Shang, Bingxin Xu, Gaowen Liu, Ramana Kompella, Yan Yan IEEE International Conference on Computer Vision (ICCV), 2023 Paper Post-training Quantization on Diffusion Models Yuzhang Shang, Zhihang Yuan, Bin Xie, Bingzhe Wu, Yan Yan IEEE Conference on Computer Vision and Pattern Recognition (CVPR), 2023 Paper Code Discrete Contrastive Diffusion for Cross-Modal Music and Image Generation Ye Zhu, Yu Wu, Kyle Olszewski, Jian Ren, Sergey Tulyakov, Yan Yan International Conference on Learning Representations (ICLR), 2023 Paper Code Lipschitz Continuity Retained Binary Neural Network Yuzhang Shang, Dan Xu, Bin Duan, Ziliang Zong, Liqiang Nie, Yan Yan European Conference on Computer Vision (ECCV), 2022 Paper Code Learning Omnidirectional Flow in 360-degree Video via Siamese Representation Keshav Bhandari, Bin Duan, Gaowen Liu, Hugo Latapie, Ziliang Zong, Yan Yan European Conference on Computer Vision (ECCV), 2022 Paper Code Network Binarization via Contrastive Learning Yuzhang Shang, Dan Xu, Ziliang Zong, Liqiang Nie, Yan Yan European Conference on Computer Vision (ECCV), 2022 Paper Code Quantized GAN for Complex Music Generation from Dance Videos Ye Zhu, Kyle Olszewski, Yu Wu, Panos Achlioptas, Menglei Chai, Yan Yan, Sergey Tulyakov European Conference on Computer Vision (ECCV), 2022 Paper Code Lipschitz Continuity Guided Knowledge Distillation Yuzhang Shang, Bin Duan, Ziliang Zong, Liqiang Nie, Yan Yan IEEE International Conference on Computer Vision (ICCV), 2021 Paper Code Describing Unseen Videos via Multi-Modal Cooperative Dialog Agents Ye Zhu, Yu Wu, Yi Yang, Yan Yan European Conference on Computer Vision (ECCV), 2020 Paper Code Teaching UIC CS 512: Advanced Machine Learning (Fall 2025) UIC CS 594: Energy Efficient Deep Learning (Spring 2025) IIT CS 577: Deep Learning (Fall 2023) IIT CS 584: Machine Learning (Spring 2024, Spring 2023, Fall 2022, Fall 2021, Spring 2021) IIT CS 595: Advanced Topics on Computer Vision and Multimedia (Spring 2022) Members Computer Vision and Multimedia Lab on CVM-LAB Current PhD students: Changchang Sun (Fall 2021-current, B.S./M.S.: Shandong University) Zhenghao Zhao (Fall 2022-current, M.S.: IIT) Weitai Kang (Fall 2022-current, B.S.: Sun Yat-sen University) Junyi Wu (Spring 2023-current, B.S.: Sun Yat-sen University) Gengyu Zhang (Spring 2023-current, M.S.: University of Georgia) Haoxuan Wang (Fall 2023-current, B.S./M.S.: Shanghai Jiao Tong University) Feiran Wang (Spring 2024-current, M.S.: University of Illinois Urbana-Champaign) Jiachen Tao (Fall 2024-current, B.S.: Zhejiang University) Bingxin Xu (Part-time, Spring 2023-current, working at Discover Financial Services) Alumni: Postdocs and PhDs: Gaowen Liu (Postdoc 2018-2020, First Employment: Research Scientist at Cisco Research) Keshav Bhandari (PhD 2018-2022, First Employment: Sr. Software Engineer at Tesla) Ye Zhu (PhD 2019-2023, First Employment: Postdoctoral Researcher at Princeton University) Bin Duan (PhD 2019-2024, First Employment: Postdoctoral Researcher at the University of Michigan) Yuzhang Shang (PhD 2021-2025, First Employment: Assistant professor at the University of Central Florida) Visitings: Hao Tang (Visiting PhD 2018-2019 from University of Trento, Next: Postdoc at ETH Zürich) Yutian Lin (Visiting PhD 2018-2019 from University of Technology Sydney, Next: Associate Professor at Wuhan University) Xianjin Han (Visiting PhD 2019-2020 from Shandong University, Next: Postdoc at National University of Singapore) Na Zheng (Visiting PhD 2019-2020 from Shandong University, Next: Postdoc at National University of Singapore) Aihua Zheng (Visiting Professor 2019-2020 from Anhui University) Songsong Wu (Visiting Professor 2018-2019 from Nanjing University of Posts and Telecommunications) Masters with Thesis: Castaneda Lopez Luis (Master 2022, First Employment: Software Engineer at NextShift) Chaguer Reda (Master 2022, First Employment: Software Engineer at Meta) Elomari Alaoui Ismail (Master 2022, First Employment: Software Dev Engineer at Amazon) Jorge Cervera Perez (Master 2021, First Employment: Senior Software Engineer at Qualcomm) De Miguel Juan Carlos (Master 2021, First Employment: Data Scientist at Caterpillar Inc) Ali Issaoui (Master 2021, First Employment: Software Engineer at Amazon Web Services) Nikhil Sharma (Fall 2023-Spring 2025, M.S.: IIT) Undergraduates: Mario A. DeLaGarza (Undergraduate 2019, First Employment: Software Engineer at Google) Theo William Guidroz (Undergraduate 2021-2022, First Employment: Software Engineer at Google) Chengyuan Xue (University of Toronto REU 2023, Next: University of Toronto) William Zhu (UChicago High School Student 2022, Next: Yale University) Kavya Uppal (Illinois Mathematics and Science Academy High School Student 2023) Misc This website was built with jekyll based on a template by Martin Saveski. Yan Yan email: yyan55 [AT] uic.edu",
  "content_length": 7012,
  "method": "requests",
  "crawl_time": "2025-12-01 14:50:02"
}