{
  "name": "Yan Shoshitaishvili",
  "homepage": "http://www.yancomm.net",
  "status": "success",
  "content": "Yan Shoshitaishvili I am an Associate Professor at Arizona State University, where I pursue passions of cybersecurity research, real-world impact, and education. My research focuses on automated program analysis and vulnerability detection techniques, but broadens to system security in general. Aside from publishing dozens of research papers in top academic venues, I led Shellphish's participation in the DARPA Cyber Grand Challenge, achieving the creation of a fully autonomous hacking system that won third place in the competition. Underpinning much of my research is angr, the open-source program analysis framework my collaborators and I created. This framework has powered hundreds of research papers, helped find thousands of security bugs, and continues to be used in research labs and companies around the world. When I am not doing research, I participate in the enthusiast and educational cybersecurity communities. I am a Captain Emeritus of Shellphish, one of the oldest ethical hacking groups in the world, and a founder of the Order of the Overflow, with whom I ran DEF CON CTF, the \"world championship\" of cybersecurity competitions, from 2018 through 2021. Now, I help demystify the hacking scene as a co-host of the CTF RadiOOO podcast. In order to inspire students to pursue cybersecurity (and, ultimately, compete at DEF CON!), I created pwn.college, an open practice-makes-perfect learning platform that is revolutionizing cybersecurity education for aspiring hackers around the world. So you want to be a hacker? You can... ... get into Cybersecurity! I got my start in hacking early on. To try to replicate this experience, I created pwn.college. If you want to learn, go and tackle the challenges there! ... compete in CTFs! Once you pick up the basics on pwn.college, you can solidify your skills through Cybersecurity competition. We mentor promising hackers through Arizona State University's CTF Academy! ... go to graduate school! After you build up your skills by earning an advanced pwn.college belt or demonstrating your talent some other way (e.g., CTFs), you might want to explore the awesomeness of graduate research! You can visit us for a research internship or apply to our PhD program. Feel free to reach out if you have any questions! Communicating with me: I love hearing from you! Unfortunately, I get about 150 emails a day. When emailing me, please keep this graph in mind. The top of the y axis is probably years. Use your best judgement for the x axis! That being said, please reach out!",
  "content_length": 2536,
  "method": "requests",
  "crawl_time": "2025-12-01 14:50:02"
}