{
  "name": "Yan Liu 0002",
  "homepage": "https://sites.google.com/view/yanliu-ai/home",
  "status": "success",
  "content": "Homepage of Prof. Yan LiuSearch this siteEmbedded FilesSkip to main contentSkip to navigationYan LiuProfessor, Thomas Lord Department of Computer ScienceDirector, USC Machine Learning Centerco-Director, USC Insitutue of  Ethics and Trust in ComputingMing Hsieh Department of Electrical Engineering (by courtesy)   Viterbi School of EngineeringUniversity of Southern CaliforniaEmail:FirstnameLastname.cs@usc.edu(notice that yanliu@usc.edu is NOT me)Phone: 1-213-740-4371Lab: RTH 321 I am a full professor in the Computer Science Department, Viterbi School of Engineering at USC. I was an assistant professor from 2010 to 2016, and an associate professor from 2016 to 2020. Before joining USC, I was a research staff member at the IBM T.J. Watson Research Center from 2006 to 2010. I received my M.S. and Ph.D. from Carnegie Mellon University. My research interests include machine learning for time series, physics-informed machine learning, and interpretable machine learning,  with applications to health, sustainability, and social media.Research: Here's my google scholar page for a list of all publications and the Melady group website for details about my research group and research projects. Service: I'm serving as associate Editor-in-Chief of TPAMI, Board Member and Finance Chair of ICLR.  I previously served as general chair (or co-chair) for ICLR 2023 and ACM KDD 2020, program chair (or co-chair)  of ICLR 2022, ACM KDD 2022, SDM 2020, ACM BCB 2020, WSDM 2018, and associate program co-chair for AAAI 2021.Selected Recent PublicationsA Theoretical and Empirical Analysis of Divide-and-Conquer Prompting in LLMs.  Y Zhang, L Du, D Cao, Q Fu, Y Liu.  COLM 2025. InstaSHAP: Interpretable Additive Models Explain Shapley Values Instantly.  J. Enouen, Y. Liu. ICLR 2025. An Empirical Examination of Balancing Strategy for Counterfactual Estimation on Time Series.  Q. Huang, C. Meng, D. Cao, B. Huang, Y. Chang, Y.  Liu. ICML 2024.TEMPO: Prompt-based Generative Pre-trained Transformer for Time Series Forecasting.  D. Cao, F. Jia, S. O Arik,  T. Pfister, Yi.  Zheng, W.  Ye, Y.  Liu. ICLR 2024. Sparse Interaction Additive Networks via Feature Interaction Detection and Sparse Selection. J. Enouen, Y. Liu. Advances in Neural Information Processing Systems 35 (NeurIPS 2022)Interpretability and fairness evaluation of deep learning models on MIMIC-IV dataset. C. Meng, L. Trinh, N. Xu, J. Enouen, Y. Liu. Nature Scientific Reports, 2022Miscellaneous  (wonderful stories about our research work for non-experts in AI)The Perfect Stitch: Training for Surgery Using AIUSC Researchers Analyze Coronavirus Misinformation on TwitterFighting Addiction Before It BeginsGoogle SitesReport abusePage detailsPage updated Google SitesReport abuse",
  "content_length": 2744,
  "method": "requests",
  "crawl_time": "2025-12-01 14:50:02"
}