{
  "name": "Yan Tong",
  "homepage": "http://www.cse.sc.edu/~tongy",
  "status": "success",
  "content": "Yan Tong's homepage Yan Tong Professor Department of Computer Science and Engineering University of South Carolina 550 Assembly Street Columbia, SC 29208 Office: 2273 Storey Innovation Center Email: tongy@cec.sc.edu Phone: 803-777-0801 Fax: 803-777-3767 Short Bio Dr. Tong received her Ph.D. degree in Electrical Engineering from Rensselaer Polytechnic Institute, Troy, New York. She is currently a Professor in the Department of Computer Science and Engineering at the University of South Carolina. Before joining USC, she has been working in Visualization and Computer Vision Lab of GE Global Research Center since January 2008. Research Interests Dr. Tong¡¯s general research interests are on computer vision, machine learning, and human computer interaction, especially in ¡¤       Machine learning and its applications in computer vision and interdisciplinary research such as psychology, cybersecurity, HCI, marketing, materials science, mechanical engineering, and mobile computing ¡¤ Probabilistic graphical models and their applications in computer vision including modeling, reasoning, information fusion, and learning under uncertainty ¡¤ Affective computing (facial activity analysis and eye gaze tracking) Selected Services and Activities Associate Editor of Computer Vision and Image Understanding Workshop Chair of the 31st ACM International Conference on Multimedia Program Co-chair of the 5th IEEE International Conference on Multimedia Information Processing and Retrieval (IEEE-MIPR 2022) Program Co-chair of the 12th IEEE Conference on Automatic Face and Gesture Recognition (FG 2017). Publicity co-chair of the 2022 IEEE International Conference on Information Reuse and Integration for Data Science (IRI 2022) Doctoral Consortium co-chair and Web chair of the 13th IEEE Conference on Automatic Face and Gesture Recognition (FG2018). Guest editor, Best of Automatic Face and Gesture Recognition 2017 special issue, Image and Vision Computing, 2017 Demo chair of the 6th Humaine Association Conference on Affective Computing and Intelligent Interaction (ACII 2015). Chair of the 1st International Workshop on Multimedia Affective Computing (MAC 2014), in conjunction with International Conference on Multimedia and Expo (ICME 2014), July 18th, 2014. Doctoral Consortium co-chair of the International Conference on Multimedia and Expo (ICME 2014). Doctoral Consortium co-chair and Web chair of the 10th IEEE Conference on Automatic Face and Gesture Recognition (FG2013). Recent Publications (Complete List) Journal Publications 1.      Jie Cai, Zibo Meng, Ahmed Shehab Khan, Zhiyuan Li, James O¡¯Reilly, Xiangyu Hu, and Yan Tong, ¡°Probabilistic Attribute Tree in Convolutional Neural Networks for Facial Expression Recognition,¡± IEEE Transaction on Affective Computing, March, 2022. 2. W. Chang, Benli Peng, A.S. Khan, M. Alwazzan, Y.Y. Zhang, X.D. Li, Y. Tong, and Chen Li, ¡°Grain Size Effect on the Wettability of As-Grown Graphene and Dropwise Condensation,¡± Carbon, Vol. 171, pp. 507-513, 2021, Jan. 2021. 3. W.M. Li, Z.K. Wang, F.H. Yang, T. Alam, M.N. Jiang, X.P. Qu, F.Y. Kong, A.S. Shehab Khan, M.J. Liu, M. Alwazzan, Y. Tong, and C. Li, ¡°Super Capillary Architecture-activated Boundary Layer for Highly Stable and Efficient Two-phase Transport¡±, Advanced Materials, 32(2) (2020),1905117. 4. Zibo Meng, Shizhong Han, Ping Liu, and Yan Tong, ¡°Improving Speech Related Facial Action Unit Recognition by Audiovisual Information Fusion,¡± IEEE Transactions on Cybernetics, Vol. 49, No. 9, pp. 3293 ¨C 3306, September 2019. 5.      Zibo Meng, Shizhong Han, and Yan Tong, ¡°Listen to Your Face: Inferring Facial Action Units from Audio Channel,¡± IEEE Transactions on Affective Computing, Vol. 10, No. 4, pp. 537-551, Oct. ¨C Dec. 1, 2019. 6.      Yuewei Lin, Yan Tong, Yu Cao, Youjie Zhou, and Song Wang, ¡°Detecting Infrequently Moving Foreground from Background with Frequent Local Motions: A Background Subtraction based Approach,¡± IEEE Transaction on Circuits and Systems for Video Technology, Vol. 27, No. 6, June 2017. 7.      Tamanna Alam, Ahmed Shehab Khan, Wenming Li, Fanghao Yang, Yan Tong, Jamil Khan, and Chen Li, \"Transient force analysis and bubble dynamics during flow boiling in silicon nanowire microchannels,\" International Journal of Heat and Mass Transfer, V. 101, pp. 937-947, October 2016. 8. Zibo Meng, Shizhong Han, Min Chen, and Yan Tong, ¡°Audiovisual Facial Action Unit Recognition using Feature Level Fusion,¡± International Journal of Multimedia Data Engineering and Management, Vol. 7, No. 1, pp. 60-76, August, 2016. 9. Jonathan Kenneth Bunn, Shizhong Han, Yan Tong, Yan Zhang, Jianjun Hu, and Jason Ryan Hattrick-Simpers, ¡°Generalized Machine Learning Algorithm for Automatic Phase Attribution in High-throughput Experimental Studies,¡± Journal of Materials Research, Vol. 30, No. 7, pp. 879 ¨C 889, April, 2015. 10.  Yan Tong, Xiaoming Liu, Frederick W. Wheeler, and Peter Tu, ¡°Semi-supervised Facial Landmark Annotation,¡± Computer Vision and Image Understanding (CVIU), Vol. 116, No. 8, pp. 922-935, August, 2012. Selected Conference Papers 1. Jie Cai, Zibo Meng, Ahmed Shehab Khan, Zhiyuan Li, Shizhong Han, and Yan Tong, ¡°Identity-Free Facial Expression Recognition using Conditional Generative Adversarial Network,¡± in Proceedings of 2021 IEEE International Conference on Image Processing (ICIP 2021), September 2021. 2. Ahmed Shehab Khan, Zhiyuan Li, Jie Cai, and Yan Tong, ¡°Regional Attention Networks with Context-aware Fusion for Group Emotion Recognition,¡± in Proceedings of 2021 IEEE Winter Conference on Applications of Computer Vision (WACV 2021), Jan. 2021. 3. Zhiyuan Li, Shizhong Han, Ahmed Shehab Khan, Jie Cai, Zibo Meng, James O'Reilly, and Yan Tong, ¡°Pooling Map Adaptation in Convolutional Neural Network for Facial Expression Recognition,¡± in Proceedings of IEEE International Conference on Multimedia and Expo (ICME2019), 2019. 4. Ahmed Saaudi, Yan Tong, and Csilla Farkas, ¡°Probabilistic Graphical Model on Detecting Insiders: Modeling with SGD-HMM,¡± in Proceedings of the 5th International Conference on Information Systems Security and Privacy (ICISSP 2019), 2019. 5. Ahmed Saaudi, Al-ibadi Zaid, Yan Tong, and Csilla Farkas, ¡°Insider Threats Detection using CNN-LSTM Model,¡± in Symposium on Cyber Warfare, Cyber Defense, & Cyber Security (CSCI-ISCW), 2019. 6. James O¡¯Reilly, Ahmed Shehab Khan, Zhiyuan Li, Jie Cai, Xiangyu Hu, Min Chen, and Yan Tong, ¡°A Novel Remote Eye Gaze Tracking System Using Line Illumination Sources,¡± in Proceedings of IEEE 2nd International Conference on Multimedia Information Processing and Retrieval (MIPR2019), 2019. 7. Jie Cai, Zibo Meng, Ahmed Shehab Khan, Zhiyuan Li, James O¡¯Reilly, Shizhong Han, Ping Liu, Min Chen, and Yan Tong, ¡°Feature-level and Model-level Audiovisual Fusion for Emotion Recognition in the Wild,¡± in Proceedings of IEEE 2nd International Conference on Multimedia Information Processing and Retrieval (MIPR2019), 2019. 8. Ahmed Shehab Khan, Zhiyuan Li, Jie Cai, Zibo Meng, James O¡¯Reilly, and Yan Tong, ¡°Group-level Emotion Recognition using Deep Models with A Four-stream Hybrid Network,¡± in Proceedings of the 6th Emotion Recognition in the Wild Challenge, in conjunction with ACM International Conference on Multimodal Interaction (ICMI2018), 2018. 9. Shizhong Han, Zibo Meng, Zhiyuan Li, James O¡¯Reilly, Jie Cai, Xiaofeng Wang, and Yan Tong, ¡°Optimizing Filter Size in Convolutional Neural Networks for Facial Action Unit Recognition,¡± IEEE Conference on Computer Vision and Pattern Recognition (CVPR2018), 2018. 10.  Jie Cai, Zibo Meng, Ahmed Shehab Khan, Zhiyuan Li, James O¡¯Reilly, and Yan Tong, ¡°Island Loss for Learning Discriminative Features in Facial Expression Recognition,¡± IEEE Conference on Automatic Face and Gesture Recognition (FG2018), Xi¡¯an, May, 2018. 11.    Ming-Ching Chang, Yi Yao, Guan Li, Yan Tong, and Peter Tu, ¡°Cloud Tracking for Solar Irradiance Prediction,¡± International Conference on Image Processing (ICIP2017), Beijing, China, September 2017. 12.    Zibo Meng, Xiaochuan Fan, Xin Chen, Min Chen, and Yan Tong, ¡°Detecting Small Signs from Large Images,¡± IEEE International Conference on Information Reuse and Integration (IRI 2017), San Diego, August, 2017. 13. Zibo Meng, Ping Liu, Jie Cai, Shizhong Han, and Yan Tong, ¡°Identity-Aware Convolutional Neural Network for Facial Expression Recognition,¡± IEEE Conference on Automatic Face and Gesture Recognition (FG2017), Washington DC, May, 2017. 14. Shizhong Han, Zibo Meng, Ahmed Shehab Khan, and Yan Tong, ¡°Incremental Boosting Convolutional Neural Network for Facial Action Unit Recognition,¡± the 30th Annual Conference on Neural Information Processing Systems (NIPS 2016), Barcelona, Spain, December, 2016. 15.  Tamanna Alam, Wenming Li, Fanghao Yang, Ahmed Shehab Khan, Yan Tong, Jamil Khan, Jing Li, Zuankai Wang, and Chen Li, ¡°Force Analysis of Bubble Dynamics in Flow Boiling Silicon Nanowire Microchannels,¡± Micro/Nanoscale Heat & Mass Transfer International Conference, Biopolis, Singapore, January, 2016. 16.  Zibo Meng, Shizhong Han, Min Chen, and Yan Tong, ¡°Feature Level Fusion for Bimodal Facial Action Unit Recognition,¡± IEEE International Symposium on Multimedia (ISM 2015), Miami, December, 2015. 17.  Shizhong Han, Zibo Meng, Ping Liu, and Yan Tong, ¡°Facial Grid Transformation: A Novel Face Registration Approach for Improving Facial Action Unit Recognition,¡± IEEE International Conference on Image Processing (ICIP14), Paris, October, 2014. 18.  Ping Liu, Joey Tianyi Zhou, Ivor Tsang, Zibo Meng, Shizhong Han, and Yan Tong, ¡°Feature Disentangling Machine-A Novel Approach of Feature Selection and Disentangling in Facial Expression Analysis,¡± European Conference on Computer Vision (ECCV14), Zurich, September, 2014. 19.  Ping Liu, Shizhong Han, Zibo Meng, and Yan Tong, ¡°Facial Expression Recognition via a Boosted Deep Belief Network,¡± IEEE Conference on Computer Vision and Pattern Recognition (CVP",
  "content_length": 11399,
  "method": "requests",
  "crawl_time": "2025-12-01 14:50:04"
}