{
  "name": "Yan Chen 0033",
  "homepage": "https://chensivan.github.io",
  "status": "success",
  "content": "Yan Chen - Assistant Professor at Virginia Tech Yan Chen CV | GScholar | X ych at vt.edu My group studies, designs, and develops interactive Human-AI systems that empower data workers to discover insights and detect critical patterns in real-time data analysis, such as in-class students' learning behaviors. The systems we develop streamline the analytical process by reducing the effort and programming skills users need. We achieve this by employing AI techniques, such as LLMs, to identify and predict underlying data structures and representations, and by integrating human-centered design principles to ensure seamless interaction between humans and AI. Our goal is to make advanced real-time data analysis more accessible and efficient for everyone by simplifying complex computational processes. I am looking for students to join me to design the future intelligent programming assistance. If you are interested in working with me, complete this form! Bio Yan Chen is an Assistant Professor of Computer Science at Virginia Tech (USA) where he directs the Programming with Intelligent Machines & Environments Lab (PRIME) . Yan is an Assistant Director of the Center for Human Computer Interaction (CHCI) at VT. His research spans programming support tools, learning at scale, real-time data analysis, and CS education. His work has been published at top HCI conferences, including ACM CHI, UIST, and CSCW. He received the Best Short Paper award at VL/HCC 2020, the Best Paper at L@S 2024, and the Best Paper Honorable Mention Award at CHI 2023, and UIST 2022. Yan was a Postdoctoral Fellow at the University of Toronto (Canada). He received his Ph.D. degree from the University of Michigan (USA), and BS and MS degrees in Applied Math and Electrical & Computer Engineering from the University of Colorado, Boulder (USA). News (2025.5) A few papers are conditionally accepted to CSCW'25, VL/HCC'25, ICER'25. (2025.5) Will be serving on the CHI'26, UIST'26 PC. Team Yue Shen PhD, VT Panayu Keelawat PhD, VT Xiaohang Tang PhD, VT Kevin Pu PhD, UofT David Barron MS, VT Darshan Nere MS, VT Aravinda Kashyap MS, VT Minsun Kim MS, KIAST Susan He BS, UVA Saksham Kumar BS, VT Rezky Dwisantika BS, SNIT, Indonesia You? Join us! Publications Panayu Keelawat, David Barron, Kaushik Narasimhan, Daniel Manesh, Xiaohang Tang, Xi Chen, Sang Won Lee, Yan Chen. Dynamite: Real-Time Debriefing Slide Authoring through AI-Enhanced Multimodal Interaction IEEE Symposium on Visual Languages and Human-Centric Computing (VL/HCC), 2025 [local | Demo] Haonan Zhang, Peng Zhang, Yan Chen, Meitong Guo, Hansu Gu, Tun Lu, Ning Gu. WePilot: Integrating Younger Family Members and Chatbot to Support Older Adults Learning Smartphone Usage ACM Conference on Computer-Supported Cooperative Work and Social Computing (CSCW), 2025 [local] Daniel Manesh, Tong Wu, Yan Chen, Sang Won Lee. Understanding and Improving Student Note-Taking in Live Coding Lectures ACM Conference on International Computing Education Research (ICER), 2025 [ACM | local] Kevin Pu, Daniel Lazaro, Ian Arawjo, Haijun Xia, Ziang Xiao, Tovi Grossman, Yan Chen. Assistance or Disruption? Exploring and Evaluating the Design and Trade-offs of Proactive AI Programming Support ACM Conference on Human Factors in Computing Systems (CHI), 2025 [demo video | pdf] Tianjia Wang, Tong Wu, Huayi Liu, Chris Brown, Yan Chen. Generative Co-Learners: Enhancing Cognitive and Social Presence of Students in Asynchronous Learning with Generative AI ACM GROUP 2025 [local | ACM | Demo] Tong Wu, Xiaohang Tang, Sam Wong, Xi Chen, Cliff Shaffer, Yan Chen. The Impact of Group Discussion and Formation on Student Performance: An Experience Report in a Large CS1 Course. SIGCSE 2025 [pre-print] Xiaohang Tang, Sam Wong, Kevin Pu, Xi Chen, Yalong Yang, Yan Chen. VizGroup: An AI-Assisted Event-Driven System for Real-Time Collaborative Programming Learning Analytics. UIST 2024 [pre-print | 30 second demo | 5 min demo] Listen to a two-host podcast about VizGroup. The content is generated by NotebookLM, and verified by the authors. Ashley Zhang, Xiaohang Tang, Steve Oney, Yan Chen. CFlow: Supporting Semantic Flow Analysis of Students' Code in Programming Problems at Scale. ACM Learning @ Scale 2024 (L@S) '24. (🏆 Best Paper) [local pdf | arxiv | talk video] Tianjia Wang, Daniel Vargas Diaz, Chris Brown, Yan Chen. Exploring the Role of AI Assistants in Computer Science Education: Methods, Implications, and Instructor Perspectives. IEEE Symposium on Visual Languages and Human-Centric Computing (VL/HCC), 2023. [local pdf] Kevin Pu, Jim Yang, Angel Yuan, Minyi Ma, Rui Dong, Xinyu Wang, Yan Chen, Tovi Grossman. DiLogics: Creating Web Automation Programs with Diverse Logics. ACM Symposium on User Interface Software and Technology (UIST), 2023. [local pdf | 5 min system demo] Ashley Ge Zhang, Yan Chen, Steve Oney. RunEx: Augmenting Regular-Expression Code Search with Runtime Values IEEE Symposium on Visual Languages and Human-Centric Computing (VL/HCC), 2023. [local pdf] Ashley Zhang, Yan Chen, Steve Oney. VizProg: Identifying Misunderstandings by Visualizing Students' Coding Progress. ACM Conference on Human Factors in Computing Systems (CHI), 2023. (🏅Best Paper Honorable Mention) [local pdf | 9 min system demo] VizProg presents an innovative, real-time visualization system that meaningfully displays class-wide students' coding progress, making it simple for programming instructors to pinpoint issues and mistakes. Thoughts: The challenge of delivering programming education at scale is exacerbated by factors such as real-time instruction, a large student population, novice learners, and the complexity of the material being taught. To enhance the classroom experience for students and simplify the task for instructors, how can we make programming education more engaging and manageable? Kevin Pu, Rainey Fu, Rui Dong, Xinyu Wang, Yan Chen, Tovi Grossman. SemanticOn: Specifying Content-Based Semantic Conditions for Web Automation Programs. ACM Symposium on User Interface Software and Technology (UIST), 2022. (🏅Best Paper Honorable Mention) [local pdf | 30 sec preview | 5 min system demo] SemanticOn enables users to specify visual and textual semantic conditions in web automation programs by natural language description and content highlighting. Thoughts: SemanticOn only considers 1-1 mapping between user intents and UI actions. How can we support other kinds of mappings? How can we design PbD systems are more trustworthy? April Wang*, Yan Chen*, John Joon Young Chung, Christopher Brooks, Steve Oney. PuzzleMe: Leveraging Peer Assessment for In-Class Programming Exercises. ACM Conference on Computer-Supported Cooperative Work and Social Computing (CSCW), 2021 (* == equal contribution). [local pdf] presentation video | 5 min system demo | ACM link] To scale programming support in a large live classroom, PuzzleMe coordinates students to help each other by exchanging test cases and problem-solving approaches for coding exercises. Karthik Mahadevan, Yan Chen, Maya Cakmak, Anthony Tang, Tovi Grossman. Mimic: In-Situ Recording and Re-Use of Demonstrations to Support Robot Teleoperation. ACM Symposium on User Interface Software and Technology (UIST), 2022. [local pdf | 30 sec preview | 5 min system demo] Teleoperators can use Mimic to program robots by demonstration and reuse demonstrations in new context Rui Dong, Zhicheng Huang, Ian Iong Lam, Yan Chen, Xinyu Wang. WebRobot: Web Robotic Process Automation using Interactive Programming-by-Demonstration. ACM SIGPLAN Conference on Programming Language Design and Implementation (PLDI), 2022. [ACM ] Jiannan Li, Mauricio Sousa, Chu Li, Jessie Liu, Yan Chen, Ravin Balakrishnan, Tovi Grossman. ASTEROIDS: Exploring Swarms of Mini-Telepresence Robots for Physical Skill Demonstration. ACM Conference on Human Factors in Computing Systems (CHI), 2022. [local pdf | 30 sec preview | 2 min system demo | presentation video ] Asteroids explores a new space of remote physical task learning via telepresence robots Yan Chen, Walter S. Lasecki, Tao Dong. Towards Supporting Programming Education at Scale via Live Streaming. ACM Conference on Computer-Supported Cooperative Work and Social Computing (CSCW), 2020. [local pdf | ACM link | 9 min paper review by Vivek Haldar] Explores the motivations/barriers/opportunities of live streaming programming as compared to pre-recorded video through interviews with 14 streamers & 12 viewers. Thoughts: What can we do to enhance the learning experience in an online environment by adopting the in-person social features that a physical library has? What can be done to support different social needs in an online learning context in order to enhance learning outcomes? Yan Chen, Tovi Grossman. Umitation: Retargeting UI Behavior Examples for Website Design. ACM Symposium on User Interface Software and Technology (UIST), 2021 [local pdf | 30 sec preview | 5 min system demo | ACM link | Anecdotes] Umitation enables web developers to perform \"copy-and-paste\" (retarget) interaction on web front-end UI behaviors with a trigger-object-response framework. Umitation enables web developers to perform \"copy-and-paste\" (retarget) interaction on web front-end UI behaviors with a trigger-object-response framework.Umitation enables web developers to perform \"copy-and-paste\" (retarget) interaction on web front-end UI behaviors with a trigger-object-response framework.Umitation enables web developers to perform \"copy-and-paste\" (retarget) interaction on web front-end UI behaviors with a trigger-object-response framework. Yan Chen, Sang Won Lee, Steve Oney. CoCapture: Effectively Communicating UI Behaviors on Existing Websites by Demonstrating and Remixing. ACM Conference on Human Factors in Computing Systems (CHI), 2021. [local pdf | 30 sec preview | 5 min system demo | ACM link] CoCapture allows designers to create UI behavior mockups on existing web interfaces by demonstrating and remixing, and to accurately describe their request",
  "content_length": 15881,
  "method": "requests",
  "crawl_time": "2025-12-01 14:49:55"
}