{
  "name": "Yan Zheng 0002",
  "homepage": "https://yanzzzzz.github.io",
  "status": "success",
  "content": "ZHENG YAN / 郑岩 | Tianjin University / 天津大学 About Me I’m now a Associate Professor in Tianjin University, co-learding the Deep Reinforcement Learning Lab, founded by Prof. Jianye Hao (郝建业). Before that, I was a Research Fellow at Nanyang Technological Univesrsity (NTU) and worked in the research group of Prof. Liu Yang (刘杨). Ads: We are taking self-motivated PhDs, masters, research interns and full-time researchers. If you are interested in the research topics (see here), please send us your CV! Contact: yanzheng@tju.edu.cn / jianye.hao@tju.edu.cn Research Interests Reinfrocement Learning (RL): representation RL, offline RL, model-based RL, transfer RL. Multiagent System (MAS): cooperative/competitive learning, opponent modeling. Large-scale Learning System: distributed RL, evolutioanry RL. News [Jan. 2023] Our four paper (one spotlight) are accepted to ICLR 2023 ! [Dec. 2022] Our solution won the 1st prize in the NeruIPS Driving SMARTS Competition (Track 1 & 2) NeruIPS 2022 Competition ! [Nov. 2022] Our paper is accepted to AAAI 2023 ! [Oct. 2022] Our three papers are accepted to NeurIPS DeepRL Workshop 2022 ! [Sep. 2022] Our paper about Symoblic RL is accepted to NeurIPS 2022 ! [Jun. 2022] Our paper about cooperative multiagent RL is accepted to ICML 2022 ! [May. 2022] Our paper about transfer RL is accepted to UAI 2022 ! [Apr. 2022] Our paper about representation RL is accepted to IJCAI 2022 ! [Feb. 2022] Our paper is accepted to Applied Energy 2022 (SCI 1 / impact factor: 11.456) ! [Jan. 2022] Our paper about (action) representation RL is accepted to ICLR 2022 ! [Feb. 2022] Our paper about representation RL is accepted to AAAI 2022 ! [Dec. 2021] Our paper about negoation won the Best Paper Award at PRICAI 2022. [Nov. 2021] Our paper about cooperative MAS is accepted to NeruIPS 2021 workshop ! [Nov. 2021] Our paper about exploration in RL is accepted to NeruIPS 2021 workshop ! [Aug. 2021] Our paper is accepted to ASE 2022 Industry Track ! [Apr. 2021] Our paper about cooperative MAS in smartgrid is accepted to IEEE TSG 2021 (SCI 1 / impact factor: 10.275) ! [Jan. 2021] Our paper about RL for automatic web testing is accepted by ICSE 2021. Publications [Google scholar] 2022 GALOIS: Boosting Deep Reinforcement Learning via Generalizable Logic Synthesis (NeurIPS 2022) Yushi Cao, Zhiming Li, Tianpei Yang, Hao Zhang, Yan Zheng*, Yi Li, Jianye Hao, Yang Liu PMIC: Improving Multi-Agent Reinforcement Learning with Progressive Mutual Information Collaboration (ICML 2022) Pengyi Li, Hongyao Tang, Tianpei Yang, Xiaotian Hao, Sang Tong, Yan Zheng*, Jianye Hao*, Matthew E. Taylor, Jinyi Liu Cross-domain Adaptive Transfer Reinforcement Learning Based on State-Action Correspondence (UAI 2022) Heng You, Tianpei Yang*, Yan Zheng*, Jianye Hao*, Mathew Taylor PAnDR: Fast Adaptation to New Environments from Offline Experiences via Decoupling Policy and Environment Representations (IJCAI 2022) Tong Sang, Hongyao Tang, Yi Ma, Jianye Hao*, Yan Zheng*, Zhaopeng Meng, Boyan Li, Zhen Wang* HyAR: Addressing Discrete-Continuous Action Reinforcement Learning via Hybrid Action Representation (ICLR 2022) Boyan Li, Hongyan Tang, Yan Zheng*, Jianye Hao*, Pengyi Li, Zhen Wang, Zhaopeng Meng, Li Wang. Hybrid process model and smart policy network of electric-vehicle resources for instantaneous power flow imbalances (Applied Energy, IF=11.446, SCI 1) Chaoyu Dong, Jianwen Sun, Yanran Li*, Yan Zheng*, Jianye Hao*, Yang Liu, Hongjie Jia. PMIC: Improving Multi-Agent Reinforcement Learning with Progressive Mutual Information Collaboration (NeruIPS 2021 Cooperative AI Workshop) Pengyi Li, Hongyao Tang, Tianpei Yang, Xiaotian Hao, Sang Tong, Yan Zheng*, Jianye Hao*, Matthew E. Taylor, Jinyi Liu OVD-Explorer: A General Information-theoretic Exploration Approach for Reinforcement Learning (NeruIPS 2021 Deep RL Workshop) Jinyi Liu, Zhi Wang, Yan Zheng*, Hao Jianye*, Junjie Ye, Chenjia Bai, Pengyi Li A Bayesian Policy Reuse Approach for Bilateral Negotiation Games (AAAI 2022 Reinforcement Learning in Games Workshop) Xiaoyang Gao, Siqi Chen, Yan Zheng and Jianye Hao Automatic HMI Structure Exploration Via Curiosity-Based Reinforcement Learning (ASE 2022 Industry Track) Yushi Cao; Yan Zheng*; Shang-Wei Lin; Yang Liu; Yon Shin Teo; Yuxuan Toh; Vinay Vishnumurthy Adiga 2021 Vulnerability Assessment of Deep Reinforcement Learning Models for Power System Topology Optimization (IEEE TSG 2021, SCI 1, IF=10.275) Yan Zheng, Ziming Yan, Kangjie Chen, Jianwen Sun, Yan Xu, Yang Liu. Automatic Web Testing using Curiosity-Driven Reinforcement Learning (ICSE 2021) Yan Zheng, Yi Liu, Xiaofei Xie, Yepang Liu, Lei Ma, Jianye Hao, and Yang Liu. Generating BehaviorDiverse Game AIs with Evolutionary Multi-Objectives Deep Reinforcement Learning (IJCAI 2021) Ruimin Shen*, Yan Zheng*, Jianye Hao, Zhaopeng Meng, Yingfeng Chen, Chanjgie Fan and Yang Liu. KoGuN: Accelerating Deep Reinforcement Learning via Integrating Human Suboptimal Knowledge (IJCAI 2021) Peng Zhang, Jianye Hao, Weixun Wang, Hongyan Tang, Yi Ma, Yihai Duan and, Yan Zheng. 2020 Efficient policy detecting and reusing for non-stationarity in Markov games (JAAMAS 2020) Yan Zheng, Jianye Hao, Zongzhang Zhang, Zhaopeng Meng, Tianpei Yang, Yanran Li, Changjie Fan. Continuous Multiagent Control using Collective Behavior Entropy for Large-Scale Home Energy Management (AAAI 2020) Jianwen Sun*, Yan Zheng*, Jianye Hao, Zhaopeng Meng and Yang Liu. Efficient Multiagent Policy Optimization Based on Weighted Estimators in Stochastic Cooperative Environments (JCST 2020) Yan Zheng, Jianye Hao, Zongzhang Zhang, Zhaopeng Meng, Xiaotian Hao. Wuji: Automatic Online Combat Game Testing Using Evolutionary Deep Reinforcement Learning (ASE 2019, Distinguished Paper Award) Yan Zheng, Xiaofei Xie, Ting Su, Lei Ma, Jianye Hao, Zhaopeng Meng, Yang Liu, Ruimin Shen, Yinfeng Chen and Changjie Fan. 2019 Large-scale home energy management using entropy-based collective multiagent deep reinforcement learning framework (IJCAI 2019) Yaodong Yang, Jianye Hao, Yan Zheng, Chao Yu. Towards Efficient Detection and Optimal Response against Sophisticated Opponents (IJCAI 2019) Tianpei Yang, Jianye Hao, Zhaopeng Meng, Zongzhang Zhang, Yan Zheng, Chao Yu. Large-Scale Home Energy Management Using Entropy-Based Collective Multiagent Reinforcement Learning Framework (AAMAS 2019) Yaodong Yang, Jianye Hao, Yan Zheng, Xiaotian Hao and Bofeng Fu. Bayes-ToMoP: A Fast Detection and Best Response Algorithm Towards Sophisticated Opponents (AAMAS 2019) Tianpei Yang, Jianye Hao, Zhaopeng Meng, Yan Zheng, Chongjie Zhang and Ze Zheng. 2018 A Deep Bayesian Policy Reuse Approach Against Non-Stationary Agents (NeruIPS 2018) Yan Zheng, Zhaopeng Meng, Jianye Hao, Zongzhang Zhang, Tianpei Yang, Changjie Fan. Localizing multiple software faults based on evolution algorithm (JSS 2018) Yan Zheng, Zan Wang, Xiangyu Fan, Xiang Chen and Zijiang Yang. Weighted Double Deep Multiagent Reinforcement Learning in Stochastic Cooperative Environments (PRICAI 2018) Yan Zheng, Zhaopeng Meng, Jianye Hao and Zongzhang Zhang. Services & Rewards (Senior) Program Committee Member of NeurIPS、ICML、ICLR、AAAI、IJCAI、AAMAS Proceedings Chair of the 26th Asia-Pacific Software Engineering Conference (APSEC 2020) CCF (AAMAS) Outstanding Doctoral Dissertation Award, 2020 ACM SIGSOFT Distinguished Paper Award in ASE 2019:” Wuji: Automatic Online Combat Game Testing Using Evolutionary Deep Reinforcement Learning”, 2019 © 2022 All rights reserved · Powered by Jekyll and Minimal Light theme.",
  "content_length": 7529,
  "method": "requests",
  "crawl_time": "2025-12-01 14:50:03"
}