{
  "name": "Yan Cai 0001",
  "homepage": "http://lcs.ios.ac.cn/~yancai",
  "status": "success",
  "content": "ï»¿ Yan Cai, PhD, Professor @ å½ç§å¤§/UCAS @ å½é/IOS Students Research Publications Top Yan Cai (è¡å½¦) PhD (CityU), BEng (SDU) Professor State Key Laboratory of Computer Science Institute of Software, Chinese Academy of Sciences Beijing, China. (ç ç©¶åï¼è®¡ç®æºç§å­¦å½å®¶éç¹å®éªå®¤ï¼ä¸­å½ç§å­¦é¢è½¯ä»¶ç ç©¶æ) Email: ycai.mail _A_T_ gmail.com Please visit my new home page at http://yancai.site Research My Google Scholar and DBLP. I am interested in concurrency bugs in large-scale multithreaded programs, such as: Concurrency Bug Fixing/Repair: FSE 2017a, ICSE 2016a. Data Race - Sampling: FSE 2017b, FSE 2016, Data Race - Scheduling and Reduction: FSE 2015, IEEE TPDS 2013, ISSRE 2011. Predictive Deadlock Detection: ICSE 2012, IEEE TSE 2014. Real Deadlock Detection: ASE 2016, TSE 2016, ICSE 2014, IEEE TPDS 2015, PPoPP 2013, ICSE 2012. These two papers present an overview on part of my previous work: ECOOP 2012 DS (presented at ECOOP 2012 Doctoral Symposium) and TSETH 2013 (including some ideas on implementation of my research tools and some demo screenshots) . Some of my Research Tools are available. If you are interested in my research and my research tools, please feel free to contact me. Academic Services Journal services Editorial Board member, Journal of Systems and Software (JSS), from 2017. Young Associate Editor, Frontiers of Computer Science (FCS), from 2014 (Received: 2016 Excellent Young AE Award). Guest Co-Editor, SQJ Special Issue for COMPSAC (SETA) 2018 with Open Call, Testing and Repair for Software Engineering Technologies and Applications. Submission deadline: Nov. 1, 2018. Conference services Program co-Chair, COMPSAC SETA 2019, CFP. Publicity co-chair, ICST 2019. Program co-Chair, COMPSAC SETA 2018, CFP. PC member (2018), ASE (CCF A), SETTA, SATE (ä¸­ææç¨¿), QRS, TAV-CPS/IoT. Other Paper review service (including PC member, selected) Journals: IEEE TSE, IEEE TC, IEEE TSC, IEEE TR, JSS, The Compute Journal, Computer Languages, Systems and Structures ... Conferences: ICSE 2015, FSE 2014, COMPSAC 2015/2016/2017, QSIC 2013, ICSOC 2013, ICWS 2015/2012/2011, ICEBE 2011, APSEC 2011 ... Others Keynote Speaker, IEEE TrustSoft 2016 Student Volunteer of ACM PLDI 2012 and ECOOP 2012, Beijing, China Helper of IEEE APSEC 2012, Hong Kong, China Publications Journal Papers Bian Pan, Liang Bin, Zhang Yan, Yang Chaoqun, Shi Wenchang, and Yan Cai. Detecting Bugs by Discovering Expectations and Their Violations. IEEE TSE, 2018. Accepted. Yan Cai and Qiong Lu. Dynamic Testing for Deadlocks via Constraints. IEEE TSE, 2016. Changjiang Jia, Yan Cai, Y.T. Yu, and T.H. Tse. 5W+1H pattern: A perspective of systematic mapping studies and a case study on cloud software testing. JSS, 2016. Yan Cai, Changjiang Jia, Shangru Wu, Ke Zhai, and W.K. Chan. ASN: A Dynamic Barrier-based Approach to Confirmation of Deadlocks from Warnings for Large-Scale Multithreaded Programs. IEEE TPDS, 2015. Yan Cai and W.K. Chan. Magiclock: Scalable Detection of Potential Deadlocks in Large-Scale Multithreaded Programs. IEEE TSE, 2014. Lijun Mei, Yan Cai, Changjiang Jia, Bo Jiang, W.K. Chan, Zhenyu Zhang, and T.H. Tse. A Subsumption Hierarchy of Test Case Prioritization for Composite Services. IEEE TSC, 2015. Yan Cai and W.K. Chan. Lock Trace Reduction for Multithreaded Programs. IEEE TPDS, 2013. Lijun Mei, Yan Cai, Changjiang Jia, Bo Jiang, and W.K. Chan. Test Pair Selection for Test Case Prioritization in Regression Testing for WS-BPEL Programs. IJWSR, 2013. W.K. Chan and Yan Cai. In Quest of the Science in Statistical Fault Localization. SPE, 2013. Conference Papers ( § indicates Co-First Author) NEW Yan Cai, Biyun Zhu, Ruijie Meng, Hao Yun, Liang He, Purui Su, and Bin Liang. Detecting Concurrency Memory Corruption Vulnerabilities. ESEC/FSE'19, accepted, 2019. Pan Bian, Bin Liang, Wenchang Shi, Jianjun Huang, and Yan Cai. NAR-Miner: Discovering Negative Association Rules from Code for Bug Detection. ESEC/FSE'18, 2018. Jing Zhao, G.R Ning, H.L Lu, Y.B Wang, Yan Cai, and Jian Zhang. A Weight-based Approach to Combinatorial Test Generation. ICSE'18 (Poster), 2018. Jinpeng Zhou, Sam Silvestro, Hongyu Liu, Yan Cai, and Tongping Liu. UnDead: Detecting and Tolerating Deadlocks in Production Software. ASE'17, 2017. Liang He, Yan Cai, Hong Hu, Purui Su, Zhenkai Liang, Yi Yang, Huafeng Huang, Jia Yan, Xiangkun Jia, and Dengguo Feng. Automatically Assessing Crashes from Heap Overflows. ASE'17, 2017. Yan Cai, Lingwei Cao, and Jing Zhao. Adaptively Generating High Quality Fixes for Atomicity Violations . ESEC/FSE'17, 2017. Yu Guo§, Yan Cai§, and Zijiang Yang. AtexRace: Across Thread and Execution Sampling for In-house Race Detection. ESEC/FSE'17, 2017. Yan Cai, Jian Zhang, Lingwei Cao, and Jian Liu. (CRSampler) A Deployable Sampling Strategy for Data Race Detection. FSE'16, 2016. Yan Cai and Zijiang Yang. (RPro) Radius Aware Probabilistic Testing of Deadlocks with Guarantees. ASE'16, 2016. Yan Cai and Lingwei Cao. (DFixer) Fixing Deadlocks via Lock Pre-Acquisitions. ICSE'16, 2016. Bin Liang, Pan Bian, Yan Zhang, Wenchang Shi, Wei You, and Yan Cai. AntMiner: Mining More Bugs by Reducing Noise Interference. ICSE'16, 2016. Yan Cai and Lingwei Cao. (DrFinder) Effective and Precise Dynamic Detection of Hidden Races for Java Programs. ESEC/FSE'15, 2015. Yan Cai, Shangru Wu, and W.K. Chan. ConLock: A Constraint-based Approach to Dynamic Checking on Deadlocks in Multithreaded Programs. ICSE'14, 2014. Yan Cai, W.K. Chan, and Y.T. Yu. Taming Deadlocks in Multithreaded Programs. The Symposium on Engineering Test Harness 2013 (TSETH'13). QSIC'13, 2013. Lijun Mei, Yan Cai, Changjiang Jia, Bo Jiang, and W.K. Chan. Prioritizing Structurally Complex Test Pairs for Validating WS-BPEL Evolutions. ICWS'13, 2013. Yan Cai, Zhai Ke, Shangru Wu, and W.K. Chan. TeamWork: Synchronizing Threads Globally to Detect Real Deadlocks for Multithreaded Programs. PPoPP'13, poster paper, 2013. Yan Cai and W.K. Chan. MagicFuzzer: Scalable Deadlock Detection for Large-Scale Applications. ICSE'12, 2012. Yan Cai and W.K. Chan. LOFT: Redundant Synchronization Event Removal for Data Race Detection. ISSRE'11, 2011. Papers in Chinese å¼ å¥, å¼ è¶ ,çè·»å³°, çè±é£, çåç¥¥, æ¢å½¬, æç¼, çª¦æç, éæ¯é¦, éç«å, è¡å½¦. Recent Progress in Program Analysis (ç¨åºåæç ç©¶è¿å±). JOS, 2019. Students Current: Biyun Zhu (2016) Haicheng Li (2016) Ruijie Meng (2017) Hao Yun (2018) Graduated: Lingwei Cao (2015-2018), Master Student, First Job: Alibaba (é¿éå·´å·´) 2018: åäº¬å¸ä¼ç§æ¯ä¸çï¼ä¸­å½ç§å­¦é¢å¤§å­¦ä¼ç§æ¯ä¸çï¼ä¸­å½ç§å­¦é¢é¢é¿å¥å­¦éï¼é¢é¿ä¼ç§å¥å­¦éï¼ 2017: å½å®¶å¥å­¦é, ACM SIGSOFT CAPS funds (1250 USD) 2016: ACM SIGSOFT CAPS funds (1000 USD) 2016-2017: ä¸­å½ç§å­¦é¢å¤§å­¦å­¦ä¸å¥å­¦éä¸ç­å¥ãä¸å¥½å­¦ç, è®¡ç®æºç§å­¦å½å®¶éç¹å®éªå®¤ç»©æå¥å­¦éä¸ç­å¥ 2015-2016: ä¸­å½ç§å­¦é¢å¤§å­¦å­¦ä¸å¥å­¦éäºç­å¥, è®¡ç®æºç§å­¦å½å®¶éç¹å®éªå®¤ç»©æå¥å­¦éä¸ç­å¥ Honors, Awards, and Grants (Selected) 2018, CCF NASAC-Neusoft Youth Software Innovation Award (CCF NASAC-ä¸è½¯ éå¹´è½¯ä»¶åæ°å¥), CCF TCSE and CCF TCSS 2018, Excellent Advisor Award (ä¼ç§å¯¼å¸), ISCAS (ä¸­å½ç§å­¦é¢è½¯ä»¶ç ç©¶æ). 2017, Young Elite Scientists Sponsorship Program (éå¹´äººææä¸¾å·¥ç¨), CAST (China Association for Science and Technology) and CCF (China Computer Federation). 2016, Excellent Young AE Award, Frontiers of Computer Science. 2014, ACM SIGSOFT CAPS Travel Award for travel to ICSE'14. Amount: 675 USD. 2013, Research Tuition Scholarship for Research Student, City University of Hong Kong. 2013, Outstanding Academic Performance Award for Research Student, City University of Hong Kong. 2012, Conference Grant for travel to ICSE'12, City University of Hong Kong, Amount: 10,000 HKD. 2011, Conference Grant for travel to ISSRE'11, City University of Hong Kong, Amount: 8,971.33 HKD. 2009, Literary and Art Activities Individual Scholarship, Shandong University, China. Amount: 1,000 RMB. 2008, National Inspirational Scholarship, Shandong University. Amount: 5,000 RMB. 2008, First Class Scholarship and Merit Student, Shandong University. Amount: 3,000 RMB. 2008, Third Class Award in The National College Students Language Basic Skills Competition, MOE of China. 2007, National Inspirational Scholarship, Shandong University. Amount: 5,000 RMB. 2007, Second Class Scholarship, Shandong University. Amount: 2,000 RMB. Teaching Experience @CityU.CS Computer Networks, Software Design, Software Engineering Practice, Software Testing and Maintenance. Other Links SigSoft, ACM Conference , IEEE Conferences & Events Last updated on May 28, 2019 by Yan.",
  "content_length": 8718,
  "method": "requests",
  "crawl_time": "2025-12-01 14:49:53"
}