{
  "name": "Yan Song 0003",
  "homepage": "https://github.com/synlp",
  "status": "success",
  "content": "Yan Song's NLP Group · GitHub Skip to content You signed in with another tab or window. Reload to refresh your session. You signed out in another tab or window. Reload to refresh your session. You switched accounts on another tab or window. Reload to refresh your session. Dismiss alert readme.md Welcome to Yan Song's NLP Group ! We are a creative and productive team focusing on a wide range of topics in natural language processing (NLP). Currently, we are focusing on pre-trained language models, knowledge-driven NLP, and language resource construction. We are open to any collaborations and prospective students and researchers who are interested in NLP. 🔥 News 🔥 We recently released a large language model for the Chinese medical domain named ChiMed-GPT (accepted by ACL-2024). Please visit our GitHub Repo for more information. We recently released our survey paper for radiology report generation titled \"A Systematic Review of Deep Learning-based Research on Radiology Report Generation\". If you are interested in more related information or resource, please refer to our GitHub repository here. You can find a list of our recent representative research papers here. If you have any questions, please post an issue here. Pinned Loading ChiMed-GPT ChiMed-GPT Public ChiMed-GPT is a Chinese medical large language model (LLM) built by continually training Ziya-v2 on Chinese medical data, where pre-training, supervised fine-tuning (SFT), and reinforcement learnin… 102 9 R2GenRL R2GenRL Public The code for our ACL-2022 paper titled \"Reinforced Cross-modal Alignment for Radiology Report Generation\" Python 25 1 RRG-Review RRG-Review Public The official GitHub repository of the survey paper \"A Systematic Review of Deep Learning-based Research on Radiology Report Generation\". TeX 96 9 T2V-Review T2V-Review Public A collection of text-to-video generation studies. TeX 3 Repositories Loading Type All Public Sources Forks Archived Mirrors Templates Language All HTML JavaScript Jupyter Notebook Python TeX Sort Last updated Name Stars Showing 10 of 68 repositories MoE-ARRL Public Uh oh! There was an error while loading. Please reload this page. synlp/MoE-ARRL’s past year of commit activity 0 MIT 0 0 0 Updated Oct 13, 2025 TeR-TSF Public synlp/TeR-TSF’s past year of commit activity Python 9 1 4 0 Updated Sep 28, 2025 SemInf-TSF Public Uh oh! There was an error while loading. Please reload this page. synlp/SemInf-TSF’s past year of commit activity Python 3 0 1 0 Updated Aug 26, 2025 RDA-ABSA Public Uh oh! There was an error while loading. Please reload this page. synlp/RDA-ABSA’s past year of commit activity Python 0 0 1 0 Updated Aug 1, 2025 MCD-TSF Public synlp/MCD-TSF’s past year of commit activity Python 13 MIT 1 2 0 Updated Jul 29, 2025 LLM-Plugin-ABSA Public Uh oh! There was an error while loading. Please reload this page. synlp/LLM-Plugin-ABSA’s past year of commit activity 0 MIT 0 0 0 Updated Jun 6, 2025 RD-AC Public Uh oh! There was an error while loading. Please reload this page. synlp/RD-AC’s past year of commit activity Python 1 MIT 0 0 0 Updated Jun 6, 2025 LLM-Detoxic Public Uh oh! There was an error while loading. Please reload this page. synlp/LLM-Detoxic’s past year of commit activity Python 0 MIT 0 0 0 Updated Jun 3, 2025 PlugLLM-MABSA Public synlp/PlugLLM-MABSA’s past year of commit activity Python 2 MIT 0 0 0 Updated May 19, 2025 RRG-Review Public The official GitHub repository of the survey paper \"A Systematic Review of Deep Learning-based Research on Radiology Report Generation\". Uh oh! There was an error while loading. Please reload this page. synlp/RRG-Review’s past year of commit activity TeX 96 9 0 0 Updated May 17, 2025 View all repositories People This organization has no public members. You must be a member to see who’s a part of this organization. Top languages Loading… Uh oh! There was an error while loading. Please reload this page. Most used topics Loading… Uh oh! There was an error while loading. Please reload this page. You can’t perform that action at this time.",
  "content_length": 4045,
  "method": "requests",
  "crawl_time": "2025-12-01 14:50:02"
}