{
  "name": "Yan Solihin",
  "homepage": "https://sites.google.com/view/arpers",
  "status": "success",
  "content": "ARPERS Research GroupSearch this siteEmbedded FilesSkip to main contentSkip to navigationHomeORCID: 0000-0002-8863-941XARPERS (Architecture Research for PErformance, Reliability, and Security) research group was formed in 2002 at NCSU by Yan Solihin and is located at UCF. ARPERS focuses on computer architecture  exploration and modeling to support cross-cutting concerns involving performance, reliability, and security. Yan Solihin is the Director of Cybersecurity and Privacy Cluster. He is Charles N. Millican* Professor of Computer Science at University of Central Florida. He obtained Sarjana Teknik di Informatika from Institut Teknologi Bandung in 1995, B.S. in Mathematics from Universitas Terbuka in 1995, M.A.Sc in computer engineering from Nanyang Technological University in 1997, and Ph.D. in computer science from the University of Illinois at Urbana-Champaign (UIUC) in 2002. He received 2025 Pegasus Faculty Award, 2023 HPCA Test of Time Award, 2023 ACM SIGMICRO Distinguished Service Award, 2010 and 2005 IBM Faculty Partnership Award, 2004 NSF Faculty Early Career Award, and 1997 AT&T Leadership Award. He is well known for pioneering cache sharing fairness and Quality of Service (QoS), efficient counter mode memory encryption, and Bonsai Merkle Tree, which have significantly influenced Intel Cache Allocation Technology and Secure Guard eXtension (SGX)'s Memory Encryption Engine (MEE). In recognition, he received IEEE Fellow “for contributions to shared cache hierarchies and secure processors” in 2017. He is listed in the HPCA Hall of Fame and ISCA Hall of Fame.Prior to joining UCF, from 2002-2018, he was a Professor of Electrical and Computer Engineering at NCSU. He joined as an Assistant Professor in 2002, was promoted early to tenured Associate Professorship in 2007, and was promoted early to Professorship in 2012. From 2015-2018, he was a Program Director at the Division of Computer and Network Systems (CNS) at the National Science Foundation. His responsibilities include managing the Secure and Trustworthy Cyberspace (SaTC), Computer Systems Research (CSR), and Scalability and Parallelism in the eXtreme (SPX). He co-founded the NSF/Intel Partnership on Foundational Microarchitecture Research (FoMR) program. He has published 100+ papers, authored 120+ patent assets, delivered 80+ invited talks/seminars, including several keynotes and multi-day tutorials. His research received HPCA Test of Time Award (2023), MICRO Best Paper Runner-up Award (2017), IEEE Micro Top Picks (2011), and several Best Paper nominations/finalists (ISPASS 2013, IPDPS 2012, and HPCA 2005). He released several software packages to the public: ACAPP - a cache performance model toolset, HeapServer - a secure heap management library, Scaltool - parallel program scalability pinpointer, and Fodex - a forensic document examination toolset. His research has been covered by the IEEE Spectrum, US News, PC World, HPCWire, Slashdot, and others. He has written two graduate textbooks. * Charles N. Millican was the founding president of UCF  Interview with TCuARchRecent Services: ISCA 2023 (General Co-Chair), UCF Interim Department Chair (2021-2022), HPCA 2020 (PC Chair), IISWC 2019 (General Co-Chair}, IISWC 2017-present (SC Chair), and SEED 2021-present (SC Chair) Fundamentals of Parallel Multicore ArchitectureCRC Press, 2015Fundamentals of Parallel Computer ArchitectureSolihin Publishing & Consulting, 2009Additional Links: UCF Computer Science: WebsiteUCF Cyber Security and Privacy Cluster: Website (Official) and Unofficial oneYan Solihin's CV (last updated 2022)LinkedIn profileResearchGate profileGoogle Scholar profileCadence Distinguished Speaker Series (2018) Funding. ARPERS activities are/were funded by the following sponsors:Contact: yan (dot) solihin (at) ucf (at) eduGoogle SitesReport abuseGoogle SitesReport abuse",
  "content_length": 3857,
  "method": "requests",
  "crawl_time": "2025-12-01 14:50:02"
}