{
  "name": "Yan Li 0018",
  "homepage": "https://www.cgu.edu/people/yan-li",
  "status": "success",
  "content": "Yan Li | Associate Professor of Information Systems & Technology EmailYan.Li@cgu.edu DegreesPhD, Information Systems, Virginia Commonwealth University MS, Information Systems, Virginia Commonwealth University Research InterestsData science, Machine Learning, Natural Language Processing, Health Informatics, Mobile Health, Data Management, Data warehousing, Business intelligence, ICT4D Yan Li is an associate professor at Claremont Graduate University’s Center for Information Systems & Technology (CISAT). After working in the industry as a data scientist, Yan re-oriented her career to academia driven by her intellectual curiosity towards emergent technologies and her passion for building things. Her research focuses on data management and analytics with an emphasis on applying data science to discover knowledge from data to support crucial business decisions. Her other research stream focuses on developing and evaluating information and communication (ICT) artifacts to improve the social well-being of underserved populations in low-resource areas, primarily in the public health and education sectors. Yan strongly believes in the creation of (ICT) artifacts to solve real-world problems. Therefore, her research philosophy is grounded in design science and quantitative methods with a strong emphasis on impactful and practice-oriented research. Yan’s passion for research is evidenced by the numerous high-quality journal publications and peer-reviewed conference presentations. Yan also believes that service to the community is integral to the well-rounded growth and development of a researcher. Thus, she has traveled to many resource-challenged countries to deploy ICT solutions that make positive social change. To achieve sustainable impact, Yan co-founded a non-profit organization, Techies without Borders, that aims to bring together like-minded IT professionals and provide an opportunity to use their talent and skills for humanitarian good. To support her research and scholarly activities, Yan has negotiated numerous research grants with non-profit and for-profit companies and government agencies. These grants not only provide graduate assistantships for CISAT students to conduct data science research, but also enable her to conduct on-the-ground work in real-world settings. Yan is a recipient of the 2023 Fulbright Future Scholar Award for her research project that aims to digitalize cognitive assessment tools for early detection of Alzheimer’s disease and related diseases (ADRD). Co-authored with Caceres, C., & Bazarah, A. (in press). “A Climate Change Vulnerability Assessment Design Framework: The Case of Small-scale Farmers in Western Honduras”. Communications of the Association for Information Systems, 53 (1). https://aisel.aisnet.org/cais/vol53/iss1/10 Co-authored with Chipidza, W., Olfman, L., Ozgur T. & Mashatan A. (2023) “Quantum computing and IS – Harnessing the opportunities of emerging technologies”. Communications of the Association for Information Systems, 52 (1). https://aisel.aisnet.org/cais/vol52/iss1/7 Co-authored with Vo A, Tao Y, Albarrak A (2023) “The Association Between Social Determinants of Health and Population Health Outcomes: Ecological Analysis”. JMIR Public Health Surveillance 9:e44070. PMID: 36989028 https://doi.org/10.2196/44070. Co-authored with A. S. Albarrak. “Improving Healthcare Access for Vulnerable Populations – A Vulnerable Population Healthcare Access Framework (VPHAF).” Journal of Biomedical Informatics, (2022). https://doi.org/10.1016/j.jbi.2022.104196 Co-authored with M. A. Thomas, V. Sistenich, K. N. Diango, and D. Kabongo. “A multi-stakeholder engagement framework for knowledge management in ICT4D.” Journal of the Association for Information Science and Technology, 1–17, (2022). https://doi.org/10.1002/asi.24703 Co-authored with M. R. Roosan, et al. “Artificial Intelligent Context-Aware Machine-Learning Tool to Detect Adverse Drug Events from Social Media Platforms.” Journal of Medical Toxicology, (2022). https://doi.org/10.1007/s13181-022-00906-2 Co-authored with Thomas, M. A.,  & Lee, A. S. (2022) “Generalizing the IS artifact”. Information Systems Research (ISR) 33(4). https://doi.org/10.1287/isre.2022.1106 Co-authored with B. Jung and T. Bechor. “A Context-Aware Vulnerability Prioritization Model.” Computers & Security 116, (2022). Co-authored with H. Zhang and W. McConnell. “Predicting Potential Palliative Care Beneficiaries for Health Plans: A Generalized Machine Learning Pipeline.” Journal of Biomedical Informatics, (2021). Co-authored with E. Kim, et al. “Scoping review: the empowerment of Alzheimer’s Disease caregivers with mHealth applications.” npj Digital Medicine 4, no. 131 (2021). Co-authored with M. Thomas and Dapeng Liu. “From semantics to pragmatics: where IS can lead in Natural Language Processing (NLP) research.” European Journal of Information Systems, (2020). Co-authored with M. Thomas, et al. “Citizen-Centric Capacity Development for ICT4D: The Case of Continuing Medical Education on a Stick.” Information Technology for Development, (2020). Co-authored with K. Williams and L. Olfman. “DRT: A Novel Tool for Data Archiving.” IEEE Software, (2020). Co-authored with D. Roosan, et al. “Improving Medication Information Presentation Through Interactive Visualization in Mobile Apps: Human Factors Design.” Journal of Medical Internet Research (JMIR) Mhealth Uhealth 7, no. 11 (2019). Co-authored with A. Vo, et al. “Designing utilization-based spatial healthcare accessibility decision support systems: A case of a regional health plan.” Decision Support Systems 99, (2017): 51-63. Co-authored with M. Thomas and T. Oliveira. “Nuances of Development Contexts for ICT4D Research in Least Developed Countries: An Empirical Investigation in Haiti.” Telematics and Informatics 34, no. 7 (2017). Co-authored with M.A. Thomas and K.M. Osei-Bryson. “A Snail Shell Process Model for Knowledge Discovery via Data Analytics.” Decision Support Systems 91, (2016): 1-12. Co-authored with M.A. Thomas and K.M. Osei-Bryson. “Ontology-based data mining model management for self-service knowledge discovery.” Information Systems Frontiers, (2016): 1–19. Co-authored with M.A Thomas and K.M. Osei-Bryson. “Using association rules mining to facilitate qualitative data analysis in theory building.” In Advances in research methods for information systems research, edited by Kweku-Muata Osei-Bryson and Ojelanki Ngwenyama, 79-92. New York: Springer, 2014. Databases & Big Data Knowledge Discovery & Data Mining Data Science Practicum Natural Language Processing Data Warehousing and Business Intelligence Leading Through Data Managing Data at Scale",
  "content_length": 6682,
  "method": "requests",
  "crawl_time": "2025-12-01 14:50:02"
}