{
  "name": "Yan Wang 0002",
  "homepage": "http://web.science.mq.edu.au/~yanwang",
  "status": "success",
  "content": "Home Page of Yan Wang Yan Wang Professor PhD, SIEEE Research Director Macquarie University Frontier AI Research Centre (FAIR) School of Computing Macquarie University 4 Research Park Drive, Office 354 Sydney, NSW 2109 Australia Tel: +61-2-9850-9539 Fax: +61-2-9850-9551 Email: yan.wang@mq.edu.au Macqaure PURE Google Scholar Awards Best Paper Award, Xuankai Yang, Yan Wang, Xiuzhen Zhang, Shoujin Wang, Huaxiong Wang and Kwok-Yan Lam, UPDATE: Mining User-News Engagement Patterns for Dual-Target Cross-Domain Fake News Detection, Special Session on Private, Secure, and Trust Data Analytics (PSTDA2024), The 11th IEEE International Conference on Data Science and Advanced Analytics (DSAA 2024), San Diego, CA, United States, 6-10 October, 2024  certificate Award for Inter-School Collaboration, Master of Data Science, Faculty of Science and Engineering, Macquarie University, 2023 2017 IEEE TC-SVC Outstanding Service Award, IEEE Technical Committee on Services Computing (TCSVC), IEEE Computer Society, 2017 (photo1, photo2, photo3) Best Student Paper Award, Jun Zou, Yan Wang and Mehmet Orgun, A Dispute Arbitration Protocol Based on a Peer-to-Peer Service Contract Management Scheme, 23rd IEEE International Conference on Web Services (IEEE ICWS2016, research track, acceptance rate 14%), June 27-July 2, 2016, San Francisco, USA certificate Top 5 Picks Award, Jun Zou, Yan Wang and Mehmet Orgun, A Dispute Arbitration Protocol Based on a Peer-to-Peer Service Contract Management Scheme, 23rd IEEE International Conference on Web Services (IEEE ICWS2016, research track, acceptance rate 14%), June 27-July 2, 2016, San Francisco, USA certificate Vice-Chancellor’s Faculty Award for Excellence in Higher Degree Research Supervision, Macquarie University, 2014 certificate Best Paper Award, Haibin Zhang, Yan Wang and Xiuzhen Zhang, Efficient Contextual Transaction Trust Computation in E-Commerce Environments, 11th IEEE International Conference on Trust, Security and Privacy in Computing and Communications (TrustCom-2012) (acceptance rate: 100/358 = 28%), 25-27 June 2012, Liverpool, UK certificate Best Paper Award, Guanfeng Liu, Yan Wang, Mehmet A. Orgun and Ee-Peng Lim, A Heuristic Algorithm for Trust-Oriented Service Provider Selection in Complex Social Networks, The 7th IEEE International Conference on Services Computing (IEEE SCC2010) (research track, acceptance rate: 29/165 =18%), July 5-10, 2010, Miami, Florida, USA certificate Learning and Teaching Award, Faculty of Science, Macquarie University, 2010 certificate Research Interests: recommender systems, data analytics, trust computing, social computing, services computing PhD Scholarships General requirements for Master Research and PhD students can be found here. Info about cotutelle PhD program (double PhD degrees program, or 双博士学位计划). Projects 2023-2026, \"Trust-Oriented Data Analytics in Online Social Networks\" (Yan Wang, Mehmet Orgun, Guanfeng Liu, Kian-Lee Tan), ARC Discovery project 2020-2023, \"Combating Fake News on Social Media: From Early Detection to Intervention\" (Xiuzhen Zhang, Yan Wang, Huan Liu), ARC Discovery project 2018-2020, \"Reputation-based Trust Management in Crowdsourcing Environments\" (Yan Wang, Michael Sheng, Mehmet Orgun), ARC Discovery project 2018, \"A Large-Scale Distributed Experimental Facility for the Internet of Things\" (Michael Sheng, Athman Bouguettaya, Seng Loke, Xue Li, Weifa Liang, Boualem Benatallah, Muhammad Ali-Babar, Jian Yang, Albert Zomaya, Yan Wang, Wanlei Zhou, Lina Yao, Kerry Taylor, Neil Bergmann), ARC Linkage Infrastructure, Equipment and Facilities project (LIEF) 2015-2017, \"Reputation-based Trust Framework for Composed Services\" (Athman Bouguettaya, Yan Wang and Elisa Bertino), ARC Discovery project 2012-2015, \"A Personalised Social Network based Location Search and Recommender System\" (Jian Yang, Mehmet A. Orgun and Yan Wang), ARC Linkage project 2010 - 2012, \"Trust-Oriented Social Relation Analysis and Social Relation Aware Rating Analysis in Trust Management\" (Yan Wang, Mehmet Orgun and Ee-Peng Lim), ARC Discovery project 2005 - 2007, \"Security for Peer-to-Peer Systems\" (Vijay Varadharajan and Yan Wang), ARC Discovery project Research Supervision and Visitors Postdoctoral Research Fellow Dr. Pengfei Ding, Graph Mining, since 2024 Dr. Jiajie Zhu, since 2025 Current HDR Students Nan Wang, Recommender Systems, since 2025 Max Xiao,  Master Research (MRes) student (full-time), Recommender Systems, since January 2025 Hongyang Liu,  PhD student (full-time), Simulation Systems, since November 2023 Han Zhang, PhD student (full-time), Temporal Path Discovery, since March 2023 Xuankai Yang, PhD student (full-time), Fake News Detection, since July 2022 Completed Students and Postdocs Dr. Jiajie Zhu, PhD student (full-time), Recommender Systems, October 2021 - June 2025 Disentangled and Invariant Cross-Domain Recommendation Systems (pdf) Dr. Pengfei Ding, PhD student (full-time), Graph Mining, April 2021 - Oct. 2024 Few-shot Learning on Heterogeneous Graphs (pdf) This PhD thesis received Vice-Chancellor's Commendation for Academic Excellence, Macquarie University, 2025 Dr. Yatong Sun, cotutelle PhD student (full-time), Sep. 2020 - Dec. 2024 PhD thesis: Robust Sequential Recommendation against Unreliable Data (pdf) This PhD thesis received Vice-Chancellor's Commendation for Academic Excellence, Macquarie University, 2024 Dr. Shoujin Wang, Postdoctoral Research Fellow, Oct. 2018 - July 2022 Dr. Yan Zhao, cotutelle PhD student (full-time), Recommender Systems, Feb. 2019 - Jan. 2021 PhD thesis: Single-behaviour and Multi-behaviour Streaming Recommender Systems (pdf) Dr. Feng Zhu, May 2017 - Jun. 2020 PhD thesis: Single-Target and Dual-Target Cross-Domain Recommender Systems (pdf) This PhD thesis received Vice-Chancellor's Commendation for Academic Excellence, Macquarie University, 2020 Dr. Guohao Sun, Dec. 2016 - Dec. 2019 PhD thesis: Incremental Graph Pattern based Node Matching (pdf) This PhD thesis received Vice-Chancellor's Commendation for Academic Excellence, Macquarie University, 2020 Maryam Khani, Master Research student (MRes, full-time), July 2017 - May 2018 MRes thesis: Context-Aware Trustworthy Service Evaluation and Recommendation in Social Internet of Things (pdf) Dr. Bin Ye, Dec. 2014 - Dec. 2017 PhD thesis: Trust Management in Crowdsourcing Environments (pdf) Dr. Jun (Joe) Zou (part-time) PhD thesis: Accountability in Cloud Services, Feb. 2008 - Nov. 2016 (pdf) This PhD thesis received Vice-Chancellor's Commendation for Academic Excellence, Macquarie University, 2016 recipient of the Best Student Paper Award and Top 5 Picks Award, IEEE ICWS 2016 Dr. Lie Qu, Aug. 2012 - Feb. 2016 PhD thesis: Credible Service Selection in Cloud Environments (pdf) Dr. Xiaoming Zheng (co-supervise with Prof. Mehmet A Orgun) PhD thesis: Trust Prediction in Online Social Networks, Oct. 2012 - Jun. 2015 (pdf) Dr. Haibin Zhang, Oct. 2010 - Apr. 2014 PhD thesis: Context-Aware Transaction Trust Computation in E-Commerce Environments (pdf) recipient of the Best Paper Award, IEEE TrustCom 2012 Dr. Guanfeng Liu, Jan. 2013- Sep. 2013 PhD thesis: Social Network Trust, Feb. 2009 - Jan. 2013 (pdf) recipient of nomination for the John Makepeace Bennett Award - Australasian Distinguished Doctoral Dissertation 2013 recipient of 2011 Chinese Government Award for Outstanding Self-financed Students Aboard by China Scholarship Council (CSC) highly commended by Vice-Chancellor for the Excellence in Higher Degree Research - Science and Engineering, Macquarie University, 2011 Dr. Lei Li, Jul. 2011- Oct. 2012 PhD thesis: Trust Evaluation in Service-Oriented Environments, Jan. 2008 - Jul. 2011 (pdf) recipient of nomination for Australasian Distinguished Doctoral Dissertation 2011, by Department of Computing, Macquarie University recipient of 2009 Chinese Government Award for Outstanding Self-financed Students Aboard by China Scholarship Council (CSC) Visitors Wenzhuo Song, visiting PhD student, Jilin University, China, 2019 - 2020 Jin He, visiting PhD student, Hefei University of Technology, China, 2018 - 2020 Prof. Jian Wang, visiting scholar, Harbin University of Science and Technology, China, 2019 Prof. Guosheng Zhao, visiting scholar, Harbin Normal University, 2019 Yan Zhao, visiting PhD student, Harbin Engineering University, China, 2017 Meijuan Jia, visiting PhD student, Harbin Engineering University, China, 2016 Prof. Bo Chen, visiting scholar, Nanjing Normal University, China, 2013 Prof. Ling Yu, visiting scholar, Nanjing Normal University, China, 2013 Selected Refereed Publications International Journal Articles J. Zhu, Y. Wang, F. Zhu, Z. Sun, Causal Deconfounding via Confounder Disentanglement for Dual-Target Cross-Domain Recommendation, ACM Transactions on Information Systems (TOIS), 43(5): 1-33, 2025 P. Ding, Y. Wang, G. Liu, N. Wang, X. Zhou, Few-Shot Causal Representation Learning for Out-of-Distribution Generalization on Heterogeneous Graphs, IEEE Transactions on Knowledge and Data Engineering (TKDE), 37(4): 1804-1818, 2025 S. Wang, X. Zhang, Y. Wang, F. Ricci, Trustworthy Recommender Systems, ACM Transactions on Intelligent Systems and Technology (TIST), 15(4): 1-20, 2024 P. Ding, Y. Wang, G. Liu, X. Zhou, Few-Shot Semantic Relation Prediction across Heterogeneous Graphs, IEEE Transactions on Knowledge and Data Engineering (TKDE), 35(10): 10265-10280, 2023 R. Lu, W. Zhang, Y. Wang, Q. Li, X. Zhang, H. Yang, D. Wang, Auction-Based Cluster Federated Learning in Mobile Edge Computing Systems, IEEE Transactions on Parallel and Distributed Systems (TPDS), 34(4): 1145-1158, 2023 S. Wang, Y. Wang, L. Hu, X. Zhang, Q. Zhang, Q. Z. Sheng, M. A. Orgun, L. Cao, D. Lian, Modeling User Demand Evolution for Next-basket Prediction, IEEE Transactions on Knowledge and Data Engineering (TKDE), 35(11): 11585-11598, 2023 P. Ding, G. Liu, Y. Wang, K. Zheng, X. Zhou, A-MCTS: Adaptive Monte Carlo Tree Search for Temporal Path Discovery, IEEE Transactions on Knowledge and Data Engine",
  "content_length": 26207,
  "method": "requests",
  "crawl_time": "2025-12-01 14:50:05"
}