{
  "name": "Yan Chen 0004",
  "homepage": "http://www.cs.northwestern.edu/~ychen",
  "status": "success",
  "content": "Welcome to Yan Chen's Home Page Yan Chen Professor Department of Computer Science Robert R. McCormick School of Engineering and Applied Science Northwestern University 3007 Mudd Hall 2233 Tech Drive, Third Floor Evanston, IL 60208 (847) 491-4946 (Office) (847) 491-2789 (Fax) E-mail : ychen AT northwestern.edu |Publications| Teaching| Research| CV| Students| I received my Ph.D. in Computer Science from University of California at Berkeley in Dec. 2003 under the supervision of Prof. Randy H. Katz and joined the faculty at Northwestern University in Jan. 2004. Teaching EECS 340 - Introduction to Networking (Winter 2004, Winter 2006, Winter 2008, Spring 2010, Winter 2012, Winter 2014) Developed EECS 350 - Introduction to Computer Security (Winter 2005, Winter 2007) Developed EECS 354 - Network Penetration and Security (Fall 2007, Fall 2008, Fall 2009, Fall 2010, Fall 2011, Fall 2012, Fall 2013, Fall 2014, Fall 2015, Fall 2016). Developed EECS 450 - Internet Security (Spring 2004, Spring 2005, Spring 2007, Winter 2009, Spring 2010, Spring 2012, Winter 2013, Spring 2014, Winter 2015, Fall 2016) Developed EECS 395/495 - Mobile Apps and Systems (Spring 2015) Developed EECS 395/495 - Programming Languages and Analysis for Security (Spring 2013) Developed MSIT 458 Information Security and Assurance (Spring 2007, Spring 2008, Spring 2009, Winter 2010, Fall 2010, Fall 2011, Fall 2012, Fall 2013, Winter 2015, Fall 2015, Fall 2016) Research My research interests are in security and measurement for networking and large-scale distributed systems. I lead the Northwestern LIST (Lab for Internet and Security Technology).   I won the DOE Early CAREER Award in 2005, the DOD (Air Force of Scientific Research) Young Investigator Award in 2007, and the Most Influential Paper award of ASPLOS in 2018. Based on Google Scholar (papers from different authors with the same names are removed), my papers have been cited over 17,000 times, and the h-index of my publications is 62 as of May 2025 (here is a snapshot at Jan. 2014). I am a Fellow of IEEE. Current Graduate Students and Research Staff Ziyi Guo (Ph.D. student) Sherwin Shen (Ph.D. student) Yuxiao Tang (Ph.D. student) Lingzhi Wang(Ph.D. student) Graduated Ph.D. Students and Postdocs Mohammad Kavousi (Ph.D. 2025, First job: Assistant Professor of Instruction at Vandebilt University) Kaiyu Hou (Ph.D. 2022, First job: Research Scientist at Ali Cloud) Won both Star of Alibaba and Star of Huawei Awards for offers Xutong Chen (Ph.D. 2021, First job: Research Scientist at Facebook) Haitao Xu (Postdoc, 2018, First job: Assistant Professor at Arizona State University) Zhenyang Qu (Ph.D. 2017, First job: Research Scientist at Facebook) Xiang Pan (Ph.D. 2017, First job: Software Engineer at Google) Xitao Wen (Ph.D. 2016. First job: Software Engineer at Google) Vaibhav Rastogi (Ph.D. 2015. First job: Postdoctal Scientis at University of Wisconsin at Madison) Yinzhi Cao (Ph.D. 2014. First job: Postdoctal Scientist at Columbia University; Now: Assistant Professor at Johns Hopkins University) Hongyu Gao (Ph.D. 2013. First job: Software Engineer at Google. Now: Shape Security) Kai Chen (Ph.D. 2012. First job and now: Professor at Hongkong University of Science and Technology) Zhichun Li (Ph.D. 2009. First job and now: Researcher at NEC Labs America.) Yao Zhao (Ph.D. 2009. First job: Researcher at Bell Labs. Now: Shape Security) Won the 2009 EECS Best Dissertation Award of Northwestern. Guohan Lv (Ph. D. of Tsinghua University China, 2008, co-advised with Prof. Xing Li at Tsinghua. First job: Researcher at Microsoft Research Asia.) Access stat here:",
  "content_length": 3624,
  "method": "requests",
  "crawl_time": "2025-12-01 14:50:04"
}