{
  "name": "Yanan Sun 0001",
  "homepage": "https://yn-sun.github.io",
  "status": "success",
  "content": "Yanan Sun - Yanan Sun / Professor / Sichuan University Yanan SunProfessor, Sichuan University Follow Chengdu, China Email Github Google ScholarProfessor 教授、博导College of Computer Science， Sichuan University, ChinaBasic Building 414, Wangjiang Campus, Sichuan University No.24 South Section 1, Yihuan Road, Chengdu, China, 610065NewsTwo papers about robust learning and SSN LLM are accepted by AAAI2026. Congratulations to Yuqi and Long!Congratulations to Jingrong, Han Ji, and Yuqi on winning the National Scholarship!Our paper about constrained optimization is accepted by SWEVO. Congratulations to Sri and Jiahao!Our work about Performance Predictor for NAS is accepted by IEEE Transactions on Computers. Congratulations to Xiaotian!I am awarded 2025 Outstanding Associate Editor of IEEE Transactions on Evolutionary Computation (TEVC)!Our work about robust learning is accepted by NeurIPS25. Congratulations to Yuqi!Two papers are accepted by PRICAI25. Congratulations to Jiawen (performance predictor) and Chunhui (continous learning)! Chunhui is a senior student.Our work about Performance Predictor for NAS is accepted by IEEE Transactions on Systems, Man, and Cybernetics: Systems (TSMC). Congratulations to Xiaotian!Our paper about AI4Science (fast design of nuclear reactor) is accepted by Nuclear Engineering and Design. Congratulations to Minxiao!Our paper about Exploring GPT-4o’s reasoning capabilities for panoramic radiograph is accepted by Clinical Oral Investigations. Congratulations to Yutao and Prof. Tang!Our paper about NAS for long-tailed learning is accepted by CIKM25. Congratulations to Yuhan and Prof. Gong.Two papers about performance predictor for NAS is accepted by ICCV25. Congratulations to Han!Our paper about Exploring GPT-4 for clinical decision-making is accepted by Front. Public Health. Congratulations to Yutao and Prof. Tang!Three papers are accepted by ICML25, Congratulations to Aojun (continous learning from neural architecture perspective), Jingrong (neural architecture design), and Zeqiong (theory of ENAS)!I am invited to be Publication Chair of PRICAI2025Our work about robust NAS is accepted by TKDE. Congratulations to Yuqi!I am invited to be Area Chair of IEEE CEC2025Our work about robust NAS is accepted by ICLR25. Congratulations to Yuqi!Our work about Evolutionary SNN is accepted by TEVC. Congratulations to Xiaotian!Again! We won the first place on Neural Architecture Search Challenge organized by AutoML24. [Media] (https://www.scu.edu.cn/info/1207/26284.htm) Congratulations to Aojun, Xiaotian, and Yuqi!I gave one-hour talk as part of specialized tutorial on Evolutionary computation and evolutionary deep learning for image analysis, signal processing and pattern recognition in GECCO2024.Our work about optimizer automation motivated by NAS is accepted by ECCV2024. Congratulations to Xiaotian!I gave two-hours tutorial on evolutionary neural architecture search in CEC2024.Our work about robust training of LLM is accepted by ICML2024. Congratulations to Prof. Pan and Yuhan!Three of our work about NAS are accepted by IJCAI2024. Congratulations to Aojun, Xiaotian, and Han!Our work about adversarial example generation is appected by FSE2024. Congratulations to Prof. Li!Our work about imbalanced data learning is appected by TKDE.Our work about robust NAS is accepted by TNNLS. Congratulations to Yuqi!Two of our work about theory of ENAS are accepted by GECCO2024 and TETCI. Congratulations to Zeqiong!Our work about schedulingis accepted by TEVC. Congratulations to Yun!Our work about robust NAS is accepted by CVPR2024. Congratulations to Yuwei and Yuqi!Yanan Sun is invited to be Associate Editor of IEEE Transactions on Neural Networks and Learning Systems.Our work about theory of ENAS is accepted by TEVC. Congratulations to Zeqiong!We won the first and second place on Neural Architecture Search Challenge organized by CVPR23. [Media] [1] [2] Congratulations to Aojun and Jingrong!Our work about Performance Predictor for NAS is accepted by TCYB. Congratulations to Xiangning!Yanan Sun is invited to be Associate Editor of IEEE Transactions on Evolutionary Computation from 2023.Our work about Performance Predictor for NAS is accepted by NeurIPS2022. Congratulations to Yuqiao!Our work about Evolving Transformer is awarded as Best Paper by MLMI2022. Congratulations to Jie!Our work about Benchmark Platform of ENAS is accepted by TEVC. Congratulations to Xiangning!Our work about Constraint NAS is accepted by TNNLS. Congratulations to Siyi!Our work about improving efficiency of NAS is accepted by ICCV21. Congratulations to Yuqiao!Research InterestMy research interest focus on theory and applications of automated machine learning, including:explainable/interpretable neural architecture search (NAS)convergence analysis for evolutionary computation-based NASmulti-/many-objective/ and constrained optimization for NASlow-energy consumption NAS with high-inference speedfeature selection and constructionauto data augmentation",
  "content_length": 5005,
  "method": "requests",
  "crawl_time": "2025-12-01 14:50:04"
}