{
  "name": "Yanfang Ye 0001",
  "homepage": "https://engineering.nd.edu/faculty/yanfang-fanny-ye",
  "status": "success",
  "content": "Yanfang (Fanny) Ye - College of Engineering Galassi Family Collegiate Professor in Computer Science and Engineering Contact Email yye7@nd.edu Phone 574-631-9131 Office 323B Cushing Hall of Engineering Areas of Interest Prof. Yanfang (Fanny) Ye’s main research interests are in the areas of artificial intelligence (AI), machine learning (ML), data mining, cybersecurity, and public health. She has unique experience in both industry and academia. By harnessing large-scale, multi-source, multi-modality data, she and her group discover new research problems, tackle fundamental challenges in AI and machine learning, and deploy their developed techniques into real-world applications with broader impacts. More specifically, she and her group strive to (1) advance knowledge and science in graph learning, trustworthy LLMs, and multimodal learning, (2) bridge AI/ML and cybersecurity concentrating on AI security and safety, large-scale malware detection, and the study of the evolving underground ecosystem, and (3) develop AI and data-driven techniques to combat the opioid crisis and infectious disease outbreaks. Besides the scholarly impact, she and her group’s works have generated significant industrial and societal impacts. Integrating humanity and technology, her long-term goal of research is to advance capabilities and trustworthiness of AI to provide state-of-the-art innovations i) to secure cyberspace for its users, and ii) to improve health and well-being of people around the world. Fighting to combat the opioid crisis (short video featuring Yanfang (Fanny) Ye) Websites Yes-lab Google Scholar Education Ph.D., Computer Science, Xiamen University, 2010 News Team led by Professor Fanny Ye awarded 2025 Poverty Research Package Notre Dame researchers leverage social media data to develop a new AI-driven model for opioid misuse prevention in teenagers and young adults Combating online opioid trafficking with advanced AI techniques ND Engineering welcomes 21 new faculty in 2021 Departments Aerospace and Mechanical Engineering Chemical and Biomolecular Engineering Civil and Environmental Engineering and Earth Sciences Computer Science and Engineering Electrical Engineering",
  "content_length": 2197,
  "method": "requests",
  "crawl_time": "2025-12-01 14:50:07"
}