{
  "name": "Yang Zhou 0001",
  "homepage": "http://eng.auburn.edu/users/yangzhou",
  "status": "success",
  "content": "Yang Zhou @ AU Yang Zhou Ph.D. in Computer Science, Georgia Institute of Technology Associate Professor Department of Computer Science and Software Engineering Samuel Ginn College of Engineering Auburn University Tel: +1 (334) 844-6330 Email: yangzhou AT auburn DOT edu EXPAND ALL SECTIONS COLLAPSE ALL SECTIONS Introduction I am an Associate Professor in the Department of Computer Science and Software Engineering at the Auburn University. Prior to that, I received my Ph.D. degree in the College of Computing at the Georgia Institute of Technology. My current research interests lie in several reasearch areas, including Trustworthy Machine Learning, Parallel, Distributed, and Federated Learning, Natural Language Processing, Graph Machine Learning. Our lab has built close collaborative relationships with Microsoft, Amazon, and Sony Research. Our research contributions have been published in top venues of machine learning (ICML, NeurIPS), artificial intelligence (AAAI, IJCAI, TIST), natural language processing (ACL, EMNLP), data mining (KDD, ICDM, SDM, TKDD, DMKD, KAIS), high performance computing (HPDC, SC, TPDS), database systems (VLDB, ICDE, CIKM, TKDE, TODS, VLDBJ), Web (WWW, TWEB), and networking (JSAC, TOIT). Currently, there are several fully funded Ph.D. positions available in deep learning, trustworthy machine learning, federated learning, or natural language processing. In addition, our industrial collaborators are hiring multiple summer interns in the above research fields. Interested students are encouraged to email me your CVs and transcripts. News News Nov 2025 Area Chair for ICML 2026. Oct 2025 One paper accepted by TODS. Oct 2025 Three papers accepted by BigData 2025. Sep 2025 Three papers accepted by NeurIPS 2025. Aug 2025 One paper accepted by ICDM 2025. Aug 2025 TPC for ICLR 2026. Jul 2025 Received HPDC Best Paper Award. Jul 2025 One paper accepted by TKDD. Jul 2025 One paper accepted by KAIS. May 2025 One paper accepted by ICML 2025. May 2025 TPC for ICDM 2025. Apr 2025 Invited talk at the Harnessing Data Science and AI for Collaborative Advances in Production Agriculture Forum. Apr 2025 One paper accepted by IJCAI 2025. Apr 2025 One paper accepted by HPDC 2025. Apr 2025 Two papers accepted by AAAI 2025. Mar 2025 Area Chair for NeurIPS 2025. Jan 2025 One paper accepted by ICC 2025. Dec 2024 TPC for ICML 2025 and KDD 2025. Dec 2024 Area Chair for ACL 2025. Oct 2024 One paper accepted by TSAS. Oct 2024 Invited talk at the Alabama Higher Education AI Exchange. Oct 2024 TPC for AISTATS 2025. Sep 2024 One paper accepted by EMNLP 2024. Sep 2024 One paper accepted by WiOpt 2024. Aug 2024 One paper accepted by TIST. Aug 2024 TPC for ICLR 2025. Jul 2024 Two papers accepted by CIKM 2024. Jun 2024 SPC for AAAI 2025. Jun 2024 One paper accepted by EDBT 2025. May 2024 Received ICDE Best Demonstration Runner Ups Award. May 2024 One paper accepted by ICML 2024. May 2024 One paper accepted by FGCS. May 2024 TPC for ICDM 2024. Apr 2024 One paper accepted by IJCAI 2024. Apr 2024 TPC for NeurIPS 2024. Mar 2024 Received ITE Safety Project Award. Mar 2024 Tianshi received Outstanding Doctoral Student Award. Mar 2024 Two papers accepted by ICDE 2024. Feb 2024 Invited talk at the Florida State University. Dec 2023 One paper accepted by ICDE 2024. Dec 2023 One paper accepted by SDM 2024. Dec 2023 Two papers accepted by AAAI 2024. Dec 2023 TPC for ICML 2024 and KDD 2024. Dec 2023 SPC for IJCAI 2024. Nov 2023 One paper accepted by TKDD. Oct 2023 Two papers accepted by EMNLP 2023. Oct 2023 Invited talk at the University of Alabama at Birmingham. Aug 2023 TPC for ICLR 2024 and SDM 2024. Aug 2023 One paper accepted by GLOBECOM 2023. Jun 2023 SPC for AAAI 2024. Apr 2023 Invited to attend DARPA AI Forward meeting. Apr 2023 Two papers accepted by ICML 2023. Mar 2023 TPC for NeurIPS 2023. Mar 2023 One workshop proposal accepted by KDD 2023. Feb 2023 One paper accepted by ICDE 2023. Mar 2023 TPC for ICDM 2023. Jan 2023 TPC for KDD 2023. Jan 2023 One paper accepted by TPDS. Dec 2022 TPC for ICML 2023. Dec 2022 Review editor for Frontiers in Big Data. Nov 2022 TPC for IJCAI 2023 and CVPR 2023. Nov 2022 One book chapter accepted by Encyclopedia of Big Data Technologies. Nov 2022 Invited talk at the Zhejiang University. Oct 2022 Invited talk at the Synced. Sep 2022 One paper accepted by NeurIPS 2022. Sep 2022 Two papers accepted by ICDM 2022. July 2022 SPC for AAAI 2023. July 2022 TPC for ICLR 2023 and SDM 2023. May 2022 One paper accepted by KDD 2022. May 2022 Two papers accepted by ICML 2022. Apr 2022 One paper accepted by IJCAI 2022. Mar 2022 TPC for NeurIPS 2022 and ICDM 2022. Mar 2022 One paper accepted by ICDE 2022. Jan 2022 One paper accepted by KAIS. Jan 2022 One book chapter accepted by Encyclopedia of Big Data Technologies. Dec 2021 SPC for KDD 2022 and IJCAI 2022. Dec 2021 One paper accepted by AAAI 2022. Sep 2021 One paper accepted by NeurIPS 2021. Sep 2021 One paper accepted by Applied Nursing Research. Aug 2021 Two papers accepted by EMNLP 2021. Aug 2021 One paper accepted by TIST. Aug 2021 SPC for AAAI 2022. Jul 2021 Sectional Editor in Chief for AIMS ERA. Jul 2021 One paper accepted by TKDD. Jul 2021 One paper accepted by VLDBJ. Jul 2021 One paper accepted by Transportation Research Record. Jun 2021 TPC for ICLR 2022. May 2021 One paper accepted by KDD 2021. May 2021 Two papers accepted by ICML 2021. Apr 2021 One paper accepted by IJCAI 2021. Apr 2021 One paper accepted by IJCNN 2021. Apr 2021 TPC for NeurIPS 2021 and ICDM 2021. Mar 2021 Guest editor for Frontiers in Artificial Intelligence and Frontiers in Big Data. Mar 2021 TPC for EMNLP 2021. Feb 2021 One paper accepted by Frontiers in Artificial Intelligence. Jan 2021 One paper accepted by WWW 2021. Dec 2020 TPC for ICML 2021, ACL 2021, and KDD 2021. Nov 2020 SPC for IJCAI 2021. Nov 2020 Invited talk at the Department of Mathematics and Statistics, Auburn University. Oct 2020 TPC for NAACL 2021. Oct 2020 Two papers accepted by BigData 2020. Sep 2020 One paper accepted by NeurIPS 2020. Sep 2020 One paper accepted by ICMLA 2020. Aug 2020 One paper accepted by ICDM 2020. Aug 2020 TPC for AAAI 2021. Jun 2020 TPC for NeurIPS 2020. May 2020 One paper accepted by TKDE. Apr 2020 One paper accepted by TOIT. Apr 2020 One paper accepted by IJCAI 2020. Apr 2020 TPC for EMNLP 2020 and BigData 2020. Apr 2020 One paper accepted by ACL 2020. Mar 2020 TPC for AACL-IJCNLP 2020. Mar 2020 Invited talk at the University of Alabama at Tuscaloosa. Mar 2020 Invited talk at the Kent State University. Feb 2020 Invited to visit Baidu Research. Jan 2020 TPC for KDD 2020. Dec 2019 Invited keynote talk at IEEE BigData 2019. Publications Selected Publications All Publications» DBLP Google Scholar ResearchGate Aminer TODS'25 TFSM: A Scalable Distributed Task-Based System for Frequent Subgraph Pattern Mining from a Big Graph Lyuheng Yuan, Da Yan, Dingwen Tao, Jiao Han, Saugat Adhikari, Cheng Long, Yang Zhou NeurIPS'25 Bridging Symmetry and Robustness: On the Role of Equivariance in Enhancing Adversarial Robustness Longwei Wang, Chaowei Zhang, Ifrat Ikhtear Uddin, KC Santosh, Xiao Qin, Yang Zhou Spotlight NeurIPS'25 PAC-Bayes Bounds for Multivariate Linear Regression and Linear Autoencoders Ruixin Guo, Ruoming Jin, Xinyu Li, Yang Zhou NeurIPS'25 Demystifying Protein Generation with Hierarchical Conditional Diffusion Models Zinan Ling, Yi Shi, Brett A. McKinney, Da Yan, Yang Zhou, Bo Hui ICDM'25 Explainability-Guided Defense: Attribution-Aware Model Refinement Against Adversarial Data Attacks Longwei Wang, Mohammad Nayyem, Abdullah Al Rakin, KC Santosh, Chaowei Zhang, Yang Zhou TKDD'25 Eï¬cient Federated Learning with Heterogeneous Data and Adaptive Dropout Ji Liu, Beichen Ma, Qiaolin Yu, Ruoming Jin, Jingbo Zhou, Yang Zhou, Huaiyu Dai, Haixun Wang, Dejing Dou, Patrick Valduriez KAIS'25 Efficient Federated Learning with Timely Update Dissemination Ji Liu, Juncheng Jia, Chao Huo, Yihui Shen, Yang Zhou, Huaiyu Dai, Dejing Dou ICML'25 Flexible, Efficient, and Stable Adversarial Attacks on Machine Unlearning [code] Zihan Zhou, Yang Zhou, Zijie Zhang, Lingjuan Lyu, Da Yan, Ruoming Jin, Dejing Dou IJCAI'25 Faster Annotation for Elevation-Guided Flood Extent Mapping by Consistency-Enhanced Active Learning Saugat Adhikari, Da Yan, Tianyang Wang, Landon Dyken, Sidharth Kumar, Lyuheng Yuan, Akhlaque Ahmad, Jiao Han, Yang Zhou, Steve Petruzza HPDC'25 Out-of-Core Parallel Spatial Join Outperforming In-Memory Systems: A BFS-DFS Hybrid Approach Lyuheng Yuan, Da Yan, Akhlaque Ahmad, Jiao Han, Saugat Adhikari, Yang Zhou Best Paper Award AAAI'25 Explainability-Driven Defense: Grad-CAM-Guided Model Reï¬nement Against Adversarial Threats Longwei Wang, Ifrat Ikhtear Uddin, Xiao Qin, Yang Zhou, and Kc Santosh AAAI'25 Multi-Scale Unrectiï¬ed Push-Pull with Channel Attention for Enhanced Corruption Robustness Robin Ranabhat, Longwei Wang, Xiao Qin, Yang Zhou, and Kc Santosh ICC'25 Making Computational Task Offloading Decision Based on Swarm Intelligence enabled RL in Internet-of-Things Blockchain Zhuo Chen, Jiahuan Yi, Yunpeng Yang, Yang Zhou EDBT'25 Efficient Enumeration of Large Maximal k-Plexes Qihao Cheng, Da Yan, Tianhao Wu, Lyuheng Yuan, Ji Cheng, Zhongyi Huang, Yang Zhou TSAS'24 Scaling Terrain-Aware Spatial Machine Learning for Flood Mapping on Large Scale Earth Imagery Data Saugat Adhikari, Zhe Jiang, Jiao Han, Zelin Xu, Yupu Zhang, Arpan Sainju, Yang Zhou EMNLP'24 Fisher Information-based Efficient Curriculum Federated Learning with Large Language Models Ji Liu, Jiaxiang Ren, Ruoming Jin, Zijie Zhang, Yang Zhou, Patrick Valduriez, Dejing Dou TIST'24 Eï¬cient Federated Learning Using Dynamic Update and Adaptive Pruning with Momentum on Shared Server Data Ji Liu, Juncheng Jia, Hong Zhang, Yuhui Yun, Leye Wang, Yang Zhou, Huaiyu Dai, and Dejing Dou CIKM'24 Advancing Certified Robustness of Explanation via Gradient Quantization Yang Xiao, Zijie Zhang, Yuchen Fang, Da Yan, Yang Zhou, Wei-Shinn Ku, Bo Hui CIKM'2",
  "content_length": 22669,
  "method": "requests",
  "crawl_time": "2025-12-01 14:50:16"
}