{
  "name": "Yang Zheng 0001",
  "homepage": "https://zhengy09.github.io",
  "status": "success",
  "content": "Yang Zheng - UC San Diego Yang Zheng Home CV Reserach SOC Lab People Publications Presentations Software Awards Join us! Teaching ECE285 ECE171A Seminars Others Yang Zheng Yang Zheng Assistant Professor Department of Electrical and Computer Engineering Department of Computer Science & Engineering (by Courtesy) Contextual Robotics Institute University of California San Diego Office: #3308 Franklin Antonio Hall Email: zhengy@ucsd.edu Phone: 858-534-5687 ORCID · Google Scholar · GitHub · Twitter Office hours Tuesday, 5:00 pm - 6:30 pm Feel free to email me to schedule office hours if needed. Prospective students: I am actively seeking highly motivated students with a strong background in mathematics, theory, and computation to join my research group. If you have a strong interest in optimization and control, I encourage you to apply. Application instructions can be found here. Prospective students and visiting interns are welcome to get in touch. Feel free to drop me an email (zhengy@ucsd.edu) with your CV, transcripts, and a brief overview of your interest in joining my group. Check here: Join us! Brief Biography I am an Assistant Professor in Electrical and Computer Engineering at the University of California San Diego. I am affiliated with the CSE department and Contextual Robotics Institute. From March 2019 to August 2020, I was a postdoctoral scholar in SEAS and CGBC at Harvard University, working with Prof. Na Li and Prof. Ali Malkawi. I was a research associate in the Verification of Autonomous Systems group at Imperial College London in 2021. I received the B.S. and M.E. degrees in the Department of Automotive Engineering from Tsinghua University, Beijing, China, in 2013 and 2015, respectively. In Feb. 2019, I received the DPhil (Ph.D.) degree in Control from the University of Oxford for my work on Chordal Sparsity in Control and Optimization of Large-scale Systems under the supervision of Prof. Antonis Papachristodoulou. I am broadly interested in learning, optimization, and control of network systems, and their applications to autonomous vehicles and traffic systems. My current research interests include: Convex and non-convex optimization for control. Principled data-driven and learning-based control. Structures and algorithms for scalable conic optimization. Applications in mixed traffic control, and certifiable robustness of machine learning (e.g., deep neural networks). Check out some exciting research in the SOC lab at UCSD. Updates 09/2025: We're excited to share three new SOC Lab preprints: A Proximal Descent Method for Minimizing Weakly Convex Optimization, led by Feng-Yi Liao; Regularization in Data-driven Predictive Control: A Convex Relaxation Perspective, led by Xu Shang; Logarithmic Regret and Polynomial Scaling in Online Multi-step-ahead Prediction, led by Jiachen Qian. 09/2025: Our paper An Overview and Comparison of Spectral Bundle Methods for Primal and Dual Semidefinite Programs was accepted for publication in Computational Optimization and Applications. 07/2025: I'm honored to recevie the Donald P. Eckman Award from the American Automatic Control Council. The award recognizes an outstanding young engineer in the field of automatic control who is 35 years old or younger. Citation: For fundamental contributions to convex and nonconvex optimization in optimal and distributed control, scalable computational techniques, and transformative applications in traffic system. 05/2024: I presented a talk on Benign Nonconvex Landscapes in Optimal and Robust Control (Slides) in the UCSD MAE Dynamic Systems & Controls Seminar 05/2025: Check out our new preprint: Model-free Online Learning for the Kalman Filter: Forgetting Factor and Logarithmic Regret. 05/2025: Our paper: Dictionary-free Koopman Predictive Control for Autonomous Vehicles in Mixed Traffic was accepted for publication in CCTA 2025. 04/2025: A new preprint: Semidefinite Programming Duality in Infinite-Horizon Linear Quadratic Differential Games. Update: this paper was accepted for publication in IEEE CDC 2025. 03/2025: A new preprint: Revisiting Strong Duality, Hidden Convexity, and Gradient Dominance in the Linear Quadratic Regulator. 02/2025: Our paper Extended Convex Lifting for Policy Optimization of Optimal and Robust Control was accepted for publication in the 7th Annual Learning for Dynamics & Control Conference. 02/2025: Check out our new preprint: A Bundle-based Augmented Lagrangian Framework: Algorithm, Convergence, and Primal-dual Principles. 01/2025: Attended the NSF Workshop on Reinforcement Learning and presented a lightning talk on Benign Nonconvex Landscapes in Optimal and Robust Control and a poster. More news Page generated 2025-09-12 22:39:34 Pacific Daylight Time, by jemdoc.",
  "content_length": 4757,
  "method": "requests",
  "crawl_time": "2025-12-01 14:50:14"
}