{
  "name": "Yangguang Tian",
  "homepage": "https://www.surrey.ac.uk/people/yangguang-tian",
  "status": "success",
  "content": "Dr Yangguang Tian | University of Surrey This website uses cookiesSome of these cookies are necessary and are used to help make our site work. With your consent, we will also use cookies to improve your experience, analyse site usage and assist in our marketing efforts. By clicking 'Accept all', you consent to our use of cookies.You can learn more about these cookies and manage your preferences at any time on our cookies page .Necessary Necessary These cookies enable essential website functions and ensure the site operates properly. They do not store personally identifiable information. While you can disable them in your browser settings, some features may not function correctly.Analytics Analytics These cookies help us understand how visitors interact with our website by collecting anonymous usage data. We use this information to improve website performance and enhance your experience.Personalisation Personalisation These cookies allow us to customise the content you see based on your activity, such as the courses you view, applications you make, or your location. This helps us provide a more relevant and tailored experience when using our site.Marketing Marketing These cookies deliver personalised ads based on your browsing activity and help us measure the effectiveness of our advertising campaigns. Accept all Manage preferences Save preferences Reject all Dr Yangguang Tian Lecturer in Cyber Security +44 (0)1483 686140 yangguang.tian@surrey.ac.uk23 BB 03Academic and research departments Surrey Centre for Cyber Security, Computer Science Research Centre, School of Computer Science and Electronic Engineering. AboutBiographyYangguang Tian received his PhD degree in applied cryptography from University of Wollongong, Australia. After PhD, he did post-docs at School of Information Systems, Singapore Management University, and iTrust, Singapore University of Technology and Design. Before Surrey, he was a research-based assistant professor at Osaka University, Japan. Expand biography ResearchResearch interestsapplied cryptography, network security, blockchain technologies, privacy-preserving technologies Expand research interests Publications Yangguang Tian, Nan Li, Yingjiu Li, Pawel Szalachowski, Jianying Zhou (2020) Policy-based chameleon hash for blockchain rewriting with black-box accountability Policy-based chameleon hash is a useful primitive for blockchain rewriting. It allows a party to create a transaction associated with an access policy, while another party who possesses enough rewriting privileges satisfying the access policy can rewrite the transaction. However, it lacks accountability. The chameleon trapdoor holder may abuse his/her rewriting privilege and maliciously rewrite the hashed object in the transaction without being identified. In this paper, we introduce policy-based chameleon hash with black-box accountability (PCHBA). Black-box accountability allows an attribute authority to link modified transactions to responsible transaction modifiers in case of dispute, in which any public user identifies those transaction modifiers from interacting with an access device/blackbox. We first present a generic framework of PCHBA. Then, we present a practical instantiation, showing its practicality through implementation and evaluation analysis. Yangguang Tian, Yingjiu Li, Yi Mu, Guomin Yang (2021) Unlinkable and Revocable Secret Handshake In this paper, we introduce a new construction for unlinkable secret handshake that allows a group of users to perform handshakes anonymously. We define formal security models for the proposed construction and prove that it can achieve session key security, anonymity and affiliation hiding. In particular, the proposed construction ensures that (i) anonymity against protocol participants (including group authority) is achieved since a hierarchical identity-based signature is used in generating group user’s pseudonym-credential pairs and (ii) revocation is achieved using a secret sharing-based revocation mechanism. Binanda Sengupta, Yingjiu Li, Yangguang Tian, Robert H Deng, Zheng Yang (2021) Policy-Based Editing-Enabled Signatures: Authenticating Fine-Grained and Restricted Data Modification Data owners often encrypt their bulk data and upload it to cloud in order to save storage while protecting privacy of their data at the same time. A data owner can allow a third-party entity to decrypt and access her data. However, if that entity wants to modify the data and publish the same in an authenticated way, she has to ask the owner for a signature on the modified data. This incurs substantial communication overhead if the data is modified often. In this work, we introduce the notion of policy-based editing-enabled signatures, where the data owner specifies a policy for her data such that onlyan entity satisfying this policy can decrypt the data. Moreover, the entity is permitted to produce a valid signature for the modified data (on behalf of the owner) without interacting with the owner every time the data is modified. On the other hand, a policy-based editing-enabled signature (PB-EES) scheme allows the data owner to choose any set of modification operations applicable to her data and still restricts a (possibly untrusted) entity to authenticate the data modified using operations from that set only. We provide two PB-EES constructions, a generic construction and a concrete instantiation. We formalize the security model for PB-EESs and analyze the security of our constructions. Finally, we evaluate the performance of the concrete PB-EES instantiation. Yangguang Tian, Yingjiu Li, Robert H Deng, Binanda Sengupta, Guomin Yang (2021) Lattice-based remote user authentication from reusable fuzzy signature In this paper, we introduce a new construction of reusable fuzzy signature based remote user authentication that is secure against quantum computers. We investigate the reusability of fuzzy signature, and we prove that the fuzzy signature schemes provide biometrics reusability (aka. reusable fuzzy signature). We define formal security models for the proposed construction, and we prove that it achieves user authenticity and user privacy. The proposed construction ensures: 1) a user’s biometrics can be securely reused in remote user authentication; 2) a third party having access to the communication channel between a user and the authentication server cannot identify the user. Zheng Yang, Chenglu Jin, Yangguang Tian, Junyu Lai, Jianying Zhou (2020) Lis: Lightweight signature schemes for continuous message authentication in cyber-physical systems",
  "content_length": 6599,
  "method": "requests",
  "crawl_time": "2025-12-01 14:50:16"
}