{
  "name": "Yang Gao 0001",
  "homepage": "https://cs.nju.edu.cn/gaoyang",
  "status": "success",
  "content": "Homepage:Dr.Yang Gao Yang Gao Professor R&L group. ,Computer Science Dept. , Nanjing University Rm 906, Computer Science Building, Nanjing University Xianlin Campus Nanjing 210046, P.R. China Email: gaoy (at) nju.edu.cn Tel:(86-25)8368-6586 Fax:(86-25)8330-0710 Yang Gao is a teacher in the Computer Science Department at the Nanjing University. He recieved his B.S. in Dalian University of Technology in 1993, M.S. in Computer Aided Design from the Nanjing University of Science and Technology in 1996, and Ph.D. in Computer Science from the Nanjing University in 2000. He won the IBM China Visitorship Program in 2003 and visited the ETI in HKU from June to September 2003. He visited the University of Western Sydney in Dec, 2004, the Hong Kong Baptist University from Jan., 2005 to Feb., 2005 and Massey University, New Zealand in Dec, 2006. Research Interests Publications Activities Honors Courses Research Interests My current research interests focus on multi-agent systems, machine learning, belief revision, and intelligent system. Reinforcement Learning Agent Theory (Belief Revision) and Multi-agent Systems Intelligent System Image Process and Video Surveillance Activities Program Chair Agent2008 (http://agent2008.nju.edu.cn) CCML2009 (http://www.dlmu.edu.cn/ccml2009) CWI2009(http://www.hebtu.edu.cn/aacrssc/crssc2009/) CWI2008 (http://web.htu.cn/cs/crssc2008) CWI2007 (http://202.207.212.8/) Organize Chair CWMLA'07 (http://lamda.nju.edu.cn/conf/mla07/) PAKDD'07 (http://lamda.nju.edu.cn/conf/PAKDD07/) CWMLA'06 (http://lamda.nju.edu.cn/conf/mla06/) http://lamda.nju.edu.cn/conf/mla05/) PC Member AI2009, ACML2009, PRICAI2008 Committee Member CCF Artificial Intelligence and Pattern Recognition CAAI Council CAAI Machine Learning Council (Secretary-general ) CAAI Rough Set and Soft Computing Council (Executive Comissioner) Jiangsu Computer Society (Senior Member) Artificial Intelligence Council, Jiangsu Computer Society (Vice Chair) Honors Jing Huo, Yang Gao, Wanqi Yang, Hujun Yin: Abnormal Event Detection via Multi-Instance Dictionary Learning. IDEAL 2012: 76-83. (Best Paper Award) Xian-Xing Zhang, Hua Liu, Yang Gao, Derek Hao Hu: Detecting Abnormal Events via Hierarchical Dirichlet Processes. PAKDD 2009: 278-289, Best Student Paper. 汪栋,叶玉坤,高阳,等. 肺癌早期诊断新技术研究与临床应用. 中国人民解放军总后勤部, 军队医疗成果奖（二等奖）, 排名第三, 2010. Xingguo Chen, Yang Gao, Weiwei Wang. NJU RL Team. RL 2009 Competition, Tetris Event, Second Place, 2009. 高阳，江苏省第十二届哲学社会科学优秀成果奖 三等奖. Courses Artificial Intelligence 2017 Artificial Intelligence 2017",
  "content_length": 2529,
  "method": "requests",
  "crawl_time": "2025-12-01 14:50:06"
}