{
  "name": "Yang Deng 0002",
  "homepage": "https://dengyang17.github.io",
  "status": "success",
  "content": "CHAT NLP Group @ SMU Yang Deng (邓扬) Assistant Professor Lee Kong Chian Fellow CHAT NLP Group School of Computing and Information Systems Singapore Management University [Email] [Google Scholar] HIRING I am actively looking for highly motivated PhD students (starting from 2026 Fall). I have several SMU-funded visiting student positions avaiable (standard monthly stipend of 2700 SGD). Self-funded visiting scholars (e.g., CSC Project) and remote collaborations are also welcomed. Feel free to reach out to me as [Openings]. Home Publications Group & Openings I am currently a tenure-track Assistant Professor in School of Computing and Information Systems, Singapore Management University (SMU). Prior to that, I was a postdoctoral research fellow in NExT++, National University of Singapore, working with Prof. Tat-Seng Chua and Prof. See-Kiong Ng. I received my Ph.D degree at The Chinese University of Hong Kong, supervised by Prof. Wai Lam. I am leading the CHAT NLP Group where we conduct research on Natural Language Processing (NLP), Information Retrieval (IR), and Large Language Models (LLM) – with special focus on Proactive Conversational AISurvey [IJCAI 2023], Tutorial [ACL 2023] [SIGIR-AP 2023],Non-collaborative Dialogues [ICLR 2024] [EMNLP 2024] [EMNLP 2023 Findings],Target-guided Dialogues [EMNLP 2024] [EMNLP 2024 Findings] [TOIS 2023],Emotional Support Dialogues [ACL 2024] [ACL 2023],Clarifications [ACL 2024 Findings] [EMNLP 2022] Trust and Reliability of Large Language ModelsKnowledge Boundary [Survey/ACL 2025] [ACL 2025] [EMNLP 2024] [EMNLP 2024] [ACL 2024],Robustness [ICLR 2025] [AAAI 2025],Hallucination [EMNLP 2024 Findings] [EMNLP 2023], Misinformation [ACL 2025],Safety [ACL 2025] [ACL 2025] [EMNLP 2023 Findings] Language Model Powered AgentsTutorial [WWW 2024] [SIGIR 2024], Role-playing Agent [Survey],Human-Agent Interaction [ACL 2024] [EMNLP 2024 Findings], Planning [ACL 2025], Memory [NAACL 2025] Human-centered Information SeekingPerspectives Paper [SIGIR 2024], Survey [ACL 2025],User Understanding [arxiv] [EMNLP 2023 Findings] [WWW 2022],Personalization [EMNLP 2023 Findings] [ACL 2023 Findings] [TOIS 2022] NEWS (Nov 2025) Three papers accepted by AAAI 2026. Congrats to Weixiang, Mengfan, and Youchao! NEWS (Nov 2025) Selected as New Faculty Highlights by AAAI 2026. NEWS (Oct 2025) Invited to be a keynote speaker at PALS Workshop @ EMNLP 2025. NEWS (Oct 2025) Recognized among the World's Top 2% Scientist (Single Year, 2025) by Stanford/Elsevier. NEWS (Sep 2025) Two papers accepted by NeurIPS 2025. NEWS (Aug 2025) Four papers accepted by EMNLP 2025 (three main and one findings). NEWS (Aug 2025) Invited to be a keynote speaker at ProActLLM Workshop @ CIKM 2025. NEWS (July 2025) One journal paper was accepted by TOIS. NEWS (June 2025) Awarded with the Lee Kong Chian Fellowship. NEWS (May 2025) Nine papers accepted by ACL 2025 (seven main and two findings). NEWS (April 2025) Two tutorials accepted by SIGIR 2025. NEWS (Mar 2025) Invited to serve as Area Chairs of COLM 2025 and NeurIPS 2025. NEWS (Feb 2025) Invited to serve as Handbook Chairs of AACL 2025. NEWS (Jan 2025) One paper accepted by ICLR 2025 and two by NAACL 2025 (one main and one findings). NEWS (Jan 2025) The extended version of the proactive conversational AI survey was accepted by TOIS. NEWS (Dec 2024) One tutorial proposal accepted by WWW 2025 and two papers by AAAI 2025. NEWS (Nov 2024) Invited Task: AI Risks and Safety @ IMDA's Technical Sharing Session. NEWS (Nov 2024) Received EMNLP 2024 Outstanding Area Chair Awards and NeurIPS 2024 Best Reviewer Awards. NEWS (Nov 2024) Received Google South Asia & Southeast Asia Research Awards 2024. NEWS (Nov 2024) Served as Program Chairs of SSNLP 2024. NEWS (Sep 2024) Nine papers accepted by EMNLP 2024 (five main and four findings). NEWS (Aug 2024) Invited Task: LLM-powered Conversational Agents @ Huawei Software Technology Summit 2024. NEWS (July 2024) Joined SMU SCIS as an Assistant Professor.",
  "content_length": 3977,
  "method": "requests",
  "crawl_time": "2025-12-01 14:50:06"
}