{
  "name": "Yang Cindy Yi",
  "homepage": "https://www.yangyi.ece.vt.edu",
  "status": "success",
  "content": "Yang (Cindy) Yi's Homepage Dr. Yang (Cindy) Yi's Homepage Home Research People Publications Teaching Services Honors Yang (Cindy) Yi, Ph.D. Professor Bradley Senior Faculty Fellow MICRON & TEL UPWARDS Faculty Fellow Virginia Tech Universal Design for Learning (UDL) Fellow College of Engineering Dean's Fellow (24-25) Director, BRain-Inspired Computing, Communications, and Security Lab (BRICCS@VT) Inaugural Faculty, Institute for Advanced Computing Bradley Department of Electrical and Computer Engineering College of Engineering, Virginia Tech Office: Room 4400, 3625 Potomac Ave Alexandria, VA 22305 Mailing: 900 N. Glebe Rd, Arlington, VA 22203 Phone: 540-231-7561 Email: cindy_yangyi@vt.edu Research Interests General Areas in Very Large Scale Integrated (VLSI) Circuits and Systems, High Performance Computing, Computer Aided Design (CAD), Artificial Intelligence, and Emerging Nano-device. The specific areas of interests include but are not limited to the following: Computing Systems: neuromorphic electronic circuits design and automation for brain-inspired computing system Emerging Devices, Circuit, and Architecture energy efficient 3D integrated circuit and architecture design, memristor design and optimization Machine Learning for Wireless Networks and cybersecurity AI-enabled cyber-physical systems (CPS) and Internet of Things (IoT) networks, machine learning for 5G/6G and cybersecurity Short Bio Yang (Cindy) Yi is a Professor in the Bradley Department of Electrical and Computer Engineering (ECE), and the Director of BRain-Inspired Computing, Communications, and Security Lab (BRICCS @VT) at Virginia Tech (VT). In 2024, she has been selected as Deanâs Fellow in College of Engineering at VT. In the past 25 years, she has been working on various research topics in Semiconductor Devices, AI Chip Design, High Performance Computing and Communication. She has more than 200 publications in international journals and conference proceedings and 8 of her paper have been selected as Best Paper Awards (Charles K. Kao Best Paper Award in 2020, IEEE Technical Committee on Green Communications & Computing Committee (TCGCC) in IEEE Global Communications Conference (GLOBECOM) in 2018, IEEE International Symposium on Quality Electronic Design (ISQED) in 2018, and IEEE Transmission, Access, and Optical Systems Technical Committee (TAOS) in International Conference on Communications (ICC) in 2018, IEEE Global Communications Conference (GLOBECOM) in 2016, etc.) Yang (Cindy) Yi’s research has been funded by National Science Foundation (NSF), Department of Defense (DoD), National Spectrum Consortium (NSC), Air Force Research Lab (AFRL), Air Force Office of Scientific Research (AFSOR), Amy Research Lab, United States Department of Agriculture (USDA), Commonwealth Cyber Initiative (CCI), and many industrial companies (Micron, Meta, Tokyo Electron Ltd., Intel, Samsung, QUALCOMM, TI, and NVidia). She has been involved with more than $60 million projects with more than $7 million personal share of research funding. Yang (Cindy) Yi has been serving as the Book Editor, General Chair, Program Chair, Technical Program Committee (TPC) Track Chair and TPC member in various international conferences, and Editorial Board Members for several international journals. (IEEE TVLSI, IEEE TCASAI, etc.) She received multiple awards for her research, teaching and service: VT Dean’s Award for Excellent in Research and VT Dean’s Fellow in 2024, MICRON & TEL UPWARDS Faculty Fellow, VT Research Excellence (Major Sponsored Proposal) Award, Virginia Tech Universal Design for Learning (UDL) Fellow, IEEE Featured Author in 2023; Virginia Tech Institute for Critical Technology and Applied Science (ICTAS) Junior Faculty Award, COE Faculty Fellow in 2019; National Science Foundation (NSF) CAREER Award in 2018; United States Air Force (USAF) Summer Faculty Fellowship, KU Miller Professional Development Award for Distinguished Research in 2016; NSF EPSCoR First Award, USAF Summer Faculty Fellowship, KU Miller Scholar Award in 2015; KU New Faculty General Research Award, Air Force Research Lab (AFRL) Visiting Faculty Research Fellowship, University of Missouri Academic Program Faculty Scholar, and University of Missouri Outstanding Service Award in 2014. What's New Follow us on LinkedIn for more updates Positions are available in Fall 2026 for postdocs, Ph.D./M.S. students and visiting scholars, who are interested in conducting research on the topic of IC design, neuromorphic computing, computer architecture, neural network, and machine learning. Now we are seeking a highly motivated PhD student for research in Physical Design of Integrated Circuits (ICs), focusing on nanometer-scale technologies. Table of Contents Contact Education Research Interests Short Bio What's New © Copyright by Yang (Cindy) Yi.",
  "content_length": 4835,
  "method": "requests",
  "crawl_time": "2025-12-01 14:50:08"
}