{
  "name": "Yanghui Rao",
  "homepage": "https://cse.sysu.edu.cn/teacher/RaoYanghui",
  "status": "success",
  "content": "饶洋辉 | 中山大学计算机学院  English 简体中文English 搜索 中大主页 ｜ 会议室预约 ｜ 管理登录 ｜ 学院概况 学院简介 历史沿革 学院领导 组织架构 常设机构 行政办公 党建工会 党建工作 党建动态 党建通知 党委分工 工会工作 工会建设 工会分工 人才培养 本科生培养 教学通知 培养方案 教学成果 研究生培养 研究生通知 管理制度 培养方案 学位工作 人才培养体系 教学平台 国家级人才培养计划 师资队伍 专任教师 专职研究人员 专业技术人员 人才工程 科学研究 科研平台 科研团队 科研通知 科研进展 产学研合作 学术活动 学生工作 学工队伍 学工通知 团学建设 学子风采 实习就业 招生信息 本科生招生 招生信息 专业介绍 研究生招生 夏令营 硕士招生 博士招生 港澳台招生 招生导师 人才招聘 人才招聘 人事通知 校友与基金 校友会 校友会简介 校友动态 校友服务 基金捐赠 捐赠项目 捐赠指南 信息中心 学校文件 政府采购与招投标 设备与实验室 公开信息 本科生教学 研究生教学 设备与网络 实验室管理 内部信息 人事信息 banner 师资队伍 专任教师 专职研究人员 专业技术人员 人才工程 饶洋辉 副教授 联系邮箱： raoyangh@mail.sysu.edu.cn个人主页： https://cse.sysu.edu.cn/teacher/RaoYanghui 教师简介: 饶洋辉，副教授，博士生导师。2014年博士毕业于香港城市大学，师从李青教授。主持国家自然科学基金面上项目、青年科学基金项目、广东省自然科学基金面上项目及课题，入选“广东特支计划”科技创新青年拔尖人才，并参与多项国家重点研发计划课题和国家自然科学基金-广东大数据科学中心联合基金重点支持项目。研究成果发表在IEEE TKDE、IEEE TNNLS、IEEE TCYB、ACM TOIS、ACM TKDD、BIB、Bioinformatics、TACL、TCBB、ACL、IJCAI、ECML、EMNLP、NAACL、COLING等期刊和会议上。曾获CCF B类会议DASFAA'17的最佳论文亚军奖。研究团队（代码集：https://github.com/YRaoGroup；专著：https://link.springer.com/book/10.1007/978-981-96-8853-1）招收博士、硕士和本科生，欢迎感兴趣的同学联系。研究领域: 文本挖掘、主题模型、表示学习、知识图谱、文本生成工作经历: 2014.9 - 至今，中山大学，移动信息工程学院、数据科学与计算机学院、计算机学院科研项目: 国家自然科学基金面上项目 (61972426, 62372483)，负责人。国家自然科学基金青年科学基金项目 (61502545)，负责人。广东省自然科学基金面上项目 (2020A1515010536)，负责人。中山大学粤港澳发展研究院年度课题，负责人。中山大学网络与信息技术中心预研究项目，负责人。主要学术兼职: Area Chair: ACL 2024, EMNLP 2024, NAACL 2025Associate Editor: Natural Language Processing JournalEditorial Board: Information Processing and ManagementPC Member & Reviewer: NeurIPS 2024, ICLR 2025, ICML 2025, WWW 2024-25, KDD 2022-25, AAAI 2019-25, IJCAI 2021-24, IEEE TPAMI/TKDE代表性论著: Y. Y. Lu (博士生), H. G. Chen (博士生), Y. H. Rao*, J. X. Yu, W. Hua, Q. Li, An efficient fuzzy system for complex query answering on knowledge graphs, IEEE Trans. on Knowledge and Data Engineering, 2025, 37(9): 4962-4976. [CCF A]Z. Y. Shen (硕士生), Y. H. Pang (博士生), Y. H. Rao*, J. X. Yu, CoE: A clue of emotion framework for emotion recognition in conversations, ACL, 2025, pp. 23548-23563. [CCF A]Y. H. Pang (博士生), B. Chen, F. J. Zhang*, Y. H. Rao, E. Kharlamov, J. Tang*, GuARD: Effective anomaly detection through a text-rich and graph-informed language model, KDD, 2025, pp. 2222-2233. [This work was done when Y. H. Pang interned at Zhipu AI][CCF A]D. T. Zhang, C. Q. Zhang, Y. H. Rao, Q. Li, C. J. Zhu*, Improved expressivity of hypergraph neural networks through high-dimensional generalized weisfeiler-leman algorithms, ICML, 2025, accepted. [CCF A]F. Li, J. X. Yu*, J. L. Tang, W. Q. Chen, H. J. Lai, Y. H. Rao, J. Yin, Answering complex geographic questions by adaptive reasoning with visual context and external commonsense knowledge, ACL, 2025, pp. 25498-25514. [CCF A]J. Y. Liu (硕士生), J. X. Yan (硕士生), C. J. Zhu, X. Y. Liu (硕士生), Q. Li, Y. H. Rao*, Neural topic modeling via contextual and graph information fusion, EMNLP, 2025, pp. 13259-13275. [CCF B]J. Y. Liu (硕士生), J. L. Song (硕士生), Y. H. Pang (博士生), Z. Y. Shen (硕士生), Y. H. Rao*, CARE: A disagreement detection framework with concept alignment and reasoning enhancement, EMNLP, 2025, pp. 13276-13291. [CCF B]X. Y. Liu (硕士生), Y. Y. Lu (博士生), Y. H. Rao*, Leveraging open path from pruned graph for link prediction on knowledge graphs, ISWC, 2025, pp. 556-574. [CCF B]R. H. Chen (硕士生), H. G. Chen (博士生), Y. Y. Lu (博士生), Y. H. Rao*, C. J. Zhu*, Supervised neural topic modeling with label alignment, Transactions of the Association for Computational Linguistics, 2025, 13: 249-263. [CCF B]Y. Y. Lu (博士生), H. G. Chen (博士生), P. B. Mao (硕士生), Y. H. Rao*, H. R. Xie, F. L. Wang, Q. Li, Self-supervised topic taxonomy discovery in the box embedding space, Transactions of the Association for Computational Linguistics, 2024, 12: 1401-1416. [CCF B]J. X. Yan (硕士生), Y. Y. Lu (博士生), H. G. Chen (博士生), J. X. Yu, Y. H. Rao*, Lifelong hierarchical topic modeling via nonparametric word embedding clustering, ECML-PKDD, 2024, pp. 270-287. [CCF B]Y. F. Zhang, J. X. Yu*, Y. H. Rao, L. B. Zheng, Q. L. Su, H. J. Zhu, J. Yin, Domain adaptation for subjective induction questions answering on products by adversarial disentangled learning, ACL, 2024, pp. 9074-9089. [CCF A]H. G. Chen (博士生), Y. Y. Lu (博士生), Y. H. Rao*, A self-training interpretable cell type annotation framework using specific marker gene, Bioinformatics, 2024, 40(10): btae569. [CCF B]H. G. Chen (博士生), Y. Y. Lu (博士生), Z. M. Dai, Y. D. Yang, Q. Li, Y. H. Rao*, Comprehensive single-cell RNA-seq analysis using deep interpretable generative modeling guided by biological hierarchy knowledge, Briefings in Bioinformatics, 2024, 25(4): bbae314. [CCF B]Z. C. Lin (硕士生), H. G. Chen (博士生), Y. Y. Lu (博士生), Y. H. Rao*, H. Xu*, H. J. Lai, Hierarchical topic modeling via contrastive learning and hyperbolic embedding, COLING, 2024, pp. 8133-8143. [Code][CCF B]J. Y. Liu (硕士生), H. G. Chen (博士生), C. J. Zhu, Y. H. Rao*, Unsupervised hierarchical topic modeling via anchor word clustering and path guidance, EMNLP: Findings, 2024, pp. 7505-7517.J. X. Yu*, S. Q. Wang, H. Yin, Z. L. Sun, R. B. Xie, B. Zhang, Y. H. Rao, Multimodal clickbait detection by de-confounding biases using causal representation inference, EMNLP, 2024, pp. 10300-10317. [CCF B]H. G. Chen (博士生), P. B. Mao (硕士生), Y. Y. Lu (博士生), Y. H. Rao*, Nonlinear structural equation model guided gaussian mixture hierarchical topic modeling, ACL, 2023, pp. 10377-10390. [Code][CCF A]Z. R. Liang (硕士生), Y. Y. Lu (博士生), H. G. Chen (博士生), Y. H. Rao*, Graph-based relation mining for context-free out-of-vocabulary word embedding learning, ACL, 2023, pp. 14133-14149. [Code][CCF A]W. Z. Guo, Q. K. Gong, Y. H. Rao, H. J. Lai*, Counterfactual multihop QA: A cause-effect approach for reducing disconnected reasoning, ACL, 2023, pp. 4214-4226. [CCF A]B. Zhu (博士生), Y. H. Rao*, Exploring robust overfitting for pre-trained language models, ACL: Findings, 2023, pp. 5506-5522. [Code]Z. Q. Lei (硕士生), H. Liu (硕士生), J. X. Yan (硕士生), Y. H. Rao*, Q. Li, NMTF-LTM: Towards an alignment of semantics for lifelong topic modeling, IEEE Trans. on Knowledge and Data Engineering, 2023, 35(10): 10616-10632. [Code][CCF A]Y. F. Chen (硕士生), Z. Q. Lei (硕士生), Y. H. Rao*, H. R. Xie, F. L. Wang, J. Yin, Q. Li, Parallel non-negative matrix tri-factorization for text data co-clustering, IEEE Trans. on Knowledge and Data Engineering, 2023, 35(5): 5132-5146. [CCF A]H. G. Chen (博士生), Y. Y. Lu (博士生), Y. D. Yang, Y. H. Rao*, A drug combination prediction framework based on graph convolutional network and heterogeneous information, IEEE/ACM Trans. on Computational Biology and Bioinformatics, 2023, 20(3): 1917-1925. [Code][CCF B]Y. F. Chen (硕士生), Y. H. Rao*, S. R. Chen (硕士生), Z. Q. Lei (硕士生), H. R. Xie, Raymond Y. K. Lau, J. Yin, Semi-supervised sentiment classification and emotion distribution learning across domains. ACM Trans. on Knowledge Discovery from Data, 2023, 17(5): 74:1-74:30. [CCF B]Z. S. Zhang (硕士生), Y. H. Rao*, H. J. Lai, J. H. Wang, J. Yin, TADC: A topic-aware dynamic convolutional neural network for aspect extraction, IEEE Trans. on Neural Networks and Learning Systems, 2023, 34(8): 3912-3924. [CCF B]陈姝睿 (硕士生), 梁子然 (硕士生), 饶洋辉*, 细粒度语义知识图谱增强的中文OOV词嵌入学习, 计算机科学, 2023, 50(3): 72-82.Y. Y. Lu (博士生), X. Cheng, Z. R. Liang (硕士生), Y. H. Rao*, Graph-based dynamic word embeddings, IJCAI, 2022, pp. 4280-4288. [Code][CCF A]L. H. Lin (硕士生), Y. H. Rao*, H. R. Xie, Raymond Y. K. Lau, J. Yin, F. L. Wang, Q. Li, Copula guided parallel gibbs sampling for nonparametric and coherent topic discovery, IEEE Trans. on Knowledge and Data Engineering, 2022, 34(1): 219-235. [CCF A]Z. H. Zhang (硕士生), X. W. Zhang (硕士生), Y. H. Rao*, Nonparametric forest-structured neural topic modeling, COLING, 2022, pp. 2585-2597. [Code][CCF B]X. W. Zhang (硕士生), Y. H. Rao*, Q. Li, Lifelong topic modeling with knowledge-enhanced adversarial network, World Wide Web Journal, 2022, 25: 219-238. [CCF B]Z. Y. Chen (硕士生), C. Ding (硕士生), Z. S. Zhang (硕士生), Y. H. Rao*, H. R. Xie, Tree-structured topic modeling with nonparametric neural variational inference, ACL, 2021, pp. 2343-2353. [Code][CCF A]X. R. Qin, Y. Y. Lu (本科生), Y. F. Chen (硕士生), Y. H. Rao*, Lifelong learning of topics and domain-specific word embeddings, ACL: Findings, 2021, pp. 2294-2309. [Code]Y. H. Feng (硕士生), Y. H. Rao*, Y. Y. Tang, N. H. Wang, H. Liu, Target-specified sequence labeling with multi-head self-attention for target-oriented opinion words extraction, NAACL, 2021, pp. 1805-1815. [Code][CCF B]J. H. Pang (本科生), Y. H. Rao*, H. R. Xie, X. Z. Wang, F. L. Wang, T.-L. Wong, Q. Li, Fast supervised topic models for short text emotion detection, IEEE Trans. on Cybernetics, 2021, 51(2): 815-828. [This work was finished when J. H. Pang was an undergraduate student of his final year][CCF B]X. R. Qin (本科生), Y. H. Rao*, H. R. Xie, J. H. Wang, F. L. Wang, TACN: A topical adversarial capsule network for textual network embedding, Neural Networks, 2021, 144: 766-777. [This work was submitted when X. R. Qin was an undergraduate student of her final year][CCF B]Z. Y. Chen (硕士生), C. Ding (硕士生), Y. H. Rao*, H. R. Xie, X. H. Tao, G. Cheng, F. L. Wang, Hierarchical neural topic modeling with manifold regularization, World Wide Web Journal, 2021, 24: 2139-2160. [CCF B]J. M. Wu (本科生), Y. H. Rao*, Z. S. Zhang (硕士生), H. R. Xie, Q. Li, F. L. Wang, Z. Y. Chen (硕士生), Neural mixed counting models for dispersed topic discovery, ACL, 2020, pp. 6159-6169. [Code][CCF A] 教务部统一门户研究生院科学研究院学生工作部人力资源管理处大学服务中心财务与国资管理处地址：广州市番禺区大学城外环东路132号（510006）2015-2025 © 中山大学计算机学院 版权所有微信公众号网站手机版 学院概况 学院简介 历史沿革 学院领导 组织架构 常设机构 行政办公 党建工会 党建工作 党建动态 党建通知 党委分工 工会工作 工会建设 工会分工 人才培养 本科生培养 教学通知 培养方案 教学成果 研究生培养 研究生通知 管理制度 培养方案 学位工作 人才培养体系 教学平台 国家级人才培养计划 师资队伍 专任教师 专职研究人员 专业技术人员 人才工程 科学研究 科研平台 科研团队 科研通知 科研进展 产学研合作 学术活动 学生工作 学工队伍 学工通知 团学建设 学子风采 实习就业 招生信息 本科生招生 招生信息 专业介绍 研究生招生 夏令营 硕士招生 博士招生 港澳台招生 招生导师 人才招聘 人才招聘 人事通知 校友与基金 校友会 校友会简介 校友动态 校友服务 基金捐赠 捐赠项目 捐赠指南 信息中心 学校文件 政府采购与招投标 设备与实验室 公开信息 本科生教学 研究生教学 设备与网络 实验室管理 内部信息 人事信息",
  "content_length": 9847,
  "method": "requests",
  "crawl_time": "2025-12-01 14:50:17"
}