{
  "name": "Yang Zhang 0016",
  "homepage": "https://yangzhangalmo.github.io",
  "status": "success",
  "content": "Yang Zhang (张阳) Follow Saarbrücken, Germany Email Twitter LinkedIn Github Google Scholar ORCIDI am a tenured faculty (equivalent to full professor) at CISPA Helmholtz Center for Information Security. I sometimes chime in iDRAMA Lab for the memes.Research AreasTrustworthy Machine Learning, with a focus on LLMs (Safety, Privacy, and Security)Misinformation, Hate Speech, and MemesSocial Network AnalysisI’m always looking for motivated students and postdocs to join my group. If you are interested, please write me an email (zhang@cispa.de).AwardsAI 2000 Most Influential Scholar Award Honorable Mention 2025Best Machine Learning and Security Paper in Cybersecurity Award 2025Best paper finalist at CSAW Europe 2024Best paper finalist at CSAW Europe 2023Best paper award honorable mention at CCS 2022Busy Beaver teaching award nomination for seminar “Privacy of Machine Learning” at Saarland University (2022 Winter)Busy Beaver teaching award nomination for advanced lecture “Machine Learning Privacy” at Saarland University (2022 Summer)Busy Beaver teaching award for seminar “Privacy of Machine Learning” at Saarland University (2021 Winter)Distinguished paper award at NDSS 2019What’s New[9/2025] Yixin Wu is named Rising Stars in EECS 2025![8/2025] I’m included in the “2025 AI 2000 Global Artificial Intelligence Scholars List” and awarded the “2025 AI 2000 Most Influential Scholar Award Honorable Mention” in the area of Security and Privacy by AMiner.[7/2025] Our paper ““Do Anything Now”: Characterizing and Evaluating In-The-Wild Jailbreak Prompts on Large Language Models” won the Best Machine Learning and Security Paper in Cybersecurity Award 2025![6/2025] Our paper “JailbreakRadar: Comprehensive Assessment of Jailbreak Attacks Against LLMs” got selected as an oral presentation at ACL 2025![6/2025] Yixin Wu received the Abbe Grant from the Carl-Zeiss-Stiftung Foundation and is selected as a Young Researcher to attend the 12th Heidelberg Laureate Forum![5/2025] Yiting Qu has successfully passed her Ph.D. defense! Congratulations, Dr. Qu![5/2025] Mengfei Liang, Bo Shao, and Tianze Chang joined the team to start their Ph.D., welcome![5/2025] Rui Wen joined Institute of Science Tokyo as an assistant professor![3/2025] Rui Wen has successfully passed his Ph.D. defense! Congratulations, Dr. Wen![3/2025] Yixin Wu and Xinyue Shen are named MLCommons ML and Systems Rising Stars 2025![1/2025] Xinyue Shen is named KAUST Rising Star in AI 2025！",
  "content_length": 2461,
  "method": "requests",
  "crawl_time": "2025-12-01 14:50:13"
}