{
  "name": "Yang Liu 0005",
  "homepage": "http://nlp.csai.tsinghua.edu.cn/~ly",
  "status": "success",
  "content": "Yang Liu's Homepage at Tsinghua University English | Chinese Yang Liu GDS Professor Department of Computer Science and Technology Institute for AI Industry Research Tsinghua University Bio Yang Liu is the GDS Professor in the Department of Computer Science and Technology at Tsinghua University. He is Executive Dean of Institute for AI Industry Research (AIR) and Executive Director of AI Agent Hospital. His research interests include natural language processing, Medical AI and AI for Science. He received COLING/ACL 2006 Meritorious Asian NLP Paper Award, ACL 2017 Outstanding Paper Award, ACL 2023 Outstanding Paper Award, and ICLR 2023 Outstanding Paper Award Honorable Mention. He served as Executive Committee Member of Asia-Pacific Chapter of ACL, Editorial Board Member of Computational Linguistics, and Associate Editor of ACM TALLIP. Research Foundation Models for Artificial Intelligence Directions: multilinguality, multimodality, trustworthy generation, alignment, etc. Recent publications: Xuanyu Lei, Zonghan Yang, Xinrui Chen, Peng Li, and Yang Liu. 2025. Scaffolding Coordinates to Promote Vision-Language Coordination in Large Multi-Modal Models. In Proceedings of COLING 2025. [arXiv] Sijie Cheng, Zhicheng Guo, Jingwen Wu, Kechen Fang, Peng Li, Huaping Liu, and Yang Liu. 2024. Can Vision-Language Models Think from a First-Person Perspective?. In Proceedings of CVPR 2024. [arXiv] Guan Wang, Sijie Cheng, Xianyuan Zhan, Xiangang Li, Sen Song, and Yang Liu. 2024. OpenChat: Advancing Open-source Language Models with Mixed-Quality Data. In Proceedings of ICLR 2024. [arXiv] Yuanchi Zhang, Yile Wang, Zijun Liu, Shuo Wang, Xiaolong Wang, Peng Li, Maosong Sun, and Yang Liu. 2024. Enhancing Multilingual Capabilities of Large Language Models through Self-Distillation from Resource-Rich Languages. In Proceedings of ACL 2024. [arXiv] Chi Chen, Ruoyu Qin, Fuwen Luo, Xiaoyue Mi, Peng Li, Maosong Sun, and Yang Liu. 2023. Position-Enhanced Visual Instruction Tuning for Multimodal Large Language Models. arXiv:2308.13437. [arXiv] Autonomous Agents Directions: tool learning, evolvable agents, internet of agents, medical agents, embodied AI, etc. Recent publications: Junkai Li, Yunghwei Lai, Weitao Li, Jingyi Ren, Meng Zhang, Xinhui Kang, Siyu Wang, Peng Li, Ya-Qin Zhang, Weizhi Ma, and Yang Liu. 2024. Agent Hospital: A Simulacrum of Hospital with Evolvable Medical Agents. arXiv:2405.02957. [arXiv] Zonghan Yang, Peng Li, Ming Yan, Ji Zhang, Fei Huang, and Yang Liu. 2024. ReAct Meets ActRe: When Language Agents Enjoy Training Data Autonomy. In Proceedings of COLM 2024. [arXiv] Zonghan Yang, An Liu, Zijun Liu, Kaiming Liu, Fangzhou Xiong, Yile Wang, Zeyuan Yang, Qingyuan Hu, Xinrui Chen, Zhenhe Zhang, Fuwen Luo, Zhicheng Guo, Peng Li, and Yang Liu. 2024. Towards Unified Alignment Between Agents, Humans, and Environment. In Proceedings of ICML 2024.[arXiv] Zijun Liu, Yanzhe Zhang, Peng Li, Yang Liu, and Diyi Yang. 2024. A Dynamic LLM-Powered Agent Network for Task-Oriented Agent Collaboration. In Proceedings of COLM 2024. [arXiv] Yuzhuang Xu, Shuo Wang, Peng Li, Fuwen Luo, Xiaolong Wang, Weidong Liu, and Yang Liu. 2023. Exploring Large Language Models for Communication Games: An Empirical Study on Werewolf. arXiv:2309.04658. [arXiv] AI for Science Directions: molecular dynamics simulation, foundation models for molecular systems, crystal structure prediction, AI for drug discovery, etc. Recent publications: Xiangzhe Kong, Wenbing Huang, and Yang Liu. 2024. Generalist Equivariant Transformer Towards 3D Molecular Interaction Learning. In Proceedings of ICML 2024. [arXiv] Rui Jiao, Wenbing Huang, Yu Liu, Deli Zhao, and Yang Liu. 2024. Space Group Constrained Crystal Generation. In Proceedings of ICLR 2024. [arXiv] Ziyang Yu, Wenbing Huang, and Yang Liu. 2024. Rigid Protein-Protein Docking via Equivariant Elliptic-Paraboloid Interface Prediction. In Proceedings of ICLR 2024. [arXiv] Xiangzhe Kong, Wenbing Huang, and Yang Liu. 2023. Conditional Antibody Design as 3D Equivariant Graph Translation. In Proceedings of ICLR 2023. [paper][arXiv][code] (ICLR 2023 Outstanding Paper Award Honorable Mention) Rui Jiao, Jiaqi Han, Wenbing Huang, Yu Rong, and Yang Liu. 2023. Energy-Motivated Equivariant Pretraining for 3D Molecular Graphs. In Proceedings of AAAI 2023. [arXiv] A full list of publications Teaching Spring 2026: Foundations of Programming, Big Models and Generative AI Fall 2025: Formal Languages and Automata Spring 2025: Foundations of Programming, Artificial Intelligence, Big Models and Generative AI Fall 2024: Formal Languages and Automata Spring 2024: Foundations of Programming, Artificial Intelligence Fall 2023: Formal Languages and Automata Spring 2023: Foundations of Programming, Artificial Intelligence Fall 2022: Formal Languages and Automata Spring 2022: Foundations of Programming, Artificial Intelligence Fall 2021: Formal Languages and Automata, Natural Language Processing Spring 2021: Foundations of Programming, Formal Languages and Automata, Artificial Intelligence Fall 2020: Natural Language Processing Spring 2020: Foundations of Programming, Formal Languages and Automata, Artificial Intelligence Fall 2019: Frontiers and Hot Topics in Deep Learning, Natural Language Processing Spring 2019: Foundations of Programming, Formal Languages and Automata, Frontiers and Hot Topics in Deep Learning Fall 2018: Frontiers and Hot Topics in Deep Learning Spring 2018: Foundations of Programming, Formal Languages and Automata, Frontiers and Hot Topics in Deep Learning Fall 2017: Computational Linguistics, Information Retrieval, Frontiers and Hot Topics in Deep Learning Spring 2017: Foundations of Programming, Frontiers and Hot Topics in Deep Learning Fall 2016: Computational Linguistics, Information Retrieval, Frontiers and Hot Topics in Deep Learning Spring 2016: Foundations of Programming Spring 2015: Foundations of Programming Spring 2014: Foundations of Programming Spring 2013: Foundations of Programming Students Current Members Rui Jiao, PhD, 2021-present Zhicheng Guo, PhD, 2021-present Xiangzhe Kong, PhD, 2022-present Ziyue Wang, PhD, 2022-present Xiaolong Wang, PhD, 2022-present Sijie Cheng, PhD, 2023-present Fuwen Luo, PhD, 2023-present Junkai Li, PhD, 2023-present Yuanhang Liu, PhD, 2023-present (co-advising with Prof. Wenjia Jing) Weitao Li, Master, 2023-present Xinhui Kang, Master, 2023-present Li Zhang, Posdoc, 2024-present Zijun Liu, PhD, 2024-present Ziyang Yu, PhD, 2024-present Xuanyu Lei, PhD, 2024-present (co-advising with Prof. Ya-qin Zhang) Jingyi Ren, PhD, 2024-present Yanqiao Wang, PhD, 2024-present (co-advising with Prof. Jinpeng Liu) Yung Hwei Lai, Master, 2024-present Ante Wang, Posdoc, 2025-present Yanxing Huang, PhD, 2025-present (co-advising with Prof. Chenglong Bao) Hanwei Fan, PhD, 2025-present Kaiming Liu, PhD, 2025-present Linlu Gong, PhD, 2025-present Zhenglong Li, Master, 2025-present Alumni Zonghan Yang, PhD, 2020-2025 An Liu, Master, 2022-2025 Jitao Xu, Posdoc, 2023-2025 Yile Wang, Posdoc, 2022-2024 Chi Chen, PhD, 2019-2024 Yuanhang Zheng, PhD, 2019-2024 Yuanchi Zhang, Master, 2021-2024 Zeyuan Yang, Master, 2021-2024 Kaiyu Huang, Posdoc, 2021-2023 Shuo Wang, PhD, 2018-2023 Qinhong Zhou, Master, 2020-2023 Zhicong Lin, Master, 2021-2023 Fuchao Wei, PhD, 2016-2023 (co-advised with Prof. Guangwen Yang) Zhixing Tan, Posdoc, 2019-2022 Huimeng Zhang, Master, 2019-2022 Yizhou Xu, Master, 2019-2022 Xuancheng Huang, PhD, 2017-2022 Gang Chen, Master, 2018-2021 Mieradilijiang Maimaiti, PhD, 2015-2021 (co-advised with Prof. Maosong Sun) Jiacheng Zhang, PhD, 2015-2020 Yanzhuo Ding, Master, 2016-2019 Meng Zhang, PhD, 2013-2018 (co-advised with Prof. Maosong Sun) Abudukelimu Halidanmu, PhD, 2012-2018 (co-advised with Prof. Maosong Sun) Shiqi Shen, PhD, 2012-2017 (co-advised with Prof. Maosong Sun) Yong Cheng, PhD, 2012-2017 (Tsinghua IIIS, co-advised with Prof. Wei Xu) Chunyang Liu, Master, 2013-2016 Meiping Dong, Master, 2012-2015 Peng Li, PhD, 2009-2015 (co-advised with Prof. Maosong Sun) Henry Loharja, Master, 2012-2014 Can Wang, Master, 2010-2013 (co-advised with Prof. Maosong Sun) Qi Liu, Master, 2010-2013 (co-advised with Prof. Maosong Sun) Shengtao Lei, Master, 2009-2012 (co-advised with Prof. Maosong Sun) Guosheng Ben (ICT/CAS), Master, 2010-2011 Selected Professional Services Organizations Association for Computational Linguistics: ACL Dissertation Committee: Member (2025-present) ACL Reviewing Committee: Member (2019-2022) AACL: Executive Committee Member (2018-2020), Secretary (2018-2020) SIGHAN: Information Officer (2013-2022) Chinese Information Processing Society: Computational Linguistics Technical Committee: Chair (2022-present), Vice Chair (2018-2022), General Secretary (2013-2020), Member (2013-present) Youth Working Committee: Chair (2016-2018), Executive Committee Member (2012-2018), Committee Member (2012-2019) Chinese Association for Artifical Intelligence: Organization Working Committee: Chair (2025-present), General Secretary (2022-2025), Vice General Secretary (2020-2022) Journals Computational Linguistics: Editorial Board Member (2018-2020) ACM Transactions on Asian and Low-Resource Language Information Processing: Associate Editor (2017-2020) Conferences ACL: Area Chair (2017-2019, 2021), Best Paper Award Committee Member (2018), Local Arrangements Chair (2015), Tutorial Chair (2014), Faculty Advisor of Student Research Workshop (2016) EMNLP: Area Chair (2016, 2018-2021), Best Long Paper Award Committee Member (2018) AACL: Program Chair (2022), Best Long Paper Award Committee Member (2023) IJCAI: Senior Area Chair (2021), Senior PC member (2016, 2018-2020, 2022) AAAI: Senior PC member (2019-2020) Created on 04/03/2004, last updated on 11/18/2025.",
  "content_length": 9746,
  "method": "requests",
  "crawl_time": "2025-12-01 14:50:07"
}