{
  "name": "Yanggon Kim",
  "homepage": "https://www.towson.edu/fcsm/departments/computerinfosci/facultystaff/ykim.html",
  "status": "success",
  "content": "Yanggon Kim | Towson University Skip to Main Content Students Current myTU for Students Blackboard Email Towson Online Services OneCard/TU ID Card Library Academic Calendar University Store Athletics Future Majors Graduate Programs Application Request Information Take a Campus Tour Housing & Dining Tuition Financial Aid Parents Family Network Family Weekend Request Information Undergraduate Admissions Visit TU Tuition Financial Aid Emergency Text Alerts Alumni Tiger Connect Alumni Events Alumni Benefits University Store TU Magazine Request a Transcript Office of Alumni Relations Faculty & Staff myTU for Faculty & Staff Email Blackboard Timesheets TechHelp Library Academic Calendar TU Webcam Business BTU-Partnerships at Work for Greater Baltimore StarTUp Center for GIS Regional Economic Studies Institute Dr. Nancy Grasmick Leadership Institute Sponsorship & Advertising Opportunities Hiring TU Students Give to TU Calendars & Events Directories SearchSearch Towson University Visit TU Apply Now Request Information Facts & Figures Mission & Strategic Plan Rankings & Achievements Administration Commitment to Diversity & Inclusion Accessibility Sustainability Consumer Information & Accreditation Visit TU Apply Now Request Information Undergraduate Studies Graduate Studies Accelerated Programs Research International Initiatives Colleges & Departments Off-Campus Locations Extended & Professional Education Summer Session Academic Services & Resources Commencement Visit TU Apply Now Request Information Undergraduate Admissions Graduate Admissions Tuition & Expenses Financial Aid Counselor & Advisor Resources Visit Campus Apply Now Request Information Visit TU Apply Now Request Information Student Involvement Housing & Dining Student Services & Resources Health & Well-being Safety & Security New Student & Family Programs Visit TU Apply Now Request Information Anchor Mission BTU-Partnerships for Greater Baltimore Business & Public Engagement Community Programs & Resources Arts & Culture Campus Landmarks & Features Planning Events & Conferences at TU Towson University SearchSearch Menu SearchSearch Go Back About TU Academics Admissions & Aid Student Life Campus & Community Information For Students Current myTU for Students Blackboard Email Towson Online Services OneCard/TU ID Card Library Academic Calendar University Store Athletics Future Majors Graduate Programs Application Request Information Take a Campus Tour Housing & Dining Tuition Financial Aid Parents Family Network Family Weekend Request Information Undergraduate Admissions Visit TU Tuition Financial Aid Emergency Text Alerts Alumni Tiger Connect Alumni Events Alumni Benefits University Store TU Magazine Request a Transcript Office of Alumni Relations Faculty & Staff myTU for Faculty & Staff Email Blackboard Timesheets TechHelp Library Academic Calendar TU Webcam Business BTU-Partnerships at Work for Greater Baltimore StarTUp Center for GIS Regional Economic Studies Institute Dr. Nancy Grasmick Leadership Institute Sponsorship & Advertising Opportunities Hiring TU Students Visit TUApply NowRequest Information Give to TU Calendars & Events Directories Yanggon Kim Professor Contact Info Phone: 410-704-3782 Office: YR-481 Email: ykim@towson.edu Education B.S., Computer and Statistics (1984), Seoul National University \t\t\tM.S., Computer Sciences (1986), Seoul National University \t\t\tPh.D., Computer Sciences (1995), Pennsylvania State University Areas of Expertise Computer Architecture, Computer Networks, Communications, Computer Graphics, High-Performance Computing Systems Biography He received his B.S. and M.S. degree from Seoul National University, Seoul, Korea in 1984 and 1986, respectively and Ph.D. degree in Computer Science from Pennsylvania State University, Pennsylvania, 1995. He is currently a professor in the Department of Computer and Information Sciences, Towson University and is a director of MS in CS program.  His current research interests include Computer Network, Secure BGP network, distributed computing systems, Big Data and data mining in social networks. Selected recent Publications and Presentations: âThe Policy-Based AS-PATH Verification to Prevent 1-Hop AS Path Hijacking By Monitoring BGP Live Streams,â International Journal on Advances in Security (IJAS), Vol 8, No. 1 & 2, pp. 79-88, 2015 published by IARIA âThe Policy-Based AS-PATH Verification to Monitor AS Path Hijackingâ, The 8th International Conference on Emerging Security Information, Systems, and Technologies (SECURWARE 2014). Pp. 20-24 (Lisbon, Portugal, Nov. 16 â 20, 2014 âEvaluating the Performance Impact of RTR-BIRD in Origin Validationâ, 2014 Research in Adaptive and Convergent Systems (RACS 2014). pp 198-203 (Towson, USA, Oct. 5 â 8, 2014) \"Dynamic Seed Selection for Twitter Data Collection\", Journal of KIISE:Databases, Vol. 41, Number 4, pp. 217 â 225, Aug. 2014 âThe Implementation of BGP Monitoring, Alarming, and Protecting System by a BGP-UPDATE-Base Method using ECOMMUNITY in Real Timeâ, International Conference on Security and Management(SAM 2014). pp290-296 (Las Vegas, Nevada, USA  July 21 â 24, 2014) âSemantic Reasoning with contextual Ontologies on Sensor Cloud Environmentâ, International Journal of Distributed Sensor Networks, 2014, Vol. 2014, Article ID 693957 published by Hindawi Publishing Corporation. âSports and Social Media: Twitter Usage Patterns during the 2013 Super Bowl Broadcastâ, The International Conference on Communication, Media,Technology and Design(ICCMTD2014). pp. 250-259 (Istanbul, Turkey, April 24 â 26, 2014) âThe Security Appliance to BIRD Software Router (RTRPKI)â, ACM The 8th International conference on Ubiquitous Information Management and Communication (ACM ICUIMC2014). (Siem Reap, Cambodia, Jan. 9 â 11, 2014) âTwitter Data Collecting Tool with Rule-based Filtering and Analysis Moduleâ, International Journal of Web Information Systems (IJWIS), 2013, Vol. 9, No. 3, pp 184 â 203 published by Emerald Group Publishing Co. Direct Edit JS for Moving Direct Edit Button into place.",
  "content_length": 6094,
  "method": "requests",
  "crawl_time": "2025-12-01 14:50:15"
}