{
  "name": "Yang Zhou 0007",
  "homepage": "https://zhouyangvcc.github.io",
  "status": "success",
  "content": "Yang Zhou Yang Zhou   周漾 Associate Professor (Tenured) Office: Room 810-A, Building L6, South Campus of Shenzhen University Tel: +86-0755-8695-8774, +86-159-9744-7904 Email: zhouyangvcc [@] szu.edu.cn or gmail.com Biography I am currently a tenured Associate Professor at the College of Computer Science & Software Engineering, Shenzhen University (SZU). I received my Ph.D. in Photogrammetry and Remote Sensing from Wuhan University in 2013. After that I did a postdoc research working with Prof. Hui Huang, who helped me start my research career in computer graphics. Before joining SZU, I worked as a software engineer at DJI Innovation and as an assistant professor at Huazhong University of Science and Technology (HUST). My research interest generally lies in computer graphics, including texture synthesis, shape analysis, and 3D modeling. Besides graphics, I'm also interested in computer vision and deep learning techniques, especially deep generative models. I have several publication records in the top conferences and journals of both graphics and vision, including SIGGRAPH, SIGGRAPH Asia, Eurographics, CVPR, and NeurIPS. 2025~present Associate Professor, at CSSE, SZU 2019~2024 Assistant Professor, at CSSE, SZU 2017~2019 Assistant Professor, at EIC, HUST 2016~2017 Software Engineer, at DJI Innovation 2014~2016 Post Doc. in Computer Graphics, at SIAT, Shenzhen 2007~2013 Ph.D. in Photogrammetry and Remote Sensing, Wuhan University 2003~2007 B.S. in Photogrammetry, Wuhan University Research Interests Geometric Modeling & Analysis Texture Synthesis & Style Transfer Deep learning Photogrammetry Publications You can also check my publications from Google Scholar. * Corresponding author SPG: Style-Prompting Guidance for Style-Specific Content Creation Computer Graphics Forum (Journal Track, Pacific Graphics 2025) Qian Liang, Zichong Chen, Yang Zhou* , Hui Huang [ project page ] Introducing Unbiased Depth into 2D Gaussian Splatting for High-accuracy Surface Reconstruction Computer Graphics Forum (Journal Track, Pacific Graphics 2025) Yixin Yang, Yang Zhou* , Hui Huang [ project page ] High-Fidelity Texture Transfer Using Multi-Scale Depth-Aware Diffusion Computer Graphics Forum (EGSR 2025) Rongzhen Lin, Zichong Chen, Xiaoyong Hao, Yang Zhou* , Hui Huang [ project page, presentation ] Attention Distillation: A Unified Approach to Visual Characteristics Transfer CVPR 2025 Yang Zhou, Xu Gao, Zichong Chen, Hui Huang* [ project page ] StyleBlend: Enhancing Style-Specific Content Creation in Text-to-Image Diffusion Models Computer Graphics Forum (Eurographics 2025) Zichong Chen, Shijin Wang, Yang Zhou* [ project page ] Deformable Few-shot Face Cartoonization via Local to Global Translation Computational Visual Media (CVMJ), 11(2), 2025 Yang Zhou, Shengshu Li, Hui Huang* [ project page ] Dynamic Importance in Diffusion U-Net for Enhanced Image Synthesis ICME 2025 Xi Wang, Ziqi He, Yang Zhou* [ project page ] Describe, Adapt and Combine: Empowering CLIP Encoders for Open-set 3D Object Retrieval ICCV 2025 Zhichuan Wang, Yang Zhou, Zhe Liu, Rui Yu, Song Bai, Yulong Wang, Xinwei He, Xiang Bai [ project page ] CLIP-AdaM: Adapting Multi-view CLIP for Open-set 3D Object Retrieval SIGIR 2025 Xinwei He, Liang Ma, Yuxuan Cheng, Zhichuan Wang, Yulong Wang, Yang Zhou, Xiang Bai [ paper ] TeDA: Boosting Vision-Lanuage Models for Zero-Shot 3D Object Retrieval via Testing-time Distribution Alignment ICMR 2025 Zhichuan Wang, Yang Zhou, Jinhai Xiang, Yulong Wang, Xinwei He [ project page ] Omni-AD: Learning to Reconstruct Global and Local Features for Multi-class Anomaly Detection ICME 2025 Jiajie Quan, Ao Tong, Yuxuan Cai, Xinwei He, Yulong Wang, Yang Zhou [ project page ] Point-StyleGAN: Multi-scale Point Cloud Synthesis with Style Modulation Computer Aided Geometric Desgine (GMP 2024) Yang Zhou, Cheng Xu, Zhiqiang Lin, Xinwei He, Hui Huang* [ project page ] Generating Non-Stationary Textures using Self-Rectification CVPR 2024 Yang Zhou, Rongjun Xiao, Dani Lischinski, Daniel Cohen-Or, Hui Huang* [ project page ] Deformable One-shot Face Stylization via DINO Semantic Guidance CVPR 2024 Yang Zhou, Zichong Chen, Hui Huang* [ project page ] Neural Texture Synthesis with Guided Correspondence CVPR 2023 Yang Zhou, Kaijian Chen, Rongjun Xiao, Hui Huang* [ project page ] Offsite Aerial Path Planning for Efficient Urban Scene Reconstruction ACM Trans. on Graphics (Proc. of SIGGRAPH Asia 2020) Xiaohui Zhou, Ke Xie, Kai Huang, Yilin Liu, Yang Zhou, Minglun Gong, Hui Huang* [ project page ] EFANet: Exchangeable Feature Alignment Network for Arbitrary Style Transfer AAAI 2020 Zhijie Wu, Chunjin Song, Yang Zhou*, Minglun Gong, Hui Huang* [ project page ] ETNet: Error Transition Network for Arbitrary Style Transfer NeurIPS 2019 Chunjin Song, Zhijie Wu, Yang Zhou*, Minglun Gong, Hui Huang* [ project page ] Non-stationary Texture Synthesis by Adversarial Expansion ACM Trans. on Graphics (Proc. of SIGGRAPH 2018) Yang Zhou, Zhen Zhu, Xiang Bai, Dani Lischinski, Daniel Cohen-Or, Hui Huang* [ project page ] Full 3D Reconstruction of Transparent Objects ACM Trans. on Graphics (Proc. of SIGGRAPH 2018) Bojian Wu, Yang Zhou, Yiming Qian, Minglun Gong, Hui Huang* [ project page ] Triplet-Center Loss for Multi-View 3D Object Retrieval CVPR 2018 Xinwei He, Yang Zhou* , Zhichao Zhou, Song Bai, Xiang Bai [ paper, code ] Analysis and Controlled Synthesis of Inhomogeneous Textures Computer Graphics Forum (Eurographics 2017) Yang Zhou, Huajie Shi, Dani Lischinski, Minglun Gong, Johannes Kopf, Hui Huang* [ project page ] Skeleton-guided 3D Shape Distance Field Metamorphosis Graphical Models (Proc. CVM 2016) Bo Wu, Kai Xu*,Yang Zhou,Yueshan Xiong, Hui Huang [ project page ] Generalized Cylinder Decomposition ACM Trans. on Graphics (Proc. SIGGRAPH Asia 2015) Yang Zhou, Kangxue Yin, Hui Huang*, Hao Zhang, Minglun Gong, Daniel Cohen-Or [ project page ] Registration of Optical Images with Lidar Data and Its Accuracy Assessment Photogrammetric Engineering and Remote Sensing, 2013 Shunyi Zheng, Rongyong Huang, Yang Zhou [ paper ] A Method of 3d Measurement and Reconstruction for Cultural Relics in Museums ISPRS Congress 2012 Shunyi Zheng, Yang Zhou, Rongyong Huang, Langming Zhou, Xuan Xu, Chengyi Wang [ paper ] Automatic 3D model reconstruction of the diamond object Measurement, 2012 Shunyi Zheng, Langming Zhou, Cailin Li, Yang Zhou [ paper ] Selected Publications in Chinese 部分中文期刊 3D stylized portrait synthesis and structured face modeling Journal of Image and Graphics, 2025 Jiaping Hu，Yang Zhou* [ paper ] Non-Stationary Texture Synthesis Controlled by Relative Coordinate Guidance Journal of CAD & CG, 2023 Kaijian Chen，Erqiang Li，Yang Zhou* [ paper ] Controllable Multi-texture Extended Synthesis and Transfer Journal of Jilin University (Science Edition), 2021 Erqiang Li，Kaijian Chen，Yang Zhou* [ paper ] Differential rendering: a survey Journal of Image and Graphics, 2021 Weiwei Xu, Yang Zhou, Hongzhi Wu, Jie Guo [ paper ] Face-wise Poisson blending with color transfer in seamless texturing Journal of Image and Graphics, 2014 Yang Zhou, Shunyi Zheng, Rongyong Huang, Dian Ma [ paper ] High quality texture reconstruction for small objects based on structure light scanning system with digital camera Geomatics and Information Science of Wuhan University, 2012 Shunyi Zheng, Yang Zhou [ paper ] Awards The 2014 Boeing Award for Best Scientific Paper in Image Analysis and Interpretation ASPRS John D. Davidson President's Award for Practical Papers, 1st place Scientific and Technological Progress Award for Surveying and Mapping, 1st place © Yang Zhou. VCC, Shenzhen University.",
  "content_length": 7640,
  "method": "requests",
  "crawl_time": "2025-12-01 14:50:14"
}