{
  "name": "Yang-Quan Chen",
  "homepage": "https://sites.ucmerced.edu/yqchen",
  "status": "success",
  "content": "YangQuan Chen Skip to main content Home Bio YangQuan Chen (SM '95 SrM '98) received the B.S. degree in industrial automation from the University of Science and Technology of Beijing, Beijing, China, in 1985, the M.S. degree in automatic control from the Beijing Institute of Technology, Beijing, in 1989, and the Ph.D. degree in advanced control and instrumentation from the Nanyang Technological University, Singapore, Singapore, in 1998. He is currently an Associate Professor of electrical and computer engineering at Utah State University, Logan, and the Director of the Center for Self-Organizing and Intelligent Systems. He is the holder of 13 U.S. patents in various aspects of hard disk drive servomechanics and one US patent on fractional order controller tuning. Read More Bio Recent Publications A Survey on Fractional-Order Iterative Learning Control Stability and stabilization of fractional-order linear systems with convex polytopic uncertainties Three fractional-order TV-L2 models for image denoising Time domain analysis of the fractional order weighted distributed parameter Maxwell model Tracking tagged fish with swarming Unmanned Aerial Vehicles using fractional order potential fields and Kalman filtering Welcome message from the program chairs More Service Service Immediate Past Chair, Technical Committee of Mechatronics and Embedded Systems and Applications (MESA), ASME DED (Design Engineering Division) (2010-2011) (ASME/IEEE MESA 2011) Chair, Technical Committee of Mechatronics and Embedded Systems and Applications (MESA),ASME DED (Design Engineering Division) (2009-2010)Chair, Technical Committee of Mechatronics and Embedded Systems (MES), IEEE ITSS (Intelligent Transportation Systems Society) (2009-2010)Associate Editor, ISA Transactions (2011-)Associate Editor, IFAC journal Mechatronics, (2010-)Designated Editor, IFAC journal Control Engineering Practice (CEP), (2010-) Read More Service",
  "content_length": 1929,
  "method": "requests",
  "crawl_time": "2025-12-01 14:50:15"
}