{
  "name": "Yang Gao 0029",
  "homepage": "https://iiis.tsinghua.edu.cn/en/People/Faculty/GaoYang.htm",
  "status": "success",
  "content": "ï»¿ Gao Yang-Institute for Interdisciplinary Information Sciences (IIIS) Home IIIS Headlines Institute Seminars About IIIS Introduction Message From Dean Current Leadership History News Latest News Media Coverage People Faculty Research Honorary Professors Adjunct Instructors Postdocs Administrative Staff Lab Assistants Yao Class About Yao Class Admission Graduate Graduate Programs Graduate Admission CQI Introduction Faculty Research Overview CQI News Research Organization Research Groups Latest Research Research Report Campus Campus Events Student Life Join Us Faculty Recruitment Postdoctoral Recruitment Staff Recruitment Alumni IIIS Alumni Community Giving People Faculty Research Honorary Professors Adjunct Instructors Postdocs Administrative Staff Lab Assistants Yang Gao computer vision, reinforcement learning I am an Assistant Professor at Institute for Interdisciplinary Information Science (IIIS) at Tsinghua University. I am interested in the intersection between computer vision and robotics. Specifically, I want to explore how to utilize the prior knowledge we have from computer vision to do robot manipulation tasks both more efficiently and effectively. This not only involves understanding how to use the previous visual experiences but also potentially needs re-designing robotic learning algorithms to better handles the visual states. Previously, I obtained my Ph.D. degree from UC Berkeley, advised by Prof. Trevor Darrell and B.E. from the Computer Science Department at Tsinghua University. I welcome highly motivated and strong undergrad students and Ph.D. candidates to join our lab. If you are interested, please feel free to send me your resume and transcript via email. Related information 05-22 2024 Prof. Yang Gao's Research Team Proposes An Innovative Any-point Trajectory Modeling (ATM) for Policy Learning Email Personal homepage http://people.iiis.tsinghua.edu.cn/~gaoyang/yang-gao.weebly.com/index.html RM 1-208, FIT Building, Tsinghua University, Haidian District, Beijing, 100084, P. R. China +86-010-62781693      FAX: +86-010-62781693-2000     EMAIL: iiis@mail.tsinghua.edu.cnCopyright@IIIS, Tsinghua University, All Rights Reserved. TOP",
  "content_length": 2185,
  "method": "requests",
  "crawl_time": "2025-12-01 14:50:06"
}