{
  "name": "Yang Chen 0001",
  "homepage": "https://chenyang03.wordpress.com",
  "status": "success",
  "content": "Yang Chen's Homepage | School of Computer Science, Fudan University I am a Professor within the College of Computer Science and Artificial Intelligence at Fudan University and a Vice Director of the Shanghai Key Lab of Intelligent Information Processing. Before joining Fudan, I was a postdoctoral associate at the Department of Computer Science, Duke University. My recent research interests include social computing & networking, interdisciplinary network analysis (for example, online/mobile social networks), network architectures and protocols, urban computing, and AI for Social Science. (E-mail: ) [NEWS] I am looking for a postdoc. The working environment here is international, and the salary is competitive. Let me know if you are interested. [NEWS] Check out EasyGraph, a multifunctional, cross-platform, and effective library for interdisciplinary network analysis! EasyGraph has been downloaded for over 900,000 times until Sep. 2025! [Paper|Project|Code|Video] [NEWS] Check out our new WeChat Mini Program: Qingyun Go! [Video|Dataset] Experience Professor (Dec. 2023 – present) Associate Professor (Dec. 2017 – Dec. 2023) Pre-tenure Associate Professor (Oct. 2014 – Nov. 2017) College of Computer Science and Artificial Intelligence, Fudan University (formerly School of Computer Science, Fudan University) Leading the Big Data and Networking (DataNET) Group of the SONIC Laboratory (WeChat: fudan-datanet) Postdoctoral Associate (Apr. 2011 – Sep. 2014) Networks and Distributed Systems (NDS) Lab, Department of Computer Science, Duke University Worked together with Prof. Xiaowei Yang Research Associate (Sep. 2009 – Apr. 2011) Computer Network Group, Institute of Computer Science, Georg-August-University of Goettingen Worked together with Prof. Xiaoming Fu (Member of Academia Europaea & IEEE Fellow) Research Intern (Apr. 2006 – Mar. 2007, Jul. 2007 – Jan. 2008) Wireless and Networking Group, Microsoft Research Asia Worked together with Dr. Yongqiang Xiong and Dr. Guobin (Jacky) Shen Education PhD (Sep. 2004 – Jul. 2009) Department of Electronic Engineering, Tsinghua University Advisor: Prof. Xing Li (Deputy Director of China Education and Research Network) Exchange Graduate Student (Apr. 2007 – Jun.2007) Department of Computer Science, School of Engineering, Stanford University Advisor: Prof. Pei Cao (Member of National Academy of Engineering) Bachelor of Engineering (Sep. 2000 – Jul. 2004) Department of Electronic Engineering, Tsinghua University Comprehensive rank: 1/30 Social media Mastodon X/Twitter Bluesky Share this: Click to share on X (Opens in new window) X Click to share on Facebook (Opens in new window) Facebook Yang Chen's Homepage Sign up Log in Copy shortlink Report this content Manage subscriptions Design a site like this with WordPress.comGet started",
  "content_length": 2804,
  "method": "requests",
  "crawl_time": "2025-12-01 14:50:05"
}