{
  "name": "Yang Hao 0001",
  "homepage": "http://www.eecs.qmul.ac.uk/~yang",
  "status": "success",
  "content": "Prof Yang Hao (FREng) - School of Electronic Engineering and Computer Science People menu School of Electronic Engineering and Computer Science    /    People    /    Profiles HAO Lab@QMUL Image Swap Static Interdisciplinary Research on Nano-Engineering and Electromagnetics Driven by Curiosity and ApplicabilityEmail: y.hao@qmul.ac.ukTelephone: +44 20 7882 5341Room Number: Engineering, Eng 261 Website: http://www.eecs.qmul.ac.uk/~yang Office Hours: Wednesday 13:30-17:00IntroductionResearchPublicationsStaffGrantsEsteemNewsCollaboratorsAwardsJobs/PhDsAlumniSpinout Biography Professor Yang Hao (FREng, FIEEE, FIET) received the Ph.D. degree from the Centre for Communications Research (CCR) at the University of Bristol, U.K. in 1998. From 1998 to 2000, he was a postdoc research fellow at the School of Electrical and Electronic Engineering, University of Birmingham, U.K. In May 2000, he joined the Antenna and Electromagnetics Group, Queen Mary, University of London, London, U.K. first as a lecturer and was promoted to Reader in 2005 and to Professor in 2007. Currently he is the holder of the QinetiQ/Royal Academy of Engineering (RAE) Research Chair. He also serves as the Deputy Vice Principal for Strategic Research, an elected University Council Member and Governance Committee Member, Queen Mary University of London. Professor Hao's early work in metamaterials and transformation optics has been instrumental in reshaping the possibilities of electromagnetic devices. his research laid the foundation for discovering unconventional properties in materials through AI/Machine Learning and robotic controlled research lab automation, which enable the design of novel devices capable of precise wave control. Beyond theoretical advancements, Prof. Hao has delved into wireless communication and wearable electronics, with a focus on in-body radio channels and wireless implants. This work demonstrated his dedication to advancing communication technologies for medical applications, showcasing the broader societal impact of his research. His work has been featured by Daily Mail, CNN, Telegraph, New Statesman, Financial Times and IEEE Spectrum . The breadth of Professor's expertise is reflected in his research interests, spanning wireless connectivity, metamaterials, antennas, terahertz technology, and intelligent systems. He has led research projects of approximate £60M from UKRI, the Royal Society, the Royal Academy of Engineering, ERC and EU. He currently leads several research programmes including an EPSRC prosperity partnership project of £2.6m . Professor Hao's research impact is not confined to the academic realm; he has been a driving force in fostering collaboration between academia and industry. His role as the QinetiQ/Royal Academy of Engineering Research Chair underscores his influence in shaping the future of wireless technologies through coommunication material innovation. He co-founded \"Isotropic Systems (All.Space)\", a successful satellite communication company creating more than 100 engineer jobs in Reading, exemplifies his commitment to bridging the gap between theoretical research and practical applications. Professor Hao was the PI and the director of a £4.6M EPSRC QUEST programme grant on transformation electromagnetics and microwave metamaterials. He is a management board member of Cambridge Graphene Center, which has attracted over £25M funding from UK EPSRC, and the ASG (AI for Science and Government) programme of Alan Turing Institute. Professor Hao was a strategic advisory board member for EPSRC, where he is committed to championing RF/microwave engineering for reshaping the future of UK manufacturing and electronics. Professor Hao has contributed extensively to patent applications and scientific journals including Physics Review Letters, Nature Communications, Advanced Science, Proceedings of IEEE, NPJ Computational Materials etc. He was a co-editor and co-author of the books Antennas and Radio Propagation for Body-Centric Wireless Communications (Boston, MA, USA: Artech House, 2006, 2012), and FDTD Modelling of Metamaterials: Theory and Applications (Boston, MA, USA: Artech House, 2008), respectively. From 2018, he serves as a publication committee chair for IEEE Antennas and Propagation Society. Prof. Hao was an Editor-in-Chief for the IEEE ANTENNAS AND WIRELESS PROPAGATION LETTERS during 2014 and 2017. He founded a new open access journal for metamaterial research and he is now an editor-in-chief for EPJ Applied Metamaterials. He was an Associate Editor for the IEEE ANTENNAS AND WIRELESS PROPAGATION LETTERS, IEEE TRANSACTIONS ON ANTENNAS AND PROPAGATION during 2008-2013, and also a Co-Guest Editor for the IEEE TRANSACTIONS ON ANTENNAS AND PROPAGATION in 2009. He was a Vice Chairman of the Executive Team of IET Antennas and Propagation Professional Network. He is currently a member of Board of the European School of Antenna Excellence, a member of EU VISTA Cost Action and the Virtual Institute for Artificial Electromagnetic Materials and Metamaterials, Metamorphose VI AISBL. He was a conference General Chair of Metamaterials’09, and EuCAP’18. Since 2000, Professor Hao has supervised more than 70 Postdocs and PhD students. They are now working in global industries and universities including Samsung Electronics, Airbus, Cobham, Cadence Design Systems, Isotropic Systems (All.Space), Heriot-Watt, Glasgow, QMUL, KTH, Dublin, and Penn State University. Three of them have set up spinout companies. Four of them winning Royal Society Research Fellowships. In addition to his prolific research career, Professor Hao has excelled in academic leadership roles. He went through the training via the Oxford Executive Leadership Programme, Saïd Business School at University of Oxford. As the Deputy Vice Principal for Strategic Research at Queen Mary, University of London, and the Dean for Research at the Faculty of Science and Engineering, he has played a pivotal role in REF 2021 submission (ranked joint 7th in the UK for the quality of its research), setting up university research institutes and steering institutional research agendas. Professor Hao was elected as a Fellow of the Royal Academy of Engineering in 2020, Fellow of the IEEE in 2013, Fellow of the IET in 2010 and Fellow of the ERA Foundation in 2007. He was a holder of the Royal Society Wolfson Research Merit Award between 2013 and 2018. He also won the 2024 European Antenna Award from EurAAP, IET AF Harvey Research Prize and BAE Chairman's Silver Award. Research We cover several research themes related to modern electromagnetics. We are keen to understand and discover fundamental limits of electromagnetic structures such as electrically small radiators, ultra thin absorbers, dynamic control of antenna beams and tunable/smart materials. New physical concepts such as transformation optics and metamaterials are playing an ever-growing part in future electrical and electronic engineering, they are enhanced by effective modelling tools, fast computer programs and optimisation techniques sprung from artificial intelligence and machine learning. Nanotechnology and nanomaterials are also key enablers for future technological development, where novel mechanisms of wave radiation, absorption and propagation will be developed. We are very excited to be a part of interdisciplinary research and development driven by curiosity and applicability. We foresee that our research will generate long-lasting impacts in the academia, industry and society, just like what we have done in \"body-centric wireless communications\", \"transformation optics and metamaterials\" and \"graphene and 2D materials\". Research Themes: antennas and radio propagation for body centric wireless communications Body-centric wireless communications refer to human-self and human-to-human networking with the use of wearable and implantable wireless sensors. It is a subject area combining wireless body-area networks (WBANs), Wireless Sensor Networks (WSNs) and Wireless Personal Area Networks (WPANs). Body-centric wireless communications has abundant applications in personal healthcare, smart home, entertainment and identification systems. Our work on \"body-centric wireless communications\" started in 2000 and it was inspired by the collaboration with Professor Peter Hall at the University of Birmingham. The research was funded by EPSRC and the industry through many research grants for more than 10 years. Example projects include: Characterisation of ON-BODY Communication Channels; Wearable Antennas for Body-Centric Wireless Networks; New Paradigms for Body Centric Wireless Communications at MM Wavelengths. While radio propagation mechanisms from RF to mm wave frequencies have been well understood, our research has now been focused on THz and nano-communications. One of the key components in our current research is to develop novel wearable and implantable sensors using nanomaterials. We are also interested in devloping radically new applications of wireless technologies for future healthcare applications including targeted drug delivery and precision medicine. The impact of this research include a few highly cited publications, industrial collaborations and technology transfer with Dstl, Philips and GE Healthcare, as well as keynote/invited talks including one at Google HQ. Reference: [1] Antennas and Propagation for Body-centric Wireless Communications, Artech House Publisher by Peter S. Hall, Yang Hao ; [2] Wireless body sensor networks for health-monitoring applications, IOP Physiological Measurement by Yang Hao and Robert Foster ; [3] Antennas and Propagation of Implanted RFIDs for Pervasive Healthcare Applications, Proceedings of IEEE, by Andrea Sani, Marie Rajab, Robert Foster, Yang Hao. active antennas for millimeter/sub-millimeter applications In this research theme, we explore novel technologies and new frequency spectrum for active integrated antennas, predominantly for applications in high data rate wi",
  "content_length": 54406,
  "method": "requests",
  "crawl_time": "2025-12-01 14:50:11"
}