{
  "name": "Yang Cai 0001",
  "homepage": "https://cpsc.yale.edu/people/yang-cai",
  "status": "success",
  "content": "Yang Cai | Professor | Yale Engineering Skip to Content Yang Cai Professor of Computer Science Additional Appointments Economics Email Room / Office:Room 338 Office Address:17 Hillhouse Avenue New Haven, CT 06511 Mailing Address:P.O. Box 208285 New Haven, CT 06520 Website: Research Website About Yang Cai Degrees Ph.D., Massachusetts Institute of Technology B.S., Peking University Perspectives Theory of Computation Economics & Computation Optimization Learning Selected Awards & Honors COLT Best Paper Award, 2025 FOCS Test of Time Award, 2022 NSF CAREER Award, 2020 Sloan Research Fellowship, 2019 William Dawson Scholar, 2015 Simons-Berkeley Research Fellowship, 2015 Selected Publications What Makes Treatment Effects Identifiable? Characterizations and Estimators Beyond Unconfoundedness The 38th Annual Conference on Learning Theory (COLT), 2025. With Alkis Kalavasis, Katerina Mamali, Anay Mehrotra, Manolis Zampetakis. On Tractable Φ-Equilibria in Non-Concave Games The 38th Conference on Neural Information Processing Systems (NeurIPS), 2024. With Constantinos Daskalakis, Haipeng Luo, Chen-Yu Wei, Weiqiang Zheng. Finite-Time Last-Iterate Convergence for Learning in Multi-Player Games The 36th Conference on Neural Information Processing Systems (NeurIPS Oral), 2022. With Argyris Oikonomou, Weiqiang Zheng. A Duality-Based Unified Approach to Bayesian Mechanism Design SIAM Journal on Computing, 2021. With Nikhil R. Devanur, S. Matthew Weinberg. Approximating Gains from Trade in Two-sided Markets via Simple Mechanisms Proceedings of the 18th ACM Conference on Economics and Computation (EC), 2017. With Johannes Brustle, Fa Wu, Mingfei Zhao. Simple Mechanisms for Subadditive Buyers via Duality Proceedings of the 49th Annual ACM SIGACT Symposium on Theory of Computing (STOC), 2017. With Mingfei Zhao. Optimum Statistical Estimation with Strategic Data Sources The 28th Annual Conference on Learning Theory (COLT), 2015. With Constantinos Daskalakis, Christos Papadimitriou. Optimal Multi-Dimensional Mechanism Design: Reducing Revenue to Welfare Maximization Proceedings of the 53rd IEEE Annual Symposium on Foundations of Computer Science (FOCS), 2012. With Constantinos Daskalakis, S. Matthew Weinberg. Related Content Computer Science team wins Best Paper Award at premier machine learning conference Cai wins Test of Time Award at FOCS 2022",
  "content_length": 2363,
  "method": "requests",
  "crawl_time": "2025-12-01 14:50:08"
}