{
  "name": "Yang Lu 0009",
  "homepage": "https://jasonyanglu.github.io",
  "status": "success",
  "content": "Yang Lu (卢杨) Yang Lu (卢杨)Assistant Professor Follow Xiamen University Email Github Google Scholar ORCID bilibili rednote I’m now an Assistant Professor and PhD supervisor in Department of Computer Science and Technology, School of Informatics, Xiamen University. I’m also the joint supervisor at the Institute of Artificial Intelligence, Xiamen University. I received my PhD degree in computer science from Hong Kong Baptist University in 2019, supervised by Prof. Yiu-ming Cheung, and received my bachelor and master degrees in software engineering from University of Macau in 2012 and 2014, supervised by Prof. Yuan Yan Tang. I was a research intern at Tencent in 2018. I have published over 50 top-tier papers, many of which have been featured in top-tier AI and computer vision conferences (CCF-A) like CVPR, NeurIPS, ICCV, AAAI, IJCAI, and MM. I have led several projects, including the Key Project, General Project and Youth Project of the National Natural Science Foundation of China, the Fujian Provincial Excellent Youth Project, the Major Project of the Fujian New Think Tank, the General Project of the Fujian Natural Science Foundation, and open projects at the Zhejiang Lab. I serve as a member of the Machine Vision Committee, the Secretary-General of the Xiamen Member Activity Center of the China Society of Image and Graphics, and IEEE senior member. I also serve as the Associate Editor of the international journal IEEE Transactions on Emerging Topics in Computational Intelligence. I was honored as the “Xiaomi Young Scholar” in 2023, and obtained the best paper award on DOCS 2024. My research interests include deep learning and computer vision. My research direction is trustworthy deep learning, including long-tail learning, federated learning, label-noise learning and continual learning.中文主页Prospective StudentsFor undergraduate students, please check here. For postgraduate students, please check here.26级硕士（面向考研生）、27级硕士（面向夏令营、预推免）仍有少量名额，请尽早与我联系（夏令营每年2-5月联系较为合适）。未在邮件中注明“已了解招生简章并愿意接受考核”的均不予回复。Recent NewsNov 8 2025: Three paper are accepted by AAAI. Congrats to Jiahao, Mingjie and Yukang!Sep 22 2025: Win the “Rising Star Award” of ACM China Xiamen Chapter!Sep 18 2025: Three paper are accepted by NeurIPS. Congrats to Shu, Zitao and Shriram!Aug 24 2025: One paper is accepted by SIGMOD. Congrats to Yiqun!July 5 2025: One paper is accepted by ACMMM . Congrats to Hezhao!June 26 2025: Two ICCV papers are accepted! Congrats to Shanshan and Chikai!May 20 2025: One paper is accepted by TNNLS. Congrats to Xiaolin!May 16 2025: One paper is accepted by ACL. Congrats to Wei!Feb 27 2025: One paper is accepted by CVPR . Congrats to Yijie!Feb 2 2025: Upgrade to IEEE Senior Member!Dec 10 2024: Two AAAI papers are accepted. Congrats to Yunfan and Jiahao!Oct 10 2024: Two IJCV papers are accepted. Congrats to Yukang and Qiang!Oct 10 2024: Win the second prize in the MICCAI long-tail chest x-ray challenge. Congrats to Ruichi!Sep 26 2024: Two NeurIPS papers are accepted. Congrats to Mengke and Jiahao!Sep 10 2024: One provincial excellent youth project is granted.Aug 17 2024: Our paper about federated clustering wins the best paper award on DOCS 2024!July 16 2024: Three ACMMM papers are accepted. Congrats to Xiying, Xiangbo and Wenyu!Apr 17 2024: One paper is accepted by IJCAI . Congrats to Chenxing!Dec 27 2023: Receive Xiaomi Youth Scholar Award.Dec 9 2023: Three AAAI papers are accepted. Congrats to Lin, Mengke and Jiangming!Aug 24 2023: One NSFC general project is granted.July 14 2023: One paper is accepted by ICCV . Congrats to Yiliang!Mar 28 2023: Congrats to postgraduate student Xinyi Shang for receiving the PhD offer from UCL supported by UCL-CSC scholarship!Feb 28 2023: One paper is accepted by CVPR. Congrats to Yan!…Research InterestsDeep Learning with Incomplete Labels Machine learning with incomplete labels addresses effective model training in the presence of significant label deficiencies, such as imbalanced label distribution or noisy labels. The goal is to achieve accurate predictions despite low data quality. We enhance model performance on incomplete labeled data by introducing more effective label processing and integration strategies.Long-tailed Visual Recognition (CVPR’23, CVPR’22, IJCAI’22, AAAI’24, AAAI’24, NeurIPS’24)Imbalance Learning (IJCAI’24, IJCAI’17, TNNLS’20, TNNLS’20, TCYB’21, TNNLS’25)Label-Noise Learning (ICCV’23, AAAI’24, TCYB’23, ECML-PKDD’21)Trustworthy Federated Learning Trustworthy federated learning aims to perform model training in a distributed data environment, ensuring data privacy and security while maintaining high model performance. It also explores personalization and fairness within the federated learning framework. Our work focuses on data heterogeneity, long-tailed distribution, missing labels, and noise issues, improving the robustness and performance of models in heterogeneous data and noisy environments.Long-tailed Federated Learning (IJCAI’22, AAAI’24, ICCV’25, ICME’22, ICASSP’23)Extreme Label-Noise in Federated Learning (AAAI’24)Semi-supervised Federated Learning (CVPR’25, Arxiv’23)Continual Learning and Prompt Learning In real-world applications, the data environment is dynamically changing, and models need to continuously learn new knowledge while retaining existing knowledge without forgetting. Our research involves task-imbalanced continual learning, concept drift handling in incremental learning, and domain generalization, aiming to enhance model stability and adaptability in dynamic and imbalanced data environments.Task-Imbalanced Continual Learning (IJCAI’24)Incremental Learning with Concept Drift (IJCAI’17, TNNLS’20)Vision-Language Prompt Learning (ICCV’25, MM’25, Arxiv’24)Supervised StudentsPhDJiacheng Yang (2025-): Long-tail learningMasterPinxin Qian (2020-2023, Employed in Alibaba): Federated learningXinyi Shang (2020-2023, Pursuing PhD at UCL): Federated learningYiliang Zhang (2021-2024, Employed in Alibaba): Label-noise learningYan Jin (2021-2024, Pursuing PhD at BUAA): Long-tail learningXiaolin Huang (2021-2024, Employed in JD): Semi-supervised learningFengling Lv (2021-2024, Employed in Xiaomi): Federated learningChengbin Zheng (2021-2024, Employed in CATL): Graph neural networksChenxing Hong (2022-2025, Employed in Tencent): Continual learningLin Chen (2022-2025, Employed in Baidu): Federated learningLiyuan Wang (2022-2025, Employed in Industrial Bank): Long-tail learningYijie Liu (2023-): Federated learningShanshan Yan (2023-): Federated learningYizhou Chen (2023-): Anomaly detectionHezhao Liu (2023-): Semi-supervised learningShu Chen (2023-): Label-noise learningZenghui Huang (2024-): Long-tail learningRuichi Zhang (2024-): Long-tail learningJunpeng Chen (2024-): Anomaly detectionShihao Hou (2024-): Federated learningChikai Shang (2025-): Long-tail learningWenxin Nian (2025-): Anomaly detectionZijian Kang (2025-): Continual learningZhiheng Yang (2025-): Federated learning",
  "content_length": 6944,
  "method": "requests",
  "crawl_time": "2025-12-01 14:50:09"
}