{
  "name": "Yang Xiang 0004",
  "homepage": "https://www.uoguelph.ca/computing/people/yang-xiang",
  "status": "success",
  "content": "Yang Xiang | School of Computer Science Yang Xiang Professor EmeritusEmail: yxiang@uoguelph.caWebsite links: WebsiteGoogle Scholar Research StatementResearch KeywordsSelected Publications My research focuses on representation and inference formalism based on probabilistic and decision theoretical graphical models, such as Bayesian networks, decomposable Markov networks, influence diagrams, Markov decision processes, causal independence models, and multiply sectioned Bayesian networks.  I study issues on representation, on acquisition by machine learning or elicitation, on effective inference mechanisms, and on multiagent systems. I develop prototype decision support systems for various applications. Knowledge representation in multiagent graphical models Uncertain knowledge representation Probabilistic inference in multiagent graphical models Probabilistic inference in Bayesian networks Multiagent constraint satisfaction Multiagent collaborative decision making Causal modeling in uncertain knowledge acquisition Privacy in multiagent systems Causal independent models Bayesian networks Y. Xiang and K. Srinivasan, Privacy Preserving Existence Recognition and Construction of Hypertree Agent Organization. Journal of Autonomous Agents and Multi-Agent Systems, 2015, (DOI) 10.1007/s10458-015-9285-5. Y. Xiang and F. Hanshar, Multiagent Decision Making in Collaborative Decision Networks by Utility Cluster Based Partial Evaluation. International Journal of Uncertainty, Fuzziness and Knowledge-Based Systems, Vol. 23, No. 2, 149-191, 2015. Y. Xiang, Y. Mohamed, and W. Zhang, Distributed Constraint Satisfaction with Multiply Sectioned Constraint Networks. International Journal of Information and Decision Sciences, Vol.6, No.2, 127-152, 2014. Y. Xiang and M. Truong, Acquisition of Causal Models for Local Distributions in Bayesian Networks. IEEE Transactions on Cybernetics, Vol.44, No.9, 1591-1604, 2014. Y. Xiang, Non-impeding Noisy-AND Tree Causal Models Over Multi-valued Variables. International Journal of Approximate Reasoning, Vol.53, No. 7, 988-1002, 2012. Share this page Share on Facebook Share on Twitter Share on LinkedIn Print this page",
  "content_length": 2166,
  "method": "requests",
  "crawl_time": "2025-12-01 14:50:14"
}