{
  "name": "Yangqiu Song",
  "homepage": "https://www.cse.ust.hk/~yqsong",
  "status": "success",
  "content": "Yangqiu Song I am now an associate professor at Department of CSE at HKUST and the associate director of HKUST-WeBank Joint Lab. I was an assistant professor at Lane Department of CSEE at WVU (2015-2016); a post-doc researcher at UIUC (2013-2015), a post-doc researcher at HKUST and visiting researcher at Huawei Noah's Ark Lab, Hong Kong (2012-2013); an associate researcher at Microsoft Research Asia (2010-2012); a staff researcher at IBM Research-China (2009-2010). I received my B.E. and PhD degree from Tsinghua University, China, in July 2003 and January 2009. I also worked as interns at Google in 2007-2008 and at IBM Research-China in 2006-2007. I am currently the PG coordinator of CSE and associate director of BSc in Data Science and Technology (DSCT) I am now also a visiting academic scholar at Amazon Rufus Team (Jan. 2022 - present). Office: Room 3518 HKUST, Clearwater Bay, Kowloon, Hong Kong Email: yqsong # cse dot ust dot hk Research Interests: Machine Learning, Data Mining, Natural Language Processing, Knowledge Graph and Information Networks. Google scholar DBLP LinkedIn Recent Research Topics (Full Publications (DBLP) and KnowComp Group Code): My research goal is to use machines to understand human languages and eventually facilitate natural human language interaction and communication. Our current approach is to extract useful knowledge from existing resources to construct knowledge graphs and use knowledge graphs to do reasoning and inference for understanding. When meeting downstream applications, we also need to care about privacy, security, and fairness issues to build trustworthy real-world systems. Knowledge graph/base construction (New Trends) ProBase: A concept knowledge graph extracted from billions of Web pages (latest version) ASER: An eventuality knowledge graph of activities, states, events, and their relations TransOMCS: Population of a commonsense knowledge base in the format of OMCS transferred from linguistic patterns in ASER DISCOS: Population of ATOMIC if-then inferential commonsense knowledge base with the discourse relations in ASER (Extension: CSKB Population Benchmark) AbstractATOMIC: A conceptualization framework of commonsense knowledge aquisition and its resulting abstract knowledge in the form of ATOMIC AbsPyramid: An implementation driven by Marvin Minsky's K-Line theory; a unification of entity typing, event typing, conceptualization, and entailment graphs AutoSchemaKG: A framework to automatically extract entity, event, and perform conceptualization at Web scale, with three large examples: ATLAS-Wiki (from Wikipedia), ATLAS-Pes2o (from academic papers), and ATLAS-CC (from Common Crawl) MARS: A metaphysical reasoning knowledge base FolkScope: Eventuality-based intention knowledge graph for e-commerce commonsense understanding Natural language understanding and grounding to knowledge graphs Conceptualization of the world knowledge Entity and event linking, semantic parsing, and discourse analysis Machine learning, inference, and reasoning with world knowledge (A survey about text categorization) World knowledge representation and learning Learning with world knowledge Logical inference and reasoning Leveraging (commonsense) knowledge and social norms to improve privacy, security, explainability, and fairness issues in machine learning models for NLP Talks: 2025 Summer: Huawei. Towards Compliant LLM Agents: From Contextual Integrity (CI) to Model Contextual Integrity Protocol (MCIP). [pdf], [ppt] 2024 December: WeBank. AI Privacy & Safety Compliance: From Checklist to Reasoning. [pdf], [ppt] 2024 July: Federated Learning Summer School, Qingdao. Privacy-Preserved Neural Graph Databases. [pdf], [ppt] 2024 May: WWW 2024 Tutorial. New Frontiers of Knowledge Graph Reasoning: Recent Advances and Future Trends. [Link] 2024 April: HKUST. E-Commerce Commonsense Knowledge Graphs for Intention-based Recommendation. [pdf], [ppt] 2023 November: Amazon/NVIDIA/Huawei/WeBank. Complex Query Answering on Neural Knowledge Graphs with Rich Semantics. [pdf], [ppt] 2023 October: COMP5222 Lectures on Complex Query Answering on Neural Knowledge Graphs. [Part 1], [Part 2] (Most contents are developed by Zihao Wang (orginal slides). 2023 Summer: IJCAI-FL. Privacy Attacks on Large Language Models. [pdf], [ppt] 2023 Summer: KDD-China. Activity (or Process), State, and Event-based Knowledge Graphs . [pdf], [ppt] 2022 July: Amazon Search Science Team. Acquiring and Modeling Abstract Commonsense Knowledge via Conceptualization. [pdf], [ppt] 2021 Novermber: CCKS Tutorial. Commonsense Knowledge Acquisition and Reasoning. [pdf], [ppt] 2021 September: Huawei Workshop on Commonsense. Commonsense Knowledge Base Population. [pdf], [ppt] 2021 Summer: WeBank, BUPT, and 4Paradigm. Differentially Private Federated Knowledge Graphs Embedding. [pdf], [ppt] 2021 Summer: Renmin University and THU. An Overview of Commonsense Knowledge Graph Construction and Reasoning at HKUST. [pdf], [ppt] 2020 KDD Tutorial. Recent Advances on Graph Analytics and Its Applications in Healthcare. [Tutorial Page] [Part 3 ppt] 2020 July: Knowledge Works at Fudan and THU. ASER: Building a Commonsense Knowledge Graph by Higher-order Selectional Preference. [pdf], [ppt] 2019 July: HIT Event Reasoning Workhop, BUPT, PKU, Beihang. ASER: A Large scale Eventuality Knowledge Graph. [pdf], [ppt], [WWW20 Version] 2018 November: ICDM Workshop on Large Scale Graph Representation Learning and Applications (GRLA). Automatic Information Fusion with Heterogeneous Information Networks. [ppt] [pdf] 2017 Summer: SCUT, PKU. Recent Development of Heterogeneous Information Networks: From Meta-paths to Meta-graphs. [ppt] [pdf] 2016 IJCAI Workshop on Heterogeneous Information Network Analysis (HINA). Incorporating Structured World Knowledge into Unstructured Text via Heterogeneous Information Networks. [ppt] [pdf] (extended abstract [pdf]) 2015 ICDM Workshop on Practical Transfer Learning. Text Classification without Supervision: Incorporating World Knowledge and Domain Adaptation. [ppt] [pdf] Group: Postdocs: Haoran Li (Since Spring 2025) Jiaxin Bai (Since Spring 2025) Xi Yang (Since Spring 2025) PhDs: Haoyu Huang (Since Fall 2025) Yufei Li (Since Fall 2025) Xiyu Ren (Since Fall 2025) Yuxuan Liu (Since Fall 2025) Andy Yau Wai YIM (Since Fall 2025) Tsz Ho CHAN (Part-time, Since Fall 2025) Huihao Jing (Since Spring 2025) Wenbin Hu (Since Spring 2025) Tianshi Zheng (Since Fall 2024) Baixuan Xu (Since Fall 2024) Qing Zong (Since Fall 2024) Haochen Shi (Since Fall 2024) Wei Fan (Since Fall 2023) Zhaowei Wang (Since Fall 2023) Jiayang Cheng (Since Fall 2023) Jacky Chun Kit Chan (Since Fall 2023) Weiqi Wang (Since Fall 2022) Zheye Deng (Since Fall 2022) Zizheng Lin (Since Fall 2019) MPhils: Changxuan Fan (Since Fall 2025) Jerry, Ki Sen HUNG(Since Fall 2025) Anson, Tsun On KWOK(Since Fall 2025) Ka Wai CHUNG(Since Fall 2025) Yisen Gao (Since Fall 2025) Zhongwei Xie (Since Fall 2025) Bowen Liu (Since Fall 2025, Co-supervised with Xiaomeng Li) Shurui Zhang (Since Fall 2025, Co-supervised with Kani Chen) Xingyan Chen (Since Fall 2024, Co-supervised with Kani Chen) Chunyang Li (Since Fall 2024) Lucas Wun Yu CHAN (Since Fall 2024) Jason Tsz Ho LI (Since Fall 2024) Dennis Hong Ting TSANG (Since Fall 2024) Asif KHAN (Since Fall 2024) Peng Xie (Since Fall 2024, Co-supervised with Kani Chen) Hongyu Luo (Since Fall 2024) Zirui Wang (Since Fall 2022, Co-supervised with Qian Xu) Past students, interns, visitors, collaborators with first employment: HKUST PhD: Qi Hu (Since Fall 2020-Spring 2025, First Employment: Byte Dance in Shanghai). Thesis: Privacy-Preserved Learning on Graph-Structured Data Jiaxin Bai (Fall 2020-Spring 2025, First Employment: Postdoc@HKUST). Thesis: Advancements in Knowledge Graph Reasoning: Innovative Approaches to Complex Query Answering and Logical Hypothesis Generation Zihao Wang (Fall 2020-Spring 2025, First Employment: Financial Industry in Hong Kong). Thesis: Querying Neural Graph Databases Ying Su (Fall 2020-Fall 2024, First Employment: Postdoc@HKU). Thesis: Commonsense Knowledge Representation, Reasoning and Application Haoran Li (Fall 2020-Fall 2024, First Employment: Postdoc@HKUST). Thesis: Enhancing Trustworthiness in Large Language Models: Perspectives on Privacy and Safety Tianqing Fang (Fall 2019-Summer 2024, First Employment: Tencent AI Lab in Shenzhen). Thesis: Commonsense Knowledge Base Population and Reasoning for Inferential Knowledge Xin Liu (Fall 2018-Summer 2023, First Employment: Scientist@Amazon A9 in Palo Alto). Thesis: Theory and Practice: Graph Representation Learning For Subgraph Isomorphisms and Substructure-Augmented Applications Huiru Xiao (Fall 2016-Summer 2022, First Employment: Lecturer@HKUST). Thesis: Learning with Hierarchical Data Wenyi Xiao (Fall 2016-Fall 2021, First Employment: Scientist@Huawei in Hong Kong). Thesis: Path Learning in Complex Networks Hongming Zhang (Fall 2018-Summer 2021, First Employment: Scientist@Tencent AI Lab in Seattle). Thesis: Towards Commonsense Reasoning with Higher-order Selectional Preference over Eventualities Hongliang Dai (Fall 2017-Summer 2021, First Employment: Scientist@Tencent Jarvislab in Shenzhen). Thesis: Weak Supervision for Information Extraction Ziqian Zeng (Fall 2016-Summer 2021, First Employment: Assistant Professor@SCUT in Guangzhou). Thesis: On the Use of Auxiliary Information for Label-less Text Mining Tasks Yinghua Zhang (Fall 2015-Spring 2021, Co-supervised with Prof. Qiang Yang, First Employment: Research Engineer@Meituan in Shanghai). Thesis: Deep Transfer Learning: Generalization on Clean and Adversarial Data Nedjma Ousidhoum (Fall 2014-Summer 2021, Co-supervised with Prof. DY Yeung, First Employment: Postdoc@Cambridge). Thesis: On the Importance of Normalization of the Experimental Design of Multilingual Toxic Content Detection HKUST MPhil: Louis Chun Yi Bo (Since Fall 2022, First Employment: Gap Year). Thesis: Educational Question Generation and Evaluation with Large",
  "content_length": 17724,
  "method": "requests",
  "crawl_time": "2025-12-01 14:50:14"
}