{
  "name": "Yaniv Romano",
  "homepage": "https://sites.google.com/view/yaniv-romano",
  "status": "success",
  "content": "Personal PageSearch this siteEmbedded FilesSkip to main contentSkip to navigationYaniv RomanoResearch interestsModern machine learning (ML) models produce valuable predictions across various applications, influencing people’s lives, opportunities, and scientific advancements. However, these systems can fail in unexpected ways, generating unreliable inferences and perpetuating biases present in the data. These issues are particularly troubling in high-stakes applications, where models are trained on increasingly diverse, incomplete, and noisy data, and then deployed in dynamic environments—conditions that often exacerbate test-time failures.My team and I work on enabling the reliable deployment of ML systems in real-world settings.Our approach is built on two key pillars. The first is the development of protective ecosystems that can be integrated with any ML model, providing formal statistical guarantees on the reliability of “black-box” data-driven inference. The second is the design of new learning paradigms grounded in fundamental statistical principles. What makes this approach to safe and powerful ML particularly appealing is that it is both highly applicable and grounded in solid theoretical foundations.Predictive inference: developing methodologies for distribution-free uncertainty estimation that work with any complex predictive algorithm, such as neural nets and LLMs. The uncertainty estimation methodology I co-invented with Emmanuel Candès and Evan Patterson at Stanford, called CQR, was used by The Washington Post to estimate outstanding votes for the 2020 U.S. presidential election.Statistical inference: advancing techniques in machine learning and statistical inference to make new, replicable data-driven discoveries.Robustness: developing principled strategies to measure, monitor, and adapt to train–test mismatch, aiming to maintain reliability when deployment conditions differ from training.Other topics I've worked on include:Theory and practice of deep learning: proposing and analyzing multi-layer convolutional sparse coding techniques and studying the stability of convolutional neural nets.Inverse problems: developing highly effective priors and algorithms for solving general image reconstruction problems. The super-resolution technology I co-invented with Peyman Milanfar, called RAISR, is being used in Google's flagship products (Pixel 2/XL Phones, Google Clips, Google+, and Motion Stills), increasing the quality of billions of images and bringing significant bandwidth savings.FundingERC (SafetyBounds Project, 2024-2029) Israel Science Foundation (2021-2025)Verily Life Sciences (2022-2024)Citi Bank (2021-2023)The Technion Center for ML and Intelligent Systems (2022-2025)About meI am an associate professor in the Departments of Electrical Engineering and of Computer Science at the Technion—Israel Institute of Technology. Before that, I was a postdoctoral scholar in the Department of Statistics at Stanford University, advised by Prof. Emmanuel Candès. I earned my Ph.D. and M.Sc. degrees in 2017 from the Department of Electrical Engineering at the Technion—Israel Institute of Technology, under the supervision of Prof. Michael Elad. Prior to that, in 2012, I received my B.Sc. from the same department. In 2017, I constructed with Prof. Elad a Massive Open Online Course (MOOC) on the theory and practice of sparse representations, under the edX platform.I am a recipient of the 2015 Zeff Fellowship, the 2017 Andrew and Erna Finci Viterbi Fellowship, the 2017 Irwin and Joan Jacobs Fellowship, the 2018–2020 Zuckerman Postdoctoral Fellowship, the 2018–2020 ISEF Postdoctoral Fellowship, the 2018–2020 Viterbi Fellowship for nurturing future faculty members, Technion, the 2019–2020 Koret Postdoctoral Scholarship, Stanford University, and the 2021-2022 Leaders in Science and Technology Career Advancement Chair (CAC), Technion. I was awarded the 2020 SIAG/IS Early Career Prize, the 2020 Sheila Samson Prime Minister’s Prize for Global Innovation in Smart Mobility and Alternative Fuels for Transportation, the 2021 IEEE Signal Processing Society Best Paper Award, and the prestigious 2021-2022 Alon scholarship. In 2023, I received two Technion's Excellence in Teaching Awards for the courses Machine Learning (ECE) and Numerical Algorithms (CS); I also received the Technion's Excellence in Teaching Award in 2024. I won the prestigious 2024 Krill Prize for Excellence in Scientific Research, and the 2024 Henry Taub Prize for Academic Excellence. In 2025, I was elected as a member of the Israel Statistical Association. I was also elected as a member of the Israel Young Academy.Selected recent publications (full list is on the publications page or visit Google Scholar)Click here to view my Google Scholar profile M. Bashari*, Y. Lee*, R. Maor Lotan, E. Dobriban, and Y. Romano, Statistical Inference Leveraging Synthetic Data with Distribution-Free Guarantees. *Equal Contribution. Code.M. Bashari*, R. Maor Lotan*, Y. Lee*, E. Dobriban, and Y. Romano, Synthetic-Powered Predictive Inference. Advances in Neural Information Processing Systems (NeurIPS), 2025. *Equal Contribution. Code.Y. Bar*, S. Shaer*, and Y. Romano, Protected Test-Time Adaptation via Online Entropy Matching: A Betting Approach, Advances in Neural Information Processing Systems (NeurIPS), 2024. *Equal Contribution. Code.B. Einbinder*, S. Feldman*, S. Bates, A. N. Angelopoulos, A. Gendler, Y. Romano, Label Noise Robustness of Conformal Prediction, Journal of Machine Learning Research (JMLR), 2024. *Equal Contribution.S. Bates*, E. J. Candès*, L. Lei*, Y. Romano*, and M. Sesia*, Testing for Outliers with Conformal p-values, Annals of Statistics, 2023. *Alphabetical Order. Code.B. Einbinder*, Y. Romano*, M. Sesia*, and Y. Zhou*, Training Uncertainty-Aware Classifiers with Conformalized Deep Learning, Advances in Neural Information Processing Systems (NeurIPS), 2022. *Equal Contribution. Code.A. N. Angelopoulos*, A. P. Kohli*, S. Bates, M. I. Jordan, J. Malik, T. Alshaabi, S. Upadhyayula, and Y. Romano, Image-to-Image Regression with Distribution-Free Uncertainty Quantification and Applications in Imaging, International Conference on Machine Learning (ICML), 2022. (Spotlight.) *Equal Contribution. Code.Y. Romano*, M. Sesia*, and E. J. Candès, Classification with Valid and Adaptive Coverage, Advances in Neural Information Processing Systems (NeurIPS), 2020. (Spotlight.) *Equal Contribution. Project website. Code.Y. Romano, R. F. Barber, C. Sabatti, and E. J. Candès, With Malice Toward None: Assessing Uncertainty via Equalized Coverage, Harvard Data Science Review, 2020. Project website. Code.Y. Romano, E. Patterson, and E. J. Candès, Conformalized Quantile Regression, in Advances in Neural Information Processing Systems (NeurIPS), Vancouver, Canada, December 8-14, 2019. Project website. Code.Google SitesReport abusePage detailsPage updated Google SitesReport abuse",
  "content_length": 6942,
  "method": "requests",
  "crawl_time": "2025-12-01 14:50:17"
}