{
  "name": "Yanina Shkel",
  "homepage": "https://theory.epfl.ch/yanina",
  "status": "success",
  "content": "Yanina Shkel Yanina Shkel Assistant Professor Information Processing Group School of Computer and Communication Sciences EPFL EPFL IC INR 131 Station 14 CH-1015 Lausanne E-mail: yanina [dot] shkel [at] epfl [dot] ch ABOUT I am an Assistant Professor at École Polytechnique Féraletedérale de Lausanne. I have been teaching and conducting research as a Scientist at EPFL between December 2019 and June 2023. Before this I was a research scholar at Princeton University and a postdoctoral fellow at University of Illinois at Urbana-Champaign. I completed my PhD at the University of Wisconsin-Madison in August 2014. Before graduate school I worked as a developer for Morningstar Inc. where I administered databases containing and processing large amounts of financial data. During graduate school, I also spent time as an intern at 3M Corporate Research Labs where I applied my background in computation and information sciences for materials and product driven needs of 3M. My lab at EPFL is supported by the Swiss NSF Starting Grant. My postdoctoral research was supported in part by the NSF Center for Science of Information Postdoctoral Fellowship. RESEARCH I am broadly interested in all theoretical aspects of data science; in my work I use tools from {information, learning, coding}-theories, statistics, cryptography, and other areas of applied mathematics. My current research interestes are particularly focused on the followoing topics: mathematical models for privacy and secrecy, fundamental limits of privacy-aware information processing systems; theory of data compression, finite blocklength data compression, universal data compression, private data compression; secret key generation from common sources of randomness, information-theoretic methods in cryptography; As I recieve a lot inqueries about PhD positions and internships, I am unable to answer many of them. If you are perspective PhD student interested in coming to EPFL and working with me, please do apply through EDIC and mention my name in your application. PUBLICATIONS Recent publications and preprtints: Robsinson DH Cung, Yanina Y. Shkel and Ibrahim Issa Binary Maximal Leakage 2024 IEEE International Symposium on Information Theory [LINK] Hatef Otroshi Shahreza, Yanina Y. Shkel, and Sebastien Marcel On Measuring Linkability of Multiple Protected Biometric Templates using Maximal Leakage IEEE Access, vol. 12, pp. 106618-106630, 2024 [LINK] Yanina Y. Shkel and Anuj Kumar Yadav Information Spectrum Converse for Minimum Entropy Couplings and Functional Representations 2023 IEEE International Symposium on Information Theory [LINK] [ARXIV] Photios A Stavrou, Yanina Shkel, and Marios Kountouris Indirect Rate Distortion Functions with f-Separable Distortion Criterion 2023 IEEE International Symposium on Information Theory [LINK] [ARXIV] Hatef Otroshi Shahreza, Yanina Y. Shkel, and Sebastien Marcel Measuring Linkability of Protected Biometric Templates Using Maximal Leakage IEEE Transactions on Information Forensics and Security, vol. 18, pp. 2262-2275, 2023 [LINK] Yanina Y. Shkel, Rick S. Blum, and H. Vincent Poor Secrecy by Design With Applications to Privacy and Compression IEEE Transactions on Information Theory, vol. 67, no. 2, pp. 824-843, Feb. 2021 [LINK] TEACHING COM-417: Advanced Probability and Applications Spring 2024, Fall 2024 (EPFL) In this masters-level course, various aspects of probability theory are considered. The first part is devoted to the main theorems in the field (law of large numbers, central limit theorem, concentration inequalities), while the second part focuses on the theory of martingales in discrete time. COM-202: Signal Processing (with Paolo Prandoni) Fall 2023, Spring 2025 (EPFL) This is a second year course that provides an intoduction to Signal Processing to students in IC. Topics include Signal processing theory and applications: discrete and continuous time signals; Fourier analysis, DFT, DTFT, CTFT, FFT, STFT; linear time invariant systems; filter design and adaptive filtering; sampling; interpolation and quantization; image processing, data communication and control systems. EE-205: Signals and Systems Spring 2020, 2021, 2022, 2023 (EPFL) The design of advanced systems (such as WiFi, cell phones, drones, airplanes) requires a thorough theoretical underpinning. This is a second year class that teaches one of the most powerful and important pillars: The theory of linear time-invariant (LTI) systems. These systems serve both as models of physical reality (such as the wireless channel) and as engineered systems (such as filters and control strategies). The class covers the following topics: LTI Systems; The Frequency Response of stable LTI Systems; Fourier Techniques for stable LTI Systems (with applications to Communication Systems and Signal Processing); Laplace and Z-Transform Techniques for LTI Systems (with applications to Control Systems). COM-622: Topics in Information-Theoretic Cryptography Fall 2020, 2021 (EPFL) This is a theoretical graduate course that will survey the interaction between information theory, cryptography, security, and privacy. This course will mainly focus on questions related to secrecy and information. We will ask very basic theoretical questions like: What is information? What does it mean to keep information secret? How do we model informatoin secrecy mathematically? What kinds of resources (randomness, computation, communication, etc.) are needed to achieve this? Topics covered in the course include perfect secrecy, information-theoretic secret key generation, randomness extraction, information leakage measures like differential privacy, mutual information, as well as some emerging approaches like maximal leakage and perfect privacy. ELE-205: Information Signals (with Vince Poor) Spring 2019 (Princeton Universty) Signals that carry information play a central role in technology and engineering, ranging from sound and images to MRI, communication, radar, multimedia interaction, and robotic control. This course teaches mathematical tools to analyze, manipulate, dissect, and preserve information signals. A major focus of the course is transforms - in particular, the Fourier, Laplace, and z- transforms - which reveal the frequency spectrum of signals and can make them easier to manipulate. We also study sampling, the process of converting a signal from continuous to digital, and which transforms to use depending on the waveform. Additional topics covered include linear time-invariant systems, modulation, quantization, and stability. ELE-530: Theory of Detection and Estimation (with Vince Poor) Fall 2018 (Princeton University) An introduction to the fundamental theoretical principles of signal processing related to detection and estimation. The level of this course is suitable for research students in communications, control, signal processing, and related areas.",
  "content_length": 6895,
  "method": "requests",
  "crawl_time": "2025-12-01 14:50:19"
}