{
  "name": "Yani Xue",
  "homepage": "https://www.brunel.ac.uk/people/yani-xue1",
  "status": "success",
  "content": "Dr Yani Xue | Introduction | Brunel University London Skip to Content Home People Dr Yani Xue Dr Yani XueLecturer in Computer Science Email: yani.xue3@brunel.ac.uk Computer Science College of Engineering, Design and Physical Sciences Summary Dr Yani Xue is a Lecturer in the Department of Computer Science, Brunel University London, UK. She is a member of the Intelligent Data Analysis (IDA) Group and  the Modelling and Simulation Group (MSG). Her research focuses on multi/many-objective optimization, computational intelligence (such as evolutionary algorithms), simulation, search-based software engineering, engineering applications, and high performance data analytics. Dr Xue received a Ph.D. degree in Computer Science from Brunel University London in 2021. She worked as a Research Fellow on the EU-funded projects - HPC and Big Data Technologies for Global Systems (HiDALGO), Demonstration of intelligent decision support for pandemic crisis prediction and management within and across European borders (STAMINA) and IT tools and methods for managing migration FLOWS (ITFLOWS). Newest selected publications Xue, Y., Schincariol, T., Chadefaux, T. and Groen, D. (2025) 'Using machine learning to forecast conflict events for use in forced migration models'. Scientific Reports, 15 (1). pp. 1 - 14. ISSN: 2045-2322 Open Access Link Journal article Xue, Y., Li, M., Arabnejad, H., Suleimenova, D., Jahani, A., Geiger, BC., Boesjes, F., Anagnostou, A., Taylor, SJE., Liu, X. and Groen, D. et al. (2024) 'Many-Objective Simulation Optimization for Camp Location Problems in Humanitarian Logistics'. International Journal of Network Dynamics and Intelligence, 13 (3). pp. 1 - 14.Open Access Link Journal article Ghorbani, M., Suleimenova, D., Jahani, A., Saha, A., Xue, Y., Mintram, K., Anagnostou, A., Tas, A., Low, W., Taylor, SJE. and Groen, D. et al. (2024) 'Flee 3: Flexible agent-based simulation for forced migration'. Journal of Computational Science, 81. pp. 1 - 14. ISSN: 1877-7503 Open Access Link Journal article Groen, D., Suleimenova, D., Jahani, A. and Xue, Y. (2023) 'Facilitating simulation development for global challenge response and anticipation in a timely way'. Journal of Computational Science, 72. pp. 1 - 11. ISSN: 1877-7503 Open Access Link Journal article Groen, D., Arabnejad, H., Suleimenova, D., Edeling, W., Raffin, E., Xue, Y., Bronik, K., Monnier, N. and Coveney, P. et al. (2022) 'FabSim3: An automation toolkit for verified simulations using high performance computing'. Computer Physics Communications, 283. pp. 1 - 18. ISSN: 0010-4655 Open Access Link Journal article More publications(9)",
  "content_length": 2630,
  "method": "requests",
  "crawl_time": "2025-12-01 14:50:18"
}