{
  "name": "Yanjie Dong",
  "homepage": "http://www.ece.ubc.ca/~ydong16",
  "status": "success",
  "content": "Yanjie Dong ¶­ÑÓ½Ü Home Research Biography Publications Gallary Yanjie Dong, PhD, Member, IEEE The Department of Electrical and Computer Engineering The University of British Columbia (UBC) Contact: ydong16 at ece dot ubc dot ca Here is a short interview of me Research Interests Machine Learning and Large-Scale Optimization Energy-Efficient Resource Management in Wireless Communications Design of Energy-Harvesting Protocols News I successfully passed my PhD thesis defence on August 5, 2020 I was awarded a President's Academic Excellence Initiative PhD Award, May 2020 I was awarded a British Columbia Graduate Scholarship, October 2019 I was awarded a MITACS Globalink Research Award to support my visit to University of Minnesota, Twin Cities (Host: Prof. Georgios B. Giannakis) I served as a session chair of IEEE ICC on May 22, 2019 I was awarded the exemplary reviewer of IEEE Transactions on Communications of 2018 and 2019 (less than 2%) I was awarded the exemplary reviewer of IEEE Communications Letters of 2018 (approximately 10%) I successfully passed my PhD qualifying exam on August 14, 2018 I was appointed as the teaching assistant of ENGR 598F, August 20--30, 2018 (Lectuer: Prof. Wei Yu, University of Toronto) I was a recipient of IEEE Student Travel Grant for ICC 2018 I was appointed as a volunteer of IEEE ICC 2018 I was a visiting researcher of Broadband Information Transmission and Signaling (BITS) lab at The University of Texas at Dallas, July--August 2017 (Host: Prof. Naofal Al-Dhahir) I was a recipient of Graduate Support Initiative (GSI) award, 2016--2017, 2017--2018 and 2018--2019 I successfully passed my master thesis defence on June 17, 2016 I was a recipient of Four Year Doctoral Fellowship (FYF) of UBC Vancouver campus, 2016 © Copyright 2020 Yanjie Dong. All rights reserved.",
  "content_length": 1820,
  "method": "requests",
  "crawl_time": "2025-12-01 14:50:21"
}