{
  "name": "Yanjun Han",
  "homepage": "https://yanjunhan2021.github.io/index.html",
  "status": "success",
  "content": "Yanjun Han Home Publications Reports Teaching Yanjun Han Assistant Professor of Mathematics and Data Science, Courant Institute of Mathematical Sciences, Center for Data Science, and Computer Science Department (affiliated), New York University I received my B.E. in Electronic Engineering from Tsinghua University in Jul 2015, and my M.S. and Ph.D. in Electrical Engineering from Stanford University in Aug 2021, under the supervision of Tsachy Weissman. I was a postdoctoral scholar at the Simons Institute for the Theory of Computing, University of California, Berkeley in 2021-22, and a Norbert Wiener postdoctoral associate at the Statistics and Data Science Center (SDSC) in MIT IDSS in 2022-23. I am broadly interested in the mathematics of data science, including statistics, learning theory, bandits, and information theory. Recent papers Sharp mean-field analysis of permutation mixtures and permutation-invariant decisions with Yiguo Liang, Sept 2025. Besting Good--Turing: Optimality of Non-Parametric Maximum Likelihood for Distribution Estimation with Jonathan Niles-Weed, Yandi Shen, and Yihong Wu, Sept 2025. (slides) Evolution of Information in Interactive Decision Making: A Case Study for Multi-Armed Bandits with Yuzhou Gu and Jian Qian, NeurIPS 2025 (to appear). Joint Value Estimation and Bidding in Repeated First-Price Auctions with Yuxiao Wen and Zhengyuan Zhou, Feb 2025. Approximate independence of permutation mixtures with Jonathan Niles-Weed, Aug 2024. (slides) Causal Inference with High-dimensional Discrete Covariates with Zhenghao Zeng, Sivaraman Balakrishnan, and Edward H. Kennedy, May 2024. Contact Email: yanjunhan [at] nyu [dot] edu Office: WWH 1110 or CDS 705 Due to the large volume of emails that I receive, I generally do not respond to unsolicited inquiries about student or postdoc openings; please apply through Courant or CDS programs. Nevertheless, if you have a strong quantitative background and think your interests are compatible with mine, please feel free to contact me.",
  "content_length": 2024,
  "method": "requests",
  "crawl_time": "2025-12-01 14:50:19"
}