{
  "name": "Yanjie Fu",
  "homepage": "http://yanjiefu.com",
  "status": "success",
  "content": "Yanjie Fu Homepage Dr. Yanjie FuAssociate ProfessorSchool of Computing and AIIra A. Fulton Schools of EngineeringArizona State UniversityOffice: Tempe campus, BYENG 506Email:  yanjie.fu AT asu.edu Short Biography Dr. Yanjie Fu is an associate professor in the School of Computing and AI at the Arizona State University. He received his Ph.D. degree from the Rutgers University in 2016, the B.E. degree from the University of Science and Technology of China (USTC), and the M.E. degree from the Chinese Academy of Sciences (CAS). He has research experience in industry research labs, such as Microsoft Research Asia and IBM Thomas J. Watson Research Center. He has published prolifically in refereed journals and conference proceedings, such as IEEE TKDE, IEEE TMC, ACM TKDD, ACM SIGKDD, ICLR, AAAI, IJCAI, VLDB, IEEE ICDE, WWW, ACM SIGIR. He currently serves as an Associate Editor of ACM Transactions on Knowledge Discovery from Data and ACM AI Letters. His teaching and research have been recognized by: 1) three junior faculty awards: US NAE Grainger Foundation Frontiers of Engineering early career engineer (2023), US NSF CAREER (2021), and US NSF CRII (2018) awards; 2) several best paper (runner-up, finalist) awards (e.g., IEEE ICDM 2021 best paper finalist, ACM SIGSPATIAL 2020 best runner-up, ACM SIGKDD 2018 best student paper finalist); 3) several community and industrial recognitions: 2025 and 2024 Stanford Elsevier World’s Top 2% Scientists, 2022 Baidu Scholar global top Chinese young scholars in AI, 2021 Aminer.org AI 2000 Most Influential Scholar Award Honorable Mention in Data Mining, 2016 Microsoft Azure Research Award; 4) several university-level awards: Fulton Engineering Top 5% Teaching Recognition Award, Reach the Stars Award, University System Research Board Award, and University Interdisciplinary Research Award. He is committed to data science education. His graduated Ph.D. students have joined academia as tenure-track faculty members. He is broadly interested in data mining, AI, and their interdisciplinary applications. His research involves two major efforts: 1) on Data for AI (D4AI), how can the structure knowledge of data guide AI? His lab has contributed projects including: D4AI-spatial, D4AI-timeseries, D4AI-causal outliers. 2) on AI for data (AI4D), how can AI augment, reprogram, and knowledgize data? Several contributed projects includes AI4D-RL, AI4D-GenAI, AI4D-LLM. His recent focuses are space-time intelligence, data-centric AI, sim2decision. He also explores emerging topics on multimodal reasoning, LLM and agentic AI with his students. He has been fortunate to work with collaborators from scientific and social domains, including urban and regional planning, earth and environmental science, learning and educational science, disaster and community resilience, social computing. Links Google Scholar Group Meeting Linkedin ORCID Recent Talks and News Nov 2025: Keynote Talk at IEEE ICDM 2025 SSTDM workshop: Can AI be the Copilot of Urban Operation and Design for Shaping Tomorrow’s Cities? Nov 2025: Keynote Talk at IEEE ICDM 2025 GTA3 workshop: AI by the Graphs: A Graph-Centered View of Unlocking Geospatial Knowledge and Tabular Intelligence Nov 2025: Keynote Talk at SIGSpatial 2025 SpatialConnect workshop: Can AI be the Copilot of Urban Operation and Design for Shaping Tomorrow’s Cities? Nov 2025: Keynote Talk at SIGSpatial 2025 UrbanAI workshop: Toward Space-Time Intelligence: Learning Representations, Dynamics, Decisions Across the Urban Physical World Sept 2025: Invited Distinguished Talk at NEC: From Reactive to Proactive: Can AI Reason Beyond Data Distribution and Dynamics for Future-ready Sim-to-Decision? August 2025: Keynote Talk at KDD2025 AI4DE workshop: Towards Autonomous Data Reprogramming August 2025: Keynote Talk at KDD2025 urban computing workshop: Can AI be the Copilot of Urban Planning for Shaping Tomorrow’s Cities? August 2025: Keynote Talk at KDD2025 time series workshop: Towards Deep Time Series Modeling via Data-Centric AI —From Distribution Learning to Distribution Reprogramming Jun 2025: Talk at Google: Welcome to the World of Smart Machines May 2025: Presentation at NAACL 2025: MixLLM: Dynamic Routing in Mixed Large Language Models April 2025: Wangyang and Haoyue will be 2025 summer research interns at NEC Research Princeton. Xinyuan will be a 2025 summer research intern at HomeDepot data science. Nanxu will be a 2025 summer research intern at Microsoft Research. Sixun will be a 2025 summer research intern at Zoom USA. Mar 2025: Talk at Lawrence Berkeley National Labs: AI for Data Editing to Advance Data Utility Feb 2025: Talk at ASU CICI: Reimagining Automated Urban Planning: A Generative AI Perspective Feb 2025: Talk at AAAI 2025: AI for urban planning workshop: Bridging AI and Urban Planning: My Journey Towards Smarter, More Sustainable Cities Feb 2025: I will be a vice cochair of IEEE BIGDATA 2025. Feb 2025: Presentation at AAAI 2024: Evolutionary LLM agents for data transformation Jan 2025: I will be the demo track co-chair of ACM SIGSpatial 2025. Jan 2025: I will be the high school and undergraduate symposium cochair of IEEE ICDM 2025. Dec 2024: Presentation at AGU 2024: generative AI for AI-ready science data Dec 2024: I attended IEEE Bigdata 2024. I cochaired the data-centric AI workshop. I cochaired the high-school and undergraduate symposium track of IEEE BIGdata 2024. Nov 2024: Talk at ACM SIGSpatial 2024 geo-industry workshop: Reimagining Automated Urban Planning: A Generative AI Perspective Oct 2024: Talk at ACM CIKM 2024 online and dynamic recsys workshop : The Symbiosis of LLMs and RecSys: from LLM for RecSys to RecSys for LLM Oct 2024: Talk at ACM CIKM 2024: Towards tabular data-centric AI (tutorial) Aug 2024: Talk at NEC research Princeton: Navigating Unexpected Disruptions in Open Environments Aug 2024: Presentation at KDD 2024: Unsupervised Generative Feature Transformation via Graph Pre-training and Multi-objective Fine-tuning May 2024: Keynote talk at WWW2024 DCAI workshop: Data-Centric AI: Unlock the Power of Feature Space ——From Decision-Making to Generative-AI Feb 2024: Keynote talk at AAAI 2024 Time Series Workshop: Towards Deep Time Series Modeling: A Distribution Perspective — From Distribution Regularity to Distribution Shift Apr 2023: Talk at UConn: Deep Disruption-Robust Machine Intelligence Apr 2023: Talk at UBuffalo: Deep Disruption-Robust Machine Intelligence in Open Environments April 2023: Talk at SpatialDI: Deep Disruption-Robust Urban Intelligence Mar 2023: Talk at UCF: Deep Disruption-Robust Machine Intelligence in Open Environments Prospective students We are interested in applications at the intersection of machine learning, complex data, and human factors. But most importantly, we hope our application-motivated research will lead to the development of theories, methodologies, and algorithms that are useful for a wide range of important and interesting problems. We not just pursue research ideas and their impact, but also hope to help students to become professors, researchers, and entrepreneurs. ASU is part of the prestigious Association of American Universities (AAU) that represents a select group of the elite in leading research universities. ASU is classified as a Carnegie Research I (R1) university. ASU is ranked #36 in USA by QS world university ranking 2026. The School of Computing and AI is ranked #39 in Computer Science, #36 in Computer Engineering (#21 among public universities), #24 in Artificial Intelligence (CS Speciality), #18 in Industrial Engineering (#13 among public universities) according to US News 2025, and is ranked #41 according to CSRankings.ORG and ranked #31 according to Research.COM . ASU School of Computing and AI is proud to have large number of alumni from our Ph.D. programs who have become professors and researchers at top universities and leading research labs. Interested in working with me? You should… Have a strong interest in AI, data mining, machine learning, data science Be self-motivated to learn Have strong writing and presentation skills A strong computer science background To help me to know your background, please send me the following items by email. A resume A copy of your graduate/undergraduate transcript One or two representative papers Once we have a commitment to each other, I will do my best to help you to build a strong research capability and publication record to proceed with your thesis to prepare for your future career",
  "content_length": 8503,
  "method": "requests",
  "crawl_time": "2025-12-01 14:50:19"
}