{
  "name": "Yankai Lin",
  "homepage": "https://linyankai.github.io",
  "status": "success",
  "content": "Yankai Lin's Homepage Yankai Lin Associate Professor (Tenure Track) Gaoling School of Artificial Intelligence, Renmin University of China Email: yankailin [at] ruc.edu.cn Add: Lide Building, 1723, Renmin University of China, Beijing Education and Experience | Publications | Talks Teaching 《Knowledge Representation Learning》 Students Graduates Wentong Chen (2022-): PhD. Yiju Guo (2022-): PhD. Wenkai Yang (2023-): PhD. Zhiyuan Chen (2023-): PhD. Shengda Fan (2024-): PhD. Yupeng Huo (2024-): PhD. Guirong Chen (2024-): PhD. Publications [Google Scholar] Journal and Conference Papers (*: equal contribution) 2023 Yujia Qin, Zihan Cai, Dian Jin, Lan Yan, Shihao Liang, Kunlun Zhu, Yankai Lin, Xu Han, Ning Ding, Huadong Wang, Ruobing Xie, Fanchao Qi, Zhiyuan Liu, Maosong Sun and Jie Zhou. Interactive Web Search for Chinese Long-form Question Answering. The 61th Annual Meeting of the Association for Computational Linguistics (ACL 2023) Chaojun Xiao, Zhengyan Zhang, Xu Han, Chi-Min Chan, Yankai Lin, Zhiyuan Liu, Xiangyang Li, Zhonghua Li, Zhao Cao and Maosong Sun. Plug-and-Play Document Modules for Pre-trained Models. The 61th Annual Meeting of the Association for Computational Linguistics (ACL 2023) Zhengyan Zhang, Zhiyuan Zeng, Yankai Lin, Huadong Wang, Deming Ye, Chaojun Xiao, Xu Han, Zhiyuan Liu, Peng Li, Maosong Sun and Jie Zhou. Plug-and-Play Knowledge Injection for Pre-trained Language Models. The 61th Annual Meeting of the Association for Computational Linguistics (ACL 2023) Zhengyan Zhang, Zhiyuan Zeng, Yankai Lin, Chaojun Xiao, Xiaozhi Wang, Xu Han, Zhiyuan Liu, Ruobing Xie, Maosong Sun and Jie Zhou. Emergent Modularity in Pre-trained Transformers. Findings of ACL 2023 Yujia Qin, Cheng Qian, Xu Han, Yankai Lin, Huadong Wang, Ruobing Xie, Zhiyuan Liu, Maosong Sun and Jie Zhou. Recyclable Tuning for Continual Pre-training. Findings of ACL 2023 Weize Chen, Xu Han, Yankai Lin, Zhiyuan Liu, Maosong Sun and Jie Zhou. Stochastic Bridges as Effective Regularizers for Parameter-Efficient Tuning. Findings of ACL 2023 Xin Cheng, Yankai Lin, Xiuying Chen, Dongyan Zhao and Rui Yan. PlugLM: Language Modeling with Plug-in Knowledge Memory. Findings of ACL 2023 2022 Lan Jiang, Hao Zhou, Yankai Lin, Peng Li, Jie Zhou, Rui Jiang. ROSE: Robust Selective Fine-tuning for Pre-trained Language Models. The 2022 Conference on Empirical Methods in Natural Language Processing (EMNLP 2022) Xiaozhi Wang, Yulin Chen, Ning Ding, Hao Peng, Zimu Wang, Yankai Lin, Xu Han, Lei Hou, Juanzi Li, Zhiyuan Liu, Peng Li, Jie Zhou. MAVEN-ERE: A Unified Large-scale Dataset for Event Coreference, Temporal, Causal, and Subevent Relation Extraction. The 2022 Conference on Empirical Methods in Natural Language Processing (EMNLP 2022) Yujia Qin, Cheng Qian, Jing Yi, Weize Chen, Yankai Lin, Xu Han, Zhiyuan Liu, Maosong Sun, Jie Zhou. Exploring Mode Connectivity for Pre-trained Language Models. The 2022 Conference on Empirical Methods in Natural Language Processing (EMNLP 2022) Jing Yi, Weize Chen, Yujia Qin, Yankai Lin, Ning Ding, Xu Han, Zhiyuan Liu, Maosong Sun, Jie Zhou. Different Tunes Played with Equal Skill: Exploring a Unified Optimization Subspace for Parameter-Efficient Tuning. Findings of EMNLP 2022 Zichun Yu, Tianyu Gao, Zhengyan Zhang, Yankai Lin, Zhiyuan Liu, Maosong Sun, Jie Zhou. Automatic Label Sequence Generation for Prompting Sequence-to-sequence Models the 29th International Conference on Computational Linguistics (COLING 2022) Deli Chen, Yankai Lin, Lei Li, Xuancheng Ren, Peng Li, Jie Zhou, Xu Sun. Rethinking the Promotion Brought by Contrastive Learning to Semi-supervised Node Classification. The 31st International Joint Conference on Artificial Intelligence (IJCAI-22) Yujia Qin, Yankai Lin, Jing Yi, Jiajie Zhang, Xu Han, Zhengyan Zhang, Yusheng Su, Zhiyuan Liu, Peng Li, Maosong Sun, Jie Zhou. Knowledge Inheritance for Pre-trained Language Models. The 2022 Conference of the North American Chapter of the Association for Computational Linguistics - Human Language Technologies (NAACL-HLT 2022) Yusheng Su, Xiaozhi Wang, Yujia Qin, Chi-Min Chan, Yankai Lin, Huadong Wang, Kaiyue Wen, Zhiyuan Liu, Peng Li, Juanzi Li, Lei Hou, Maosong Sun, Jie Zhou. On Transferability of Prompt Tuning for Natural Language Processing. The 2022 Conference of the North American Chapter of the Association for Computational Linguistics - Human Language Technologies (NAACL-HLT 2022) Weize Chen, Xu Han, Yankai Lin, Hexu Zhao, Zhiyuan Liu, Peng Li, Maosong Sun, Jie Zhou. Fully Hyperbolic Neural Networks. The 60th Annual Meeting of the Association for Computational Linguistics (ACL 2022) Deming Ye, Yankai Lin, Peng Li, Maosong Sun. Packed Levitated Marker for Entity and Relation Extraction. The 60th Annual Meeting of the Association for Computational Linguistics (ACL 2022) Pei Ke, Hao Zhou, Yankai Lin, Peng Li, Jie Zhou, Xiaoyan Zhu, Minlie Huang. CTRLEval: An Unsupervised Reference-Free Metric for Evaluating Controlled Text Generation. The 60th Annual Meeting of the Association for Computational Linguistics (ACL 2022) Deming Ye, Yankai Lin, Peng Li, Maosong Sun, Zhiyuan Liu. A Simple but Effective Pluggable Entity Lookup Table for Pre-trained Language Models. The 60th Annual Meeting of the Association for Computational Linguistics (ACL 2022) Zhengyan Zhang, Yankai Lin, Zhiyuan Liu, Peng Li, Maosong Sun, Jie Zhou. MoEfication: Conditional Computation of Transformer Models for Efficient Inference. Findings of ACL 2022 Yujia Qin, Jiajie Zhang, Yankai Lin, Zhiyuan Liu, Peng Li, Maosong Sun, Jie Zhou. ELLE: Efficient Lifelong Pre-training for Emerging Data. Findings of ACL 2022. Xin Lv, Yankai Lin, Yixin Cao, Lei Hou, Juanzi Li, Zhiyuan Liu, Peng Li, Jie Zhou. Do Pre-trained Models Benefit Knowledge Graph Completion? A Reliable Evaluation and a Reasonable Approach. Findings of ACL 2022 Lan Jiang, Tianshu Lyu, Yankai Lin, Meng Chong, Xiaoyong Lyu, Dawei Yin. On Length Divergence Bias in Textual Matching Models. Findings of ACL 2022 2021 Deli Chen, Yankai Lin , Guangxiang Zhao, Xuancheng Ren, Peng Li, Jie Zhou, Xu Sun. Topology-Imbalance Learning for Semi-Supervised Node Classification. Thirty-fifth Conference on Neural Information Processing Systems (NeurIPS 2021) Wenkai Yang, Yankai Lin , Peng Li, Jie Zhou and Xu Sun. RAP: Robustness-Aware Perturbations for Defending against Backdoor Attacks on NLP Models. The 2021 Conference on Empirical Methods in Natural Language Processing (EMNLP 2021) Yuan Yao, Jiaju Du, Yankai Lin , Peng Li, Zhiyuan Liu, Jie Zhou and Maosong Sun. CodRED: A Cross-Document Relation Extraction Dataset for Acquiring Knowledge in the Wild. The 2021 Conference on Empirical Methods in Natural Language Processing (EMNLP 2021) Lei Li, Yankai Lin , Shuhuai Ren, Peng Li, Jie Zhou and Xu Sun. Dynamic Knowledge Distillation for Pre-trained Language Models. The 2021 Conference on Empirical Methods in Natural Language Processing (EMNLP 2021) Lei Li, Yankai Lin , Deli Chen, Shuhuai Ren, Peng Li, Jie Zhou and Xu Sun. CascadeBERT: Accelerating Inference of Pre-trained Language Models via Calibrated Complete Models Cascade. Findings of EMNLP 2021 Jifan Yu, Yuquan Wang, Qingyang Zhong, Gan Luo, Yiming Mao, Kai Sun, Wenzheng Feng, Wei Xu, Shulin Cao, Kaisheng Zeng, Zijun Yao, Lei Hou, Yankai Lin , Peng Li, Jie Zhou, Bin Xu, Juanzi Li, Jie Tang and Maosong Sun. MOOCCubeX: A Large Knowledge-centered Repository for Adaptive Learning in MOOCs. 30th ACM International Conference on Information and Knowledge Management (CIKM 2021) Yusheng Su, Xu Han, Zhengyan Zhang, Peng Li, Zhiyuan Liu, Yankai Lin, Jie Zhou, Maosong Sun. CokeBERT: Contextual Knowledge Selection and Embedding towards Enhanced Pre-Trained Language Models. AI Open, 2021. [pdf] Wenkai Yang, Yankai Lin , Peng Li, Jie Zhou and Xu Sun. Rethinking Stealthiness of Backdoor Attack against NLP Models. The Joint Conference of the 59th Annual Meeting of the Association for Computational Linguistics and the 11th International Joint Conference on Natural Language Processing (ACL-IJCNLP 2021). [pdf] Tianyu Gao, Xu Han, Yuzhuo Bai, Keyue Qiu, Zhiyu Xie, Yankai Lin , Zhiyuan Liu, Peng Li, Maosong Sun and Jie Zhou. Manual Evaluation Matters: Reviewing Test Protocols of Distantly Supervised Relation Extraction. Findings of ACL 2021. [pdf] Yujia Qin, Yankai Lin, Ryuichi Takanobu, Zhiyuan Liu, Peng Li, Heng Ji, Minlie Huang, Maosong Sun and Jie Zhou. ERICA: Improving Entity and Relation Understanding for Pre-trained Language Models via Contrastive Learning. The Joint Conference of the 59th Annual Meeting of the Association for Computational Linguistics and the 11th International Joint Conference on Natural Language Processing (ACL-IJCNLP 2021). [pdf] Ziqi Wang, Xiaozhi Wang, Xu Han, Yankai Lin, Lei Hou, Zhiyuan Liu, Peng Li, Juanzi Li and Jie Zhou. CLEVE: Contrastive Pre-training for Event Extraction. The Joint Conference of the 59th Annual Meeting of the Association for Computational Linguistics and the 11th International Joint Conference on Natural Language Processing (ACL-IJCNLP 2021). [pdf] Deming Ye, Yankai Lin, Yufei Huang, Maosong Sun. TR-BERT: Dynamic Token Reduction for Accelerating BERT Inference. 2021 Annual Conference of the North American Chapter of the Association for Computational Linguistics (NAACL-HLT 2021) [pdf] Huimin Chen, Yankai Lin, Fanchao Qi, Jinyi Hu, Peng Li, Jie Zhou, Maosong Sun. Aspect-Level Sentiment-Controllable Review Generation with Mutual Learning Framework. Thirty-Fifth AAAI Conference on Artificial Intelligence (AAAI 2021) [pdf] Qiu Ran, Yankai Lin, Peng Li, Jie Zhou. Guiding Non-Autoregressive Neural Machine Translation Decoding with Reordering Information. Thirty-Fifth AAAI Conference on Artificial Intelligence (AAAI 2021) [pdf] 2020 Deming Ye, Yankai Lin, Jiaju Du, Zhenghao Liu, Peng Li, Maosong Sun and Zhiyuan Liu. Coreferential Reasoning Learning for Language Representation. The 2020 Conference on Empirical Methods in Natural Language Processing (EMNLP 2020). [pdf] [codes] Hao Peng, Tianyu Gao,",
  "content_length": 16626,
  "method": "requests",
  "crawl_time": "2025-12-01 14:50:19"
}