{
  "name": "Yanlin Wang 0001",
  "homepage": "https://yanlin.info",
  "status": "success",
  "content": "Yanlin Wang's Homepage Yanlin Wang's Homepage Assistant Professor School of Software Engineering Sun Yat-sen University E-mail: yanlin-wang AT outlook DOT com 中文主页 About me I joined School of Software Engineering, Sun Yat-sen University as an assistant professor in July 2022. Before that, I worked at Microsoft Research Asia, Data, Knowledge, and Intelligence (DKI) group as a senior researcher. I was very fortunate to work under the supervision of Dr. Dongmei Zhang and Shi Han in MSRA. I received my B.S. degree from Zhejiang University and PhD degree from the University of Hong Kong under the supervision of Prof. Bruno C. d. S. Oliveira. My research interests include large language models, software engineering, deep learning, and programming languages, particularly in intelligent software engineering. Our group is always recruiting undergraduate/master students. Please contact me with your CV attached if you are interested in the above topics. Recent news (Pinned) I am currently on the program committee of ISSTA 2025, FSE 2024 Industry, ISSTA 2024, ICSE 2024, FSE 2023 Industry Track, COLING 2022, Scala 2022, FSE 2022 industry track, and ICSME 2022 industry track. Please consider submitting a paper! 2024-09-15. 🏆 Our work on LLM code generation acceleration receives ACM SIGSOFT Distinguished Paper Award at ISSTA 2024! 2024-09-15. 🏆 Our work on identifying code security issues receives ACM SIGSOFT Distinguished Paper Award at ISSTA 2024! 2024-07-24. 🏆 Our paper receives the ACM SIGSOFT Distinguished Paper Award at Intermetware 2024. 2024-07-24. 🏆 I am honored to receive the Distinguished Reviewer Award of Internetware 2024. Thank you for the recognition! 2024/07. Our paper “When to Stop? Towards Efficient Code Generation in LLMs with Excess Token Prevention” has been accepted by ISSTA 2024. 2024/07. Our paper “RLCoder: Reinforcement Learning for Repository-Level Code Completion” has been accepted by ICSE 2025. 2024/07. Our paper “Identifying Smart Contract Security Issues in Code Snippets from Stack Overflow” has been accepted by ISSTA 2024. 2024/02. Our paper Tackling Long Code Search with Splitting, Encoding, and Aggregating was accepted by COLING 2024. Congrats to Fan! 2024/01. Our paper KADEL was accepted by TOSEM 2024. Congrats to Wei! 2023/12. Our paper SparseCoder (Identifier-Aware Sparse Transformer for File-Level Code Summarization) was accepted by SANER 2024. Congrats to Yanxian! 2023/12. Our paper MemoryBank (enhancing LLMs with long-term memory) was accepted by AAAI 2024. Congrats to Wanjun and Lianghong! 2023/07. One paper on issue link recovery was accepted by ASE 2023. Congratulations to Chenyuan! 2023/06. One paper on code search utilizing ChatGPT was accepted by ICSME 2023. Congratulations to Lianghong! 2023/05. Four research papers were accepted by ISSTA 2023. Congratulations to Ensheng, Hao, Queping, and Yifan! 2023/05. Our research project MemoryBank for enhancing LLMs with long-term memory was released, check it out! 2023/04. Our benchmark AGIEval for accessing foundation models was released, check it out! 2022/12. New paper accepted at ICSE 2023. 2022/11. New paper accepted at AAAI 2023. 2022/10. New paper accepted at WSDM 2023. 2022/10. Two papers accepted at EMNLP 2022. 2022/09. New paper accepted at EMSE 2022. 2022/05. New paper accepted at KDD 2022 Applied Data Science Track. 2022/03. New paper accepted at MSR 2022. 2022/02. Two papers accepted at ACL 2022. Publications Agents in Software Engineering: Survey, Landscape, and Vision [preprint ] Yanlin Wang, Wanjun Zhong, Yanxian Huang, Ensheng Shi, Min Yang, Jiachi Chen, Hui Li, Yuchi Ma, Qianxiang Wang, Zibin Zheng LLM Hallucinations in Practical Code Generation: Phenomena, Mechanism, and Mitigation [preprint ] Ziyao Zhang, Yanlin Wang, Chong Wang, Jiachi Chen, Zibin Zheng RLCoder: Reinforcement Learning for Repository-Level Code Completion (ICSE 2025, CCF-A) Yanlin Wang, Yanli Wang, Daya Guo, Jiachi Chen, Ruikai Zhang, Yuchi Ma, Zibin Zheng. MAGIS: LLM-Based Multi-Agent Framework for GitHub Issue Resolution (NeurIPS 2024, CCF-A) When to Stop? Towards Efficient Code Generation in LLMs with Excess Token Prevention (ISSTA 2024, CCF-A) (🏆Distinguished Paper Award🏆) Lianghong Guo, Yanlin Wang*, Ensheng Shi, Wanjun Zhong, Hongyu Zhang, Jiachi Chen, Ruikai Zhang, Yuchi Ma, Zibin Zheng. Identifying Smart Contract Security Issues in Code Snippets from Stack Overflow (ISSTA 2024, CCF-A) (🏆Distinguished Paper Award🏆) Jiachi Chen, Chong Chen, Jiang Hu, John Grundy, Yanlin Wang, Ting Chen, Zibin Zheng RMCBench: Benchmarking Large Language Models’ Resistance to Malicious Code (ASE 2024, CCF-A) Jiachi Chen, Qingyuan Zhong, Yanlin Wang, Kaiwen Ning, Yongkun Liu, Zenan Xu, Zhe Zhao, Ting Chen, Zibin Zheng In The 39th ACM/IEEE International Conference on Automated Software Engineering. Beyond Functional Correctness: Investigating Coding Style Inconsistencies in Large Language Models [preprint ] Yanlin Wang, Tianyue Jiang, Mingwei Liu, Jiachi Chen, Zibin Zheng Demystifying and Detecting Cryptographic Defects in Ethereum Smart Contracts (ICSE 2025, CCF-A) Jiashuo Zhang, Yiming Shen, Jiachi Chen, Jianzhong Su, Yanlin Wang, Ting Chen, Jianbo Gao, Zhong Chen Hyperion: Unveiling DApp Inconsistencies using LLM and Dataflow-Guided Symbolic Execution (ICSE 2025, CCF-A) Shuo Yang, Xingwei Lin, Jiachi Chen, Qingyuan Zhong, Lei Xiao, Renke Huang, Yanlin Wang, Zibin Zheng CoSQA+: Enhancing Code Search Dataset with Matching Code [preprint ] Jing Gong, Yanghui Wu, Linxi Liang, Zibin Zheng, Yanlin Wang Make Heterophilic Graphs Better Fit GNN:A GraphRewiring Approach (TKDE 2024, CCF-A) Wendong Bi, Lun Du*, Qiang Fu, Yanlin Wang, Shi Han, and Dongmei Zhang YODA: Teacher-Student Progressive Learning for Language Models [preprint] Jianqiao Lu, Wanjun Zhong, Yufei Wang, Zhijiang Guo, Qi Zhu, Wenyong Huang, Yanlin Wang, Fei Mi, Baojun Wang, Yasheng Wang, Lifeng Shang, Xin Jiang, Qun Liu Tackling Long Code Search with Splitting, Encoding, and Aggregating. Fan Hu, Yanlin Wang*, Lun Du, Hongyu Zhang, Dongmei Zhang and Xirong Li International Conference on Computational Linguistics, Language Resources and Evaluation. (LREC-COLING 2024, CCF-B) MoonBit: Explore the Design of an AI-Friendly Programming Language. In LLM4Code Workshop 2024. Haoxiang Fei, Yu Zhang, Hongbo Zhang, Yanlin Wang, Qing Liu An Empirical Study on Low Code Programming using Traditional vs Large Language Model Support. [preprint] Yongkun Liu, Jiachi Chen, Tingting Bi, John Grundy, Yanlin Wang, Ting Chen, Yutian Tang, Zibin Zheng KADEL: Knowledge-Aware Denoising Learning for Commit Message Generation. [pdf ] Wei Tao, Yucheng Zhou, Yanlin Wang*, Hongyu Zhang, Haofen Wang, Wenqiang Zhang* ACM Transactions on Software Engineering and Methodology 2024. (TOSEM 2024, CCF-A) SparseCoder: Identifier-Aware Sparse Transformer for File-Level Code Summarization. [pdf ] Yanlin Wang, Yanxian Huang, Daya Guo, Hongyu Zhang and Zibin Zheng The IEEE International Conference on Software Analysis, Evolution and Reengineering (SANER 2024, CCF-B) Adaptive-Solver Framework for Dynamic Strategy Selection in Large Language Model Reasoning [preprint] Jianpeng Zhou, Wanjun Zhong, Yanlin Wang, Jiahai Wang SoTaNa: The Open-Source Software Development Assistant [preprint] Ensheng Shi, Fengji Zhang, Yanlin Wang, Bei Chen, Lun Du, Hongyu Zhang, Shi Han, Dongmei Zhang, Hongbin Sun A Survey of Large Language Models for Code: Evolution, Benchmarking, and Future Trends [preprint] Zibin Zheng, Kaiwen Ning, Yanlin Wang, Jingwen Zhang, Dewu Zheng, Mingxi Ye, Jiachi Chen Towards an Understanding of Large Language Models in Software Engineering Tasks [preprint] Zibin Zheng, Kaiwen Ning, Jiachi Chen, Wenqing Chen, Lianghong Guo, Weicheng Wang, Yanlin Wang When ChatGPT Meets Smart Contract Vulnerability Detection: How Far Are We? [preprint] Chong Chen, Jianzhong Su, Jiachi Chen, Yanlin Wang, Tingting Bi, Yanli Wang, Xingwei Lin, Ting Chen, Zibin Zheng AGIEval: A Human-Centric Benchmark for Evaluating Foundation Models [preprint] Wanjun Zhong, Ruixiang Cui, Yiduo Guo, Yaobo Liang, Shuai Lu, Yanlin Wang, Amin Saied, Weizhu Chen, Nan Duan MemoryBank: Enhancing Large Language Models with Long-Term Memory [preprint] Wanjun Zhong, Lianghong Guo, Qiqi Gao, He Ye, Yanlin Wang In Proceedings of the 37th AAAI Conference on Artificial Intelligence. (AAAI 2024). Code Search Debiasing: Improve Search Results beyond Overall Ranking Performance Sheng Zhang, Hui Li, Yanlin Wang, Zhao Wei, yong xu, Juhong Wang, Rongrong Ji (EMNLP 2023 Findings, CCF-B). Towards Efficient Fine-tuning of Pre-trained Code Models: An Experimental Study and Beyond [pdf] Ensheng Shi, Yanlin Wang, Hongyu Zhang, Lun Du, Shi Han, Dongmei Zhang, Hongbin Sun In The ACM SIGSOFT International Symposium on Software Testing and Analysis. (ISSTA 2023, CCF-A). Re2BERT: A Two-stage Pre-trained Framework for Automatic Rename Refactoring [pdf] Hao Liu, Yanlin Wang, Zhao Wei, Yong Xu, Juhong Wang, Hui Li, Rongrong Ji In The ACM SIGSOFT International Symposium on Software Testing and Analysis. (ISSTA 2023, CCF-A). DeFiTainter: Detecting Price Manipulation Vulnerabilities in DeFi Protocols [pdf] Queping Kong, Jiachi Chen, Yanlin Wang, Zigui Jiang, Zibin Zheng In The ACM SIGSOFT International Symposium on Software Testing and Analysis. (ISSTA 2023, CCF-A). Toward Automated Detecting Unanticipated Price Feed in Smart Contract[pdf] Yifan Mo, Jiachi Chen, Yanlin Wang, Zibin Zheng In The ACM SIGSOFT International Symposium on Software Testing and Analysis. (ISSTA 2023, CCF-A). Snippet Comment Generation Based on Code Context Expansion [pdf] Hanyang Guo, Xiangping Chen, Yuan Huang, Yanlin Wang, Xi Ding, Zibin Zheng, Xiaocong Zhou, Hong-Ning Dai In ACM Transactions on Software Engineering and Methodology (TOSEM 2023, CCF-A) CoCoAST: Representing Source Code via Hierarchical Splitting and Reconstruction of Abstract Syntax Trees[pdf] Ensheng Shi#, Yanlin Wang#, Lun Du, Hongyu Zhang, Shi Han, Dongmei Zhang, Hongbin Sun In",
  "content_length": 16713,
  "method": "requests",
  "crawl_time": "2025-12-01 14:50:20"
}