{
  "name": "Yannis Smaragdakis",
  "homepage": "https://yanniss.github.io",
  "status": "success",
  "content": "Yannis Smaragdakis Yannis Smaragdakis (also Ioannis Smaragdakis, Γιάννης Σμαραγδάκης) Professor (35%-time, also at Dedaub) Mailing address (shortened but valid): Dept. of Informatics, University of Athens, Ilisia, 15784, Greece Phone: +30 210 7275311 Email: yannis@smaragd.org (or smaragd@di.uoa.gr) Events: Current Service: while part-time, I am less likely to accept service duties. YouTube channel for my lab Teaching: Greece: Compilers (S11,S12,S13,S14,S15,S16,F17,S19,S20,S21,S22,S25); Analysis of Smart Contracts on Blockchain Platforms (S25); OO Languages and Systems/Advanced Programming Techniques (F10, F11, F12, F13, F14, F15, F17, F18, F19, F20, F21); Advanced Compilers and Static Analysis (S19, S20,S21,S22); Operating Systems (F17); Systems Programming (S14,S15,S16); SE (S11,S12,S13). US: SE (S09); OO Languages and Systems (F09, S09, S08, S07, F05, F04, F03, F02, F01); Graduate Seminar (S07, F08); Distributed Systems (F06, F07); Intro OO (F05, S05); Advanced OS (S04, S03, S02, S01, S00); Memory Management (F00). Research Programming languages and software engineering: Program analysis (static analysis, test generation, invariant inference, symbolic execution) Language mechanisms for abstraction (declarative languages, program generation, DSLs, modules and components, generics, extensible languages, multi-paradigm programming) Languages and tools for systems (programming models for concurrency, language support for distributed computing, memory management and program locality) Gratefully acknowledging funding by the ERC (Advanced grant, '24-'29), and the HFRI. (Very outdated) CV My Ph.D. students: Anastasis Antoniadis.. Sifis Lagouvardos.. Panagiotis Diamantakis. Ph.D. alumni: Brian McNamara, Eli Tilevich, Christoph Csallner, Shan Shan Huang, John Altidor, Kaituo Li, Aggelos Biboudis, George Balatsouras, George Kastrinis. Sample older B.Sc. and M.Sc. theses Latest work: \"Universal Scalability in Declarative Program Analysis (with Choice-Based Combination Pruning)\" (OOPSLA'25) \"The Incredible Shrinking Context... in a Decompiler Near You\" (ISSTA'25) \"Program Analysis for High-Value Smart Contract Vulnerabilities: Techniques and Insights\" (SBC'23) \"Elipmoc: Advanced Decompilation of Ethereum Smart Contracts\" (OOPSLA'22) Project areas, each with representative publications and links: Static analysis of smart contracts: work that led to Dedaub and to the best decompiler for Ethereum VM smart contracts. \"Symbolic Value-Flow Static Analysis: Deep, Precise, Complete Modeling of Ethereum Smart Contracts\" (OOPSLA'21) \"Precise Static Modeling of Ethereum 'Memory'\" (OOPSLA'20) \"MadMax: Analyzing the Out-of-Gas World of Smart Contracts\" (CACM Oct'20) Condensed, updated \"research highlight\" over \"MadMax: Surviving Out-of-Gas Conditions in Ethereum Smart Contracts\" (OOPSLA'18) \"Ethainter: A Smart Contract Security Analyzer for Composite Vulnerabilities\" (PLDI'20) \"Gigahorse: Thorough, Declarative Decompilation of Smart Contracts\" (ICSE'19) General Static Program Analysis (esp. pointer analysis): we express a rich set of static analyses completely declaratively (in the Datalog language). Reference/overview material: The Doop framework \"Pointer Analysis\" tutorial survey (Foundations and Trends in PL, official link) Notes, slides, etc. from a 2016 seminar. Videos of lectures. \"Making Pointer Analysis More Precise by Unleashing the Power of Selective Context Sensitivity\" (OOPSLA'21) \"Identifying Java Calls in Native Code via Binary Scanning\" (ISSTA'20) \"Static Analysis of Java Enterprise Applications: Frameworks and Caches, the Elephants in the Room\" (PLDI'20) \"Explaining Bug Provenance with Trace Witnesses\" (SOAP'20) \"A Principled Approach to Selective Context Sensitivity for Pointer Analysis\" (ACM TOPLAS, May'20) extends \"Precision-Guided Context Sensitivity for Pointer Analysis\" (OOPSLA'18) \"Static Analysis of Shape in TensorFlow Programs\" (ECOOP'20) \"Deep Static Modeling of Invokedynamic\" (ECOOP'19) \"Scalability-First Pointer Analysis with Self-Tuning Context-Sensitivity\" (ESEC/FSE'18) \"Defensive Points-To Analysis: Effective Soundness via Laziness\" (ECOOP'18) \"Efficient Reflection String Analysis via Graph Coloring\" (ECOOP'18) \"Shooting from the Heap: Ultra-Scalable Static Analysis with Heap Snapshots\" (ISSTA'18) \"Static Analysis of Java Dynamic Proxies\" (ISSTA'18) \"Symbolic Reasoning for Automatic Signal Placement\" (PLDI'18) \"An Efficient Data Structure for Must-Alias Analysis\" (CC'18) \"Heaps Don’t Lie: Countering Unsoundness with Heap Snapshots\" (OOPSLA'17) \"P/Taint: Unified Points-to and Taint Analysis\" (OOPSLA'17) \"Porting Doop to Souffle: A Tale of Inter-Engine Portability for Datalog-Based Analyses\" (SOAP'17) \"A Datalog Model of Must-Alias Analysis\" (SOAP'17) \"Structure-Sensitive Points-To Analysis for C and C++\" (SAS'16) \"More Sound Static Handling of Java Reflection\" (APLAS'15) \"In Defense of Soundiness: A Manifesto\" (CACM, Feb'15), see also soundiness.org \"Introspective Analysis: Context-Sensitivity, Across the Board\" (PLDI'14), code \"Set-Based Pre-Processing for Points-To Analysis\" (OOPSLA'13) \"Class Hierarchy Complementation: Soundly Completing a Partial Type Graph\" (OOPSLA'13) \"Hybrid Context Sensitivity for Points-To Analysis\" (PLDI'13) \"Efficient and Effective Handling of Exceptions in Java Points-To Analysis\" (CC'13) \"Pick Your Contexts Well: Understanding Object-Sensitivity (The Making of a Precise and Scalable Pointer Analysis)\" (POPL'11) \"Using Datalog for Fast and Easy Program Analysis\" (Datalog 2.0) \"Resolving and Exploiting the k-CFA Paradox: Illuminating Functional vs. Object-Oriented Program Analysis\" (PLDI'10) \"Strictly Declarative Specification of Sophisticated Points-to Analyses\" (OOPSLA'09) \"Exception Analysis and Points-To Analysis: Better Together\" (ISSTA'09) Program generators, generics in PL, extensibility: MorphJ is a language for safe \"morphing\", i.e., creating classes by iterating over members of other classes. This work also includes a generalization of the concept of \"variance\" in generics/templates: a way to marry parametric and subtype polymorphism. In the 90s, I also worked (as an intern and a funded Ph.D. student) on the Intentional Programming (IP) project at Microsoft. \"Stream Fusion, to Completeness\" (POPL'17) \"Structured Program Generation Techniques\" (GTTSE--Grand Timely Topics in SE) \"Automating Ad hoc Data Representation Transformations\" (OOPSLA'15) \"Foo: A Minimal Modern OO Calculus\" (FTfJP'15) \"jUCM: Universal Class Morphing\" (MASPEGHI'15) \"Streams a la carte: Extensible Pipelines with Object Algebras\" (ECOOP'15). Closely related to earlier performance analysis study: \"Clash of the Lambdas\" (ICOOOLPS'14) \"Refactoring Java Generics by Inferring Wildcards, In Practice\" (OOPSLA'14) \"Forsaking Inheritance: Supercharged Delegation in DelphJ\" (OOPSLA'13) \"Reified Type Parameters Using Java Annotations\" (GPCE'13) \"Java Wildcards Meet Definition-Site Variance\" (ECOOP'12) \"Morphing: Structurally Shaping a Class by Reflecting on Others\": a comprehensive article (ACM TOPLAS, sans appendix) \"Expressive and Safe Static Reflection with MorphJ\" (PLDI'08) \"Morphing: Safely Shaping a Class in the Image of Others\" (ECOOP'07) \"Morphing Software for Easier Evolution\" (RAM-SE'07) \"Statically Safe Program Generation with SafeGen\" (SCP) shows a language that can certify a generator under all possible inputs to assert that it will only produce well-formed programs. conference version at GPCE'05 \"Taming the Wildcards: Combining Definition- and Use-Site Variance\" (PLDI'11) Meta-AspectJ (MAJ) is a state-of-the-art meta-programming tool for Java and AspectJ \"Domain-Specific Languages and Program Generation with Meta-AspectJ\" (ACM TOSEM). Expands \"Generating AspectJ Programs with Meta-AspectJ\" (GPCE'04) and \"Easy Language Extension with Meta-AspectJ\" (ICSE'06 Emerging Results) \"cJ: Enhancing Java with Safe Type Conditions\" (AOSD'07) \"Program Generators and the Tools to Make Them\" (PEPM'04) \"A Personal Outlook on Generator Research\" (Domain-Specific Program Generation) \"Application Generators\": survey article in the Encyclopedia of Electrical and Electronics Engineering, (John Wiley and Sons) \"JTS: Tools for Implementing Domain-Specific Languages\" (ICSR'98) \"Scoping Constructs for Program Generators\" (GCSE'99) \"DiSTiL: a Transformation Library for Data Structures\" in the Domain-Specific Languages conference (DSL)'97. Declarative languages: I am a late convert to declarative programming. An interesting direction is bounded, special-purpose declarative languages (e.g., for parallelism, or for GC-time computation). \"Next-Paradigm Programming Languages: What Will They Look Like and What Changes Will They Bring?\" (Onward! Essays'19) \"A Backend Extension Mechanism for PQL/Java with Free Run-Time Optimisation\" (CC'15) \"PQL: A Purely-Declarative Java Extension for Parallel Programming\" (ECOOP'12) \"Declarative Datalog Debugging for Mere Mortals\" (Datalog 2.0 2012) \"What Can the GC Compute Efficiently? A Language for Heap Assertions at GC Time\" (OOPSLA'10) \"A New Java Runtime for a Parallel World\" (PLDI'10 FIT) Program analysis and test generation for bug detection: the most recent work includes Residual Investigation: an approach that enhances static bug warnings with predictive dynamic analyses. My original work includes JCrasher and its followups, CnC and DSD-Crasher. JCrasher is a system for random testing of Java programs. CnC combines static checking (the ESC/Java system) with automatic test case generation. DSD-Crasher adds a dynamic invariant detection step to CnC. Finally, the ORM- modeling formalism allows efficient satisfiability checking and test data generation. \"Residual Investigation: Predictive and Precise Bug Detection\" (ACM TOSEM) conference version at ISSTA'12 \"SEDGE: Symbolic Example Data Generation for Dataflow Programs\" (ASE'13) \"Second-Order Constraints in Dynamic Invariant Inference\" (ESEC/FSE'13) \"Scalable Satisfiability Checking and Test Data Generation from Modeling Diagrams\" (JASE)",
  "content_length": 15783,
  "method": "requests",
  "crawl_time": "2025-12-01 14:50:23"
}