{
  "name": "Yannic Noller",
  "homepage": "https://yannicnoller.github.io",
  "status": "success",
  "content": "Yannic Noller Yannic (CV) is a professor at the Faculty of Computer Science at the Ruhr University Bochum (RUB) and leads the Software Quality group. His research focuses on how software quality can be maintained and improved with automated testing and repair technologies. His general research goal is to shape the future of software development by contributing to the domain of automated software engineering and providing the means to develop reliable, trustworthy, and secure software systems. In particular, he works in the following areas: Automated Program Repair: developing novel repair techniques to aid developers in fixing program bugs Machine Learning Analysis: automated analysis, testing, and repairing of machine learning models Software Testing: exploring and designing (hybrid) testing techniques to systematically generate test inputs that expose incorrect program behavior Intelligent Tutoring Systems: how to help CS students learn programming by applying concepts from automated testing and repair to guide the students toward the right solution Human Factors in SE: studying developer needs and requirements for successful deployment of testing and repair techniques in development practice Before joining RUB in July 2024, Yannic was an Assistant Professor at Singapore University of Technology and Design (SUTD) and a Research Assistant Professor in the Department of Computer Science at the National University of Singapore (NUS). He pursued his Ph.D. in Computer Science in the Software Engineering group (advised by Prof. Lars Grunske) at the Humboldt-Universität zu Berlin, Germany. His Ph.D. research focused on differential software testing, in particular, by combining fuzzing and symbolic execution in the context of regression analysis, algorithmic complexity analysis, side-channel analysis, and robustness analysis of neural networks. news Jul 10, 2025 Had a great time at the Summer School on Security Testing and Verification 2025 organized by the KU Leuven and VUB! It was great to engage with the participants and present our research in fuzzing :) For more info, check the website or this LinkedIn post! Jun 29, 2025 Enjoyed the FUZZING’25 workshop with great participants and keynote speakers! Miryung Kim (UCLA and Amazon Web Services) talked about here research on constraining fuzzing and Will Wilson (Antithesis) provided interesting insights into career paths in fuzzing outside academia. Check our program and watch the keynote recordings! Jun 03, 2025 I have been invited to serve as the Artifact Evaluation Chair for FASE 2026! Looking forward to many great research artifacts :-) May 21, 2025 I have been invited to talk about my (postdoctoral) research experience in Singapore as part of the workshop and networking event “Doing research in (Greater) China” for STEM early career researchers organized by the China Competence Network Ruhr Niederrhein (C NET RNR). You find my slides here! May 09, 2025 I have been invited to serve on the Program Committee for FSE 2026! Looking forward to many great submissions!!! selected publications CSEE&T’25 Software Engineering Educational Experience in Building an Intelligent Tutoring System Zhiyu Fan, Yannic Noller, Ashish Dandekar, and Abhik Roychoudhury In 37th IEEE Conference on Software Engineering Education and Training (CSEE&T 2025), co-located with ICSE 2025., 2025 Abs PDF The growing number of students enrolling in Computer Science (CS) programmes is pushing CS educators to their limits. This poses significant challenges to computing education, particularly the teaching of introductory programming and advanced software engineering (SE) courses. First-year programming courses often face overwhelming enrollments, including interdisciplinary students who are not CS majors. The high teacher-to-student ratio makes it challenging to provide timely and high-quality feedback. Meanwhile, software engineering education comes with inherent difficulties like acquiring industry partners and the dilemma that such software projects are often under or over-specified and one-time efforts within one team or one course. To address these challenges, we designed a novel foundational SE course. This SE course envisions building a full-fledged Intelligent Tutoring System (ITS) of Programming Assignments to provide automated, real-time feedback for novice students in programming courses over multiple years. Each year, SE students contribute to specific short-running SE projects that improve the existing ITS implementation, while at the same time, we can deploy the ITS for usage by students for learning programming. This project setup builds awareness among SE students about their contribution to a “to–be–deployed\" software project. In this multi-year teaching effort, we have incrementally built an ITS that is now deployed in various programming courses. This paper discusses the Intelligent Tutoring System architecture, our teaching concept in the SE course, our experience with the built ITS, and our view of future computing education. TOSEM’25 Vulnerability Repair via Concolic Execution and Code Mutations Ridwan Shariffdeen, Christopher Timperley, Yannic Noller, Claire Le Goues, and Abhik Roychoudhury ACM Transactions on Software Engineering and Methodology (TOSEM), 2025 Abs Bib PDF Security vulnerabilities detected via techniques like greybox fuzzing are often fixed with a significant time lag. This increases the exposure of the software to vulnerabilities. Automated fixing of vulnerabilities where a tool can generate fix suggestions is thus of value. In this work, we present such a tool, called CrashRepair, to automatically generate fix suggestions using concolic execution, specification inference, and search techniques. Our approach avoids generating fix suggestions merely at the crash location because such fixes often disable the manifestation of the error instead of fixing the error. Instead, based on sanitizer-guided concolic execution, we infer desired constraints at specific program locations and then opportunistically search for code mutations that help respect those constraints. Our technique only requires a single detected vulnerability or exploit as input; it does not require any user-provided properties. Evaluation results on a wide variety of CVEs in the VulnLoc benchmark, show CrashRepair achieves greater efficacy than state-of-the-art vulnerability repair tools like Senx. The repairs suggested come in the form of a ranked set of patches at different locations, and we show that on most occasions, the desired fix is among the top-3 fixes reported by CrashRepair. @article{tosem25_crashrepair, title = {Vulnerability Repair via Concolic Execution and Code Mutations}, journal = {ACM Transactions on Software Engineering and Methodology (TOSEM)}, publisher = {Association for Computing Machinery}, year = {2025}, keywords = {Automated Program Repair, Vulnerability Repair, Semantic Program Analysis, Concolic Execution}, author = {Shariffdeen, Ridwan and Timperley, Christopher and Noller, Yannic and Goues, Claire Le and Roychoudhury, Abhik}, } ICST’24 Evolutionary Testing for Program Repair Haifeng Ruan, Hoang Lam Nguyen, Ridwan Shariffdeen, Yannic Noller, and Abhik Roychoudhury In 2024 17th IEEE International Conference on Software Testing, Verification and Validation (ICST), 2024 Abs DOI Bib PDF Supp Automated program repair (APR) allows for autonomous software protection and improvement. Many proposed repair techniques rely on available test suites, since tests are available in real-world settings. Tests are incomplete specifications, however. As a result, repairs generated based on tests may suffer from the test overfitting problem. The patches produced by APR techniques may pass the given tests and thus be plausible, and yet be an incorrect patch. This hints towards more extensive test suites to guide program repair. Generating additional tests to improve the test suite quality is generally difficult because the oracle or expected observable behavior of the generated tests is unknown. In our work, we first construct additional oracles by instrumenting buggy programs from the Defects4J benchmark with the knowledge obtained from the available bug reports. Then, we formulate a coevolution approach that generates tests and repairs in a unified workflow. The complete workflow is implemented as an extension of the well-known Java testing framework EvoSuite. This includes re-purposing the search in EvoSuite to search for repairs (instead of searching for tests) and enables an easy adoption for developers who are already familiar with EvoSuite for test suite generation. The evaluation of our tool EvoRepair shows that coevolution has a positive impact on the quality of patches and tests. In future, we hope that coevolution of patches and tests can inspire new repair tools and techniques. @inproceedings{evorepair, author = {Ruan, Haifeng and Nguyen, Hoang Lam and Shariffdeen, Ridwan and Noller, Yannic and Roychoudhury, Abhik}, booktitle = {2024 17th IEEE International Conference on Software Testing, Verification and Validation (ICST)}, title = {Evolutionary Testing for Program Repair}, year = {2024}, volume = {}, number = {}, pages = {105-116}, keywords = {Software testing;Java;Software protection;Instruments;Computer bugs;Maintenance engineering;Software;evolutionary testing;coevolution;automated program repair}, doi = {10.1109/ICST60714.2024.00058}, issn = {}, month = {}, } ICSE’22 Trust Enhancement Issues in Program Repair Yannic Noller, Ridwan Shariffdeen, Xiang Gao, and Abhik Roychoudhury In Proceedings of the 44th International Conference on Software Engineering, Pittsburgh, Pennsylvania, 2022 Abs DOI Bib HTML PDF Supp Slides Automated program repair is an emerging technology that seeks to automatically rectify bugs and vulnerabilities using learning, search, and semantic analysis. Trust in automatically generated patches is necessary for achieving greater adoption of program repair",
  "content_length": 18981,
  "method": "requests",
  "crawl_time": "2025-12-01 14:50:21"
}