{
  "name": "Yanning Shen",
  "homepage": "https://sites.google.com/uci.edu/yanning-shen",
  "status": "success",
  "content": "HomeSearch this siteEmbedded FilesSkip to main contentSkip to navigationYanning ShenAssociate ProfessorDepartment of EECSDepartment of CS (Joint appointment, WoS)University of California, IrvineEmail: yannings@uci.eduPublications Group MembersMy research interests span the areas of trustworthy machine learning, network science, and statistical signal processing, along with their applications in social, brain, gene-regulatory, environmental, financial, and IoT systems.I am looking for self-motivated undergrad and grad students. For students at UCI, please contact me and include your research interest, CV, transcripts, as well as writing samples (if any) in your email. For prospective graduate students, please apply to UCI ECE or Network Systems and mention my name in your application.Selected Awards  (See Awards tab for the full list)2025 NSF CAREER Award2024-2025 Academic Senate Distinguished Junior Faculty Award for Research2024 Samueli School of Engineering Faculty Excellence in Research Award2023 UCI CORCL Research Award2023 Newkirk Faculty Fellow2022 MIT Technology Review Innovators under 35 Asia Pacific2022-2023 Hellman Fellowship Award2022 Google Research Scholar Award2022 UCI CORCL Research Award2021 Microsoft Academic Grant Award for AI Research 2020 Academic Senate Council on Research, Computing, and Libraries (CORCL) Research Award2018-2019  Doctoral Dissertation Fellowship, UMN2017  Rising Stars in EECS News09/2025 Our paper \"Is Noise Conditioning Necessary? A Unified Theory of Unconditional Graph Diffusion Models\" was accepted by NeuRIPS 2025 as Spotlight (3%)!09/2025 Ms. Niqi Liu joined our group as a new PhD student! Welcome Niqi!08/2025 New collaborative work \"Deploying AI for Signal Processing education: Selected challenges and intriguing opportunities\" accepted by the IEEE Signal Processing Magazine.07/2025 Two papers accepted by the Asilomar Conference on Signals, Systems, and Computers 2025! Congratulations to Erfan and Deniz!06/2025 Our group got the NSF CAREER Award!05/2025 Deniz passed her PhD defense. Congratulations!05/2025 Ruijie passed his PhD candidacy exam. Congratulations!04/2025 Yanning started serving as an Associate Editor of IEEE Transactions on Signal and Information Processing over Networks02/2025 Yanning will be serving as a Technical Area Chair of Asilomar 202501/2025 Yanning is elected as a member of the IEEE SPM Technical Committee11/2024 Pouya passed his PhD defense. Congratulations!10/2024 Yanning organized the special session \"Machine Learning over Graphs\" in Asilomar 2024.09/2024 Four papers accepted by NeuRIPS 2024. Congratulations to Pouya, Deniz, and Erfan!09/2024 Our paper \"Long-term Fairness For Real-time Decision Making: A Constrained Online Optimization Approach\" R. Du, D. Muthirayan, P. P Khargonekar, Y. Shen is accepted by the IEEE Transactions on Neural Networks and Learning Systems. Congratulations to Ruijie on his first journal publication!09/2024 The group received a new NSF grant on \"BLoG: A Bi-Level Optimization Framework for Learning Over Graphs.\"08/2024 Yanning received the 2024-2025 Academic Senate Distinguished Junior Faculty Award for Research!07/2024 Our paper \"Fair Vision Transformer via Adaptive Masking\" B. Tian, R. Du, Y. Shen got was accepted by the European Conference on Computer Vision (ECCV 2024). Congratulations Bowei and Ruijie!Archived NewsSponsors:   Report abuseReport abuse",
  "content_length": 3410,
  "method": "requests",
  "crawl_time": "2025-12-01 14:50:23"
}