{
  "name": "Yann Chevaleyre",
  "homepage": "https://www.lamsade.dauphine.fr/~ychevaleyre",
  "status": "success",
  "content": "homepage Yann Chevaleyre I am Full Professor in computer science at Dauphine PSL, researcher in Artificial Intelligence. News Research positions. 1 PhD and 1 postdoc position on robustness in AI Research Interests Machine Learning Reinforcement Learning and Imitation in Robotics Game Theory, Multiagent Systems and Computational Social Choice Current Teaching Activities Advanced Topics in Machine Learning, M2 IASD Introduction to Machine Learning, M1 I2D Short Bio since 2024: responsible of the Data Science team in Lamsade with Khalid Belhajjame since 2017 : Full professor at LAMSADE, university of Paris Dauphine 2010 : Full professor at LIPN, head of the machine learning team 2002 : Assistant Professor at LAMSADE. 2001 : PhD in machine learning at LIP6 A Few Recent Publications Lucas Gnecco Heredia, Matteo Sammut, Muni Sreenivas Pydi, Rafael Pinot, benjamin negrevergne, Yann Chevaleyre, Unveiling the Role of Randomization in Multiclass Adversarial Classification: Insights from Graph Theory (AISTATS 2025) Léo Dana, Muni Sreenivas Pydi, Yann Chevaleyre, Memorization in Attention-only Transformers (AISTATS 2025) Alexandre Verine, Muni Sreenivas Pydi, Benjamin Negrevergne, Yann Chevaleyre, Optimal Budgeted Rejection Sampling for Generative Models (AISTATS 2024) Florian Le Bronnec, Alexandre Verine, Benjamin Negrevergne, Yann Chevaleyre, Alexandre Allauzen Exploring Precision and Recall to assess the quality and diversity of LLMs (ACL 2024) Alexandre Verine, benjamin negrevergne, Muni Sreenivas Pydi, Yann Chevaleyre, Precision-Recall Divergence Optimization for Generative Modeling with GANs and Normalizing Flows (Neurips 2023). Lucas Gnecco Heredia, Muni Sreenivas Pydi, Laurent Meunier, benjamin negrevergne, Yann Chevaleyre, On the Role of Randomization in Adversarially Robust Classification (Spotlight at Neurips 2023). Ikko Yamane, Yann Chevaleyre, Takashi Ishida, and Florian Yger, Mediated Uncoupled Learning and Validation with Bregman Divergences: Loss Family with Maximal Generality (AISTATS 2023) Laurent Meunier, Raphaël Ettedgui, Rafael Pinot, Yann Chevaleyre, Jamal Atif, Towards Consistency in Adversarial Classification (Neurips 2022). Geovani Rizk, Igor Colin, Albert Thomas, Rida Laraki, Yann Chevaleyre, An α-No-Regret Algorithm For Graphical Bilinear Bandits (Neurips 2022) Alexandre Verine, Benjamin Negrevergne, Fabrice Rossi, Yann Chevaleyre, On the expressivity of Normalizing Flows (ACML 2022) Rafael Pinot, Laurent Meunier, Florian Yger, Cédric Gouy-Pailler, Yann Chevaleyre, Jamal Atif, On the robustness of randomized classifiers to adversarial examples. Machine Learning Journal 111(9): 3425-3457 (2022) Alexis Duburcq, Guilhem Boéris, Nicolas Bredèche, Yann Chevaleyre, Reactive Stepping for Humanoid Robots using Reinforcement Learning: Application to Standing Push Recovery on the Exoskeleton Atalante. (IROS 2022) G. Rizk, A. Thomas, I. Colin, R. Laraki, Y. Chevaleyre, Best Arm Identification in Graphical Bilinear Bandits, International Conference on Machine Learning (ICML 2021) L. Meunier, M. Scetbon, R. Pinot, J. Atif, Y. Chevaleyre, Mixed Nash Equilibria in the Adversarial Examples Game, International Conference on Machine Learning (ICML 2021) A. Verine, B. Negrevergne, F. Rossi, Y. Chevaleyre On the expressivity of bi-Lipschitz normalizing flows, ICML Workshop on Invertible Neural Nets and Normalizing Flows (INNF 2021) L. Meunier, I. Legheraba, Y. Chevaleyre and O. Teytaud, Asymptotic convergence rates for averaging strategies, Foundations of Genetic Algorithms (FOGA 2021) A. Araujo, B. Negrevergne, Y. Chevaleyre, J. Atif, On Lipschitz Regularization of Convolutional Layers using Toeplitz Matrix Theory, 35th Conference on Artificial Intelligence (AAAI 2021) R. Pinot, R. Ettedgui, G. Rizk, Y. Chevaleyre, J. Atif, Randomization matters How to defend against strong adversarial attacks, International Conference on Machine Learning (ICML 2020). L. Meunier, Y. Chevaleyre, J. Rapin, C. Royer, O. Teytaud, On Averaging the Best Samples in Evolutionary Computation. (PPSN 2020). pp.661-674 A. Duburcq, Y. Chevaleyre, N. Bredeche, G. Boéris, Online trajectory planning through combined trajectory optimization and function approximation: Application to the exoskeleton Atalante. IEEE International Conference on Robotics and Automation (ICRA 2020), 3756-3762. Nominated for the Best Paper Award in Service Robotics. Alexandre Araujo, Benjamin Negrevergne, Yann Chevaleyre and Jamal Atif. Understanding and Training Deep Diagonal Circulant Neural Networks 24th European Conference on Artificial Intelligence (ECAI 2020) K. Belahcene, N. Sokolovska, Y. Chevaleyre, J.-D. Zucker. Learning Interpretable Models using Soft Integrity Constraints, ACML 2020. M. Clertant, N. Sokolovska, Y. Chevaleyre, B. Hanczar, Interpretable Cascade Classifiers with Abstention (AISTATS 2019) For more Publications, see google scholar or DBLP Current PhD supervision Khunao Zheng, working on Automatic Test Generation for Code Execution with LLMs, at META, co-supervised with Benjamin Negrevergne Lucas Gnecco, working on Improved Defenses against Adversarial Attacks with Mixtures of Classifiers, co-supervised with Benjamin Negrevergne. Alexandre Vérine, working on Expressivity of Normalizing Flows, co-supervised with Benjamin Negrevergne and Fabrice Rossi. Louis-Henri Fernandez, working on Deep Learning for Physics applied to Maxwell Equations, at ST-Microelectronics. Recent past PhD supervision Geovani Rizk, working on Graphical Bandits, co-supervised with Rida Laraki. (CIFRE with Huawei) Raphael Ettedgui, working on Game Theory and Adversarial Attacks co-supervised with Jamal Atif and Rafael Pinot Alexis Duburcq, working on Machine Learning and Reinforcement Learning for Exoskeleton trajectory optimization. (CIFRE with WanderCraft). Contact Information e-mail: yann.chevaleyre (at) dauphine.fr postal address: Université Dauphine - PSL, Laboratoire LAMSADE, Place du Maréchal de Lattre de Tassigny, 75 775 Paris Cedex 16, France.",
  "content_length": 6006,
  "method": "requests",
  "crawl_time": "2025-12-01 14:50:21"
}