{
  "name": "Yannic Maus",
  "homepage": "https://academia.yannicmaus.de",
  "status": "success",
  "content": "Yannic Maus Home Publications More Yannic Maus We are looking for PhD students! I am a university professor at the Faculty of Computer Science and Biomedical Engineering at TU Graz, Austria, where I also head the Institute of Algorithms and Theory (founded in 2025). I am also (co)-leader of one of the five field of expertise (FoE) at TU Graz (FoE Information, Communication & Computation). I am grateful for the support of the FWF grants P36280-N (2023-2027), DOC 183 (2024-2028) and I6915 (2024-2028), and FFG grant No. 59263962. Contact Information Institute of Algorithms and Theory Münzgrabenstraße 36/II 8010 Graz, Austria Email: first-name.last-name at tugraz.at Bachelor and Master Thesis: I am always offering bachelor and master thesis for interested students. Topics range from distributed graph algorithms, efficient algorithms, data structures, complexity theory, and geometric algorithms. Research Interests I am interested in all kinds of problems in theoretical computer science and algorithm design, especially in problems that arise in the context of distributed computing. On the one hand, I am fascinated by clean mathematical questions and the techniques involved in solving them; on the other hand, I enjoy if these questions are motivated by real world systems. Before joining TU Graz I was a postdoctoral researcher at the Technion in Israel in the group of Keren Censor-Hillel. Earlier I received a PhD from the Algorithms and Complexity group at the University of Freiburg (Germany) under the supervision of Fabian Kuhn. When I am not involved with research chances are pretty high that you can find me on one of my bicycles, on the road or offroad. Or, in winter times you might find me enjoying the technical and physiological components of cross country skiing. Impressum",
  "content_length": 1801,
  "method": "requests",
  "crawl_time": "2025-12-01 14:50:21"
}