{
  "name": "Yannick Forster 0002",
  "homepage": "https://yforster.de",
  "status": "success",
  "content": "Yannick Forster I am a tenured researcher (“chargé de recherche”) at Inria in the Cambium team in Paris. My research focuses on proof assistants. I am interested in formalisation of models of computation and complexity, code extraction and compilation, meta-programming, type theory, and constructive and synthetic mathematics. Much of my research involves the proof assistant Rocq. See below for a list of projects. I am excited about any potential collaborator for any of these topics, if you are interested in working with me please get in touch no matter your location or experience – including no or little experience! Before joining Cambium, I was a Marie Skłodowska-Curie fellow at Inria in the Gallinette team in Nantes. And before that, I did my PhD at Saarland University with Gert Smolka. News In October 2025 Mathis Bouverot-Dupuis is starting his PhD on guarantees for meta-programming, co-supervised by François Pottier. Timothée Huneau is starting his PhD on constructive and classical reverse mathematics related to model theory, co-supervised by Dominik Kirst and Sam van Gool. Sara Rousta is starting her Master’s thesis on realisability in synthetic computability, co-supervised by Dominik Kirst. Jean Caspar is starting a 4 months internship on continuity properties for partial functions in constructive mathematics. Together with Corina Cirstea, I am a PC chair of CSL ’27. I am in the PC of ITP ’26. Older news Together with Chantal Keller, I am a PC chair of ITP ’25. I gave an invited talk at LFMTP ’25 on obtaining executable programs from dependently typed proof assistants. I am in the PC of CICM ’25. From April to August, Simon Dima will do an internship with me on extraction of programs from proof assistants, and Timothée Huneau on a Rocq proof on the Downward Löwenheim Skolen theorem for arbitrary cardinalities, co-supervised by Dominik Kirst. In June and July, Hugo Segoufin-Chollet will do an internship on defining the semantics of a sublanguage of CakeML in Rocq. I’m very proud of my students who got abstracts accepted at TYPES ’25: Janis Bailitis on Löb’s Theorem and Provability Predicates in Rocq (joint work with Dominik Kirst), Mathis Bouverot-Dupuis on Code Generation via Meta-programming in Dependently Typed Proof Assistants (Experience Report), and Yee-Jian Tan on Towards Formalising the Guard Checker of Rocq. I am an invited speaker at CSL ’25 in Amsterdam in February. I am an invited speaker at the Simons Institute for the Theory of Computing and SLMath Joint Workshop: AI for Mathematics and Theoretical Computer Science in Berkeley in April I was in the PC of PLDI ’25. The 5-th busy beaver number is 47,176,870. I reviewed the Coq proof and can confirm that it proves what it claims to prove. This Quanta Magazine article has the full story, and this Le Monde article has a shorter story in French. From September to November, I will be teaching the course on proof assistants in the Parisian Master of Research in Computer Science (MPRI) together with Théo Winterhalter. Thomas Lamiaux started his PhD in September in Nantes, and will work with Nicolas Tabareau, Matthieu Sozeau, and me on Coq’s guard condition. Mathis Bouverot-Dupuis will do a 5 months long internship with me, working on meta-programming in proof assistants based on dependent type theory. From May to August, I had two interns working on the MetaCoq project: Yee-Jian Tan, working on a reimplementation and specification of Coq’s guard condition, and Weituo Dai, working on scope guarantees for meta-programs. I am workshop co-chair of ICFP ’24 together with Chandra Nandi. I gave an invited talk on Synthetic Computability without Choice at the Panhellenic Logic Symposium in Thessaloniki, reporting on joint work with Dominik Kirst, Gert Smolka, Felix Jahn, Niklas Mück, and Haoyi Zeng. Our paper Separating Markov’s Principles, joint work with Liron Cohen, Dominik Kirst, Bruno da Rocha Paiva, and Vincent Rahli, got accepted at LICS ’24. Our paper Verified Extraction from Coq to OCaml, joint work with Matthieu Sozeau and Nicolas Tabareau, got accepted at PLDI ’24 and was chosen as a distinguished paper! I will attend TYPES ’24. Lots of interesting talks in session 4! Our paper The Kleene-Post and Post’s Theorem in the Calculus of Inductive Constructions with Dominik Kirst and Niklas Mück was accepted at CSL ’24 (pre-print). We ran a tutorial on MetaCoq at POPL, on Sunday, January 14th, with Meven Lennon-Bertrand, Matthieu Sozeau, and Théo Winterhalter. As of December 1st, I joined the Cambium team at Inria Paris on a permanent position. From September to November I taught the course on proof assistants in the Parisian Master of Research in Computer Science (MPRI) together with Théo Winterhalter. Our paper Oracle Computability and Turing Reducibility in the Calculus of Inductive Constructions with Dominik Kirst and Niklas Mück was accepted at APLAS ’23. New pre-print on hal: Correct and Complete Type Checking and Certified Erasure for Coq, in Coq, with Matthieu Sozeau, Meven Lennon-Bertrand, Jakob Botsch Nielsen, Nicolas Tabareau, and Théo Winterhalter. I gave 3 lectures on Coq, MetaCoq, and (verified) extraction at the Proof and Computation 2023 autumn school in Herrsching near Munich in September. Slides for lecture 1 on Coq, lecture 2 on MetaCoq, lecture 3 on verified extraction. I will attend ICFP 2023 in Seattle where I served as workshop co-chair with Arthur Azevedo de Amorim. I gave a talk on Synthetic Computability in Constructive Type Theory in the special session on proof assistants at CALCO & MFPS 2023 in Bloomington, Indiana. I was an invited speaker at TYPES 2023 in Valencia and gave a talk about verified extraction from Coq to OCaml. At TYPES, I also gave a talk on Markov’s Principles in Constructive Type Theory, joint work with Dominik Kirst, Bruno da Rocha Paiva, and Vincent Rahli. Our paper A Computational Cantor-Bernstein and Myhill’s Isomorphism Theorem in Constructive Type Theory with Felix Jahn and Gert Smolka was accepted at CPP 2023. Pre-print on hal. Our paper Constructive and Synthetic Reducibility Degrees: Post’s Problem for Many-one and Truth-table Reducibility in Coq with Felix Jahn was accepted at CSL 2023. Pre-print on hal. The TYPES conference in Nantes has lots of interesting talks! I was involved in several: On Tuesday, Tiago Cogumbreiro will present our work Towards a Mechanized Theory of Computation for Education. Immediately afterwards, Felix Jahn will talk about our joint work with Gert Smolka, Myhill Isomorphism Theorem and a Computational Cantor-Bernstein Theorem in Constructive Type Theory. Then I’ll give a talk on Synthetic Turing Reducibility in CIC, joint work with Dominik Kirst. On Wednesday, I’ll be talking about Aspects of a machine-checked intermediate language for extraction from Coq, in MetaCoq, joint work with Matthieu Sozeau. And on Thursday, Dominik Kirst will talk about our Synthetic Versions of the Kleene-Post and Post’s Theorem, joint work with Niklas Mück. Our paper Synthetic Kolmogorov Complexity in Coq with Fabian Kunze and Nils Lauermann got accepted at ITP ’22! Two new pre-prints out! With Felix Jahn and Gert Smolka: A Constructive and Synthetic Theory of Reducibility: Myhill’s Isomorphism Theorem and Post’s Problem for Many-one and Truth-table Reducibility in Coq. With Fabian Kunze and Nils Lauermann: Synthetic Kolmogorov Complexity in Coq. My paper Parametric Church’s Thesis: Synthetic Computability without Choice got accepted at LFSC ’22 and won the Rosser Prize. LFCS has free online participation! Current Students Timothée Huneau, PhD student, co-supervised with Dominik Kirst and Sam van Gool. Starting October 2025. Mathis Bouverot-Dupuis, PhD student, co-supervised with François Pottier. Starting September 2025. Thomas Lamiaux, PhD student, co-supervised with Nicolas Tabareau and Matthieu Sozeau. Started September 2024. Projects Verified extraction and compilation I am interested in using the Coq proof assistant as a system to obtain verified executable programs: I co-developed verified extraction from Coq to OCaml (PLDI ’24); I am involved in the MetaCoq project, a formalisation and implementation of Coq in Coq, where I verified type and proof erasure (POPL ’20); and I am a team member in the CertiCoq project, a verified compiler from Coq to C. Synthetic computability Synthetic computability was pioneered by Richman, Bridges, and Bauer in different flavours of constructive logic. In synthetic computability theory, the fact that all definable functions in constructive logic are computable is made explicit via axioms. Thereby, formalisations can focus on the mathematical essence of results and on rigorous simplification of proofs rather than on encoding programs in model of computation. Since synthetic computability in most presentations assumes the axiom of countable choice the theory becomes anti-classical, i.e. the law of excluded middle is disprovable. When choosing constructive type theory as implemented by the Coq proof assistant as foundation for synthetic computability, classical logic via the law of excluded middle can be consistently assumed. We gave a general discussion of the axiom CT (Church’s Thesis) in relation to other axioms for Coq’s type theory (CSL ’21) an introduction to Parametric Church’s Thesis and synthetic computability without choice (LFCS 22), a definition of Kolmogorov complexity (ITP ‘22’), a solution for Post’s problem for many-one and truth-table reducibility (CSL ’23), a definition of oracle computability and Turing reductions (APLAS ‘23’), and a proof of Post’s hierarchy theorem (CSL ‘24’). Synthetic undecidability Decidability and undecidability proofs are the subarea of computability theory with the most influence on general theoretical computer science. Both kinds of proofs are often intricate and their details are error-prone: Several later retracted results have been published at renowned venues. Synthetic undecidability offers a method to verif",
  "content_length": 25260,
  "method": "requests",
  "crawl_time": "2025-12-01 14:50:23"
}