{
  "name": "Yanqiu Wu 0002",
  "homepage": "https://sites.google.com/nyu.edu/yanqiu-autumn-wu/home",
  "status": "success",
  "content": "YWSearch this siteEmbedded FilesSkip to main contentSkip to navigationYanqiu (Autumn) WuBiographyI am Yanqiu (Autumn) Wu, currently employed as a Lecturer in Artificial Intelligence at Macquarie University, School of Computing. From October 2022 to January 2024, I was a CSIRO Early Research Career (CERC) Post-doctoral Fellow in the Distributed Systems Security group, Data61, CSIRO. My current research interests are in the fields of Quantum Machine Learning and Deep Reinforcement Learning. In September 2022, I completed my doctoral degree in Computer Science from New York University (NYU) under the guidance of Professor Keith W. Ross. During my PhD studies, I worked in the area of deep reinforcement learning. Prior to that, I received my B.S. degree from New York University Shanghai. Contacts yanqiu.wu@mq.edu.auyanqiu.wu@nyu.eduPublicationsPhD ThesisYanqiu Wu. Improving Sample Efficiency in Off-policy and Offline Deep Reinforcement Learning. NYUConferencesYanqiu Wu, Xinyue Chen, Che Wang, Yiming Zhang, Zijian Zhou, Keith Ross. Aggressive Q-Learning with Ensembles: Achieving Both High Sample Efficiency and High Asymptotic Performance. 36th Conference on Neural Information Processing Systems Deep Reinforcement Learning Workshop (NeurIPS) 2022 Che Wang*, Yanqiu Wu*, Quan Vuong, Keith Ross. Striving for Simplicity and Performance in Off-Policy DRL: Output Normalization and Non-Uniform Sampling. Proceedings of the 37th International Conference on Machine Learning (ICML) 2020  *Equal ContributionXinyue Chen, Zijian Zhou, Zheng Wang, Che Wang, Yanqiu Wu, Qing Deng, and Keith W. Ross. BAIL: Best-Action Imitation Learning for Batch Deep Reinforcement Learning.  34th Conference on Neural Information Processing Systems (NeurIPS) 2020Minhui Xue, Cameron Ballard, Kelvin Liu, Carson Nemelka, Yanqiu Wu, Keith W. Ross, Haifeng Qian. You Can Yak But You Can’t Hide: Localizing Anonymous Social Network Users. Proceedings of the 2016 Internet Measurement Conference (2016)JournalsYanqiu Wu, Qingyang Li, Zhiwei Qin. Spatio-temporal Incentives Optimization for Ride-hailing Services with Offline Deep Reinforcement Learning. Computing Research Repository (CoRR) 2022Yanqiu Wu, Tehila Minkus, and Keith W. Ross. Takg the Pulse of US College Campuses with LocationBased Anonymous Mobile Apps. ACM Transactions on Intelligent Systems and Technology (2017)Academic ServiceProgram CommitteeThe inaugural AsiaCCS 2023 Workshop on Secure and Trustworthy Deep Learning Systems (SecTL 2023)ReviewerConference on Neural Information Processing Systems (NeurIPS)The International Conference on Machine Learning (ICML)The International Conference on Learning Representations (ICLR)The International Joint Conference on Artificial Intelligence (IJCAI)ACM SIGKDD International Conference on Knowledge Discovery and Data Mining (KDD)Report abusePage detailsPage updated Report abuse",
  "content_length": 2878,
  "method": "requests",
  "crawl_time": "2025-12-01 14:50:25"
}