{
  "name": "Yanwen Guo 0001",
  "homepage": "https://cs.nju.edu.cn/ywguo",
  "status": "success",
  "content": "Yanwen Guo Yanwen Guo HomeResearch Publications Team PhotosContact Yanwen Guo 郭延文 博士 教授 博士生导师 Affiliations: Department of Computer Science and Technology, Nanjing University National Key Lab for Novel Software Technology Contact Info: Phone:0086-25-8968-0928 Email: ywguo [at] nju.edu.cn ywguo.nju [at] gmail.com URL: cs.nju.edu.cn/ywguo Dr. Yanwen Guo is currently a full professor in the Department of Computer Science and Technology , Nanjing University. He is also affiliated with the National Key Laboratory for Novel Software Technology. He received the PhD degree from State Key Lab of CAD&CG, Zhejiang University in 2006, and his supervisor is Prof. Qunsheng Peng. He worked as a visiting professor in the Department of Computer Science and Engineering, The Chinese Unviersity of Hong Kong in 2006, 2008, and 2009 and a visiting professor in Department of Computer Science, The Unviersity of Hong Kong in 2008, 2012, and 2013, the University of Illinois at Urbana-Champaign (UIUC) in 2013. His research interests mainly include Graphics, Image and Video analysis and processing, and Computer Vision. He has published more than 50 technical papers refereed at Graphics and Multimedia journals and conferences, including IEEE Trans. on Visualization & Computer Graphics, IEEE Trans. on Multimedia, Computer Vision and Image Understanding, Computer Graphics Forum, The Visual Computer, Computer Animation and Virtual Worlds, European Conference on Computer Vision, Pacific Graphics, IEEE Intl. Conf. on Image Processing, etc. He received the Third Prize of Lu Zeng Yong CAD&CG High-Tech Awards in 2008. He now serves as the principal or main investigator of several research projects such as National Natural Science Foundation of China and the National Fundamental Research Program of China(973). He has accomplished two project of National Natural Science Foundation of China, one NSF Key project, and two projects of Natural Science Foundation of Jiangsu Province, and the collaborative projects with Samsung Electronics China R&D Center and Nanjing Automation Research Institute separately. Research Interests Computer graphics Image and video analysis and processing Surveillance video analysis Image and video content adaptation Image representation and object tracking Awards 江苏省杰出青年科学基金获得者, 2015 江苏省“六大人才高峰”第十批高层次人才项目, 2013 Confidence-Driven Image Co-matting， Proc. CAD/Graphics 2013, Best Paper Honorable Mention 江苏省科技社团优秀青年人才 苏科协发（2013）14号文件 Bank of China Teaching Grants(南京大学第三届中国银行奖教金), 2012 南京大学本科生创新项目优秀指导教师, 2012 南京大学首批优青师计划入选者, 2012 江苏高校“青蓝工程”中青年学术带头人培养对象, 2012 南京大学推荐申报教育部新世纪优秀人才, 2012 Talented Young Teacher of Nanjing University, 2008 Third Prize of Lu Zeng Yong CAD&CG High-Tech Awards, 2006 Work Experience Professor, Department of Computer Science and Technology, Nanjing University, P. R. China. Visiting Scholar, Coordinated Science Lab, University of Illinois at Urbana-Champaign (UIUC), with Prof. Minh N. Do (IEEE Fellow), Oct. 2013 to Sept. 2015 Visiting Professor, Department of Computer Science, The University of Hong Kong, with Prof. Wenping Wang. Jul. 2013 Visiting Professor, Department of Computer Science, The University of Hong Kong, with Prof. Wenping Wang. Mar. 2012 Visiting Professor, Department of Computer Science and Engineering, The Chinese University of Hong Kong, with Prof. Hanqiu Sun. Aug. 2010 Visiting Professor, Department of Computer Science and Engineering, The Chinese University of Hong Kong, with Prof. Hanqiu Sun. Jul. 2009 Visiting Researcher, Department of Computer Science, The University of Hong Kong, with Prof. Wenping Wang. Jun.2008-Aug. 2008 Research Assistant, Department of Computer Science and Engineering, The Chinese University of Hong Kong with Prof. Hanqiu Sun. Mar.2006-Aug. 2006 Professional Activities 江苏省计算机学会 图像图形专业委员会 主任 江苏省工程师学会 虚拟现实专业委员会 主任 第八届中国虚拟现实大会 暨 The 8th International Conference on Virtual Reality and Visualization，PC Co-Chair Pacific Graphics 2018, CVPR 2018, ICCV 2017, BMVC 2018 PC Member International Conference on CYBERWORLDS 2016, Program Co-Chair [CFP] GMP 2016, ECCV 2016, Chinagraph 2016 PC Member ICCV 2015, CVPR 2016 PC Member CAD/Graphics 2015 PC Member, Best Reviewer ECCV 2014, ACCV 2014, Chinagraph 2014, CAD&CG 2014, ICCV 2013, PSIVT 2013 PC Member 中国计算机学会计算机辅助设计与图形学专委会 常务委员 《中国科学》、Frontier Computer Science、The Visual Computer、IEEE Trans. on Image Processing、《计算机辅助设计与图形学学报》等刊审稿人 Springer国际期刊Frontiers of Computer Science in China 青年Associate Editor (入选FCS青年AE计划) 中国计算机学会青年科技论坛委员；南京分论坛2012年度学术委员会副主席 Siggraph Asia 2012 Posters Program Committee Member ACCV 2012 PC Member NBiS 2012 PC member Chinagraph 2008, 2010, 2012程序委员会委员 CAD&CG 2010, 2012程序委员会员 CAD&Graphics 2009, 2011 PC Member Chinagraph 2010程序委员会秘书长 Courses C++ Programming Language (Winter Semester, 2010, 2011, 2012) for undergradute students Real-time Rendering (Winter Semester, 2009, 2012) for postgraduate students Talk 图像和视频的协同分析与分割， 2015年10月18日 中国虚拟现实大会 厦门大学，2015年10月30日 北京工商大学，2015年11月11日 中国科协第292次青年科学家论坛 中科院计算所 Content-aware Photo Collage Using Circle Packing, 2015年9月24日 南京航空航天大学， 2015年10月16日 厦门大学 面向公共安全的监控视频分析与处理, 2013年6月,安徽大学 Multi-view Video Summarization with Applications to Surveillance Video Processing. The 3rd Sino-French Virtual Reality Seminar, July, 2012, Qingdao, China Multi-view Video Summarization, March 21, 2012, Department of Computer Science, The University of Hong kong Photo Quality Assessment and Enhancement, August, 2011, Samsung (China) R&D Center Summarization of Visual Media Data, High Level Seminar on Computer Graphics in Chinagraph 2010 Mesh Parameterization for Content-aware Image Retargeting, July 24, 2009, Department of Computer Science and Engineering, The Chinese University of Hong Kong Mesh Parameterization with Applications to Image Processing, July 2008, Department of Computer Science, The University of Hong kong Copyright 2006-2013 Yanwen Guo Since 22 Mar,2014 visiters have arrived.",
  "content_length": 5917,
  "method": "requests",
  "crawl_time": "2025-12-01 14:50:28"
}