{
  "name": "Yanwei Fu 0001",
  "homepage": "https://yanweifu.github.io",
  "status": "success",
  "content": "Yanwei Fu | School of Data Science, Fudan University. Yanwei Fu is a full professor (tenured) at the School of Data Science, Fudan University, Shanghai China. Prof. Fu is also a faculty with Shanghai Innovation Institute (sii.edu.cn). He is Professor of Eastern Scholar, Shanghai (上海高校特聘教授 – 东方学者), 1000 young scholar (青千)，and ARC DECRA fellow. Research interests The core scientific problem I investigate centers on few-shot learning, which seeks to emulate the human ability of “learning to learn”—enabling models to acquire new concepts and generalize to unseen tasks from limited data. This line of research focuses on how to effectively integrate prior knowledge with scarce samples to achieve robust knowledge transfer and generalization. While large-scale models such as Transformers and Diffusion networks have achieved remarkable success in 2D perception, they still encounter significant challenges under data-sparse conditions, particularly in 3D reconstruction and multi-modal learning. Addressing these limitations drives my exploration of broader yet closely related applications, including vision-guided robotic learning and fMRI-based neural decoding, where data scarcity and generalization remain fundamental bottlenecks. I’m particularly interested in these topics recently, 1, Few-Shot Learning Theory and Algorithms: Large models often rely on massive labeled datasets, yet data collection is costly and prone to bias and noise. My research develops meta-learning and statistical frameworks—drawing on extreme value theory, causality, and sparsity—to enable models to learn and generalize effectively from limited samples. 2, Few-Shot 3D Reconstruction: 3D reconstruction typically requires dense viewpoints and extensive data, while real-world acquisition remains limited. I integrate prior knowledge, neural networks, and optimization methods to recover accurate 3D structures from sparse observations, advancing practical applications in this domain. 3, Multi-Modal Few-Shot Learning: Learning from multi-modal data—combining images, videos, audio, and sensor signals—requires efficient cross-modal fusion under data scarcity. I design frameworks that enhance generalization across modalities, enabling robots, for example, to learn 6DoF pose estimation and grasping from only a few demonstrations. Timeline Jan. 2015 – July 2016, postdoctoral researcher, Disney Research Pittsburgh with Dr. Leon Sigal Sep. 2011 – Nov. 2014 PhD in Computer Vision, Queen Mary University of London, with Prof. Tao Xiang (Tony) and Prof. Shaogang Gong (Sean) Sep. 2008 – Jun. 2011 Master in Computer Science, Nanjing University with Prof. Yanwen Guo. Please donot contact me via my QMUL email address, which has been suspended. 关于本组招生：大数据学院科学硕士及直博生是统一招生（而不是分配给导师名额）。所以感兴趣我们组的话，可以直接去申请拿到学院的offer，再联系我即可。申请普博或者Oversea students想来我们组做summer intern的话，可以提前联系我。 大家有兴趣联系我们，可以email联系我。 有兴趣做statistical sparsity的本科同学，可以直接联系孙鑫伟老师，我们可以一起合作。 **注意：本组2025年入学的硕士已经招满，没有名额了。 ** Recent News 05/2025 “A Unified Diffusion Bridge Framework via Stochastic Optimal Control” has been selected as the Long Paper Outstanding Paper Award Winner at the DeLTa Workshop, held in conjunction with ICLR 2025. 03/2024 Chenjie Cao passed his PhD Viva, and Dr. Xuelin Qian will join Northwestern Polytechnical University (NWPU) as Associate Professor. 03/2024 I am holding CVPR tutorial from 2022 to 2024. Hopefully, I can get US visa for the trip. 03/2024 I will organize CVPR 2024 object-centric represenation tutorial with Tong He, Tianjun Xiao, and Francesco Locatello. https://object-centric-representation.github.io/object-centric-tutorial-2024/ 12/2023 Dr. Yanwei Fu is a full professor of Fudan University, starting from Dec. 2023. 07/2023 1 IROS 2023 paper, and 7 ICCV 2023 papers accepted 06/2023 I will organize CVPR 2023 few-shot learning tutorial with Yikai Wang, Da Li, Yu-Xiong Wang, Timothy Hispedales: https://fsl-fudan.github.io 05/2023 Chengming Xu, Boyang Jiang, Yuqian Fu, and Qiang Sun passed their PhD Viva. Congratulations! 05/2023 One IEEE TPAMI paper accepted – ZITS++ 01/2023 I will serve as ICML 2023 Area Chair. I guess it may be still challenging, as ML community always likes to make some experiments in exploring a better review process. 12/2022 One IEEE TPAMI and one TMLR paper accepted! The TPAMI one about identifying causal features in one-shot learning; TMLR one is about DINO features for MVS, which took the first place in tank and temples Leaderboard , during the past 6 months. We released their codes. This year, our group has 4 accepted IEEE TPAMI papers, 2 accepted TMLR paper. 12/2022 Yu Xie, and Pan Li passed their PhD Viva. Congratulations! 08/2022 I  will organize the tutorial “The Priors Guided Image Editing and Synthesis” with Prof. Shenghua Gao, Mr. Chenjie Cao, and Mr. Qiaole Dong in ACCV 2022, held in Macau SAR, China. https://dqiaole.github.io/priors_guided_image_editing_synthesis/`` 07/2022 We organize the 2nd Visual Intelligence Seminar on Few-shot Learning with Online videos 07/2022 Our MVSFormer has ranked as Top-1 (since May) on the leaderboard 07/2022 Two ACM MM2022 and Three ECCV2022 papers accepted. 06/2022 I am a Fellow member of BCS. 06/2022 I organized a CVPR 2022 tutorial of “Sparsity Learning in Neural Networks and Robust Statistical Analysis”, jointly with  Dr. Xinwei Sun, Prof. Yuan Yao, and Prof. Wotao Yin. 05/2022 Three IEEE TPAMI papers accepted. 03/2022 I am in the action editor list of Transactions on Machine Learning Research. 02/2022 Ten papers accepted to CVPR 2022 02/2022 Two papers accepted to ICRA 2022 01/2021 We organize the 1st Visual Intelligence Seminar on Few-shot Learning. Media Interview 05/2023 https://m.thepaper.cn/newsDetail_forward_23279276 ``````````````````````",
  "content_length": 5746,
  "method": "requests",
  "crawl_time": "2025-12-01 14:50:31"
}