{
  "name": "Yanxue Jia",
  "homepage": "https://www.iit.edu/directory/people/yanxue-jia",
  "status": "success",
  "content": "Yanxue Jia | Illinois Institute of Technology Skip to main site navigation Skip to main content Yanxue Jia Assistant Professor of Computer Science Tags: Faculty Computer Science Home Office and Department Directory Directory Yanxue Jia EducationPh.D. Computer Science, Shanghai Jiao Tong UniversityResearch InterestsCybersecurityPublications\"Proxying is Enough: Security of Proxying in TLS Oracles and AEAD Context Unforgeability\"Zhongtang Luo, Yanxue Jia, Yaobin Shen, Aniket Kate (AFT 2025 / SBC 2024)\"Cauchyproofs: Batch-Updatable Vector Commitment with Easy Aggregation and Application to Stateless Blockchains\"Zhongtang Luo, Yanxue Jia, Alejandra Victoria Ospina Gracia, Aniket Kate (IEEE S&P 2025)\"HomeRun: High-efficiency Oblivious Message Retrieval, Unrestricted\"Yanxue Jia, Varun Madathil, Aniket Kate (CCS 2024)\"Scalable Private Set Union, with Stronger Security\"Yanxue Jia, Shi-Feng Sun, Hong-Sheng Zhou, Dawu Gu (USENIX Security 2024)\"A Universally Composable Non-Interactive Aggregate Cash System\"Yanxue Jia, Shi-Feng Sun, Hong-Sheng Zhou, Jiajun Du, Dawu Gu (Asiacrypt 2022)\"Shuffle-based Private Set Union: Faster and More Secure\"Yanxue Jia, Shi-Feng Sun, Hong-Sheng Zhou, Jiajun Du, Dawu Gu (USENIX Security 2022)\"Redactable Blockchain Supporting Supervision and Self-Management\"Yanxue Jia, Shi-Feng Sun, Yi Zhang, Zhiqiang Liu, Dawu Gu (AsiaCCS 2021)\"PBT: A New Privacy-Preserving Payment Protocol for Blockchain Transaction\" Yanxue Jia, Shi-Feng Sun, Yuncong Zhang, Qingzhao Zhang, Ning Ding, Zhiqiang Liu, Joseph Liu, Dawu Gu (IEEE TDSC 2020) Contact Information yjia12@illinoistech.edu Website SB 217C Learn more... Illinois Tech welcomes you to join our community of people who discover, create, and solve. Apply today, visit us in Chicago, and contact us for more information. Request Info Visit Apply",
  "content_length": 1823,
  "method": "requests",
  "crawl_time": "2025-12-01 14:50:31"
}