{
  "name": "Yanyan Jiang 0001",
  "homepage": "http://ics.nju.edu.cn/~jyy",
  "status": "success",
  "content": "Yanyan Jiang | Institute of Computer Software é¦é¡µ ç»ç» æ´»å¨ è¯¾ç¨ æç èµæº Home Yanyan Jiang Yanyan Jiang èçå²© (Tenure-track) Associate Professor,SPAR - CASTLE Joint Group, School of Computer Science and Technology,Nanjing University. Room 0b1111111111, CST Building, Nanjing University Xianlin Campus. Research I'm interested in fun stuffs on constructing and torturing software systems, literally anything. Selected publications: Yanyan Jiang, âThe hitchhiker's guide to operating systemsâ, in Proceedings of the 2023 USENIX Annual Technical Conference (USENIX ATC), 929â943, 2023. Hanzhi Liu, Yanyan Jiang, and Chang Xu, âUnderstanding the Linux kernel, visuallyâ, Proceedings of the 20th European Conference on Computer Systems (EuroSys), 1044â1060, 2025 (Best Student Paper ð ). Cong Li, Yanyan Jiang, Chang Xu, and Zhendong Su, âValidating JIT compilers via compilation space explorationâ, in Proceedings of the 29th Symposium on Operating Systems Principles (SOSP), 66â79, 2023 (Best Paper ð ). And the full publication list. Teaching Yanyan's Wiki and âThe Green Advisorâ Operating Systems; test case design and plagiarism detection (Needle [SIGCSE-China18]). Project-N (with Zihao Yu ä½å­æ¿ ) in which undergraduate students build a complete computer system (SoC, full-system emulator, operating system, etc.) from scratch. Students I'm looking for students excited to try out some crazy ideas, and ready to get hands dirty over the next few yearsâso that together we can turn ambitious projects into real, commercial work. [Caveat: I can be a bit of a hardass.] Current (åéä¿¡) PhD: åçä¹ (2020), å¨æå¯ (2021), çå ç (2021), é«å¹ç« (2023), èµµè¶ æ¿ (2023), æ¹äºå¸ (2024), è°­æ£®çª (2024) Master: åæ³½æ£® (2023), è§å­å¥ (2024), éåæ (2025) Past students Services Program Committee Member: EuroSys'26, SOSP'25, EuroSys'25, ASE'23, ASE'21, SANER'23, SANER'22, Internetware, ChinaSoft, ChinaSys (I'm PC Chair of ChinaSys'25 Spring). Steering Committee Member of Jiangsu Olympiad in Informatics; Technical Committee Member of APIO'22â24. Honors and Awards 2024 ACM China Rising Star Award (Top 2 in China) and ACM ChinaSys Rising Star Award. 2024 The Teacher Award Program for Computer Science in Chinese Universities (é«æ ¡è®¡ç®æºä¸ä¸ä¼ç§æå¸å¥å±è®¡å). 2024 The Favorite Teacher at Nanjing University (ææåç±çèå¸, Nominated by Students). 2023 Best Paper Award of the 29th ACM Symposium on Operating Systems Principles (SOSP'23). 2022 Xiaomi Youth Innovation Award (å°ç±³éå¹´å­¦è ç§æåæ°å¥). 2021 NASAC Youth Software Innovation Award (NASAC éå¹´è½¯ä»¶åæ°å¥). 2021 ACM SIGSOFT Distinguished Paper Award and ACM European Best Paper Award (ICSE'21). 2018-2020 CCF Elite Youth Scientists Sponsorship Program (CCF éå¹´äººææä¸¾è®¡å; Top 6 in China). 2018 ACM SIGSOFT Distinguished Paper Award (ASE'18). 2018 CCF Docotral Disseration Award (Top 5 in China), ACM China Doctoral Dissertation Award Nomination (Top 5 in China). 2016 Distinguished Student of Nanjing University (åäº¬å¤§å­¦å­¦çå¹´åº¦äººç©; the only PhD student out of ten winners). 2014 MSRA Fellowship Award (å¾®è½¯å­¦è å¥å­¦é; Top 12 in Asia Region); 2015 and 2010 National Scholarship; First Place in 2014 Huawei Cup Regional Programming Contest; Second Place in 2012 Tencent Hackathon. I competed in ICPC regional contests for two Gold Medals and earned 49th Place in the 2009 World Finals. Last Update: Jun 27, 2025 Â© 2021 Institute of Computer Software, Nanjing University. All rights reserved.",
  "content_length": 3603,
  "method": "requests",
  "crawl_time": "2025-12-01 14:50:31"
}