{
  "name": "Yanyan Xu 0002",
  "homepage": "http://humnetlab.berkeley.edu/~yxu",
  "status": "success",
  "content": "Yanyan Xu - Shanghai Jiao Tong University & UC Berkeley My homepage Home News Projects Publications Yanyan Xu - Shanghai Jiao Tong University & UC Berkeley Yanyan Xu yanyanxu@sjtu.edu.cn xustone1987@gmail.com Tenure-Track Associate Professor Artificial Intelligence Institute, Shanghai Jiao Tong University Affiliate Member Human Mobility and Networks (HuMNet) Lab UC Berkeley Research Interests Urban Computing | Human Mobility | Smart Transportation | Energy & Environment | Urban Science Biography I was a postdoctoral associate in Human Mobility and Networks (HuMNet) Lab at the Department of City and Regional Planning, UC Berkeley, supervised by Prof. Marta C. Gonzalez. Prior to joining Berkeley, I was a postdoctoral associate at Department of Civil and Environmental Engineering, MIT from Sep. 2015 to Oct. 2018 in Marta’s group, a guest postdoctoral fellow in the Energy Analysis and Environmental Impacts Division, Lawrence Berkeley National Laboratory from Dec. 2017 to Oct. 2018. I got the Ph.D. (supervised by Prof. Yuncai Liu) in Department of Automation at Shanghai Jiao Tong University in 2015. I hold M.S. (supervised by Prof. Hui Chen) and B.S degrees in Shandong University. My research is on human mobility and urban computing, with particular emphasis placed on the use of massive trajectory data in Smart City, Transportation, Energy, and Environment, from interdisciplinary perspective. My work has been published in Nature Energy, Science Advances, J. Roy. Soc. Interface, and IJCAI, among others. Download my CV Figure: Travel demand management during Rio Olympics 2016. Academic Services Peer Review for Journals: Nature Energy Nature Sustainability IEEE Internet of Things Journal IEEE Transactions on Mobile Computing IEEE Transactions on Intelligent Transportation Systems IEEE Transactions on Vehicular Technology IEEE Intelligent Transportation Systems Magazine IEEE Access EPJ Data Science Data Mining and Knowledge Discovery Computers, Environment and Urban Systems Transportation Research Part C: Emerging Technologies Transportmetrica A: Transport Science Transportation Research Board Annual Meeting (ADC20) Opening Positions We have two Postdoc positions open in the OMNILab, directed by Prof. Yaohui Jin, AI Institute, Shanghai Jiao Tong University. The postdoc will be work with Prof. Yaohui Jin and me, in the applicaiton of cutting-edge AI techniques in finance and urban challenges. If you’re interested, please contact me via email.",
  "content_length": 2476,
  "method": "requests",
  "crawl_time": "2025-12-01 14:50:32"
}