{
  "name": "Yanzhi Wang",
  "homepage": "https://www.khoury.northeastern.edu/people/yanzhi-wang",
  "status": "success",
  "content": "Yanzhi Wang - Khoury College of Computer Sciences All People Yanzhi Wang Associate Professor, Khoury College Affiliate Appointment Research interests Research interests Deep learning Model compression of deep neural networks Neuromorphic computing and non-von Neumann computing paradigms Cybersecurity in deep learning systems Education Education PhD in computer engineering, University of Southern California BS in electronic engineering, Tsinghua University — China Biography Biography Yanzhi Wang is an associate professor in the College of Engineering at Northeastern University, with a courtesy appointment in the Khoury College of Computer Sciences. Wang's group works on both algorithms and implementations (FPGAs, circuit tapeouts, mobile and embedded systems, GPUs, emerging devices, and UAVs). His research maintains the highest model compression rates on representative DNNs since 09/2018 (ECCV18, ASPLOS19, ICCV19) and achieves the highest performance/energy efficiency in DNN implementations on many platforms (FPGA19, ISLPED19, HPCA19). His work on AQFP superconducting-based DNN inference acceleration, which is validated through cryogenic testing, has by far the highest energy efficiency among all hardware devices (ISCA19). Wang's has published widely in top conferences and journals (e.g., ASPLOS, ISCA, MICRO, HPCA, ISSCC, AAAI, ICML, CVPR, ICLR, IJCAI, ECCV, ACM MM, ICDM, DAC, ICCAD, FPGA, LCTES, CCS, VLDB, ICDCS, TComputer, TCAD, JSAC, Nature SP, etc.) and has been cited more than 20,000 times according to Google Scholar. He has received four best paper awards, seven best paper nominations, and three popular paper designations from IEEE TCAD. Several instances of his group’s work have been adopted by industry. Individual Details Affiliated Faculty Campus Boston Website https://coe.northeastern.edu/people/wang-yanzhi/ Google Scholar See Citations Contact yanz.wang@northeastern.edu 617.373.8805",
  "content_length": 1925,
  "method": "requests",
  "crawl_time": "2025-12-01 14:50:33"
}