{
  "name": "Yao Zhao 0001",
  "homepage": "https://faculty.bjtu.edu.cn/5900",
  "status": "success",
  "content": "北京交通大学教师名录 赵耀 博士 、教授 基本信息 办公电话：010-51688667 电子邮件： yzhao@bjtu.edu.cn 通讯地址：北京交通大学信息科学研究所 邮编：100044 教育背景 赵耀：博士，教授，博导，教育部重要人才工程入选者，国家杰出青年基金获得者，万人计划科技创新领军人才，第八届\"信息与通信工程学科\"国务院学科评议组成员，科技北京百名领军人才，IEEE Fellow。 1996年获北京交通大学工学博士学位, 2001年破格晋升为教授，2002被遴选为博士生指导教师，现为北京交通大学二级教授。2001年至2002年在荷兰代尔夫特理工大学（TU Delft）从事博士后研究工作，2015年10月在瑞士洛桑联邦理工学院(EPFL)访问交流，2001年至2002年在美国南加州大学访问交流。现为 “科幻音视频智能处理”北京市重点实验室主任，“视觉智能交叉创新”教育部国际合作联合实验室主任。北京交通大学学位委员会委员，北京交通大学计算机与信息技术学院教授会主席，院学位委员会主席。2004年入选教育部新世纪优秀人才支持计划，2012年作为团队带头人的“数字媒体信息处理”团队入选教育部创新团队，2015年该团队入选科技部重点领域创新团队。担任IEEE Transactions on Circuits and Systems for Video Technology, IEEE Transactions on Cybernetics等多个国内外期刊编委、国家自然科学基金第十一届和第十二届评审专家组专家，科技部”云计算与大数据“专项总体组专家等。承担和完成科技创新2030——新一代人工智能项目、重点研发计划课题、973课题、863、国家自然基金重大国际合作项目等37项国家级项目。作为第一完成人获北京市科学技术奖一等奖、高等学校自然科学奖一等奖、中国图象图形学学会科学技术奖一等奖等省部级奖励5项。获授权发明专利20余项、软件著作权6项。曾获詹天佑铁道科技奖青年奖，全国高等学校优秀骨干教师、北京市五四奖章、北京市高等学校优秀青年骨干教师、国家百千万人才工程入选者等荣誉称号，享受国务院政府特殊津贴。 指导的博士生已毕业26名，已毕业硕士研究生68人，其中1人获北京市优秀博士论文奖，1人获中国计算机学会优秀博士论文奖, 3人获电子学会优秀博士论文奖，1人获中国人工智能学会优秀博士论文提名奖，3人获北京图象图形学会优秀论文奖，8人获北京交通大学优秀博士论文奖，4人获北京交通大学优秀硕士论文奖，1人入选教育部重要人才工程。目前正在指导博士研究生9名，硕士研究生10名，所领导的团队获评北京交通大学首届研究生优秀导学团队。 2025年博士生、硕士生招生计划 截止目前，所指导的学生均顺利毕业，去向良好，包括高等院所（西北工业大学、湖南大学、中国传媒大学、中国公安大学、北京交通大学等），知名互联网与IT公司（华为、京东、小米、联想 等）、银行科技岗（中国银行、中国工商银行等）、国企、央企等。欢迎 准备推免/报考 硕士研究生、博士研究生、以及硕博连读的同学与我联系！ 博士生 (2-3名)： 计算机视觉、AIGC鉴伪 、AI视频编码； 硕士生 (3-4名)：计算机视觉 、AGC鉴伪、AI视频编码、多媒体智能理解等; 招生要求：对科研工作真正怀有兴趣，具有较强的自我驱动能力和具备较好的编程能力和数学基础，有学术竞赛经验者优先。 本科专业：计算机、自动化、电子、物理、数学 等相关专业； 招生专业：计算机科学与技术专业的博士生与硕士生。联系方式：yzhao@bjtu.edu.cn 博士生招生专业 学术型：计算机科学与技术 工程型：人工智能、新一代电子信息技术（含量子技术） 硕士生招生专业 学术型：计算机科学与技术、控制科学与工程 专业型：新一代信息与技术（含量子技术等）、人工智能、计算机技术 “ 数字媒体信息处理创新团队” 主页:    http://mepro.bjtu.edu.cn/ 工作经历 研究方向 数字媒体信息处理与智能分析 人工智能 新一代电子信息技术 软件工程 大数据技术与工程 生成式人工智能与安全 计算机技术 招生专业 人工智能博士 人工智能硕士 新一代电子信息技术（含量子技术等）硕士 新一代电子信息技术（含量子技术等）博士 软件工程硕士 大数据技术与工程硕士 计算机技术博士 计算机科学与技术硕士 计算机技术硕士 计算机科学与技术博士 软件工程博士 研究生招生 研究领域为数字媒体信息处理与智能分析，包括：计算机视觉、AIGC鉴伪 、AI视频编码等。欢迎有志青年联系和报考！请将简历发邮件yzhao@bjtu.edu.cn。 科研项目 主持和参与了37个项目的研究工作，主要的项目有： 1. 科技创新2030--新一代人工智能重大专项项目 连续学习理论与方法 2. 国家自然科学基金“国际（地区）合作与交流项目”重点项目 人机共友好的深度视频编码 3.国家自然科学基金重点项目 基于深度学习的数字图像溯源分析与取证 4.北京交通大学基本科研业务费重大项目 基于人工智能的轨道交通安全 5.国家重点研发计划 基于数字水印的大数据隐私保护与溯源 6.国家自然科学基金重点项目 混杂数据的模式识别及敏感内容挖掘理论与方法 7. 国家自然科学基金重大国际合作项目 基于对象和MacroCube 的三维视频的编码和理解 8. 国家973课题 跨媒体数据统一表示和建模机制 9. 国家杰出青年基金 图像视频编码与数字水印 10. 科技部国际合作项目 鲁棒的可伸缩视频编码及其在异构网络中的传输 11. 国家863项目 基于人类视觉特性的分布式多描述视频编码 12. 国家自然科学基金网络与信息安全重大研究计划 数字水印关键技术的研究 13. 国家自然科学基金 MPEG-7框架下可伸缩视频检索系统的研究 教学工作 从1996年至2000年担任信息科学研究生班主任，两次被评为校优秀研究生班主任，所带班级两次荣获“校优良学风班”称号。 作为主要完成人参加的教学项目获北京市高等教育教学成果奖一等奖。近年来，为研究生和本科生开设了多门课程，主要有： 1.         《多媒体通信的理论与方法》（研究生学位课） 2.         《Principle of Image Communication》（外籍博士生学位课） 3.         《多媒体数据压缩技术》（研究生选修课） 4.         《数字信号处理》（计算机系本科生指选课） 5.         《数字图像处理》（研究生学位课） 6.         《计算机文化基础教程》（本科生学位课） 7.         《信号与系统》（本科生学位课） 8.         《数字媒体信息处理的研究与创新体验》（本科生研讨课） 论文/期刊 发表论文200余篇，包括国际期刊IEEE Trans. on Pattern Recognition and Machine Intelligence、IEEE Trans. on Image Processing、IEEE Trans. on Circuits and Systems for Video Technology、 IEEE Trans. on Knowledge and Data Engineering、IEEE Trans. on Multimedia等。目前90余篇被SCI检索，73篇被EI检索，被国内外同行他引9000余次。论文曾被评为IAS09最佳会议论文奖、IIH-MSP10最佳会议论文奖、电子学会年度优秀论文、北京铁道学会青年优秀论文二等奖、第五届全国信号处理学术年会优秀论文奖、中国电子学会第十届青年学术会议优秀论文奖等。编辑出版著作4部，其中国际出版商Springer出版2部。代表性论文有： 1. Bo Ou, Xiaolong Li, Yao Zhao, Rongrong Ni, Yun Q. Shi, Pairwise Prediction-Error Expansion for Efficient Reversible Data Hiding. IEEE Transactions on Image Processing, vol.22, no.12, pp.5010-5021, Dec. 2013. 2. Lili Meng, Jie Liang, Upul Samarawickrama, Yao Zhao, Huihui Bai, Andr′e Kaup, Multiple Description Coding with Randomly and Uniformly Offset Quantizers, IEEE Transactions on Image Processing, VOL. 23, NO. 2, 2014. 3. Han Huang, John W. Woods, Yao Zhao, Huihui Bai, Control-Points Representation and Differential Coding for Affine Motion Compensation, IEEE Transactions on Circuits and Systems for Video Technology, VOL. 23, NO. 10, 2013. 4. Huawei Tian, Yao Zhao, Rongrong Ni, Lunming Qin, and Xuelong Li, LDFT-Based Watermarking Resilient to Local Desynchronization Attacks, IEEE Trans. on Cybernetics, VOL. 43, NO. 6, DECEMBER 2013. 5. Lunming Qin, Ce Zhu, Yao Zhao, Huihui Bai, Huawei Tian, Generalized Gradient Vector Flow for Snakes:New Observations, Analysis and Improvement, IEEE Trans. on Circuits and Systems for Video Technology, VOL. 23, NO. 5, 2013. 6. Yao Zhao, Rongrong Ni, Zhenfeng Zhu, RST Transforms Resistant Image Watermarking based on Centroid and Sector-shaped Partition, Science in China: Series F Information Science (中国科学F辑），Vol. 55. No. 3, 2012. 7. Gang Cao, Yao Zhao, Rongrong Ni, Alex C. Kot, Unsharp Masking Sharpening Detection via Overshoot Artifacts Analysis, IEEE Signal Processing Letters, Vol. 18, No. 10, 2011. 8. Nan Liu, Yao Zhao, Zhenfeng Zhu, Hanqing Lu, Exploiting Visual-Audio-Textual Characteristics for Automatic TV Commercial Block Detection and Segmentation, IEEE Trans. on Multimedia, Vol.13, No.5, 2011. 9. Chunyu Lin, Tammam Tillo, Yao Zhao, Byeungwoo Jeon, Multiple description coding for H.264/AVC with redundancy allocation at macro block level, IEEE Trans. on Circuits and Systems for Video Technology , Vol. 21, No. 5, 2011. 10. Yao Zhao, Baozong Yuan, A New Affine Transformation: Its Theory and Application to Image Coding, IEEE Trans. on Circuits and Systems for Video Technology, Vol.8, No.3, 1998. 专著/译著 PAN，HUANG,Jain,赵耀.Recent advances in information hiding and applications。国外:Springer-Verlag Berlin and Heidelberg GmbH & Co. K，2012-07 韦世奎，赵耀,朱振峰.Copy Detection Using Graphical Model: HMM for Frame Fusion。国外:Graph-Based Methods in Computer Vision: Developments and Applications，2013-01 白慧慧，王安红,赵耀,Pan.Distributed Multiple Description Coding: Principles, Algorithms and Systems。国外:Springer，2011-10 白慧慧，张萌萌,赵耀.面向异构网络的视频编码技术。国内:中国水利水电出版社，2011-03 翁韶伟，赵耀,潘正祥.Intelligent Multimedia Data Hiding，springer，2007-04 王移芝，罗四维,赵耀,魏惠琴,许宏丽.大学计算机基础教程，高等教育出版社，2004-07 专利 申请发明专利20项，已获得授权15项。 软件著作权 获计算机软件著作权登记6项。 获奖与荣誉 1. 北京市优秀教师 2. 教育部创新团队带头人 3. 国家杰出青年基金获得者 4. 科技北京百名领军人才 5. 国家百千万人才工程入选者 6.“结合视觉特性的图像视频编码”获北京市科学技术奖一等奖 7.“多媒体信息处理关键技术研究”获高等学校自然科学奖二等奖 8. 享受国务院政府特殊津贴 9. 第七届詹天佑铁道科技奖青年奖获得者 10. 教育部新世纪优秀人才支持计划入选者 11. 第17届北京市五四奖章获得者 13. \"侦察图象回传系统的研究\"获军队科技进步三等奖 14. 霍英东教育基金会高等院校青年教师基金获得者 15. 全国高等学校优秀骨干教师 16. 铁道部青年科技拔尖人才 17. 北京市青年骨干教师 社会兼职 1. IEEE Transactions on Circuits and Systems for Video Technology编委（Associate Editor） 2.  IEEE Transactions on Cybernetics编委（Associate Editor） 3. IEEE Signal Processing Letters编委（Senior Associate Editor） 4. Signal Processing: Image Communication 编委（Associate Editor） 5. Circuits, Systems & Signal Processing编委（Associate Editor） 6. KSII Transactions on Internet and Information Systems编委（Associate Editor） 7. 《数据采集与处理》、《信息处理》、《北京交通大学学报》等杂志编委 8. IEEE Trans. on Multimedia, IEEE Trans. on CSVT，《中国科学》、《电子学报》等学术杂志审稿人 9. 清华大学网络多媒体北京市重点实验室学术委员会委员 10. 北京理工大学智能信息技术北京市重点实验室学术委员会委员 11. 北方工业大学图象处理与模式识别研究所学术委员会委员 12. 清华大学多维多尺度计算摄像北京市重点实验室学术委员会委员 13. 北京理工大学分数域信号与系统北京市重点实验室学术委员会委员 14. 中国电子学会高级会员 15. 中国计算机学会杰出会员 16. 中国图象图形学学会会士 17. 中国图象图形学学会交通视频专委会主任 18. 中国计算机学会YOCSEF委员会AC委员 19. 中国计算机学会学术工作委员会委员 20. 中国电子学会青年与志愿者工作委员会委员 21. 北京交通大学学位委员会委员 22. 铁道学会会员 23. 国家自然科学基金委员会第十一届、第十二届评审专家组专家 24. 留学回国人员科研启动基金评审专家 25. 教育部科学技术研究重点项目评审专家 26. 科技部”云计算与大数据“专项总体组专家 27. 863项目评审库专家 28. IEEE Fellow 29. IET Fellow 30. 第八届\"信息与通信工程学科\"国务院学科评议组成员 版权所有：北京交通大学研究生院",
  "content_length": 7266,
  "method": "requests",
  "crawl_time": "2025-12-01 14:50:33"
}