{
  "name": "Yao Ma 0001",
  "homepage": "https://yaoma24.github.io",
  "status": "success",
  "content": "Yao Ma Yao Ma Home CV(pdf) Research Publications Openings Teaching@RPI CSCI4975-6975 CSCI4961-6961 Teaching@NJIT CS675 CS785 Book Deep Learning on Graphs Tutorials GNNs@AAAI2021 Links DAMI Lab @RPI DSE Lab @MSU Yao Ma Assistant Professor Department of Computer Science School of Science Rensselaer Polytechnic Institute Data Analytics and Machine Intelligence (DAMI) Lab Email: may13@rpi.edu Google Scholar LinkedIn Short Bio Yao Ma is an assistant professor in the Department of Computer Science at Rensselaer Polytechnic Institute (RPI). Before joining RPI, he worked as an Assistant Professor at New Jersey Institute of Technology. He got his PhD from Michigan State University in 2021 under the supervision of Dr. Jiliang Tang. Before that, he completed his MS (2016) in Statistics, Probability & Operations Research at Eindhoven University of Technology and BS (2015) in Mathematics and Applied Mathematics at Zhejiang University. I have several fully-funded PhD positions available in Fall 2024 and Spring 2025. If you are interested in working with me, please feel free to email me. Please check here for more details. Research Interests Machine Learning with Graphs, Graph Neural Networks Trustworthy AI: Robustness, Fairness, Privacy Data Centric-AI: Data Augmentation, Active Learning, Data Valuation, Data Condensation Large Language Models: GraphRAG, Knowledge Graphs for LLMs News (more) 09/2025 Papers accepted by NeurIPs 2025. 08/2025 One paper accepted by CCS 2025. 01/2025 Two papers on graph data vaulation accepted by ICLR 2025. 01/2025 One paper accepted by NAACL 2025. 11/2024 One paper accepted by LoG 2024. 11/2024 Honored to receive the National AI Research Resource Pilot Award to support our research in Foundation Models for Graph-Sturctued Data. 11/2024 Invited to give a lecture on Introduction to Machine Learning to High School seniors in the Questar III New Vision Program. 08/2024 I gave a lecture on Machine Learning to high school students through the PREFACE program. 07/2024 Honored to receive a research grant from DHS for the project Adaptive Graph-based Framework for Multi-Source Digital Forensic Analysis as PI. 05/2024 We are presenting a tutorial on Safe Multi-Modal Learning at KDD2024. Check out the details here. 05/2024 Our survey A Survey on Safe Multi-Modal Learning System is accepted by KDD2024. 05/2024 Three papers accepted by KDD2024. 05/2024 Two papers accepted by ICML2024. 02/2024 Check out our preprints on Graph Data Valuation, Graph Foundation Model, Mechanism of In-contex Learning, Graph Condensation, Safe Multi-Modal Learning System, and Graph Contrastive Learning Benchmarks! 01/2024 One paper accepted by ACM-WebSci2024. 01/2024 One paper accepted by WWW2024. 01/2024 One paper accepted by ICLR2024. 12/2023 One paper accepted by SDM2024. 09/2023 Two papers accepted by NeurIPS2023. 08/2023 One paper accepted by CIKM2023. 07/2023 One paper accepted by S&P2024. 05/2023 Honored to receive a research grant from NSF for the project SHINE: Prediction of Coronal Mass Ejections and Interplanetary Magnetic Fields Using Advanced Artificial Intelligence Techniques as a Co-PI. 05/2023 Gave a lecture on machine learning for the ISWS-REU program. 05/2023 One paper accepted by ACL2023. 04/2023 One paper accepted by TKDE. 04/2023 Invited to give a talk at IEEE CAS Seasonal School. 04/2023 One paper accepted by SIGIR2023. 01/2023 Receving a gift grant from Shell for the project Supply Chain Network Optimization. Thanks Shell! 12/2022 Invited to serve as a grant proposal panelist for NSF. 11/2022 Our workshop Data Science for Smart Manufacturing and Healthcare was accepted by SDM2023. 10/2022 Our workshop Machine Learning on Graphs (MLoG) is accepted by WSDM2023. 08/2022 Honored to receive a research grant from NSF for the project Collaborative Research: III: Medium: Graph Neural Networks for Heterophilous Data: Advancing the Theory, Models, and Applications as the Site PI at NJIT. 08/2022 Invited to give a talk for the Data Science Show at AT&T Labs. 08/2022 New preprint on graph contrastive learning is available here. 07/2022 Invited to serve as Senior PC member for AAAI2023. 05/2022 One paper accepted by KDD2022. 04/2022 Our workshop Machine Learning on Graphs (MLoG) is accepted at ICDM2022. 03/2022 Invited to serve as a PC menber for KDD2022, ICML2022, IJCAI2022, and NeurIPS2022. 02/2022 Gratefully received an NSF CRII grant (IIS-2153326) as the PI to support our research on advancing graph neural networks. 01/2022 Two papers accepted by ICLR2022. 11/2021 Our workshop “Machine Learning on Graphs (MLoG)” has been accpeted by WSDM2022. 10/2021 Invited to serve as Proceddings Co-chair of KDD2022. 10/2021 Invited to serve as PC member for SDM 2022. 10/2021 Invited to serve as PC menber for The Web Conference 2022. 09/2021 One paper accepted by NeurIPS2021. 08/2021 Two papers accepted by CIKM2021. Page generated 2025-10-01 15:14:46 EDT, by jemdoc+MathJax.",
  "content_length": 4945,
  "method": "requests",
  "crawl_time": "2025-12-01 14:50:32"
}