{
  "name": "Yao Qin 0001",
  "homepage": "https://yaoqin1.github.io",
  "status": "success",
  "content": "Yao Qin Yao Qin Assistant Professor @ UC Santa Barbara Co-Director @ REAL AI Initiative Senior Research Scientist @ Google DeepMind I am an Assistant Professor at the Department of Electrical and Computer Engineering, affiliated with the Department of Computer Science at UC Santa Barbara, where I am also co-leading the REAL AI initiative. Meanwhile, I am a senior Research Scientist at Google DeepMind, working on Gemini Multimodal. I obtained my PhD degree at UC San Diego in Computer Science, advised by Prof. Garrison W. Cottrell. During my PhD, I was very fortunate to intern under the supervision of Geoffrey Hinton, Ian Goodfellow and many others. My research interests primarily focus on robustness in machine learning, such as adversarial robustness, out-of-distribution generalization, and fairness. In addition, I am highly passionate about developing reliable AI-driven models tailored for healthcare, with a particular focus on diabetes management. In my lab, we explore various research themes for designing robust machine learning models in healthcare. Specifically, our research themes include: Multi-modal modeling Reliable AI for diabetes Time series foundation models Services: Invited to serve as an Area Chair for NeurIPS-25, ICML-25/24, ICLR-25/24/23, ICCV-25/23, CVPR-25, AAAI-25, Co-Local Arrangement Chair for KDD-2023. Hiring! I am actively seeking motivated postdoctoral researchers and students who are enthusiastic about robustness and diabetes care to join my research lab. In addition, we also have open positions for visiting students interested in engaging in collaborative research. You are welcome to contact me at yaoqin@ucsb.edu with your resume if you have an interest to join us. If you are a current student at UCSB, please email me with [UCSB Student] in the title! NEWS! Oct. 2025: One paper on Variation in Hypoglycemia Risk During Real-World Physical Activity is accepted to Diabetes Technology and Therapeutics. Oct. 2025: Invited talk at Diabetes Technology Meeting (DTM-2025)!. Oct. 2025: Invited talks at two workshops at ICCV-25: SaFeMM-AI: Safe and Trustworthy Multimodal AI Systems, TrustFM: Workshop on Trustworthy Foundation Models. Sep. 2025: SPICE: A Synergistic, Precise, Iterative, and Customizable Image Editing Workflow is accepted to NeurIPS Creative AI track-2025. Aug. 2025: One paper on Prompt Sensitivity in Evaluating LLMs is accepted to EMNLP-2025. Jun. 2025: Our exercise metobalism modeling work has won the American Diabetes Association Abstract Award (ADA-2025). Congratulations to the whole team! May 2025: New survey work on bridging distribution shift and AI safety through conceptual and methodological synergies. Apr. 2025: New work introducing SPICE, A Synergistic, Precise, Iterative, and Customizable Image Editing Workflow, accepted to the CVPR AI Art Gallery 2025. Mar. 2025: Invited talk at Advanced Technologies & Treatments for Diabetes (ATTD-2025). Mar. 2025: Two abstracts (one Oral and one Poster) on exercise-based metabolism modeling for diabetes are accepted to American Diabetes Association (ADA-2025). Mar. 2025: Invited talk at USC symposium on Frontiers of Machine Learning and AI: Fundamentals and Applications. Feb. 2025: One paper on OOD detection through the lens of Neural Collapse is accepted to CVPR-2025. Jan. 2025: One paper on LLMs for nutrition estimation is accepted to ICLR-2025. Dec. 2024: We are organizing two workshops at NeurIPS-2024: AdvML-Frontiers on adversarial machine learning, AIM-FM on medical foundation models. Nov. 2024: One paper on idiom translation is accepted to Findings of EMNLP-2024. Nov. 2024: Invited talk at Endocrine Society AI in Healthcare Summit. Oct. 2024: Invited talk at NIDDK AI in Precision Medicine Workshop. Jul. 2024: New work on model degradation in the chain of diffusion models. May 2024: One paper on out-of-distribution detection is accepted to ICML-2024. May 2024: One paper on Ising Machines for generative AI is accepted to Nature Electronics. Apr. 2024: Two abstracts on understanding glycemic effects of exercise for Type 1 diabetes are accepted to American Diabetes Association (ADA-2024). Apr. 2024: Honored to receive the UCSB Regents' Junior Faculty Fellowship Award. Apr. 2024: We are organizing ECE Summit Day at UCSB. Feb. 2024: One paper on adversarial transfer learning is accepted to CVPR-2024. Jan. 2024: One paper on improving out-of-distribution robustness is accepted to AISTATS-2024. Jan. 2024: One paper on small medical language models is accepted to ICLR-2024. Dec. 2023: We are organizing Robustness of Few-shot and Zero-shot Learning in Foundation Models at NeurIPS-2023. Oct. 2023: Honored to be awarded by Helmsley Charitable Trust working on exercise specific AID algorithm for Type 1 diabetes. Oct. 2023: We are organizing Responsible Machine Learning Summit at UCSB. Oct. 2023: One paper is accepted to Findings of EMNLP-2023. Sep. 2023: One paper is accepted to NeurIPS-2023. Aug. 2023: We are organizing Southern California Data Science Day at KDD-2023. Jun. 2023: Honored to be awarded the UCSB Faculty Research Grant. Feb. 2023: Invited talk at Information Theory and Applications, 2023. Lab Members Recommendations! If you are an undergraduate/master student at UCSB and wants to work with me, the best way is to reach out to my amazing PhD students first to seek potential collaborations! Mehak Dhaliwal (PhD) Working on Large Language Model & AI for Diabetes Andong Hua (PhD) Working on Robustness in Multimodal & Large Language Model Kenan Tang (PhD) Working on AI for Diabetes & Multimodal Model Youngseok Yoon (PhD, co-advised with Prof. Haewon Jeong) Working on Generative Models & Times Series Modeling Preprints Bridging Distribution Shift and AI Safety: Conceptual and Methodological Synergies Kenan Tang*, Chenruo Liu*，Yao Qin and Qi Lei [Paper] Model Collapse in the Self-Consuming Chain of Diffusion Finetuning: A Novel Perspective from Quantitative Trait Modeling Youngseok Yoon, Dainong Hu, Iain Weissburg, Yao Qin and Haewon Jeong [Paper] Towards Robust Prompts on Vision-Language Models Jindong Gu, Ahmad Beirami, Xuezhi Wang, Alex Beutel, Philip Torr and Yao Qin [Paper] Deflecting Adversarial Attacks Yao Qin, Nicholas Frosst, Colin Raffel, Garrison Cottrell and Geoffrey Hinton [Paper] Evaluation Methodology for Attacks Against Confidence Thresholding Models Ian Goodfellow, Yao Qin, David Berthelot [Paper] Selected Publications (* indicates equal contributions.) SPICE: A Synergistic, Precise, Iterative, and Customizable Image Editing Workflow Kenan Tang*, Yanhong Li* and Yao Qin Advances in Neural Information Processing Systems Creative AI track, 2025 [Paper][Code][Project Page] Flaw or Artifact? Rethinking Prompt Sensitivity in Evaluating LLMs Andong Hua*, Kenan Tang*, Chenhe Gu, Jindong Gu, Eric Wong and Yao Qin Empirical Methods in Natural Language Processing (EMNLP), 2025 [Paper] Detecting Out-of-Distribution through the Lens of Neural Collapse Litian Liu and Yao Qin IEEE Conference on Computer Vision and Pattern Recognition (CVPR), 2025 [Paper][Code] NutriBench: A Dataset for Evaluating Large Language Models in Nutrition Estimation from Meal Descriptions Andong Hua*, Mehak Preet Dhaliwal*, Laya Pullela, Ryan Burke, and Yao Qin International Conference on Learning Representations (ICLR), 2025 [Paper][Project Page][Data] Fast Decision Boundary based Out-of-Distribution Detector Litian Liu and Yao Qin International Conference on Machine Learning (ICML), 2024 [Paper][Code] Initialization Matters for Adversarial Transfer Learning Andong Hua, Jindong Gu, Zhiyu Xue, Nicholas Carlini, Eric Wong and Yao Qin IEEE Conference on Computer Vision and Pattern Recognition (CVPR), 2024 [Paper][Code] Effective Robustness against Natural Distribution Shifts for Models with Different Training Data Zhouxing Shi, Nicholas Carlini, Ananth Balashankar, Ludwig Schmidt, Cho-Jui Hsieh, Alex Beutel and Yao Qin Advances in Neural Information Processing Systems (NeurIPS), 2023 [Paper] Understanding and Improving Robustness of Vision Transformers through Patch-based Negative Augmentation Yao Qin, Chiyuan Zhang, Ting Chen, Balaji Lakshminarayanan, Alex Beutel and Xuezhi Wang Advances in Neural Information Processing Systems (NeurIPS), 2022 [Paper] Are Vision Transformers Robust to Patch Perturbations? Jindong Gu, Volker Tresp, Yao Qin European Conference on Computer Vision (ECCV), 2022 [Paper][Code] Improving Calibration through the Relationship with Adversarial Robustness Yao Qin, Xuezhi Wang, Alex Beutel, Ed H. Chi Advances in Neural Information Processing Systems (NeurIPS), 2021 [Paper] Detecting and Diagnosing Adversarial Images with Class-Conditional Capsule Reconstructions Yao Qin*, Nicholas Frosst*, Sara Sabour, Colin Raffel, Garrison Cottrell and Geoffrey Hinton International Conference on Learning Representations (ICLR), 2020 [Paper] Imperceptible, Robust and Targeted Adversarial Examples for Automatic Speech Recognition Yao Qin, Nicholas Carlini, Ian Goodfellow, Garrison Cottrell, Colin Raffel International Conference on Machine Learning (ICML), 2019 [Paper][Project Page][Code] Autofocus Layer for Semantic Segmentation Yao Qin, Konstantinos Kamnitsas, Siddharth Ancha, Jay Nanavati, Garrison Cottrell, Antonio Criminisi, Aditya Nori International Conference on Medical Image Computing and Computer Assisted Intervention (MICCAI), 2018 Oral presentation (4% acceptance rate) [Paper][Code] Hierarchical Cellular Automata for Visual Saliency Yao Qin*, Mengyang Feng*, Huchuan Lu, Garrison Cottrell International Journal of Computer Vision (IJCV), 2017 [Paper][Code] A Dual-Stage Attention-Based Recurrent Neural Network for Time Series Prediction Yao Qin, Dongjin Song, Haifeng Chen, Wei Cheng, Guofei Jiang, Garrison Cottrell International Joint Conference on Artificial Intelligence (IJCAI), 2017 [Paper][Code][Data] Saliency Detection via Cellular Automata Yao Qin, Huchuan Lu , Yiqun Xu, He Wang IEEE Conference on Computer Vision and Pattern Recognition ",
  "content_length": 10444,
  "method": "requests",
  "crawl_time": "2025-12-01 14:50:33"
}