{
  "name": "Yaobin Shen",
  "homepage": "https://sites.google.com/view/yaobin",
  "status": "success",
  "content": "Yaobin's HomepageSearch this siteEmbedded FilesSkip to main contentSkip to navigationYaobin ShenMy research interest is in cryptography. I'm working on theory and practice of symmetric-key cryptography. I am an associate professor at Xiamen University. Email: yaobins180{AT}gmail.comOpen position: I may have some open position for postdoc. Send me an email if you are interested in working with me. Education & Experience2023-now         Associate professor at Xiamen University2021-2023 Postdoc at UCL Crypto Group 2016-2021 Ph.D. at Shanghai Jiao Tong University2019-2020 Visiting student at Florida State University 2012-2016 B.Sc. at Shandong UniversityPublications On Constructing AEs with Leakage and FaultsThomas Peters, Sayandeep Saha, Yaobin Shen, and François-Xavier StandaertFSE 2026Proxying Is Enough: Security of Proxying in TLS Oracles and AEAD Context UnforgeabilityZhongtang Luo, Yanxue Jia, Yaobin Shen, and Aniket KateAFT 2025Multiplex: TBC-based Authenticated Encryption with Sponge-Like Rate Thomas Peters, Yaobin Shen, and François-Xavier StandaertFSE 2025Multi-User Security of CCM Authenticated Encryption ModeXiangyang Zhang, Yaobin Shen, and Lei WangCCS 2024Efficient Variants of TNT with BBB SecurityRitam Bhaumik, Wonseok Choi, Avijit Dutta, Cuauhtemoc Mancillas López, Hrithik Nandi, and Yaobin ShenProvSec 2024The Committing Security of MACs with Applications to Generic CompositionRitam Bhaumik, Bishwajit Chakraborty, Wonseok Choi, Avijit Dutta, Jérôme Govinden, and Yaobin ShenCRYPTO 2024Optimally Secure Tweakable Block Ciphers with a Large Tweak from n-bit Block Ciphers Yaobin Shen and François-Xavier StandaertFSE 2024Forgery Attacks on Several Beyond-Birthday-Bound Secure MACsYaobin Shen, François-Xavier Standaert, and Lei WangASIACRYPT 2023Revisiting the Indifferentiability of the Sum of Permutations Aldo Gunsing, Ritam Bhaumik, Ashwin Jha, Bart Mennink, and Yaobin ShenCRYPTO 2023Secure Message Authentication in the Presence of Leakage and FaultsFrancesco Berti, Chun Guo, Thomas Peters, Yaobin Shen, and François-Xavier StandaertFSE 2023Key-Reduced Variants of 3kf9 with Beyond-Birthday-Bound SecurityYaobin Shen and Ferdinand SibleyrasASIACRYPT 2022Triplex: an Efficient and One-Pass Leakage-Resistant Mode of OperationYaobin Shen, Thomas Peters, François-Xavier Standaert, Gaëtan Cassiers, and Corentin VerhammeCHES 2022Revisiting the Security of DbHtS MACs: Beyond-Birthday-Bound in the Multi-User Setting  Yaobin Shen, Lei Wang, Dawu Gu, and Jian WengCRYPTO 2021Security of Streaming Encryption in Google's Tink LibraryViet Tung Hoang and Yaobin ShenCCS 2020Security Analysis of NIST CTR-DRBG Viet Tung Hoang and Yaobin ShenCRYPTO 2020On Beyond-Birthday-Bound Security: Revisiting the Development of ISO/IEC 9797-1 MACs Yaobin Shen and Lei WangFSE 2020 (- Best Paper Award -)Improved Security Bounds for Generalized Feistel Networks Yaobin Shen, Chun Guo, and Lei WangFSE 2020Secure Key-Alternating Feistel Ciphers Without Key Schedule Yaobin Shen, Hailun Yan, Lei Wang, and Xuejia LaiSCIENCE CHINA Information Sciences, October 2020Tweaking Key-Alternating Feistel Block Ciphers Hailun Yan, Lei Wang, Yaobin Shen, and Xuejia LaiACNS 2020Beyond-birthday Secure Domain-preserving PRFs from a Single Permutation Chun Guo, Yaobin Shen, Lei Wang, and Dawu GuDesigns, Codes and Cryptography (2019)Length-Preserving Encryption Based on Single-Key Tweakable Block Cipher Xiangyang Zhang, Yaobin Shen, Hailun Yan, Ying Zou, Ming Wan, Zheyi Wu, and Lei WangProvSec 2018ServiceProgram committee of ASIACRYPT 2023/2024, CRYPTO 2024/2025, FSE 2025/ToSC 2024/2025, Inscrypt 2024/2025; Editorial board of CiC 2025General & Program Chairs of ASK 2023 (The 10th Asian Workshop on Symmetric Key Cryptography)Reviewer for CRYPTO, EUROCRYPT, ASIACRYPT, Journal of CryptographyPreprintsSecurity Analysis of NIST Key Derivation Using Pseudorandom FunctionsYaobin Shen, Lei Wang and Dawu GuePrint 2025/815Google SitesReport abusePage detailsPage updated Google SitesReport abuse",
  "content_length": 4006,
  "method": "requests",
  "crawl_time": "2025-12-01 14:50:34"
}