{
  "name": "Yaohang Li",
  "homepage": "http://www.cs.odu.edu/~yaohang",
  "status": "success",
  "content": "Welcome to Dr. Yaohang Li's Homepage Home Teaching Research Protein Tools Education Activities Publications Students Contact Info CV Services Random Number Links Yaohang LiAssociate Professor Department of Computer Science Old Dominion University yaohang@cs.odu.edu Phone: 757-683-7721Fax: 757-683-4900 Affiliations Department of Computer Science Old Dominion University Shodor Foundation NC High Performance Computing Consortium SURA Computing Matters Post-Doctoral Researcher Position Ph.D. Student Positions Yaohang Li is a Professor in the Department of Computer Science at Old Dominion University. His research interests are in Computational Biology, Monte Carlo methods, Big Data Analysis, and Parallel/Distributed/Grid Computing. His current projects include: ·       Protein Structure Modeling ·       Machine Learning and Nuclear Physics · Large-Scale Numerical Linear Algebra and Randomized Algorithms Yaohang Li received \"Rookie of the Year\" young investigator award at North Carolina A&T State University in 2005 and Ralph E. Powe young faculty award in Computer Science and Mathematics from Oak Ridge Associated Universities (ORAU) in 2005. He is the recipient of an NSF CAREER Award in 2009. He received the Ph.D. and M.S. degrees in Computer Science from the Florida State University in 2003 and 2000, respectively, and the B.S. degree in Computer Science and Engineering from the South China University of Technology in 1997. After graduation, he worked at Oak Ridge National Laboratory for a short period of time. He was a Summer Research Fellow at National Center of Supercomputing Applications (NCSA) in 2007 and a Summer Faculty Research Participation member at Oak Ridge National Laboratory in 2006 and 2008. Before joining ODU, he was an associate professor in the Computer Science Department at North Carolina A&T State University.",
  "content_length": 1854,
  "method": "requests",
  "crawl_time": "2025-12-01 14:50:37"
}