{
  "name": "Yaojie Lu 0001",
  "homepage": "https://luyaojie.github.io",
  "status": "success",
  "content": "Yaojie Lu's Homepage Yaojie Lu (陆垚杰) Chinese Information Processing Laboratory Institute of Software, Chinese Academy of Sciences Room 1201, 4#  South  Fourth Street, Zhong Guan Cun Haidian District, Beijing Email: luyaojie{at}iscas{dot}ac{dot}cn Short Bio I am an Associate Professor at the Chinese Information Processing Laboratory, Institute of Software, Chinese Academy of Sciences. Research Interests My research interests center on Natural Language Processing, such as Information Extraction and Large Language Models. Selected Publications (Full List) Rethinking Reward Model Evaluation: Are We Barking up the Wrong Tree? Xueru Wen, Jie Lou, Yaojie Lu, Hongyu Lin, XingYu, Xinyu Lu, Ben He, Xianpei Han, Debing Zhang, Le Sun. ICLR 2025. [link] SoFA: Shielded On-the-fly Alignment via Priority Rule Following. Xinyu Lu, Bowen Yu, Yaojie Lu, Hongyu Lin, Haiyang Yu, Le Sun, Xianpei Han, Yongbin Li. ACL Findings 2024. [link] Mitigating Large Language Model Hallucinations via Autonomous Knowledge Graph-Based Retrofitting. Xinyan Guan, Yanjiang Liu, Hongyu Lin, Yaojie Lu, Ben He, Xianpei Han, Le Sun. AAAI 2024. [link] Learning In-context Learning for Named Entity Recognition. Jiawei Chen, Yaojie Lu, Hongyu Lin, Jie Lou, Wei Jia, Dai Dai, Hua Wu, Boxi Cao, Xianpei Han, Le Sun. ACL 2023. [link] Unified Structure Generation for Universal Information Extraction. Yaojie Lu, Qing Liu, Dai Dai, Xinyan Xiao, Hongyu Lin, Xianpei Han, Le Sun and Hua Wu. ACL 2022. [link] Text2Event: Controllable Sequence-to-Structure Generation for End-to-end Event Extraction. Yaojie Lu, Hongyu Lin, Jin Xu, Xianpei Han, Jialong Tang, Annan Li, Le Sun, Meng Liao and Shaoyi Chen. ACL-IJCNLP 2021. [link] Useful Resources Repositories I Maintain [Awesome Resource for NLP] Some useful datasets for NLP. [NLP Resource in Chinese Conference] Some useful resources for NLP (in Chinese). Conferences Info AI Conference Deadlines WikiCFP Professional Activities Program Committee Members: ACL (ARR), NeurIPS, ICLR, AAAI, IJCAI, EMNLP, COLM, COLING, CCL, CCKS. Last updated: April 2, 2025",
  "content_length": 2069,
  "method": "requests",
  "crawl_time": "2025-12-01 14:50:35"
}