{
  "name": "Yaoliang Yu",
  "homepage": "https://cs.uwaterloo.ca/~y328yu",
  "status": "success",
  "content": "Yaoliang Yu's Webpage Yaoliang Yu University of Waterloo Vector Institute About Me Yaoliang Yu (于耀亮) is currently a faculty in the David R. Cheriton School of Computer Science at University of Waterloo, as well as at the Vector institute. His main research interests include generative models, convex and nonconvex optimization, trustworthy machine learning, and applications in computer vision and natural language processing. Interests Machine Learning Optimization Education PhD (Statistical Machine Learning) University of Alberta Some Publications H. Lu, Q. Wu, Y. Yu (2025). Stochastic Forward-Backward Deconvolution: Training Diffusion Models with Finite Noisy Datasets. International Conference on Machine Learning (ICML). PDF Cite Code URL Z. Hu, Y. Yu (2025). Leveraging Variable Sparsity to Refine Pareto Stationarity in Multi-Objective Optimization. International Conference on Learning Representations (ICLR). PDF Cite Code URL W. Li, Y. Yu (2024). Faster Approximation of Probabilistic and Distributional Values via Least Squares. International Conference on Learning Representations (ICLR). PDF Cite Code URL Y. Lu, G. Kamath, Y. Yu (2023). Exploring the Limits of Model-Targeted Indiscriminate Data Poisoning Attacks. International Conference on Machine Learning (ICML). PDF Cite Code URL T. Dockhorn, Y. Yu, E. Sari, M. Zolnouri, V. Nia (2021). Demystifying and Generalizing BinaryConnect. Advances in Neural Information Processing Systems (NeurIPS). PDF Cite URL J. Wang, S. Sun, Y. Yu (2019). Multivariate Triangular Quantile Maps for Novelty Detection. Advances in Neural Information Processing Systems (NeurIPS). PDF Cite URL P. Jaini, K. Selby, Y. Yu (2019). Sum-of-squares Polynomial Flow. International Conference on Machine Learning (ICML). PDF Cite URL P. Jaini, P. Poupart, Y. Yu (2018). Deep Homogeneous Mixture Models: Representation, Separation and Approximation. Advances in Neural Information Processing Systems (NeurIPS). PDF Cite URL Y. Yu, X. Zhang, D. Schuurmans (2017). Generalized Conditional Gradient for Sparse Estimation. Journal of Machine Learning Research (JMLR). PDF Cite URL Y. Yu, X. Zheng, M. Marchetti-Bowick, E. Xing (2015). Minimizing Nonconvex Non-Separable Functions. International Conference on Artificial Intelligence and Statistics (AISTATS). PDF Cite URL Y. Yu, H. Cheng, D. Schuurmans, C. Szepesvári (2013). Characterizing the Representer Theorem. International Conference on Machine Learning (ICML). PDF Cite URL Y. Yu (2013). On Decomposing the Proximal Map. Advances in Neural Information Processing Systems (NeurIPS). PDF Cite URL Y. Yu, D. Schuurmans (2011). Rank/Norm Regularization with Closed-Form Solutions: Application to Subspace Clustering. Conference on Uncertainty in Artificial Intelligence (UAI). PDF Cite URL Y. Yu, Y. Li, D. Schuurmans, C. Szepesvári (2009). A General Projection Property for Distribution Families. Advances in Neural Information Processing Systems (NeurIPS). PDF Cite URL See all publications Recent Courses 2025 Optimization for Data Science CS794 Jun 22, 2025 Winter 2025 Introduction to Machine Learning CS480/680 Jan 6, 2025 Recent Readings 我只会算术，惰者集 Nov 9, 2025 i can only do arithmetic, the collection of a lazy man Read more Nov 9, 2025 数学与创造，可变思考 Oct 20, 2025 math and creativity, variable thinking Read more Oct 20, 2025 世界是概率的 Sep 28, 2025 the world is probabilistic Read more Sep 28, 2025 张忠谋自传 Sep 25, 2025 autobiography of Morris Chang Read more Sep 25, 2025 See all",
  "content_length": 3473,
  "method": "requests",
  "crawl_time": "2025-12-01 14:50:35"
}