{
  "name": "Yaqiong Xu",
  "homepage": "http://eecs.vanderbilt.edu/people/yaqiongxu/group.html",
  "status": "success",
  "content": "Department of Electrical and Computer Engineering - School of EngineeringSchool of Engineering | Vanderbilt University Department of Electrical and Computer Engineering Home to world-class teaching and interdisciplinary research, the Department of Electrical and Computer Engineering prides itself on immersive education, creative problem-solving, and close mentorship, with emphasis on devices, system engineering, signal processing and machine learning. Apply to the Program Apply to the undergraduate program or graduate program today. Top Resources Meet the Faculty Recent News Graduate Degree Programs Small Scale, Big Impact Vanderbilt researchers have developed a way to more quickly, and precisely, trap nanoscale objects such as potentially cancerous extracellular vesicles using a cutting-edge plasmonic nanotweezer. Read the Story Mission The Electrical and Computer Engineering Department Educates future leaders and innovators in individual and team problem solving skills through immersive technical experiences in focus areas of excellence. Drives innovation across areas of focus as recognized by national priorities and impacts on international science. Empowers scholars and graduates to appreciate social implications of technologies and consider ethical responsibilities Leads collaborative ground-breaking research to define the future of computing devices and systems. Vision The Electrical and Computer Engineering DepartmentWill integrate focused areas of excellence throughout our undergraduate, graduate and professional programsWill grow leadership that reflects our student profileWill increase national impact and reflective rankingsWill be defined by its innovative nature so that students, staff, and faculty will not only want to work here but will enjoy it. Our undergraduate and graduate curricula are constantly refined to meet real-world demands and rapid changes in technology. We are committed to our core values of education, research, and inclusive excellence. Shekhar BhansaliChair and Cornelius Vanderbilt Professor of Electrical and Computer EngineeringDepartment of Electrical and Computer EngineeringVanderbilt University School of Engineering Research A shared passion for research and education is a hallmark of the Vanderbilt environment, and our undergraduate and graduate programs exemplify that drive for excellence. Faculty, research engineers and students engage in leading scholarship and significant research in both industry and government. Electrical and Computer Engineering Research Areas Photonics, Electronics and Nanotechnology Robotics Medical Imaging, Devices, and Systems Cyber-Physical Systems Applied and Translational Artificial Intelligence Space and Defense Systems Explore Our Research Institutes Institute for Space and Defense Electronics Institute for Software Integrated Systems Vanderbilt Institute for Surgery and Engineering Vanderbilt Institute of Nanoscale Science and Engineering Data Science Institute Vanderbilt Lab for Immersive AI Translation Department Faculty Our faculty are renowned leaders in their respective fields, extraordinary teachers, and dedicated mentors. Meet the Faculty Degree Programs Graduate ProgramsElectrical and computer engineering graduate students pursuing M.S. and Ph.D. degrees work with our accomplished faculty on high-impact research projects while gaining experience in specialized areas of interest. Focus areas include carbon, diamond and silicon nanotechnology, hybrid and embedded systems, medical image processing, photonics, radiation effects and reliability and robotics. Explore Graduate Degree Programs Apply to a Graduate Program Undergraduate ProgramsWe offer an accredited electrical and computer engineering undergraduate major, a double-major in electrical and computer engineering and biomedical engineering, and a minor in electrical and computer engineering.Program FeaturesThe immersive Senior Design Project brings together interdisciplinary teams of engineers to solve cutting-edge problems. Prior teams have gone on to start companies, lead to new industry products, and kickstart research careers. Summer research opportunities are also available in collaboration with the School of Engineering and the VUSE Undergraduate Summer Research Program. Additional opportunities are available in the NSF Research Experience for Undergraduates (REU) programs. ECE Major The curriculum of the Electrical and Computer Engineering major is multifaceted. It provides a broad foundation in mathematics, physics, and computer science and a traditional background in circuit analysis, digital systems, and electronics. Several exciting areas of concentration are available, including photonics, nanomaterials, microelectronics, embedded systems, cyber-physical systems, signal processing, and medical imaging. The ECE major can be combined with several other programs as a double major, including biomedical engineering, physics, and mathematics. Students receive an education that prepares them for diverse careers in industry, government, law, medicine, and postgraduate education.Curriculum and Degree Requirements ECE/BME Double Major The double major between Electrical and Computer Engineering and Biomedical Engineering is a strategic combination of the broad foundations of Biomedical Engineering with the in-depth preparation of Electrical and Computer Engineering. It is an ideal background for those interested in pursuing careers in instrumentation or the blending of computer technology with biomedical applications (e.g., medical informatics, imaging), as well as careers in research that are directed at the solution of biomedically-oriented problems or health care delivery. The similarity of the two curricula is leveraged so that the double major may be achieved with only six additional course hours beyond the standard load, at the cost of some flexibility in the selection of elective courses.While some anticipation of the additional course load is advised by taking extra classes in the freshman year, it is often not necessary for those with AP credit. In general the ECE/BME double major can be adopted as late as the sophomore year.Curriculum and Degree Requirements ECE Minor Minoring in Electrical and Computer Engineering (ECE) equips students with essential cross-disciplinary knowledge in circuits, digital systems, and programming. It also offers a diverse selection of ECE electives in areas such as photonics, nanomaterials, microelectronics, embedded systems, cyber-physical systems, medical imaging, and signal processing. In today's technology-driven world, where computers and electronics are integral to everything from spacecraft to home appliances, an ECE minor enhances coursework across the entire School of Engineering. It provides students with the tools to apply their disciplines more effectively to real-world challenges in manufacturing, economics, transportation, construction, aerospace, energy production, and environmental safety.Learn more See Undergrad Admissions Info Apply to an Undergraduate Program Latest News Read More Contact Us Shekhar Bhansali, ChairTim Holman, Director of Undergraduate StudiesAlan Peters, Director of Graduate StudiesJack Noble, Director of Graduate RecruitingDepartment Administration StaffMailing AddressDepartment of Electrical and Computer EngineeringVanderbilt UniversityPMB 3518242301 Vanderbilt PlaceNashville, TN 37235-1824",
  "content_length": 7438,
  "method": "requests",
  "crawl_time": "2025-12-01 14:50:43"
}