{
  "name": "Yasamin Nazari",
  "homepage": "https://www.cs.jhu.edu/~ynazari",
  "status": "success",
  "content": "Yasamin Nazari Yasamin Nazari y.nazari[AT]vu.nl Department of Computer Science Vrije Universiteit Amsterdam, Amsterdam, NL LinkedIn About me I am a tenured Assistant Professor (UD 2) at VU Amsterdam in the Theoretical Computer Science group. I also have a partial affiliation with CWI Network and Optimization group . I was a postdoctoral researcher at University of Salzburg in Austria working with Sebastian Forster. I completed my PhD at Johns Hopkins University, where I was advised by Mike Dinitz, and my masters at University of Calgary in Canada. You can access my current CV here (last update: July 2025). Research and Positions I am broadly interested in algorithms and theoretical computer science, with an emphasis on graph algorithms in various computational settings (dynamic, distributed, etc). I study graph theoretical structures that can be used to improve running time or memory of solving fundamental computational tasks. I am also interested in approximation and online algorithms, and the interplay of these topics. Grants I have been awarded the NWO (Dutch Research Council) Veni Award Publications (Authors are listed in alphabetic order:) Michael Dinitz, Ama Koranteng, YN , Approximation Algorithms for Optimal Hopsets, In proceedings of International Colloquium on Automata, Languages, and Programming (ICALP 2025) Michal Dory, Sebastian Forster, YN, Tijn de Vos, New Tradeoffs for Decremental Approximate All-Pairs Shortest Paths , In proceedings of International Colloquium on Automata, Languages, and Programming (ICALP 2024) Jan van den Brand, Sebastian Forster, YN, Adam Polak, On Dynamic Graph Algorithms with Predictions, In proceedings of Symposium on Discrete Algorithms (SODA 2024) Emilio Cruciani, Sebastian Forster, Gramoz Goranci, YN, Antonis Skarlatos, Dynamic algorithms for k-center on graphs, In proceedings of Symposium on Discrete Algorithms (SODA 2024) Michal Dory, Sebastian Forster, Yael Kirkpatrick, YN, Virginia Vassilevska Williams, Tijn de Vos, Fast 2-Approximate All-Pairs Shortest Paths, In proceedings of Symposium on Discrete Algorithms (SODA 2024) Sebastian Forster, YN, Maximilian Probst Gutenberg, Deterministic Incremental APSP with Polylogarithmic Update Time and Stretch, In proceedings of Symposium on Theory of Computing (STOC 2023) Sebastian Forster, Gramoz Goranci, YN, Antonis Skarlatos, Bootstrapping Dynamic Distance Oracles, In proceedings of European Symposium on Algorithms (ESA 2023) Greg Bodwin, Michael Dinitz, YN, Epic Fail: Emulators can tolerate polynomially many edge faults for free, In proceedings of 14th Conf. on Innovations in Theoretical Computer Science (ITCS 2023) Jan van den Brand, Sebastian Forster, YN, Fast Deterministic Fully Dynamic Distance Approximation, In proceedings the 63rd Symposium on Foundation of Computer Science (FOCS 2022) Presented as Rising Star Talk at the Fifth TCS Women Meeting at Theory Fest 2022 Jakub Łącki, YN, Near-Optimal Decremental Hopsets with Applications, In proceedings of 49th International Colloquium on Automata, Languages and Programming (ICALP 2022) Melika Abolhassani, Hossein Esfandiari, YN, Balasubramanian Sivan, Yifeng Teng, Creighton Thomas, Online Allocation and Display Ads Optimization with Surplus Supply, In proceedings of the 18th Conf on Web and Internet (WINE 2022) Greg Bodwin, Michael Dinitz, YN, Vertex Fault Tolerant Emulators, In proceedings of 13th Conf. on Innovations in Theoretical Computer Science (ITCS 2022) Amartya Shankha Biswas, Michal Dory, Mohsen Ghaffari, Slobodan Mitrović, YN, Massively Parallel Algorithms for Distance Approximation and Spanners, In proceedings of 33rd Symp. on Parallelism in Algorithms and Architectures (SPAA 2021) Michael Dinitz, YN, Zeyu Zhang, Lasserre Integrality Gaps for Graph Spanners and Related Problems, In proceedings of 18th Workshop on Approximation and Online Algorithms (WAOA 2020) YN, Sparse Hopsets in Congested Clique, In proceedings of 23rd Conference on Principles of Distributed Systems (OPODIS 2019) Michael Dinitz and YN, Massively Parallel Distance Sketches, In proceedings of 23rd Conference on Principles of Distributed Systems (OPODIS 2019), Best Student Paper Award, Breif Announcement presented at The International Symposium on Distributed Computing (DISC 2019) Michael Dinitz and YN, Distributed Distance-Bounded Network Design Through Distributed Convex Programming, In proceedings of 21st International Conference on Principles of Distributed Systems (OPODIS 2017) George Giakkoupis, YN, Philipp Woelfel, How Asynchrony Affects Rumor Spreading Time, In proceedings of 35th Symposium on Principles of Distributed Computing (PODC 2016) You can also view an updated list at my Google Scholar page or DBLP. Supervision Ben Bals (CWI and VU, co-advised with Solon Pissis and Daniel Dadush) Rajath Rao (VU) Teaching Fall 2025 (VU Amsterdam): Network and Graphs Fall 2022 (University of Salzburg): Combinatorial Optimization (Course Website) Academic Service Member of Dutch NWO Round Table Computer Science (Tafel Informatica) Board member of the Dutch (IPN) Interest Group on Algorithms (SIG Algo) Workshop Organizer: Algorithms postdocs in Europe [AlgPie] (Poland, Summer 2022), Dagstuhl seminar Graph algorithms: dynamic meets distributed (Germany, Fall 2024).\t\t\t\t\t\t Program Committee: SODA 2026, ICALP 2025, STOC 2024, HALG 2024, SOSA 2024, ESA 2023, SIROCCO 2023 External reviewer: STOC 2023, ICALP 2023, SODA 2023, STOC 2022, ESA 2022, SPAA 2022, SIROCCO 2022, DISC 2021, SPAA 2021, STOC 2021, SODA 2021, SODA 2020, SPAA 2019, APPROX 2019, OPODIS 2018",
  "content_length": 5570,
  "method": "requests",
  "crawl_time": "2025-12-01 14:50:39"
}