{
  "name": "Yashwant K. Malaiya",
  "homepage": "http://www.cs.colostate.edu/~malaiya",
  "status": "success",
  "content": "Yashwant K. Malaiya Yashwant K. Malaiya Professor, Computer Science Department Voice: (970) 491-7031, Fax: (970) 491-2466 Email: malaiya@ cs.colostate.edu Address Computer Science Department 1873 Campus Delivery Fort Collins, CO 80523-1873 Office location: 356 Computer Science Building (see map) Biographical information, publications, CV Erdös number 2, Academic lineage to Isaac Newton and Beyond Research Major Topics: Software and hardware testing Fault modeling, Test effectiveness, Testing strategies Software and hardware Reliability Reliability growth for design faults, Relationship between test coverage and reliability. Security vulnerabilities Discovery process modeling, Metrics Some books that use our results: Machine Learning Techniques for Improved Business Analytics, Dileep Kumar G., Ed, IGI Global, 2018, see related paper) Software Reliability Assessment with OR Applications, Springer Series in Reliability Engineering, P.K. Kapur, Hoang Pham, A. Gupta, P.C. Jha, Springer Science & Business Media, 2013, see related paper) Security Engineering for Cloud Computing: Approaches and Tools: Approaches and Tools, David G Rosado, July 2011, IGI Global, Sep 30, 2012 A large Scale validation of A methodology for Assessing Software Reliability, C.S. Smidts, Y. Shi, M. Li, W. Kong, J. Dai,July 2011, U.S. Nuclear Regulatory Commission.(Fault Exposure Ratio, see related paper) Secure Coding in C and C++, Robert C. Seacord, Addison-Wesley Professional; Sep 9 2005, (Vulenrability discovery Data, see related paper) Software Measurement and Estimation: A Practical Approach by Linda M. Laird and M. Carol Brennan, John Wiley & Sons Canada, Ltd.; May 18 2006, (Module size and complexity, see related paper) Random testing of digital circuits: theory and applications, René David, CRC Press, 1998. (Detectability Profile concept, see related paper) Digital hardware testing: transistor-level fault modeling and testing, Rochit Rajsuman, Artech House Publishers, 1992.(IDDQ Testing, see related paper) Some press and comments about our work: Researchers Struggle to Determine True Cost of Data Breaches Robert Lemos, eWeek, July 24, 2016, pages 13-14. Heading off the hackers: Research predicts software vulnerabilities CSU Magazine, pages 13-14. Is Internet Explorer More Secure than Firefox?, Kate Green, MIT Techology review, Sept. 21, 2006. Software Flaws Can Be Predicted, David Utter, SecurityProNews, July 3, 2006. Modell zur Vorhersage von Sicherheitslucken, von Frank Ziemann, PCWelt, July 4, 2006 Researchers look to predict software flaws, Robert Lemos, July 10, 2006, also at SecurityFocus, July 7, 2006. CSU team crushes computer bugs, Christine McManus, Coloradoan, July 10, 2006. Editor's Eye, Jon Erickson, Dr. Dobb's Portal, July 3, 2006. Un progetto di ricerca per prevedere il numero di errori nel softwarePaolo De Nictolis,13-07-2006. Testing, Reliability & Security Research Group: Publications/Reports Courses CS559: Quantitative Security CS530, CS530DL: Fault-Tolerant Computing CS470: Computer Architecture CS370: Operating Systems CS635: Adv. Fault-Tolerant Computing CS150: Interactive Programming with Java CS270: Computer Organization Computer Science Department Home Page",
  "content_length": 3215,
  "method": "requests",
  "crawl_time": "2025-12-01 14:50:46"
}