{
  "name": "Yashaswi Verma",
  "homepage": "https://sites.google.com/view/yashaswiverma",
  "status": "success",
  "content": "HomeSearch this siteEmbedded FilesSkip to main contentSkip to navigationYashaswi VermaPresently, I am a faculty in the Department of Computer Science & Engineering  (CSE) at Indian Institute of Technology, Jodhpur (IITJ), India. Previously, I was an INSPIRE Faculty Fellow at Indian Institute of Science, Bengaluru, India. Before that, I completed my BTech and PhD from IIIT-Hyderabad, India. CVNote: Due to time constraints, I won't be able to accept any application for internship/short-term engagement. Email: yashaswi@iitj.ac.in Address: Room No. 227, Department of Computer Science and Engineering, Indian Institute of Technology Jodhpur, NH 62, Nagaur Road, Karwar, Jodhpur, Rajasthan (India) - 342030. Contact: (91) (291) 280 1260Note: The following articles (and associated data/codes) are made available under the Creative Commons CC-BY-NC- ND license.Journal Publications: \"Early-stage autism diagnosis using action videos and contrastive feature learning\" [code] [link] [view] [pdf] In: Multimedia Systems 2023 (Asha Rani, Pankaj Yadav and Yashaswi Verma) \"A retrieval-based approach for diverse and image-specific adversary selection\" [link] [pdf]       In: IJMIR 2020 (Rajvardhan Singh Ravat and Yashaswi Verma) \"Diverse Image Annotation with Missing Labels\" [code] [link] [pdf]        In: PR 2019 (Yashaswi Verma) \"Automatic image annotation: The quirks and what works\" [code] [link] [pdf]       In: MTA 2018 (Ayushi Dutta, Yashaswi Verma and C. V. Jawahar) \"Cross-specificity: Modelling data semantics for cross-modal matching and retrieval\" [link] [pdf]        In: IJMIR 2018 (Yashaswi Verma, Abhishek Jha and C. V. Jawahar) \"Image Annotation by Propagating Labels from Semantic Neighbourhoods\" [code] [link] [pdf]        In: IJCV 2017 (Yashaswi Verma and C. V. Jawahar) \"A Support Vector Approach for Cross-Modal Search of Images and Texts\" [code] [link] [pdf]        In: CVIU 2017 (Yashaswi Verma and C. V. Jawahar) Conference/Workshop Publications: \"Cross-modal Retrieval Using Contrastive Learning of Visual-Semantic Embeddings\" [code] [link] [arXiv] In: ICPR 2022 (Anurag Jain and Yashaswi Verma) \"Surprising Effectiveness of Random Feature Embeddings in eXtreme Classification\" [code] [link] [arXiv] In: ICPR 2022 (Yashaswi Verma) \"Multi-view Multi-label Canonical Correlation Analysis for Cross-modal Matching and Retrieval\" [code] [link] [pdf] In CVPR Workshop 2022 (Rushil Sanghavi and Yashaswi Verma) \"Worst Case Adversarial Perturbation and Effect of Feature Normalization on Max-Margin Multi-label Classifiers\" [pdf] In: ICVGIP Workshop 2021 (Ritesh Kumar Gupta and Yashaswi Verma) \"Recurrent Image Annotation With Explicit Inter-Label Dependencies\" [code] [link] [pdf]        In: ECCV 2020 (Ayushi Dutta, Yashaswi Verma and C. V. Jawahar) \"A Robust Distance with Correlated Metric Learning for Multi-Instance Multi-Label Data\" [link] [pdf]        In: ACM Multimedia 2016 (Yashaswi Verma and C. V. Jawahar) \"A Probabilistic Approach for Image Retrieval Using Descriptive Textual Queries\" [link] [pdf]        In: ACM Multimedia 2015 (Yashaswi Verma and C. V. Jawahar) \"Exploring Locally Rigid Discriminative Patches for Learning Relative Attributes\" [project] [code] [link] [pdf]        In: BMVC 2015 (Yashaswi Verma and C. V. Jawahar)\"Im2Text and Text2Im: Associating Images and Texts for Cross-Modal Retrieval\" [code] [link] [pdf]        In: BMVC 2014 (Yashaswi Verma and C. V. Jawahar) \"Relative Parts: Distinctive Parts for Learning Relative Attributes\" [project] [code] [link] [pdf]        In: CVPR 2014 (Ramachandruni N. Sandeep, Yashaswi Verma and C. V. Jawahar) \"Exploring SVM for Image Annotation in Presence of Confusing Labels\" [link] [pdf]        In: BMVC 2013 (Yashaswi Verma and C. V. Jawahar) \"Generating Image Descriptions Using Semantic Similarities in the Output Space\" [link] [pdf]        In: CVPR Workshop 2013 (Yashaswi Verma, Ankush Gupta, Prashanth Mannem and C. V. Jawahar) \"Neti Neti: In Search of Deity\" [link] [pdf]        In: ICVGIP 2012 (Yashaswi Verma and C. V. Jawahar) \"Image Annotation Using Metric Learning in Semantic Neighbourhoods\" [code] [link] [pdf]        In: ECCV 2012 (Yashaswi Verma and C. V. Jawahar) \"Choosing Linguistics over Vision to Describe Images\" [link] [pdf]        In: AAAI 2012 (Ankush Gupta, Yashaswi Verma and C. V. Jawahar)PhD dissertation: \"Understanding Semantic Association Between Images and Text\" [pdf] Panel of Examiners: Dr. Manish Gupta, Dr. Raghavan Manmatha, Dr. Rajeev Rastogi and Prof. C. V. Jawahar Google SitesReport abuseGoogle SitesReport abuse",
  "content_length": 4545,
  "method": "requests",
  "crawl_time": "2025-12-01 14:50:45"
}