{
  "name": "Yasir Mehmood",
  "homepage": "https://lums.edu.pk/lums_employee/4841",
  "status": "success",
  "content": "| Welcome to LUMS Skip to main content ApplyAdmissionsFinancial AidDonateCampus HealthNewsEventsContact Faculty Directory LUMS faculty comprises recognised experts across a variety of disciplines who are driven by a shared purpose: to make a better world through scholarship, research and teaching. Our 200+ PhD holding faculty members are leaders in their respective fields, and work collaboratively with each other and students to develop innovative solutions to 21st century challenges. Filter By SchoolSuleman Dawood School of BusinessSyed Ahsan Ali and Syed Maratib Ali School of EducationMushtaq Ahmad Gurmani School of Humanities and Social SciencesShaikh Ahmad Hassan School of LawSyed Babar Ali School of Science and Engineering Filter By Subject AreaBiologyEducationChemistry & Chemical EngineeringComputer ScienceEconomicsElectrical EngineeringHumanities and Social SciencesMathematicsPhysics ApplyClear Dr. Ali Cheema Vice Chancellor Economics Mushtaq Ahmad Gurmani School of Humanities and Social Sciences Profile Dr. Tariq Mahmood Jadoon Provost, Office of the Provost Electrical Engineering Syed Babar Ali School of Science and Engineering Profile Dr. Sadaf Aziz Dean Shaikh Ahmad Hassan School of Law Profile Dr. Ali Khan Dean Humanities and Social Sciences Mushtaq Ahmad Gurmani School of Humanities and Social Sciences Profile Dr. Walther Schwarzacher Professor & Dean Physics Syed Babar Ali School of Science and Engineering Profile Dr. Tayyaba Tamim Associate Professor Education Syed Ahsan Ali and Syed Maratib Ali School of Education Profile Dr. Muhammad Adeel Zaffar Dean Suleman Dawood School of Business Profile Mr. Imad Adjunct Faculty Humanities and Social Sciences Mushtaq Ahmad Gurmani School of Humanities and Social Sciences Profile Dr. Faiza Assistant Professor Shaikh Ahmad Hassan School of Law Profile Ms. Maheen Aamir Syed Teaching Fellow Suleman Dawood School of Business Profile Dr. Tauqeer Abbas Assistant Professor Chemistry & Chemical Engineering Syed Babar Ali School of Science and Engineering Profile Dr. Sameera Abbas Assistant Professor Humanities and Social Sciences Mushtaq Ahmad Gurmani School of Humanities and Social Sciences Profile Mr. Mohib Abbas Ali Adjunct Faculty Suleman Dawood School of Business Profile Dr. Syed Kumail Abbas Rizvi Associate Professor Suleman Dawood School of Business Profile Dr. Reza Abdolmaleki Assistant Professor Mathematics Syed Babar Ali School of Science and Engineering Profile Dr. Muhammad Abdur Rahman Malik Associate Professor Suleman Dawood School of Business Profile Dr. Muhammad Abubakr Associate Professor Electrical Engineering Syed Babar Ali School of Science and Engineering Profile Ms. Khadija Aftab Adjunct Faculty Economics Mushtaq Ahmad Gurmani School of Humanities and Social Sciences Profile Mr. Hafiz Muhammad Afzal Lecturer Chemistry & Chemical Engineering Syed Babar Ali School of Science and Engineering Profile Dr. Zartash Afzal Uzmi Professor Electrical Engineering Syed Babar Ali School of Science and Engineering Profile Mr. Bilal Ahmad Adjunct Faculty Education Syed Ahsan Ali and Syed Maratib Ali School of Education Profile Ms. Ayesha Ahmad Adjunct Faculty Mathematics Syed Babar Ali School of Science and Engineering Profile Mr. Shahab Ud Din Ahmad Adjunct Faculty Humanities and Social Sciences Mushtaq Ahmad Gurmani School of Humanities and Social Sciences Profile Dr. Sadaf Ahmad Professor Humanities and Social Sciences Mushtaq Ahmad Gurmani School of Humanities and Social Sciences Profile Dr. Ferhana Ahmad Associate Professor Suleman Dawood School of Business Profile Dr. Muhammad Ghufran Ahmad Associate Professor Suleman Dawood School of Business Profile Mr. Waqar Ahmad Assistant Professor of Practice Computer Science Syed Babar Ali School of Science and Engineering Profile Mr. Osama Ahmad Adjunct Faculty Profile Mr. Muhammad Ahmad Adjunct Faculty Profile Dr. Ali Nobil Ahmad Associate Professor Humanities and Social Sciences Mushtaq Ahmad Gurmani School of Humanities and Social Sciences Profile Dr. Aisha Ahmad Assistant Professor Shaikh Ahmad Hassan School of Law Profile Dr. Fiaz Ahmad Chaudhry Professor and Werner-Von-Siemens Chair Electrical Engineering Syed Babar Ali School of Science and Engineering Profile Dr. Malik Fakhar Ahmed Visiting Assistant Professor Economics Mushtaq Ahmad Gurmani School of Humanities and Social Sciences Profile Dr. Ammar Ahmed Khan Associate Professor Physics Syed Babar Ali School of Science and Engineering Profile Miss. Furrha Ahsan Adjunct Faculty Humanities and Social Sciences Mushtaq Ahmad Gurmani School of Humanities and Social Sciences Profile Dr. Muhammad Shabbir Ahsen Associate Professor Humanities and Social Sciences Mushtaq Ahmad Gurmani School of Humanities and Social Sciences Profile Dr. Muhammad Ajmal Adjunct Faculty Suleman Dawood School of Business Profile Mr. Nafeh Akbar Adjunct Faculty Suleman Dawood School of Business Profile Mr. Farhan Akhtar Adjunct Faculty Suleman Dawood School of Business Profile Mr. Asad Alam Associate Professor Suleman Dawood School of Business Profile Dr. Samnan Ali Assistant Professor Suleman Dawood School of Business Profile Ms. Samia Ahmed Ali Teaching Fellow Suleman Dawood School of Business Profile Dr. Ayesha Ali Associate Professor Economics Mushtaq Ahmad Gurmani School of Humanities and Social Sciences Profile Dr. Fahd Ali Visiting Assistant Professor Economics Mushtaq Ahmad Gurmani School of Humanities and Social Sciences Profile Dr. Ahtisham Ali Adjunct Faculty Humanities and Social Sciences Mushtaq Ahmad Gurmani School of Humanities and Social Sciences Profile Dr. Syed Zahid Ali Professor Economics Mushtaq Ahmad Gurmani School of Humanities and Social Sciences Profile Dr. Syed Mubashir Ali Associate Professor Suleman Dawood School of Business Profile Dr. Farah Hasan Ali Assistant Professor Humanities and Social Sciences Mushtaq Ahmad Gurmani School of Humanities and Social Sciences Profile Dr. Faiza Ali Associate Dean, Research Suleman Dawood School of Business Profile Mr. Muhammad Umar Ali Visiting Assistant Professor Shaikh Ahmad Hassan School of Law Profile Dr. Waqas Ali Azhar Assistant Professor Mathematics Syed Babar Ali School of Science and Engineering Profile Mr. Muhammad Ali Syed Adjunct Faculty Suleman Dawood School of Business Profile Dr. Muhammad Hamad Alizai Associate Professor Computer Science Syed Babar Ali School of Science and Engineering Profile Dr. Qandeel Almas Assistant Professor Chemistry & Chemical Engineering Syed Babar Ali School of Science and Engineering Profile Mr. Saad Amir Assistant Professor of Practice Shaikh Ahmad Hassan School of Law Profile Ms. Zainab Amir Adjunct Faculty Suleman Dawood School of Business Profile Miss. Maria Amir Adjunct Faculty Humanities and Social Sciences Mushtaq Ahmad Gurmani School of Humanities and Social Sciences Profile Dr. Imran Anwar Associate Professor Mathematics Syed Babar Ali School of Science and Engineering Profile Dr. Muhammad Sabieh Anwar Professor Physics Syed Babar Ali School of Science and Engineering Profile Dr. Ghulam Ali Arain Associate Professor Suleman Dawood School of Business Profile Ms. Samina Arifa Adjunct Faculty Humanities and Social Sciences Mushtaq Ahmad Gurmani School of Humanities and Social Sciences Profile Mr. Sheikh Arsalan Ul Haq Adjunct Faculty Economics Mushtaq Ahmad Gurmani School of Humanities and Social Sciences Profile Dr. Naveed Arshad Professor Computer Science Syed Babar Ali School of Science and Engineering Profile Dr. Salman Noshear Arshad Associate Professor Chemistry & Chemical Engineering Syed Babar Ali School of Science and Engineering Profile Dr. Sher Afghan Asad Assistant Professor Economics Mushtaq Ahmad Gurmani School of Humanities and Social Sciences Profile Ms. Shizza Asher Teaching Fellow Computer Science Syed Babar Ali School of Science and Engineering Profile Ms. Rida Ashfaq Adjunct Faculty Humanities and Social Sciences Mushtaq Ahmad Gurmani School of Humanities and Social Sciences Profile Mr. Tabjeel Ashraf Adjunct Faculty Suleman Dawood School of Business Profile Ms. Arman Ashraf Teaching Fellow Humanities and Social Sciences Mushtaq Ahmad Gurmani School of Humanities and Social Sciences Profile Dr. Muhammad Junaid Ashraf Associate Professor Suleman Dawood School of Business Profile Dr. Ghazal Asif Assistant Professor Humanities and Social Sciences Mushtaq Ahmad Gurmani School of Humanities and Social Sciences Profile Mr. Muhammad Asim Teaching Fellow Suleman Dawood School of Business Profile Mr. Muhammad Zubair Aslam Adjunct Faculty Suleman Dawood School of Business Profile Ms. Angbeen Atif Mirza Assistant Professor Shaikh Ahmad Hassan School of Law Profile Ms. Anusheh Attique Adjunct Faculty Profile Mr. Ali Awais Adjunct Faculty Shaikh Ahmad Hassan School of Law Profile Dr. Mian Muhammad Awais Professor Computer Science Syed Babar Ali School of Science and Engineering Profile Mr. Muhammad Luqman Awan Senior Lecturer Suleman Dawood School of Business Profile Mr. Ahmad Ayub Teaching Fellow Education Syed Ahsan Ali and Syed Maratib Ali School of Education Profile Dr. Haniya Azam Associate Professor Mathematics Syed Babar Ali School of Science and Engineering Profile Dr. Muhammad Azeem Associate Professor Shaikh Ahmad Hassan School of Law Profile Ms. Mahnoor Azeem Adjunct Faculty Humanities and Social Sciences Mushtaq Ahmad Gurmani School of Humanities and Social Sciences Profile Mr. Younis Bin Azeem Adjunct Faculty Humanities and Social Sciences Mushtaq Ahmad Gurmani School of Humanities and Social Sciences Profile Mr. Hassan Aziz Adjunct Faculty Humanities and Social Sciences Mushtaq Ahmad Gurmani School of Humanities and Social Sciences Profile Dr. Khawaja Zahid Aziz Adjunct Faculty Humanities and Social Sciences Mushtaq Ahmad Gurmani School of Humanities and Social Sciences Profile Dr. Saad Azmat Associate Professor Suleman Dawood School of Business Profile Ms. Mahrukh Baig Teaching Fellow Humanities and Social Sciences Mushtaq Ahmad Gurmani School of Hu",
  "content_length": 46040,
  "method": "requests",
  "crawl_time": "2025-12-01 14:50:47"
}