{
  "name": "Yasmine Kotturi",
  "homepage": "https://ykotturi.github.io",
  "status": "success",
  "content": "Yasmine Kotturi, Ph.D. Yasmine Kotturi, Ph.D.Information Systems Department University of Maryland, Baltimore County Follow Baltimore, MDX/Twitter CV LinkedIn Github Google ScholarI am an Assistant Professor of Human-Centered Computing at University of Maryland, Baltimore County in the Information Systems Department. I am also an Affiliate Faculty in the Department of Computer Science and Electrical Engineering. My work focuses on human-centered AI, the future of work, and community-engaged research, particularly with the goal of supporting worker resilience amid rapid technological change. I completed my Ph.D. in Human-Computer Interaction at Carnegie Mellon University. Selected Projects and Publications BizChat: Scaffolding AI-Powered Business Planning for Small Business Owners Across Digital Skill LevelsQuentin Romero Lauro, Aakash Gautum, Yasmine KotturiIn this demo, we introduce BizChat, an AI-powered web application designed to help small business owners complete tedious yet essential back-office tasks (e.g., writing a business plan). Drawing from learning sciences, BizChat provides accessible, just-in-time support tailored to users’ digital skills and business goals.CHIWORK Demo 2025 Project website PDF Abstract Generative AI can help small business owners automate tasks, increase efficiency, and improve their bottom line. However, despite the seemingly intuitive design of systems like ChatGPT, significant barriers remain for those less comfortable with technology. To address these disparities, prior work highlights accessory skills—beyond prompt engineering—users must master to successfully adopt generative AI including keyboard shortcuts, editing skills, file conversions, and browser literacy. Building on a design workshop series and 15 interviews with small businesses, we introduce BizChat, a large language model (LLM)-powered web application that helps business owners across digital skills levels write their business plan—an essential but often neglected document. To do so, BizChat's interface embodies three design considerations inspired by learning sciences: ensuring accessibility to users with less digital skills while maintaining extensibility to power users (\"low-floor-high-ceiling\"), providing in situ micro-learning to support entrepreneurial education (\"just-in-time learning\"), and framing interaction around business activities (\"contextualized technology introduction\"). We conclude with plans for a future BizChat deployment. Deconstructing the Veneer of Simplicity: Co-Designing Introductory Generative AI Workshops with Local EntrepreneursYasmine Kotturi, Angel Anderson, Glenn Ford, Michael Skirpan, Jeffrey BighamIn this paper, we designed an interactive workshops series aimed to onboard local entrepreneurs to generative AI platforms for small business. We detail the importance of communal and supportive exposure to generative AI tools for local entrepreneurs, scaffolding actionable use (and supporting non-use), demystifying generative AI technologies by emphasizing entrepreneurial power, while simultaneously deconstructing the veneer of simplicity to address the many operational skills needed for successful application.CHI 2024 Project website PDF Abstract Generative AI platforms and features are permeating many aspects of work. Entrepreneurs from lean economies in particular are well positioned to outsource tasks to generative AI given limited resources. In this paper, we work to address a growing disparity in use of these technologies by building on a four-year partnership with a local entrepreneurial hub dedicated to equity in tech and entrepreneurship. Together, we co-designed an interactive workshops series aimed to onboard local entrepreneurs to generative AI platforms. Alongside four community-driven and iterative workshops with entrepreneurs across five months, we conducted interviews with 15 local entrepreneurs and community providers. We detail the importance of communal and supportive exposure to generative AI tools for local entrepreneurs, scaffolding actionable use (and supporting non-use), demystifying generative AI technologies by emphasizing entrepreneurial power, while simultaneously deconstructing the veneer of simplicity to address the many operational skills needed for successful application. Peerdea: Co-Designing a Peer Support Platform with Creative EntrepreneursYasmine Kotturi, Jenny Yu, Pranav Khadpe, Harvey Zheng, Erin Gatz, Sarah Fox, Chinmay KulkarniIn this paper, we describe a multi-year partnership with a local feminist makerspace to build a social platform, called Peerdea, which centered creative entrepreneurs’ needs such that online feedback and information exchange, and goal setting and accountability were more readily available to them. Through an iterative, community-collaborative approach with 46 creative entrepreneurs, we report on the kinds of peer support entrepreneurs sought on Peerdea such as feedback on in-progress and unpolished work.CSCW 2024 Project website PDF Abstract Creative entrepreneurs rely on online platforms to build community in order to overcome isolated work conditions. However, because of frequent attempts by larger brands to use their work without permission, creative entrepreneurs constrain their use of social platforms in order to safeguard their intellectual property. In this paper, we describe a multi-year partnership with a feminist makerspace to build a social platform, called Peerdea, that centered creative entrepreneurs' needs such that online feedback and information exchange, and goal setting and accountability were more readily available to them. Through an iterative, community- collaborative approach with 46 creative entrepreneurs, we report on the kinds of peer support entrepreneurs sought on Peerdea such as feedback on in-progress and unpolished work. We argue that by aligning Peerdea's design with the makerspace's community of practice, Peerdea leveraged the relationship and trust building which occurs more readily in person for entrepreneurs. In addition, we highlight the role of a community leader who actively managed the relationships between researchers and entrepreneurs, surfaced failures and championed successes, and provided critical mediation for co-design when participants' livelihoods were implicated. @article{kotturi2024peerdea, title={Peerdea: Co-Designing a Peer Support Platform with Creative Entrepreneurs}, author={Kotturi, Yasmine and Yu, Jenny and Khadpe, Pranav, and Zheng, Harvey, and Gatz, Erin and Fox, Sarah E and Kulkarni, Chinmay}, journal={Proceedings of the ACM on Human-Computer Interaction}, volume={}, number={CSCW1}, pages={1--27}, year={2024}, publisher={ACM New York, NY, USA} } Exploring the Role of Social Support when Integrating Generative AI in Small Business WorkflowsQuentin Romero Lauro, Jeffrey P. Bigham, Yasmine KotturiWe interviewed 11 entrepreneurs and support personnel to detail how entrepreneurs resourcefully leveraged their local networks to discover new use-cases of generative AI (e.g., by sharing accounts), assuage heightened techno-anxieties (e.g., by recruiting trusted confidants), overcome barriers to sustained use (e.g., by receiving wrap-around support), and establish boundaries of use.CSCW 2024 Poster PDF Abstract Small business owners stand to benefit from generative AI technologies due to limited resources, yet they must navigate increasing legal and ethical risks. In this paper, we interview 11 entrepreneurs and support personnel to investigate existing practices of how entrepreneurs integrate generative AI technologies into their business workflows. Specifically, we build on scholarship in HCI which emphasizes the role of small, offline networks in supporting entrepreneurs' technology maintenance. We detail how entrepreneurs resourcefully leveraged their local networks to discover new use-cases of generative AI (e.g., by sharing accounts), assuage heightened techno-anxieties (e.g., by recruiting trusted confidants), overcome barriers to sustained use (e.g., by receiving wrap-around support), and establish boundaries of use. Further, we suggest how generative AI platforms may be redesigned to better support entrepreneurs, such as by taking into account the benefits and tensions of use in a social context. Sustaining Community-Based Research in Computing: Lessons from Two Tech Capacity Building Initiatives for Local BusinessesYasmine Kotturi and Julie Hui (shared first authorship), TJ Johnson, Lutalo Sanifu, Tawanna DillahuntDrawing on two multi-year programs for small-scale tech capacity building in post-industrial U.S. cities, this article presents a comparative analysis and retrospective ethnography to investigate the challenges and strategies for sustained community-based research in computing. In particular, our work aimed to better understand and contribute the necessary considerations and dynamics among the academic-community partnerships attributed to sustaining the community-based programs over time.CSCW 2024 Project website PDF Abstract The field of human-computer interaction (HCI) has traditionally focused on the design of novel technology artifacts. However, ensuring considerations for artifact maintenance and repair is crucial to sustainably supporting the populations they aim to serve over the long term. Drawing on two multi-year programs for tech capacity building in post-industrial U.S. cities, this article presents a comparative analysis to investigate the challenges and strategies for sustained community-based research in computing. In particular, our work detailed three considerations for academic-community partnerships. First, long-term partnerships prioritized transferring trust across academic and community personnel and continually set expectations that responded to evolving community initiatives (i.e., relational sustainability). Second, partnerships used academic support as a way to kickstart community initiatives, and flexibly reframed intervent",
  "content_length": 13299,
  "method": "requests",
  "crawl_time": "2025-12-01 14:50:47"
}