{
  "name": "Yasuko Matsubara",
  "homepage": "https://www.dm.sanken.osaka-u.ac.jp/~yasuko",
  "status": "success",
  "content": "Yasuko Matsubara - SANKEN, The University of Osaka Yasuko Matsubara Home Publications Software Profile (JP) Publications (JP) Yasuko Matsubara I am a professor at The University of Osaka, Japan. My research focuses on time-series data mining and nonlinear dynamic systems. I obtained my PhD degree from Kyoto University in 2012. DBLP google scholar Affiliation Sakurai+Matsubara Laboratory SANKEN Osaka University Mihogaoka 8-1, Ibaraki, Osaka 567-0047, Japan yasuko [at] sanken.osaka-u.ac.jp Education Ph.D. (2012) Graduate School of Informatics, Department of Social Informatics, Kyoto University M.Sc. (2009) Graduate School of Humanities and Sciences, Advanced Sciences, Ochanomizu university B.Sc. (2007) Department of information sciences, Ochanomizu university Experiences Professor at The University of Osaka (2025-) Associate professor at The University of Osaka (2019-2025) IROAST , Young Faculty Members for International Joint Research (2017-2019) JST, PRESTO (2016-) Assistant professor at Kumamoto University (2014-2019) Visiting researcher at CSD, Carnegie Mellon University (2013-2015), Supervisor: Christos Faloutsos JSPS research fellow, PD (2013-2014) Supervisor: Yasushi Sakurai Research associate at NTT Communication Science Laboratories (2012-2013) Visiting student at Computer Science Department, Carnegie Mellon University (2011-2012), Supervisor: Christos Faloutsos JSPS research fellow, DC2 (2010-2012) Supervisor: Masatoshi Yoshikawa Research intern at NTT Communication Science Laboratories (2009-2012) Mentor: Yasushi Sakurai Others Tutorials @ [SIGMOD'15] / [WWW'16] / [KDD'17] Meet Dr. Yasuko Matsubara, Caterpillar Women in STEM 4th Grand Prize Winner (April, 2024) MicroAdapt@KDD2025 - Self-Evolutionary Dynamic Modeling Algorithms (August, 2025) Last-updated: 05-07-2019",
  "content_length": 1805,
  "method": "requests",
  "crawl_time": "2025-12-01 14:50:48"
}