{
  "name": "Ye Shi 0001",
  "homepage": "http://faculty.sist.shanghaitech.edu.cn/faculty/shiye",
  "status": "success",
  "content": "Ye Shi/Homepage Ye Shi Home About Me Research Publications Activities Group Ye Shi  ç³é Tenure-track Assistant Professor ç ç©¶åãåå¯¼ (SIST, ShanghaiTech University) Email: shiye@shanghaitech.edu.cn Phone: (021) 20684426 Address: Building 1A 404.A, 393 Huaxia Middle Road, Pudong New Area, Shanghai, 201210, China. Major: Computer Science, Information and Communication Engineering. Research areas: Artificial Intelligence, Smart grid, Nonconvex optimization and Big data. Position Openings Postgraduate Students: Dr. Ye Shi recruits 2~3 postgraduate students for each academic year. The candidate is expected to be self-motivated in doing research on Artificial Intelligence, Machine learning, 3D Vision, Smart Energy, etc. Solid mathemetical background and sufficient programming skills are required. If you are interested in this opening, please email me your CV ; Undergraduates/Visting Students: We warmly encourage students (from ShanghaiTech or other Universities) studying at Computer Science and Technology, Information and Communication Engineering, and other related disciplines to join our group; Research Assistant: Dr. Ye Shi is seeking a research assistant to work closely with the principal investigator, postdoc, and students in the laboratory. A master degree in mathematics, computer science, machine learning, electrical engineering, control, big data or related areas is required. Research Interests My current research interests mainly focus on Artificial Intelligence, Machine learning, 3D Vision, Smart Energy, and on the fundamental optimizations underlying them. I am interested in developing Trustworty AI algorithms that are more robust, more privacy-preserving and more explainable compared with traditional deep learning methods. Moreover, our target is to use the developed RAI methods to solve not only the tasks like Computer Vision and Natual Laguage Processing, but also the real-world applications, such as Smart Grid and Robotics. Optimization for Trustworty AI Learning and Optimization for applications: 3D Vision, Smart Grid, Robotics, etc. Federated Learning Brief Biography Dr. Ye Shi received the B.S. degree at Northwestern Polytechnical University, China in 2013 and the Ph.D. degree at University of Technology Sydney (UTS), Australia in 2018. His Ph.D. is under the supervision of Prof. Tuan D. Hoang, who is an expert in the field of control and optimization. Dr Shi served as a Research Assistant at the University of New South Wales, Australia from 2017 to 2019, and a Postdoctoral Fellow at the University of Technology Sydney from 2019 to 2020. Dr. Shi has been an Assistant Professor (PI) in the School of Information Science and Technology at ShanghaiTech University since January 2021. Dr. Shi also received many honors and awards, including the 2018 National Outstanding Self-financed International Student Scholarship, the 2016 IEEE ICCSCE Best Paper Award, the 2017 UTS Higher Degree Research Publication Award, the 2014 Australia ARC Discovery Award, and the 2014 UTS International Research Scholarship, the Meritorious Winner of the 2013 American College Students Mathematical Contest in Modeling, the First Prize of the 2012 Chinese College Students Mathematical Contest in Modeling, the 2010 National Scholarship, etc. In addition, Dr. Shi serves as a Reviewer for many top-level international journals, such as IEEE Journal on Selected Areas in Communications, IEEE Transactions on Smart Grid, IEEE Transactions on Power Systems, IEEE Transactions on Fuzzy Systems, IEEE Transactions on Industrial Informatics, IEEE Transactions on Industrial Electronics, Information Sciences, Applied Soft Computing, IEEE Systems Journal. Recent News Apr. 2023 | \"FedTP: Federated Learning by Transformer Personalization\" has been accpeted by IEEE Transactions on Neural Networks and Learning Systems, 2023. (Impact factor 14.225) Congratualation to Hongxia Li and Zhongyi Cai! Jan. 2023 | \"Robust Fuzzy Neural Network with an Adaptive Inference Engine\" has been accpeted by IEEE Transactions on Cybernetics, 2023. (Impact factor 19.118) Congratualation to Leijie Zhang! Jan. 2023 | \"Alternating Differentiation for Optimization Layers\" has been accpeted by ICLR 2023 (CCF A). Congratualation to Haixiang Sun! Nov. 2022 | \"IKOL: Inverse kinematics optimization layer for 3D human pose and shape estimation via Gauss-Newton differentiation\" has been accpeted by AAAI 2023 (CCF A) as an Oral. Congratualation to Juze Zhang! Nov. 2022 | \"Beyond Rehearsal: Lifelong Person Re-Identification via Knowledge Refreshing and Consolidation\" has been accpeted by AAAI 2023 (CCF A) as an Oral. Congratualation to Chunlin Yu! Oct. 2022 | \"Distributionally Robust Optimization for Vehicle-to-grid with Uncertain Renewable Energy\" has been accpeted by ICCAIS 2022 as an oral. The first author is our undergraduate student Qi Li, Congratualations! Sep. 2022 | \"Unified Optimal Transport Framework for Universal Domain Adaptation\" has been accpeted by NeurIPS 2022 (CCF A) as a Spotlight. Congratualation to Wanxing Chang! Sep. 2022 | \"Federated Fuzzy Neural Networks with Evolutionary Rule Learning\" has been accpeted by IEEE Transactions on Fuzzy Systems. (Impact factor 12.029) Congratualation to Leijie Zhang! Jul. 2022 | \"Mutual Adaptive Reasoning for Monocular 3D Multi-Person Pose Estimation\" has been accpeted by ACM Multimedia 2022 (CCF A). Congratualation to Juze Zhang! Dec. 2021 | One paper (Corresponding author) received the Best Student Paper Award at Australia Artificial Intelligence Institute. Aug. 2021 | One paper has been accpeted by IEEE Transactions on Fuzzy Systems. (Impact factor 12.029) July. 2021 | One paper (First author) has been accpeted by IEEE Transactions on Fuzzy Systems. (Impact factor 12.029) May. 2021 | One paper (First author) has been published in Applied Energy. (Impact factor 9.746) Apr. 2021 | One paper has been published in IEEE Transactions on Multimedia. (Impact Factor 6.051) Jan. 2021 | Dr Ye Shi joined ShanghaiTech as an Tenure-track Assistant Professor. Teaching Course SI251 - Convex Optimization, ShanghaiTech University, 2021 Spring, 2021 Autumn. Course SI152 - Numerical Optimization, ShanghaiTech University, 2022 Spring.",
  "content_length": 6222,
  "method": "requests",
  "crawl_time": "2025-12-01 14:50:53"
}