{
  "name": "Yee-Hong Yang",
  "homepage": "https://webdocs.cs.ualberta.ca/~yang",
  "status": "success",
  "content": "Herbert Yang HERBERT YANG HOME GROUP MEMBERS ALUMNI VISION GRAPHICS PUBLICATIONS COURSES SPONSORS Professor (retired) Office: UCOMM 7-236 Tel: 780-492-2285 Email: Welcome to my homepage My research interests cover a wide range of topics in computer graphics and computer vision. In computer graphics, my interests include fluid and character animation, environment matting, hardware accelerated graphics, motion editing, physics-based modelling, texture analysis and synthesis, and static and dynamic image-based modeling and rendering. Topics in computer vision include light source estimation, motion estimation, human motion analysis, camera calibration, 3D reconstruction, stereo and multiview stereo, underwater imaging, and medical imaging, in particular in developing biomarkers for ALS. I am a senior member of the IEEE and serve on the Editorial Board of the journal Pattern Recognition. I have published over 160 technical papers in international journals and conference proceedings, co-edited one book and served as a guest editor of an international journal. In addition, I have served as reviewer to numerous international journals, and as committee member to many conferences, review panels, and government agencies. I recently retired from my position as a full professor and am currently on a two-year post-retirement contract. For prospective graduate students: I am not accepting new graduate students! Launching of the world's first U of Alberta underwater 3D camera - aired on Oct. 5, 2015 in the Discovery Channel (click here to watch the exciting event)! Picture - Courtesy of Ocean Networks Canada ALS Canada has awarded over $2.9M over 5 years to our team lead by Dr. Sanjay Kalra (Neurology) for our project titled “Novel MRI biomarkers for monitoring disease progression in ALS.” Our thanks to ALS Canada and all the donors who have made this research possible. Our picture at the news announcement on Nov. 19, 2015.",
  "content_length": 1942,
  "method": "requests",
  "crawl_time": "2025-12-01 14:50:55"
}