{
  "name": "Yelena Yesha",
  "homepage": "http://www.csee.umbc.edu/people/faculty/yelena-yesha",
  "status": "success",
  "content": "Yelena Yesha – Department of Computer Science and Electrical Engineering – UMBC Skip to main content Department of Computer Science and Electrical Engineering Menu Apply Search Search Context This Site All of UMBC Location CSEE Main Office: ITE 325 1000 Hilltop Circle Baltimore, MD 21250 Contact Phone: 410-455-3500Contact Us Department of Computer Science and Electrical Engineering on FacebookDepartment of Computer Science and Electrical Engineering on TwitterDepartment of Computer Science and Electrical Engineering on YouTubeDepartment of Computer Science and Electrical Engineering on LinkedIn Position Professor of Computer Science and Electrical Engineering Office 335 Information Technology and Engineering (ITE) Building Contact Info University of Maryland, Baltimore County 1000 Hilltop Circle Baltimore, MD 21250 phone: (410) 455-3542 email: yeyesha@umbc.edu Education Ph.D., Computer Science, The Ohio State University, 1989 M.Sc., Computer Science, The Ohio State University, 1986 B.Sc., Applied Mathematics, York University, Toronto, Canada, 1984 B.Sc., Computer Science, York University, Toronto, Canada, 1984 Research Areas Dr. Yesha’s research areas include multicore computing, electronic commerce, distributed databases, assured information systems, and intelligent Web applications. To learn more about Dr. Yesha’s research pursuits, read her research profile. Location CSEE Main Office: ITE 325 1000 Hilltop Circle Baltimore, MD 21250 Contact Phone: 410-455-3500Contact Us Department of Computer Science and Electrical Engineering on FacebookDepartment of Computer Science and Electrical Engineering on TwitterDepartment of Computer Science and Electrical Engineering on YouTubeDepartment of Computer Science and Electrical Engineering on LinkedIn © UMBC: A University System of Maryland Member Institution Accreditation Equal Opportunity Privacy Policy Title IX Web Accessibility Consumer Information Subscribe to UMBC Weekly Top Stories First Name Last Name Email I am interested in: I am interested in: Undergraduate I am interested in: Graduate I am interested in: Professional Masters",
  "content_length": 2113,
  "method": "requests",
  "crawl_time": "2025-12-01 14:50:59"
}