{
  "name": "Yepang Liu 0001",
  "homepage": "http://cse.sustech.edu.cn/faculty/~liuyp",
  "status": "success",
  "content": "Yepang Liuâs Homepage Yepang Liu (åç¨åº, CV) Associate Professor (åå¯¼, ç ç©¶å) Department of Computer Science and Engineering Southern University of Science and Technology Office: Room 609, CoE Building (South), SUSTech Email: liuyp1 AT sustech DOT edu DOT cnTel: +86-0755-88015159 I am a tenured associate professor with the CSE Department of SUSTech. I lead the Software Quality Lab. I am also the director of the Trustworthy Software Research Center of the Research Insititute of Trustworthy Autonomous Systems. My research interests mainly include software testing and analysis, empirical software engineering, software security, and trustworthy AI. Our research is supported by the National Natural Science Foundation of China, National Key Research and Development Program of China, Basic and Applied Basic Research Foundation of Guangdong, Science, Technology and Innovation Commission of Shenzhen, and leading IT companies in China. I obtained my B.Sc. degree in Computer Science with honor from Nanjing University in 2010, and my Ph.D. degree in Computer Science and Engineering from HKUST in 2015. Prior to joining SUSTech, I worked at the CASTLE Lab and Cybersecurity Lab of HKUST as a postdoc, under the supervision of Prof. Shing-Chi Cheung and Prof. Charles Zhang. Call for papers: Please consider submitting your high-quality work to ICSE 2025, FSE 2025, SANER 2025, ASE 2024, JCST, where I serve as a PC member or an editor. We are hiring research assistant professors, postdocs, and research assistants (job post). We are also looking for PhD students with strong programming skills and good English ability. Please send me an email with your CV if you are interested and have relevant background. For undergraduate students who are interested in joining our group, please send me a copy of your transcript. Latest News (more) August 23, 2024: Our MARL-based web GUI testing paper has been accepted to ASE 2024. August 8, 2024: Our HarmonyOS app testing paper has been accepted to ASE 2024 Demonstration Track. July 3, 2024: Our paper on LLM-based machine learning model optimization bug detection has been accepted to ISSTA 2024. June 14, 2024: Two papers (one on vision language model-based web testing, the other on Android device-specific compatibility issues) have been accepted to ICSME 2024. May 16, 2024: Our paper on fusing code searchers has been accpeted to TSE. April 15, 2024: Two papers (one on VR software testing, the other on fairness analysis of machine learning software) have been accepted to FSE 2024. April 11, 2024: Our paper on fuzzy replay technique has been accepted to TASE 2024. December 15, 2023: Our study on UAV log anomalies has been accepted to ICSE 2024. Awards and Honors (more) Junior Faculty of the Year (2021å¹´åº¦éå¹´ææå¥, SUSTechï¼ Top-10 Most Active Early-Stage Software Engineering Researcher (2013-2020, according to an independent Elsevier bibliometric assessment) ACM SIGSOFT Distinguished Paper Award x 3 (received at ICSE 2021, ASE 2016, ICSE 2014 ) åæ¹ç§æå¤§å­¦ä¼ç§æå­¦å¥ (2020) åæ¹ç§æå¤§å­¦ä¼ç§ä¹¦é¢å¯¼å¸å¥ (2020) æ·±å³å¸åå±±åºé¢èªäººæ (Cç±», 2019) ACM SIGSOFT Distinguished Artifact Award (received at ICSE 2019) 2019å ¨å½å¤§å­¦çè½¯ä»¶æµè¯å¤§èµåè¶æå¯¼èå¸å¥ (photo) 2018å ¨å½å¤§å­¦çè½¯ä»¶æµè¯å¤§èµæ°åºæå¯¼èå¸å¥ æ·±å³å¸æµ·å¤é«å±æ¬¡äººæ (Cç±», 2018) ACM SIGSOFT Service Award (received at FSE 2014) Teaching (more) CS323 Compilers (Fall 2019-2023) CS109 Introduction to Computer Programming (Spring 2024) CS102A Introduction to Computer Programming (Spring 2018-2022) CS102B Introduction to Computer Programming (Fall 2018) CSE5008 Advanced Software Engineering (Fall 2018) Selected Recent Publications (full list, Google Scholar) [ASE 2024, CORE-A*/CCF-A] Yujia Fan, Sinan Wang, Zebang Fei, Yao Qin, Huaxuan Li, and Yepang Liu. Can Cooperative Multi-Agent Reinforcement Learning Boost Automatic Web Testing? An Exploratory Study. In the 39th IEEE/ACM International Conference on Automated Software Engineering, October 2024, Sacremento, California, United States, to appear. [ISSTA 2024, CORE-A*/CCF-A] Hao Guan, Guangdong Bai, and Yepang Liu. Large Language Models Can Connect the Dots: Exploring Model Optimization Bugs with Domain Knowledge-aware Prompts. In the 33rd ACM SIGSOFT International Symposium on Software Testing and Analysis, September 2024, Vienna, Austria, to appear. [acceptance rate: 20.6%] [ICSME 2024, CORE-A/CCF-B] Siyi Wang, Sinan Wang, Yujia Fan, Xiaolei Li, and Yepang Liu. Leveraging Large Vision-Language Model for Better Automatic Web GUI Testing. In the 40th IEEE International Conference on Software Maintenance and Evolution, October 2024, Flagstaff, AZ, USA, to appear. [acceptance rate: 26%] [ICSME 2024, CORE-A/CCF-B] Junfeng Chen, Kevin Li, Yifei Chen, Lili Wei, and Yepang Liu. Demystifying Device-specific Compatibility Issues in Android Apps. In the 40th IEEE International Conference on Software Maintenance and Evolution, October 2024, Flagstaff, AZ, USA, to appear. [acceptance rate: 26%] [FSE 2024, CORE-A*/CCF-A] Ying Xiao, Jie M. Zhang, Yepang Liu, Mohammad Reza Mousavi, Sicen Liu, and Dingyuan Xue. MirrorFair: Fixing Fairness Bugs in Machine Learning Software via Counterfactual Predictions. In the ACM International Conference on the Foundations of Software Engineering, July 2024, Porto de Galinhas, Brazil, to appear. [pdf] [FSE 2024, CORE-A*/CCF-A] Shuqing Li, Cuiyun Gao, Jianping Zhang, Yujia Zhang, Yepang Liu, Jiazhen Gu, Yun Peng, and Michael R. Lyu. Less Cybersickness, Please: Demystifying and Detecting Stereoscopic Visual Inconsistencies in Virtual Reality Applications. In the ACM International Conference on the Foundations of Software Engineering, July 2024, Porto de Galinhas, Brazil, to appear. [pdf] [ICSE 2024, CORE-A*/CCF-A] Dinghua Wang, Shuqing Li, Guanping Xiao, Yepang Liu, Yulei Sui, Pinjia He, and Michael R. Lyu. An Exploratory Investigation of Log Anomalies in Unmanned Aerial Vehicles. In the 46th International Conference on Software Engineering, April 2024, Lisbon, Portugal, to appear. [S&P 2024, CORE-A*/CCF-A] Wuqi Zhang, Zhuo Zhang, Qingkai Shi, Lu Liu, Lili Wei, Yepang Liu, Xiangyu Zhang, and Shing-Chi Cheung. Nyx: Detecting Exploitable Front-Running Vulnerabilities in Smart Contracts. In the 45th IEEE Symposium on Security and Privacy, May 2024, San Francisco, California, USA. [pdf] [TSE 2023, CCF-A] Wuqi Zhang, Lili Wei, Shing-Chi Cheung, Yepang Liu, Shuqing Li, Lu Liu, and Michael R. Lyu. Combatting Front-Running in Smart Contracts: Attack Mining, Benchmark Construction and Vulnerability Detector Evaluation. In IEEE Transactions on Software Engineering, to appear. [preprint] [OOPSLA 2023, CORE-A/CCF-A] Shangwen Wang, Bo Lin, Zhensu Sun, Ming Wen, Yepang Liu, Yan Lei, and Xiaoguang Mao. Two Birds with One Stone: Boosting Code Generation and Code Search via Generative Adversarial Network. In the 2023 ACM SIGPLAN International Conference on Object-Oriented Programming, Systems, Languages, and Applications, October 2023, Cascais, Portugal, 30 pages. [pdf] [ISSTA 2023, CCF-A] Jiajun Hu, Lili Wei, Yepang Liu, and Shing-Chi Cheung. wTest: WebView-Oriented Testing for Android Applications. In the 32nd ACM SIGSOFT International Symposium on Software Testing and Analysis, 2023, to appear. [ISSTA 2023, CCF-A] Linlin Li, Ruifeng Wang, Xian Zhan, Ying Wang, Cuiyun Gao, Sinan Wang, and Yepang Liu. What You See Is What You Get? It Is Not the Case! Detecting Misleading Icons for Mobile Applications. In the 32nd ACM SIGSOFT International Symposium on Software Testing and Analysis, 2023, July 2023, pp. 538-550. [pdf] [ISSTA 2023, CCF-A] Huaxun Huang, Chi Xu, Ming Wen, Yepang Liu, and Shing-Chi Cheung. ConfFix: Repairing Configuration Compatibility Issues in Android Apps. In the 32nd ACM SIGSOFT International Symposium on Software Testing and Analysis, 2023, to appear. [ICSE 2023, CCF-A] Hao Guan, Ying Xiao, Jiaying Li, Yepang Liu, and Guangdong Bai. A Comprehensive Study of Real-World Bugs in Machine Learning Model Optimization. In the 45th International Conference on Software Engineering, 2023, to appear. [ICSE 2022, CCF-A] Sinan Wang, Yibo Wang, Xian Zhan, Ying Wang, Yepang Liu, Xiapu Luo, and Shing-Chi Cheung. Aper: Evolution-Aware Runtime Permission Misuse Detection for Android Apps. In the 44th International Conference on Software Engineering, pp. 125-137, May 2022, to appear. [pdf][tool] Site maintained by yepangliu, last updated: 2024-10-14 14:39:12 +0800",
  "content_length": 8529,
  "method": "requests",
  "crawl_time": "2025-12-01 14:50:58"
}