{
  "name": "Yevgeniy Dodis",
  "homepage": "http://www.cs.nyu.edu/~dodis",
  "status": "success",
  "content": "Yevgeniy Dodis, Academic Home Page Yevgeniy Dodis Professor, IACR Fellow. Cryptography Group Department of Computer Science Courant Institute of Mathematical Sciences New York University Publications | CV | Advising | Teaching | Professional | Contact | Miscellaneous My main interests are in Cryptography; especially Leakage-Resilient Cryptography Random Number Generation Cryptography with Biometrics and Other Noisy Data Hash Functions and Random Oracle Model Information-Theoretic Cryptography Secure (Group) Messaging More generally, I'm interested in Theoretical Computer Science at large (Algorithms, Complexity, Combinatorics, etc.). Publications Research Papers (in reverse chronological order) Surveys, Book Chapters, Thesis, etc. DBLP, Google Citation, Crypto/Eurocrypt/TCC (all-time stats). Some impementations: Generic Signal Messaging Protocol (by Yi Tang) Efficiency Comparisons for MLS variants (by Yi Tang) Implementation of secure skecthes (by Leonid Reyzin) I was also a contributor to Ron Rivest’s MD6 effort Curriculum Vitae (check the date at the end) Short Biographical Sketch 2021 IACR Test of Time Award for our work on verifiable random functions (ceremony). 2020 IACR Fellow (ceremony). \"For fundamental contributions to cryptology, especially to cryptographic randomness and symmetric-key primitives, and for service to the IACR\". Inreview about recents trends in Secuirty and Privacy for DIGITALAX Magazine. One-on-one 30-minute interview on Randomness and Coincidence for the \"Science goes to the movies\" TV series. Courant newsletter about my work on Randomness in Cryptography. 2019 IACR Test of Time Award for our work on fuzzy extractors (ceremony). Facebook award on \"Secure the Internet\" for my work on Encrypted messaging. Short interview on NBC News about the use of encrypted technology by terrorists. Daily Texan article about random number generation covering some of my work. Advising Graduated PhD students: (14) Alexander Bienstock (Fall 2023), (13) Harish Karthikeyan (Summer 2022), (12) Noah Stephens-Davidowitz (August 2017), (11) Chaya Ganesh (August 2017). (10) Sasha Golovnev (May 2017), (9) Aris Tentes (September 2014), (8) Adriana Lopez-Alt (April 2014), (7) Daniel Wichs (September 2011), (6) Joel Alwen (September 2011), (5) Sherman Chow (September 2010), (4) Carl Bosley (September 2009), (3) Shabsi Walfish (Fall 2007), (2) Prashant Puniya (Summer 2007), (1) Nelly Fazio (Spring 2006). Current PhD students: Peter Fenteany, Eli Goldin. Postdocs: Muthu Venkitasubramaniam (Sep. 2010-May 2011), Dario Fiore (Jan. 2012-Nov. 2012), Divesh Aggraval (Sep. 2012-Aug. 2014), Tomasz Kazana (Jan. 2015-Oct. 2015), Siyao Guo (Jan. 2016-Dec. 2016), Sandro Coretti (Jun. 2016-Mar. 2019), Yiannis Tselekounis (Mar. 2019-Feb. 2021), Paul Rosler (Jan. 2022-Dec. 2022), Daniel Jost (Oct. 2020-May 2024). What to do if you are interested in working with me? Teaching Fall 2025: Fundamental Algorithms (graduate: CSCI-GA.1170). Spring 2025: Fundamental Algorithms (graduate: CSCI-GA.1170). Spring 2024: Fundamental Algorithms (graduate: CSCI-GA.1170). Fall 2023: Fundamental Algorithms (graduate: CSCI-GA.1170). Spring 2023: Fundamental Algorithms (graduate: CSCI-GA.1170). Fall 2021: Fundamental Algorithms (graduate: CSCI-GA.1170). Spring 2021: Fundamental Algorithms (graduate: CSCI-GA.1170). Spring 2020: Fundamental Algorithms (graduate: CSCI-GA.1170). Fall 2019: Fundamental Algorithms (graduate: CSCI-GA.1170). Spring 2019: Fundamental Algorithms (graduate: CSCI-GA.1170). Fall 2016: Basic Algorithms (graduate: CSCI-UA.0310). Fall 2016: Fundamental Algorithms (graduate: CSCI-GA.1170). Spring 2016: Fundamental Algorithms (graduate: CSCI-GA.1170). Fall 2015: Fundamental Algorithms (graduate: CSCI-GA.1170). Spring 2015: Basic Algorithms (undergraduate: CSCI-UA.0310). Fall 2014: Fundamental Algorithms (graduate: CSCI-GA.1170). Spring 2014: Randomness in Cryptography (graduate: CSCI-GA.3220/MATH-GA.2180). COURSE NOTES Fall 2013: Fundamental Algorithms (graduate: CSCI-GA.1170). Spring 2013: Randomness in Cryptography (graduate). Fall 2012: Fundamental Algorithms (graduate: CSCI-GA.1170). Spring 2012: Introduction to Cryptography (graduate: CSCI-GA.3210/MATH-GA.2170). COURSE NOTES Fall 2011: Fundamental Algorithms (graduate: CSCI-GA.1170). Fall 2010: Basic Algorithms (regular and honors) (undergraduate: V22.0310). Spring 2010: Basic Algorithms (regular and honors) (undergraduate: V22.0310). Fall 2009: Advanced Cryptography (graduate: G22.3220/G63.2180). COURSE NOTES Spring 2009: Basic Algorithms (regular and honors) (undergraduate: V22.0310). Fall 2008: Introduction to Cryptography (graduate: G22.3210/G63.2170). Spring 2007: Exposure-Resilient Cryptography (graduate: G22.3033-013). Fall 2006: Introduction to Cryptography (graduate: G22.3210/G63.2170). Spring 2006: Cryptography & Imperfect Randomness (graduate: G22.3220). Spring 2006: Introduction to Cryptography (undergraduate: V22.0480-003). Spring 2005: Introduction to Cryptography (undergraduate: V22.0480-005). Spring 2004: Honors Theory of Computation (graduate: G22.3350). Fall 2003: Basic Algorithms (honors) (undergraduate: V22.0310). Spring 2003: Honors Theory of Computation (graduate: G22.3350). Fall 2002: Introduction to Cryptography (undergraduate: V22.0480-001). Fall 2001: Introduction to Cryptography (graduate: G22.3033-003). COURSE NOTES Spring 2001: Honors Theory of Computation (graduate: G22.3350). Some Professional Activities Editor of Journal of Cryptology. Organizer of NYU Cryptography Seminar. Send me e-mail if you'd like to present or put on our mailing list! Everybody is welcome! This is also a 1 credit Research Seminar for our PhD students (number G22.3850-001). Co-Organizer of IBM/NYU/Columbia Theory Day. Current meeting: Friday, December 6, 2019. I am affiliated with the following upcoming Conferences: All PCs: FOCS 2008, STOC 2020, 2017, 2007, CRYPTO 2022, 2021, 2014, 2012, 2011, 2008, 2007, 2004, Eurocrypt 2018, 2016, 2006, 2005, 2003, TCC 2015, 2014, 2008, ITCS 2013, ASIACRYPT 2010, RSA 2006, CCS 2005, SCN 2010, CSR 2013, ICITS 2008, ICISC 2006, 2005, DRMTICS 2005. CRYPTO 2022. Program co-Chair. Aug 3-18, 2022, Santa Berbara, CA. TCC 2015. Program co-Chair. Mar 23-25, 2015, Warsaw, Poland. STOC 2012. Local Arrangements Chair. May 19-22, 2012, New York, NY. Tutorials held here at NYU. TCC 2008. PC member and General Chair. March 19-21, 2008, New York, NY. PKC 2006. Co-Editor, General and Sponsorship Chair. Apr 24-26, 2006, New York, NY. I gave/will give invited talks at the following venues: Conference on Security and Cryptography for Networks (SCN), September 11 - 13, 2024, Amalfi, Italy. Brazilian Symposium on Information and Computational Systems Security, September 12 - 15, 2022, Santa Maria, Brazil. Workshop on Lower Bounds in Cryptography, July 8-12, 2019, Bertinoro, Italy. Eurocrypt Workshop on Secure Messaging, May 18, 2019, Damsdadt, Germany. DIMACS/MACS Workshop on Usable, Efficient, and Formally Verified Secure Computation, March 14-15, 2019, Boston, MA. IACR Spotniq School on Proof Techniques in Symmetric Key Cryptography, July 29-August 3, 2018, Bertinoro, Italy. Simons Reunion Workshop on Pseudorandomness, June 19, 2018, Berkeley, CA, Crypto in the Galilee Workshop, April 27, 2018, Ma'alot-Tarshiha, Israel. NYU Scholar Lecture Series, Nov 30, 2017, New York, NY. Security and Privacy Day, Oct 13, 2017, New York, NY. Theory at UBC Mini-Symposium, Feb 3, 2017, Vancouver, Canada. COST-IACR School on Randomness in Cryptography, Nov 14-16, 2016, Barcelona, Spain. Tutorial on Mathematics of Information-Theoretic Cryptography, Sep 19-23, 2016, Singapore. DIMACS Workshop on Cryptography and its Interactions: Learning Theory, Coding Theory, and Data Structures. Jul 11-13, 2016, Piscataway, NJ. 2016 Capital Area Theory Day. May 26, 2016, Johns Hopkins University, Baltimore, MD. Nexus of Information and Computation Theories Secrecy and Privacy Theme . March 21-April 1, 2016, Institut Henri Poincare, Paris, France. TCC'16. January 10-13, 2016, Suzanne Dellal Center, Tel Aviv, Israel. Second Desert Workshop in Cryptography, January 7-10, Sde Boker, Israel. DIMACS/Columbia Data Science Institute Workshop on Cryptography for Big Data. December 14-15, 2015, Columbia University, New York, NY. Indocrypt'15. December 6-9, 2015, Indian Institute of Science, Bangalore, India. Workshop on Foundations of Randomness. October 26-28, 2015, Stellenbosch Institute for Advanced Study, Stellenbosch, South Africa. The Mathematics of Modern Cryptography. July 6-10, 2015, Berkeley, CA. DIMACS Workshop on Coding-Theoretic Methods for Network Security. Apr 1-3, 2015, Piscataway, NJ. NYC BSD User Group (video). April 1, 2014, New York, NY. Real World Cryptography Workshop. January 13-15, 2014, New York, NY. Celebration of the work of Shafi Goldwasser and Silvio Micali, December 10-12, Rehovot, Israel. Workshop on Leakage, Tampering and Viruses. June 2-6, 2013, Warsaw, Poland. International State of the Art in Cryptography - Security. May 30-31, 2013, Athens, Greece. Mathematics of Information-Theoretic Cryptography. May 21-25, 2013, Leiden, Netherlands. DIMACS Workshop on Current Trends in Cryptology. Apr 29-May 1, 2013, New York, NY. Dimacs Workshop on Information-Theoretic Network Security. November 12-14, 2012, Piscataway, NJ. Dagstuhl Privacy-Oriented Cryptography Workshop. September 16-21, 2012, Dagstuhl, Germany. Cryptography and Complexity Day. June 21, 2012, Paris, France. Workshop on Formal and Computational Cryptographic Proofs. April 13, 2012, Cambridge, UK. Crypto Day. January 27, 2012, New York, NY. Dagstuhl Symmetric-Key Cryptography Workshop. January 15-20, 2012, Dagstuhl, Germany. Dagstuhl Public-Key Cryptography Workshop. September 25-30, 2011, Dagstuhl, Germany. Workshop on Mathematics of Information-Theoretic Cryptography. February 28-March 4, 2011, Los Angeles, CA. Trends in Theoretical Cryptography Conference. January 10-12, 2011, Beijing, China. Cloud Cryptograp",
  "content_length": 13679,
  "method": "requests",
  "crawl_time": "2025-12-01 14:51:05"
}