{
  "name": "Yexiang Xue",
  "homepage": "https://www.cs.purdue.edu/people/faculty/yexiang",
  "status": "success",
  "content": "Yexiang Xue - Department of Computer Science - Purdue University Skip to content Home People Faculty Yexiang Xue Faculty & Lecturers Staff Offices Yexiang Xue Associate Professor of Computer Science Yexiang Xue is an assistant professor at Purdue. The goal of Mr Xue's research is to bridge large-scale constraint-based reasoning and optimization with state-of-the-art machine learning techniques in order to enable intelligent agents to make optimal decisions in high-dimensional and uncertain real-world applications. More specifically, Mr Xue's research focuses on scalable and accurate probabilistic reasoning techniques, statistical modeling of data, and… ↓More Joined department: Fall 2018 Research Areas Computational Science and Engineering Artificial Intelligence, Machine Learning, and Natural Language Processing Theory of Computing, Algorithms, and Quantum Computing Yexiang Xue is an assistant professor at Purdue. The goal of Mr Xue's research is to bridge large-scale constraint-based reasoning and optimization with state-of-the-art machine learning techniques in order to enable intelligent agents to make optimal decisions in high-dimensional and uncertain real-world applications. More specifically, Mr Xue's research focuses on scalable and accurate probabilistic reasoning techniques, statistical modeling of data, and robust decision-making under uncertainty. Mr. Xue's work is motivated by key problems across multiple scientific domains, ranging from artificial intelligence, machine learning, renewable energy, materials science, crowdsourcing, citizen science, urban computing, ecology, to behavioral econometrics. Mr. Xue focuses on developing cross-cutting computational methods, with an emphasis in the areas of computational sustainability and scientific discovery. Contact Info yexiang@purdue.edu DSAI 3089 Websites My Homepage Google Scholar dblp",
  "content_length": 1882,
  "method": "requests",
  "crawl_time": "2025-12-01 14:51:02"
}