{
  "name": "Yezid Donoso Meisel",
  "homepage": "https://profesores.virtual.uniandes.edu.co/ydonoso/es/inicio",
  "status": "success",
  "content": "Yezid Enrique Donoso Meisel Yezid Enrique Donoso Meisel Profesor Titular Grupo:: Research Group: COMIT-Comunicaciones y Tecnología de Información Contacto: Oficina: Office: ML 773 Correo: Email: Extensión: Extension: 1723 Formación Certificaciones Investigación Publicaciones Cursos dictados Proyectos Estudiantes Hoja de Vida Post Ph.D. in Information Technology, Universidad de Girona, España. Ph.D. in Information Technology, Universidad de Girona, España. D.E.A. in Information technology, Universidad de Girona, España. Magister en Ingeniería de Sistemas y Computación, Universidad de los Andes, colombia. Ingeniero de Sistemas y Computación,Universidad del Norte, Colombia. Certificate in Information Security Software Engineering Institute, Carnegie Mellon University, USA. Certificate in Incident Response Process Software Engineering Institute, Carnegie Mellon University, USA. CERT – RMM – Resilience Management Model Software Engineering Institute, Carnegie Mellon University, USA. Information Security Management Systems Auditor/Lead Auditor BS ISO/IEC 27001:2005 BSI – British Standards Institution Certificate Business Continuity Management Systems Auditor/Lead Auditor BSI – British Standards Institution Certified Functional Continuity Professional (CFCP) DRII – Disaster Recovery Institute International – The Institute for Continuity Management EC-Council – ECSA- Certified Security Analyst EC-Council Intereses y líneas de Investigación: Optimización de redes Calidad de servicio en redes Seguridad de redes Grupo:: Research Group: COMIT-Comunicaciones y Tecnología de Información Filtrar Tipo de publicación: Todos los tipos Software Patente y Solicitud de Patente Otro Propuesta a Colciencias (o entidades afines) Evento Propuesta internacional de investigación Artículo Libro Capítulo de libro Capítulo en Memoria Caso de Estudio Otra Producción Bibliográfica Columna de Opinión Tesis A partir de: 1970 1971 1972 1973 1974 1975 1976 1977 1978 1979 1980 1981 1982 1983 1984 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011 2012 2013 2014 2015 2016 2017 2018 2019 2020 2021 2022 2023 2024 2025 Filtrar Limpiar A Mathematical Optimization Approach for Prioritized Services in IoT Networks for Energy-constrained Smart Cities Artículo 2025 Montoya G, C. Lozano-Garzón, Paternina C, Donoso Y. (2025) A Mathematical Optimization Approach for Prioritized Services in IoT Networks for Energy-constrained Smart Cities. International Journal of Computers, Communications and Control (ISSN 1841-9836) 20 (1), pp. 1-14. - 2025 Adaptive Neural Networks for Mitigating GPS Spoofing Attacks inUnmanned Aerial Vehicles Artículo 2025 Salgado A, Donoso Y. (2025) Adaptive Neural Networks for Mitigating GPS Spoofing Attacks inUnmanned Aerial Vehicles. International Journal of Computers, Communications and Control (ISSN 1841-9836) 20 (3), pp. 1-18. - 2025 An analytical approach to named entity recognition for military aerospace intelligence Artículo 2025 Zabala-lópez A, Linares-Vásquez M, Haiduc S, Donoso Y. (2025) An analytical approach to named entity recognition for military aerospace intelligence. Decision Analytics Journal (ISSN 2772-6622) 16 (N/A), pp. 1-15. - 2025 Análisis de estrategias de phishing en foros de la Deep Web Tesis 2025 .(2025). Análisis de estrategias de phishing en foros de la Deep Web.Trabajo Dirigido por: Donoso Y - 2025 Beyond the Black Box: A Framework for Explainable and Attack-Resilient Federated Anomaly Detection in IIoT Capítulo en Memoria 2025 Andrea Pinto , Donoso Y, Jairo A Gutierrez. (2025) Beyond the Black Box: A Framework for Explainable and Attack-Resilient Federated Anomaly Detection in IIoT. 35th IEEE ITNAC Proceeding 35th IEEE ITNAC (ISBN 979-8-3315-7918-0) Nueva Zelanda. - 2025 Circular Economy in the Armed Forces: Systematic Literature Review and Case Analysis in the Colombian Army Artículo 2025 Meza C, Linares-Vásquez M, Donoso Y. (2025) Circular Economy in the Armed Forces: Systematic Literature Review and Case Analysis in the Colombian Army. Circular Economy and Sustainability (ISSN 27305988) 5 (4), pp. 1-24. - 2025 Development of a Test Bench for Fault Diagnosis in the Caution and Warning Panels of the UH-60 Helicopter Artículo 2025 Saenz C, CUADROS R, RATIVA E, Linares-Vásquez M, Donoso Y, LOZANO C. (2025) Development of a Test Bench for Fault Diagnosis in the Caution and Warning Panels of the UH-60 Helicopter. ENG (ISSN 2673-4117) 6 (5), pp. 1-20. - 2025 Modelo de detección de audios en español y videos deepfake contra ataques de ingeniería social Tesis 2025 .(2025). Modelo de detección de audios en español y videos deepfake contra ataques de ingeniería social.Trabajo Dirigido por: Donoso Y - 2025 Redefining identity and security: Spoofing in the age of artificial intelligence Tesis 2025 .(2025). Redefining identity and security: Spoofing in the age of artificial intelligence.Trabajo Dirigido por: Donoso Y - 2025 Sistema integral de detección y geolocalización de drones de uso recreativo basado en radiofrecuencias Tesis 2025 .(2025). Sistema integral de detección y geolocalización de drones de uso recreativo basado en radiofrecuencias.Trabajo Dirigido por: Donoso Y - 2025 Steg Phantom: Sistema para la exfiltración de datos mediante técnicas de esteganografía en archivos multimedia: Análisis comparativo de herramientas de ocultamiento de información Tesis 2025 .(2025). Steg Phantom: Sistema para la exfiltración de datos mediante técnicas de esteganografía en archivos multimedia: Análisis comparativo de herramientas de ocultamiento de información.Trabajo Dirigido por: Donoso Y - 2025 Understanding Security Vulnerabilities in Private 5G Networks: Insights from a Literature Review Artículo 2025 Fue J, Jairo A Gutierrez, Donoso Y. (2025) Understanding Security Vulnerabilities in Private 5G Networks: Insights from a Literature Review. Future Internet (ISSN 1999-5903) 17 (11), pp. 1-26. - 2025 A Mathematical Optimization Model for Priority-driven IoT Services in Energy-constrained Smart Cities Capítulo en Memoria 2024 Montoya G, C. Lozano-Garzón, Paternina C, Donoso Y. (2024) A Mathematical Optimization Model for Priority-driven IoT Services in Energy-constrained Smart Cities. 2024 10th International Conference on Computers Communications and Control (ICCCC) Advances in Intelligent Systems and Computing (ISBN 9783319941196) Oradea, Rumania. - 2024 A Survey of data-centric technologies supporting decision-making before deploying military assets Artículo 2024 Zabala A, Linares-Vásquez M, Haiduc S, Donoso Y. (2024) A Survey of data-centric technologies supporting decision-making before deploying military assets. Defence Technology (ISSN 2096-3459) 1 (1), pp. 1-49. - 2024 Ciberseguridad en los Sistema de Identificación Automático (AIS): análisis de ciberamenazas y controles de ciberseguridad Tesis 2024 .(2024). Ciberseguridad en los Sistema de Identificación Automático (AIS): análisis de ciberamenazas y controles de ciberseguridad.Trabajo Dirigido por: Donoso Y - 2024 Crawler para la Deep Web Tesis 2024 .(2024). Crawler para la Deep Web.Trabajo Dirigido por: Donoso Y - 2024 Defense model to detect cyberattacks in critical infrastructures: Machine Learning And Cyber Threat Intelligence Approach Tesis 2024 .(2024). Defense model to detect cyberattacks in critical infrastructures: Machine Learning And Cyber Threat Intelligence Approach.Trabajo Dirigido por: Donoso Y - 2024 Detección de fallos de integridad en sistemas de posicionamiento (GPS) de vehículos aéreos no tripulados (UAVs) Tesis 2024 .(2024). Detección de fallos de integridad en sistemas de posicionamiento (GPS) de vehículos aéreos no tripulados (UAVs).Trabajo Dirigido por: Donoso Y - 2024 Detección de publicaciones en la red social X para la generación de alertas tempranas de daño reputacional en la Fuerza Aeroespacial Colombiana Tesis 2024 .(2024). Detección de publicaciones en la red social X para la generación de alertas tempranas de daño reputacional en la Fuerza Aeroespacial Colombiana.Trabajo Dirigido por: Donoso Y - 2024 Detection of Integrity Failures in GPS Systems of Unmanned Aerial Vehicles (UAVs) Capítulo en Memoria 2024 Salgado A, Donoso Y. (2024) Detection of Integrity Failures in GPS Systems of Unmanned Aerial Vehicles (UAVs). 2024 10th International Conference on Computers Communications and Control (ICCCC) Advances in Intelligent Systems and Computing (ISBN 9783319941196) Rumania. - 2024 2015 2015-10 PROYECTO FINAL MODELADO, SIMULACION Y OPTIMIZ SERV MOVILES Y DE PROXIMA GENE ALGORITMICA Y PROGR. OBJ. I ARQUITECTURA DE SEGURIDAD ARQUITECTURA DE INFRAESTRUCTUR 2015-20 MODELADO, SIMULACION Y OPTIMIZ ARQUITECTURA DE SEGURIDAD SEGURIDAD EN LA RED ARQUITECTURA DE INFRAESTRUCTUR TEC DISEÑO REDES COM LAN WAN PROYECTO FINAL INFRAESTRUCTURA SEGURA INFORMATICA INDUSTRIAL 2016 2016-10 INFORMATICA INDUSTRIAL ARQUITECTURA DE INFRAESTRUCTUR ARQUITECTURA DE SEGURIDAD PROYECTO FINAL MODELADO, SIMULACION Y OPTIMIZ TEC DISEÑO REDES COM LAN WAN INFRAESTRUCTURA SEGURA 2016-18 PROGRAMACIÓN SEGURA 2016-19 ALGORITMICA Y PROGR. OBJ. I 2016-20 GOBIERNO DE TI MODELADO, SIMULACION Y OPTIMIZ ARQUITECTURA DE SEGURIDAD PROYECTO FINAL INFORMATICA INDUSTRIAL INFRAESTRUCTURA SEGURA SERV MOVILES Y DE PROXIMA GENE ARQUITECTURA DE INFRAESTRUCTUR 2017 2017-10 ARQUITECTURA DE INFRAESTRUCTUR ARQUITECTURA DE SEGURIDAD INFRAESTRUCTURA SEGURA INFORMATICA INDUSTRIAL PROYECTO FINAL GOBIERNO DE TI MODELADO, SIMULACION Y OPTIMIZ 2017-20 ARQUITECTURA DE INFRAESTRUCTUR MODELADO, SIMULACION Y OPTIMIZ PROYECTO FINAL INFRAESTRUCTURA SEGURA ARQUITECTURA DE SEGURIDAD 2018 2018-10 MODELADO, SIMULACION Y OPTIMIZ INFRAESTRUCTURA SEGURA ARQUITECTURA DE INFRAESTRUCTUR ARQUITECTURA DE SEGURIDAD SERV MOVILES Y DE PROXIMA GENE 2018-20 ARQUITECTURA DE SEGURIDAD TEC DISEÑO REDES COM LAN WAN INFRAESTRUCTURA COMUNICACIONES ARQUITECTURA DE INFRAESTRUCTUR 2019 2019-10 INFRAESTRUCTURA COMUNICACIONES ARQUITECTURA DE SEGURIDAD ",
  "content_length": 19601,
  "method": "requests",
  "crawl_time": "2025-12-01 14:51:13"
}