{
  "name": "Yi-Ping Hung",
  "homepage": "https://www.csie.ntu.edu.tw/~hung",
  "status": "success",
  "content": "ï»¿ Professor Yi-Ping Hung GS Yi-Ping Hung     æ´ªä¸å¹³ Professor Graduate Institute of Networking and Multimedia Department of Computer Science and Information Engineering National Taiwan University CSIE Building Room# 433 Tel: 886-2-3366-4888 ext. 433 Fax: 886-2-2362-8167 Email: hung AT csie.ntu.edu.tw Lab: ntuimlab.tw Research Interests Image Processing/Analysis and Interactive Multimedia Techniques and Applications, including: VR/AR/MR/XR Metaverse Design Image Processing and Analysis AI and Machine Learning Blockchain Applications Human-Computer Interaction Computer Vision Yi-Ping Hung is currently a professor in the Graduate Institute of Networking and Multimedia and the Department of Computer Science and Information Engineering at National Taiwan University. He received his B.S. in Electrical Engineering from National Taiwan University and his Ph.D. from Brown University. He previously served as Director of the Graduate Institute of Networking and Multimedia at NTU (2007â2013), Provost of Tainan National University of the Arts (2019â2020), and Academic Vice President of Taipei National University of the Arts (2023â2024). He was the founding President of the Taiwan Society of Human-Computer Interaction (2016â2018) and currently serves as President of the Taiwan Art and Technology Association (2021â2025). He has collaborated extensively with the National Palace Museum on new media and VR/XR projects, taking on roles such as project leader, producer, and director. Over the years, he has published more than two hundred technical papers, and created more than ten original VR/XR works, and has received numerous notable awards, including the MUSE Platinum Award, the Platinum Remi Award at WorldFest-Houston, the Laval Virtual Award, the XR Golden Award. His selected publications and research projects can be found at https://www.ntuimlab.tw Publications 2014 Single-Pass K-SVD for Efficient Dictionary Learning, Kuang-Yu Chang, Cheng-Fu Lin, Chu-Song Chen, and Yi-Ping Hung, Circuits, Systems, and Signal Processing. Vol. 33, No. 1, pp. 309-320, Jan. 2014. 2013 Automatic Multi-Resolution Joint Image Smoothing for Depth Map Refinement, He-Lin Luo, Chih-Tsung Shen, Yu-Chun Chen, Ru-Han Wu, and Yi-Ping Hung, Asian Conference on Pattern Recognition (ACPR), Okinawa, Japan, Nov. 2013. Teleport: Space Navigation by Detecting the Self-Motion of a Mobile Device, Shen-Chi Chen, Chia-Wei Hsu, Shih-Yao Lin, Kevin Lin, and Yi-Ping Hung, ACM SIGGRAPH Asia, Hong Kong, China, Nov. 2013. AirTouch Panel: A Re-Anchorable Virtual Touch Panel, Shih-Yao Lin, Chuen-Kai Shie, Shen-Chi Chen, and Yi-Ping Hung, ACM Multimedia (ACM MM), Barcelona, Spain, Oct. 2013. Target-Driven Video Summarization in a Camera Network, Shen-Chi Chen, Kevin Lin, Shih-Yao Lin, Kuan-Wen Chen, Chih-Wei Lin, Chu-Song Chen, and Yi-Ping Hung, International Conference on Image Processing (ICIP), Melbourne, Australia, Sep. 2013. Real-time Camera Tampering Detection Using Two-Stage Scene Matching, Chao-Ching Shih, Shen-Chi Chen, Cheng-Feng Hung, Kuan-Wen Chen, Shih-Yao Lin, Chih-Wei Lin, Yi-Ping Hung, International Conference on Multimedia and Expo (ICME), San Jose, CA, Jul. 2013. Viewing Chinese Art on an Interactive Tabletop, Chun-Ko Hsieh, Yi-Ping Hung, Moshe Ben-Ezra, and Hsin-Fang Hsieh, IEEE Computer Graphics and Applications, Vol. 33, No. 3, pp. 16-21, May 2013. Facial Trait Code, Ping-Han Lee, Gee-Sern Hsu, Tsuhan Chen, and Yi-Ping Hung, IEEE Transactions on Circuits and Systems for Video Technology, Vol. 23, No. 4, pp. 648 â 660, Apr. 2013. 2012 Applying Scattering Operators for Face Recognition: A Comparative Study, Kuang-Yu Chang, Cheng-Fu Lin, Chu-Song Chen, and Yi-Ping Hung, International Conference on Pattern Recognition (ICPR), Tsukuba, Japan, Nov, 2012. Human Action Recognition Using Action Trait Code, Shih-Yao Lin, Chuen-Kai Shie, Shen-Chi Chen, Ming-Sui Lee, and Yi-Ping Hung, International Conference on Pattern Recognition(ICPR), Tsukuba, Japan, Nov. 2012. Multimedia Assisted Breathwalk-Aware System, Meng-Chieh Yu, Huan Wu, Ming-Sui Lee, and Yi-Ping Hung, IEEE Transactions on Biomedical Engineering, Vol. 59, No. 12, pp. 3276-3282, Oct. 2012. Noncontact Respiratory Measurement of Volume Change Using Depth Camera, Meng-Chieh Yu, Jia-Lin Liou, Shuenn-Wen Kuo, Ming-Sui Lee, and Yi-Ping Hung, International Conference of IEEE Engineering in Medicine and Biology Society (EMBC), San Diego, CA, Sep. 2012. 2D Face Alignment and Pose Estimation Based on 3D Facial Models, Shen-Chi Chen, Chia-Hsiang Wu, Shih-Yao Lin, Chih-Chuan Lai, and Yi-Ping Hung, International Conference on Multimedia and Expo (ICME), Melbourne, Australia, July 2012. Subject-Specific and Pose-Oriented Facial Features for Face Recognition Across Poses, Ping-Han Lee, Gee-Sern Hsu, Yun-Wen Wang, and Yi-Ping Hung, IEEE Transactions on Systems, Man, and Cybernetics, Vol. 42, No. 5, pp. 1357-1368, Apr. 2012. Breath and Position Monitoring during Sleeping with a Depth Camera, Meng-Chieh Yu, Huan Wu, Jia-Lin Liou, Ming-Sui Lee, and Yi-Ping Hung, International Conference on Health Informatics (HEALTHINF), Vilamoura, Portugal, Feb. 2012. Illumination Compensation Using Oriented Local Histogram Equalization and Its Application to Face Recognition, Ping-Han Lee, Szu-Wei Wu, and Yi-Ping Hung, IEEE Transactions on Image Processing, Vol. 21, No. 9, pp. 4280-4289, Jan. 2012. 2011 Viewpoint Independent Object Detection Based onÂ Two-Dimensional Contours and Three- Dimensional Sizes,Â Ping-Han Lee, Yen-Liang Lin, Shen-Chi Chen, Chia-Hsiang Wu, Cheng-Chih Tsai, and Yi-Ping Hung, IEEE Transactions on Intelligent Transportation Systems, Vol.12, No.4, pp.1599 â 1608, Dec. 2011. [Download] Multi-Resolution Design for Large-Scale and High-ResolutionÂ Monitoring, Kuan-Wen Chen, Chih-Wei Lin, Tzu-Hsuan Chiu, Mike Yen-Yang Chen, and Yi-Ping Hung, IEEE Transactions on Multimedia, Vol. 13, No. 6, pp.1256-1268, Dec. 2011. [Download] Adaptive Learning for Target Tracking and True Linking Discovering across Multiple Non-Overlapping Cameras, Kuan-Wen Chen, Chih-Chuan Lai, Pei-Jyun Lee, Chu-Song Chen, and Yi-Ping Hung, IEEE Transactions on Multimedia, Vol. 13, No.4, pp.625-638, Aug. 2011.Â [Download]Â Editing by Viewing: Automatic Home Video Summarization by Viewing Behavior Analysis, Wei-Ting Peng, Wei-Ta Chu, Chia-Han Chang, Chien-Nan Chou, Wei-Jia Huang, Wen-Yan Chang, and Yi-Ping Hung, IEEE Transactions on Multimedia, Vol. 13, Issue 3, pp.539-550, June 2011.Â [Download] Clip-on Gadgets: Expanding Multi-touch Interaction Area with Unpowered Tactile Controls,Â Neng-Hao Yu, Sung-Sheng Tsai, I-Chun Hsiao, Dian-Je Tsai, Meng-Han Lee, Mike Y. Chen, Yi-Ping Hung, ACM UIST, Santa Babara, USA, Oct. 2011.Â [Download] Novel Projector Calibration Approaches of Multi-Resolution Display, Po-Hsun Chiu, Shih-Yao Lin, Li-Wei Chan, Neng-Hao Yu and Yi-Ping Hung, IEEE International Conference on Multimedia and Expo (ICME 2011), Barcelona, Spain, July 2011. [Download] Ordinal HyperplanesÂ Ranker with Cost Sensitivities for Age Estimations, Kuang-Yu Chang, Chu-Song Chen, and Yi-Ping Hung, IEEE Conference on Computer Vision and Pattern Recognition (CVPR), June 2011. [Download] TUIC: Enabling Tangible Interaction on Capacitive Multi-touch Displays, Neng-Hao Yu, Li-Wei Chan, Seng-Yong Lau, Sung-Sheng Tsai, I-Chun Hsiao, Dian-Je Tsai, Lung-Pan Cheng, Fang-I Hsiao, Mike Y. Chen, Polly Huang, Yi-Ping Hung, CHI, Vancouver, Canada, May. 2011 (full paper). [Download] i-m-Walk : Interactive Multimedia Walking-aware System, Meng-Chieh Yu, Cheng-Chih Tsai, Hao-Tien Chiang, Shih-Ta Liu, Wei-Ting Chen, Ying-Chieh Tseng, Wan-Wei Teo, Mike Y. Chen, Ming-Sui Lee, and Yi-Ping Hung, International Conference on Health Informatics (HEALTHINF 2011), Rome, Italy, Jan. 2011. [Download] i-m-Breath: The Effect of Multimedia Biofeedback on LearningÂ Abdominal Breath, Meng-Chieh Yu, Jin-Shing Chen, King-Jen Chang, Su-Chu Hsu, Ming-Sui Lee, and Yi-Ping Hung, International Conference on MultiMedia Modeling (MMM), Taipei, Taiwan, Jan. 2011. [Download] Egocentric View Transitionfor Video Monitoring in a Distributed Camera Network, Kuan-Wen Chen, Pei-Jyun Lee, and Yi-Ping Hung, International Conference on MultiMedia Modeling (MMM), Taipei, Taiwan, Jan. 2011. [Download] 2010 Multidisplay map touring with tangible widget, Marco Piovesana, Ying-Jui Chen, Neng-hao Yu, Hsiang-Tao Wu, Li-Wei Chan, Yi-Ping Hung, ACM Multimedia, Firenze, Italy, Oct. 2010. [Download] i-m-Space: Interactive Multimedia-Enhanced Space for Rehabilitation of Breast Cancer Patients, Ju-Chun Ko, Wei-Han Chen, Meng-Chieh Yu, Han-Hung Lin, Jin-Yao Lin, Szu-Wei Wu, Yi-Yu Chung, I-Ling Hu, Wei-Ting Peng, Shih-Yao Lin, Chia Han Chang, Pei-Hsuan Chou, King-Jen Chang, Mei-Lan Chang, Sue-huei Chen, Jin-Shing Chen, Ming-Sui Lee, Mike Y. Chen, Yi-Ping Hung, ACM Multimedia, Firenze, Italy, Oct. 2010. [Download] Yongzheng Emperorâs Interactive Tabletop: Seamless Multimedia System in a Museum Context, Chun-Ko Hsieh, I-Ling Liu, Neng-Hao Yu, Yueh-Hsuan Chiang,Hsiang-Tao Wu, Ying-Jui Chen, Yi-Ping Hung , ACM Multimedia, Firenze, Italy, Oct. 2010. [Download] e-Fovea: A Multi-Resolution Approach with Steerable Focus to Large-Scale and High-Resolution Monitoring, Kuan-Wen Chen, Chih-Wei Lin, Mike Y. Chen, Yi-Ping Hung , ACM Multimedia, Firenze, Italy, Oct. 2010. [Download] Enabling Beyond Surface Interactions for Interactive Surface with An Invisible Projection, Li-Wei Chan, Hsiang-Tao Wu, Hui-Shan Kao, Home-Ru Lin, Ju-Chun Ko, Mike Y. Chen, Jane Hsu and Yi-Ping Hung, ACM UIST, New York, USA, Oct. 2010, 10 pages. [Youtube] Robust Face Recognition Using Probabilistic Facial Trait Code, Ping-Han Lee, Si-Wei Wu, Gee-Sern Hsu, Yi-Ping Hung, European Conference on Computer Vision (ECCV), Crete, Greece, Sep. 2010. [Download] A Ranking Approach for Human Age Estimation Based On Face Images,Â Kuang-Yu Chang, Chu-Song Chen, Yi-Ping Hung, International Conference on Pattern Recognition (ICPR), Istanbul, Turkey, Aug. 201",
  "content_length": 35325,
  "method": "requests",
  "crawl_time": "2025-12-01 14:51:16"
}