{
  "name": "Yi Chen 0013",
  "homepage": "https://sse.cuhk.edu.cn/en/faculty/chenyi",
  "status": "success",
  "content": "CHEN, Yi | School of Science and Engineering Search Search SEARCH CUHK-Shenzhen ç®ä½ä¸­æ About the School Introduction of SSE Deanâs message Annual Undergraduate Prospectus School Video Contact us News SSE News SSE Newsletter Interviews with SSE Faculty Members Announcement Programmes Undergraduate Programmes Mathematics and Applied Mathematics Physics Chemistry Materials Science and Engineering New Energy Science and Engineering Electrical and Computer Engineering Financial Engineering(offered jointly with the SME and the SDS) CUHK Special Exchange Programme Double Major Programmes Columbia University 3+2 Initiative (Columbia Class) Long Feng Class Bachelor-Master Scheme Bachelor-PhD Class Q&A on Registry Matters Master of Science Programmes Master of Science in Communications Engineering Master of Science in Computer and Information Engineering Master of Science in Integrated Circuits and Systems Master of Science in Financial Mathematics Master of Science in Artificial Intelligence for Science Master of Science in Artificial Intelligence and Robotics Executive Master of Science in Supply Chain and Logistics Management (Part-time master programme) Research Postgraduate Programmes Mathematics Physics Chemistry Materials Science and Engineering Energy Science and Engineering Computer and Information Engineering Biomedical Engineering Faculty Academic Staff Research Fellow Academic Research Research Field Laboratories Research News Academic Activities Long Feng Science Forum SSE Upcoming Events SSE Events Review Materials Characterization and Preparation Center Students Studentsâ Activities Studentsâ Achievements Student Sharing Student Associations Maker Lab About us Tools & Equipment Project Ideas Career About us Career Handbook International Co Exchange & Visiting Programs Collaborative Degree Program Further Education and Employment Latest News Industrial Talks Employment Workshop Further Study Workshop Counselling Alumni Cooperation Recruitments About the School Introduction of SSE Deanâs message Annual Undergraduate Prospectus School Video Contact us News SSE News SSE Newsletter Interviews with SSE Faculty Members Announcement Programmes Undergraduate Programmes Mathematics and Applied Mathematics Physics Chemistry Materials Science and Engineering New Energy Science and Engineering Electrical and Computer Engineering Financial Engineering(offered jointly with the SME and the SDS) CUHK Special Exchange Programme Double Major Programmes Columbia University 3+2 Initiative (Columbia Class) Long Feng Class Bachelor-Master Scheme Bachelor-PhD Class Q&A on Registry Matters Master of Science Programmes Master of Science in Communications Engineering Master of Science in Computer and Information Engineering Master of Science in Integrated Circuits and Systems Master of Science in Financial Mathematics Master of Science in Artificial Intelligence for Science Master of Science in Artificial Intelligence and Robotics Executive Master of Science in Supply Chain and Logistics Management (Part-time master programme) Research Postgraduate Programmes Mathematics Physics Chemistry Materials Science and Engineering Energy Science and Engineering Computer and Information Engineering Biomedical Engineering Faculty Academic Staff Research Fellow Academic Research Research Field Laboratories Research News Academic Activities Long Feng Science Forum SSE Upcoming Events SSE Events Review Materials Characterization and Preparation Center Students Studentsâ Activities Studentsâ Achievements Student Sharing Student Associations Maker Lab About us Tools & Equipment Project Ideas Career About us Career Handbook International Co Exchange & Visiting Programs Collaborative Degree Program Further Education and Employment Latest News Industrial Talks Employment Workshop Further Study Workshop Counselling Alumni Cooperation Recruitments CUHK-Shenzhen ç®ä½ä¸­æ CHEN, Yi Research Assistant Professor Education Background PhD (The Chinese University of Hong Kong)BEng (Beijing University of Posts and Telecommunications) Research Field Wireless communications, resource allocation and optimization, big data systems Academic Area Computer Engineering, Electrical Engineering Personal Website (CUHK-Shenzhen) https://myweb.cuhk.edu.cn/yichen Email yichen@cuhk.edu.cn Biography Dr. Yi Chen received her B.Eng. degree from Beijing University of Posts and Telecommunications in 2007, majoring in Electronics and Information Engineering. She received her Ph.D. degree in Information Engineering from The Chinese University of Hong Kong (CUHK) in 2012. From 2012 to 2015, she worked as a postdoctoral fellow in the department of Electronic Engineering of City University of Hong Kong. Since March 2015, she has been with the department of Information Engineering, CUHK, as a Research Associate. She has joined the School of Science and Engineering, CUHK Shenzhen in August 2016. Her research interests include wireless communications with the focus on power control and media access control, resource allocation and optimization, scheduling and routing algorithms in data center networks, and Big Data systems. Academic Publications 1. Yi Chen, Kenneth W. Shum, Wing Shing Wong, âGeneralized CRT sequence and its applicationsâ, to appear in Proceedings of Sequence and Their Applications (SETA), Chengdu, China, Oct. 2016.2. Yi Chen, Chi Wan Sung, Siu-Wai Ho, Wing Shing Wong, âBER analysis for interfering visible light communication systemsâ, in Proceedings of IEEE/IET International Symposium on Communication Systems, Networks and Digital Signal Processing (CSNDSP), Prague, Czech Republic, Jul. 2016. (Best Paper Award)3. Yaru Fu, Yi Chen, Chi Wan Sung, âDistributed downlink power control for the non-orthogonal multiple access system with two interfering cellsâ, in Proceedings of IEEE International Conference on Communications (ICC), Kuala Lumpur, Malaysia, May 2016.4. Shenghao Yang, Yi Chen, Soung Chang Liew, Lizhao You, âCoding for network-coded sotted ALOHAâ, in Proceedings of IEEE Information Theory Workshop (ITW), Jerusalem, Israel, April 2015. â¨5. Shenghao Yang, Soung Chang Liew, Lizhao You, Yi Chen, âLinearly-coupled fountain codes for network-coded multiple accessâ, in Proceedings of IEEE Information Theory Workshop (ITW), Hobart, Tasmania, Australia, Nov. 2014.6. Yi Chen, Chi Wan Sung, âResource allocation for two-way relay cellular networks with and without network codingâ, in Proceedings of IEEE International Conference on Communication Systems (ICCS), Macau, China, Nov. 2014.7. Yi Chen, Shenghao Yang, Wing Shing Wong, âExact non-Gaussian interference model for fading channelsâ, IEEE Transactions on Wireless Communications, vol. 12, no. 1, pp. 168-179, Jan. 2013. â¨8. Hui Cheng, Yi Chen, Wing Shing Wong, Qiong Yang, Lianfeng Shen, âProtocol sequence based wireless media access control in networked control systemsâ, in Proceedings of IEEE International Conference on Control, Automation, Robotics and Vision (ICARCV), Guangzhou, China, Dec, 2012. â¨9. Yi Chen, Wing Shing Wong, âPower control for non-Gaussian interferenceâ, IEEE Transactions on Wireless Communications, vol. 10, no. 8, pp. 2660-2669, Aug. 2011.10. Yi Chen, Wing Shing Wong, âPower control for non-Gaussian interferenceâ, in Proceedings of IEEE International Symposium on Modeling and Optimization in Mobile, Ad Hoc, and Wireless Networks (WiOPT), Seoul, Korea, 2009. â¨ Follow us Get In Touch Campus Map Contact Us Join us Explore More Admissions Office Registry Office Office of Academic Links Research Administration Office Library Media School News Copyright Â© CUHK-Shenzhen All Rights Reserved.",
  "content_length": 7704,
  "method": "requests",
  "crawl_time": "2025-12-01 14:51:04"
}