{
  "name": "Yi Fang 0006",
  "homepage": "https://nyuad.nyu.edu/en/academics/divisions/engineering/faculty/yi-fang.html",
  "status": "success",
  "content": "Yi Fang - NYU Abu Dhabi Skip To All NYU Navigation Skip To Main Content To open and close this bar, use optionalt+/ Yi Fang Associate Professor of Computer Engineering; Associate Professor of Computer Science (Affiliated), NYU Abu Dhabi; Global Network Associate Professor of Computer Science and Engineering, NYU Tandon Affiliation: NYU Abu Dhabi Education: PhD Purdue University yf23@nyu.edu Research Websites: Embodied AI and Robotics Lab (AIR) Research Areas: 3D Computer Vision, Multimedia Processing, Machine Learning, and Deep Learning Yi Fang is a researcher, engineer, innovator, and entrepreneur specializing in Embodied AI and Robotics, with a focus on AI-driven perception, learning, and real-world applications. He received his PhD from Purdue University, specializing in computer vision and machine learning. His career began in industry, where he worked at Siemens and Riverain Technologies before transitioning to academia as a Senior Staff Scientist in the Department of Electrical Engineering and Computer Science at Vanderbilt University. In 2013, he joined NYU Abu Dhabi as an Assistant Professor of Electrical and Computer Engineering, where he currently directs the Embodied AI and Robotics (AIR) Lab. His research spans large-scale visual computing, deep visual learning, and cross-domain/multimodal foundation models, with impactful applications in engineering, social sciences, medicine, and biology. As the founder and director of the AIR Lab, he has established a dedicated research space for developing intelligent robotic systems that seamlessly integrate perception, learning, and decision-making to tackle complex real-world challenges. His lab fosters interdisciplinary collaboration, bringing together faculty, researchers, and students to drive advancements in Embodied AI-powered robotics. His research is actively funded by major government and institutional agencies, including US NSF, UAE ADEK, and ASPIRE. Yi Fang is an active researcher in the AI and robotics research community, serving as an Area Chair for top conferences such as CVPR, ECCV, ICCV, IJCAI, and IROS. His contributions extend to peer reviewing, conference organization, and mentoring early-career researchers, reinforcing his role in shaping the future of Embodied AI and robotics. Beyond academia, he is an entrepreneur dedicated to AI-driven assistive technologies. He recently founded ChatSign Technology, a company pioneering Generative AI-powered assistive devices designed to empower deaf and hard-of-hearing individuals by enhancing their communication and social reintegration. His work aims to leverage AI for greater accessibility, ensuring that cutting-edge innovations serve a broader societal purpose. Through his work as a researcher, engineer, innovator, and entrepreneur, Yi Fang continues to push the boundaries of Embodied AI, Robotics, and AI-powered assistive technologies, shaping the future of intelligent systems and their impact on society. Courses Taught Expand/Collapse all",
  "content_length": 3006,
  "method": "requests",
  "crawl_time": "2025-12-01 14:51:04"
}