{
  "name": "Yi Huang 0001",
  "homepage": "https://liverpool.ac.uk/electrical-engineering-and-electronics/staff/yi-huang",
  "status": "success",
  "content": "Professor Yi Huang | Our people | University of Liverpool Skip to main content Close Search Find courses, people, research, information and more. Please ignore What types of page to search? All Courses Academic staff News Events Search Popular pages: Undergraduate Postgraduate PhD Accommodation Research International students Alternatively use our A-Z index. About Prof Yi Huang received a BSc in Physics (Wuhan, China), an MSc (Eng) in Microwave Engineering (Nanjing, China), and a DPhil in Communications from the University of Oxford, UK in 1994. He has been conducting research in the areas of antennas, radio propagation, radar, wireless communications, energy harvesting, and applied electromagnetics since 1987. His experience includes 3 years with NRIET (China) as a Radar Engineer and various periods with the Universities of Birmingham, Oxford, and Essex as a member of research staff. He worked as a Research Fellow at British Telecom Labs in 1994 and then joined the Department of Electrical Engineering & Electronics, at the University of Liverpool as a Lecturer in 1995. He was the MS Programme Director and Deputy Head of Department (2015-2023) and is now a Chair in Wireless Engineering and Head of the High-Frequency Engineering Research Group. Prof Huang has published over 500 refereed papers in leading international journals and conference proceedings and authored books on Antennas: from Theory to Practice (Wiley, 2008, and 2021), and Reverberation Chambers (Wiley 2016, and 2019). He has received over 10 awards (e.g. the IET Premium Award 2022 for Best Paper, EuCAP2023 Best Antenna Paper, the IET Innovation Award 2018, and BAE Systems Chairman's Award 2017) and many research grants from research councils, government agencies, charities, the EU, and industry, acted as a consultant to various companies, and served on many national and international technical committees (such as the IET, EPSRC, European ACE, COST-IC0603, and COST-IC1102, and EurAAP), and been the UK/Ireland Delegate to EurAAP (2016-2020, 2022-2023), an Associate Editor and Guest Editor of four of international journals (including IEEE AWPL 2016-2022), and the Editor-in-Chief of Wireless Engineering and Technology (2014-2023). He has been a keynote/invited speaker and organiser of many international conferences and workshops (e.g. EuCAP, IEEE iWAT, WiCom, and LAPC). He is at present an Associate Editor of IEEE Trans on Antennas and Propagation, a College member of EPSRC, a member of the New Technology Directions Committee and a Distinguished Lecturer of IEEE AP-S, a Senior Fellow of Higher Education Academy (SFHEA), and a Fellow of IEEE (FIEEE).",
  "content_length": 2656,
  "method": "requests",
  "crawl_time": "2025-12-01 14:51:14"
}