{
  "name": "Yi He 0007",
  "homepage": "https://yhe15.people.wm.edu",
  "status": "success",
  "content": "Yi He - Homepage Yi He I am an assistant professor of Data Science with the School of Computing, Data Sciences, and Physics at William & Mary. Prior to that, I have been with the Department of Computer Science at Old Dominion University since 2021. I received my Ph.D. from the Center for Advanced Computer Studies (CACS) at the University of Louisiana at Lafayette in 2020, advised by Dr. Xindong Wu, and my B.E. from Harbin Institute of Technology (HIT), China, in 2013. My research interests include data mining, streaming algorithms, graph learning, and AI for conservation study. I am a recipient of the IEEE TCII Volunteer Award 2022 and the NSF CRII Award 2023. Office: Integrated Science Center (ISC) 2271 540 Landrum Dr, Williamsburg, VA 23185 Email: yihe@wm.edu News [11/2025] Two papers have been accepted by AAAI'26, and one survey has been accepted by TMLR. Congratulations to the co-authors! [08/2025] Two papers on large-scale graph ensemble learning and knowledge graph link prediction have been accepted by ICDM'25. [06/2025] Two papers on streaming data analytics have been accepted by IEEE TKDE and ACM TKDD. [06/2025] One prospectus has been accepted by KDD PhD Consortium 2025. Congrats to Heng Lian! [05/2025] Our experiential learning project on applied AI safety in marine ecological models has been funded by CCI. Thanks to CCI for supporting this education-prioritized AI research! [05/2025] One paper on physics-informed graph learning has been accepted by ICML'25. [04/2025] Three papers on graph ensemble learning, online learning, and graphRAG have been accepted by IJCAI'25. [04/2025] One paper on dynamic graphRAG have been accepted by ACL'25. [03/2025] Proceedings of the 2024 IEEE International Conference on Data Mining Workshops (ICDMW) have been released. [12/2024] Our project on benchmarking and mitigating social biases in LLMs has been funded by CCI. Thanks to CCI for the support! [12/2024] One paper on continual learning fair classifier has been accepted by AAAI'25. [10/2024] Our project using AI for benthic environment analysis has been funded by SCeMFiS, an NSF Industry/University Cooperative Research Center (I/UCRC). Thanks to SCeMFiS for the support! [09/2024] One paper on label distribution learning on heterogeneous graphs has been accepted by NeurIPS'24. [09/2024] One paper on mining open-world soft-sensing streams has been accepted by ICDM'24. [08/2024] I receive the NSF PACSP grant as the PI (WM link). Thanks to National Science Foundation (NSF) and Paul G. Allen Family Foundation for the support on our AI-driven conservation research! NSF News [08/2024] I serve as the NSF Travel Award Chair for IEEE ICDM'24 (link). Thanks to NSF for the generous support to students and early-career researchers in data mining! [07/2024] One paper on group fairness in streaming feature analysis has been accepted by IEEE SMC'24. [07/2024] One paper on multi-type load forecasting has been accepted by Energy. [03/2024] One paper on machine learning-based gradual typing has been accepted by ECOOP'24. Click to view more news ... [12/2023] Two papers on knowledge graph-based medical AI and graph label distribution learning have been accepted by AAAI'24. [12/2023] One paper on sparse online learning has been accepted by SDM'24. [11/2023] One paper on spatio-temporal signal recovery has been accepted by TNNLS. [09/2023] One paper on knowledge graph-based POI recommendation has been accepted by ICDM'23. [09/2023] One paper on VAE-based online algorithm for open feature space has been accepted by TKDE. [07/2023] I receive the NSF CORE grant as the Lead PI (ODU link, FAU link). Thanks to National Science Foundation (NSF) for the support on our open-world streaming graph research! [06/2023] I receive the NSF CRII award (link). Thanks to NSF for the support on the explainable data stream analytic research! [06/2023] One paper gets accepted by ECML-PKDD'23 . [05/2023] I serve on the NSF CISE panel. [04/2023] Our survey on online learning in open feature spaces gets accepted by IJCAI'23 . [04/2023] I serve as the Workshop Co-Chair for ICDM'23 (update: ICDMW-23 proceedings have been released). [04/2023] I receive the SRFP award. Thanks to ODU for the support! [01/2023] I receive the CCI grant as PI (media). Thanks to COVA CCI for the support! [01/2023] I receive the Volunteer Award from the IEEE Technical Community on Intelligent Informatics (TCII) . Looking forward to serving the community more! [11/2022] Two papers on open online algorithms get accepted by AAAI'23 . [10/2022] Two papers get accepted by IEEE UIC'22 (170/694 = 24.5%), both investigated the robustness of deep factorization machines. One mitigates the train-test bias of sparse matrices, the other reinforces resilience to outlier entries. [06/2022] A novel generative model for streaming feature online learning has been accepted by ACM MM'22 . Congratulations to Heng! Excellent job for a first-year PhD student. [06/2022] I will be chairing the Multifarious Multimedia session in ICMR'22. Please join us on June 30th, 10:30 am, at Central King Building. Looking forward to meeting you at NJIT! [05/2022] A new metric-learning based regularizer for stochastic matrix factorization has been accepted by IEEE Transactions on Services Computing . [04/2022] A new graph algorithm for cyber risk quantification in distributed Cyber-Physical Systems has been accepted by IEEE Transactions on Industrial Informatics. [04/2022] One paper on generative adversarial attack on GNN models has been accepted by ICMR'22. [03/2022] I will be serving as PC members for ECML-PKDD 2022 and CIKM 2022. [01/2022] I serve as the Registration Chair of ICDM-2022. [01/2022] A new hyper-parameter auto-tuning method for \"deep\" recommender systems has been accepted by DASFAA-2022 . [12/2021] I receive the Faculty Innovator Grant as Co-PI. Kudos to PI Xiao Yang (Psychology). [12/2021] I will be serving as a member of the program committee of IJCAI-ECAI 22. [10/2021] A new neural-architecture search (NAS) method that can work under a federated and privacy-preserving context has been accepted by IEEE T.KDE. [10/2021] A new web service recommender system with ensemble latent factor modeling is accepted by IEEE ICBK 2021; ICBK is the sister conference of ICDM. [08/2021] A new Copula model to learn feature interactions and dynamics in streaming data has been accepted as a regular paper (acceptance rate = 9.9%) by IEEE ICDM 2021. [08/2021] A new latent factor analysis for online feature selection under high sparsity has been accepted by IEEE T.SMC. [04/2021] An interpretable data synthesis technique using GAN for imbalanced classification problem has been accepted by IJCAI 2021. [01/2021] A new lifelong learning paradigm that overcomes catastrophic forgetting with an \"easy-to-hard\" task curriculum has been accepted by WWW 2021. [12/2020] A semi-supervised online learning algorithm dealing with streaming features has been accepted by AAAI 2021. Research Data Streams More Info Graph Learning More Info AI for Conservation Study More Info Funding Agencies",
  "content_length": 7083,
  "method": "requests",
  "crawl_time": "2025-12-01 14:51:05"
}