{
  "name": "Yi Jin 0001",
  "homepage": "https://faculty.bjtu.edu.cn/8497",
  "status": "success",
  "content": "北京交通大学教师名录 金一 博士 、教授 、博导、院长助理 基本信息 办公电话： 电子邮件： yjin@bjtu.edu.cn 通讯地址：北京市海淀区上园村3号，北京交通大学 邮编：100044 个人简介 金一，北京交通大学计算机与信息技术学院教授，博导，院长助理。主要研究方向为交通视频语义理解、可信行为分析、人脸防伪及面部识别、行人再识别等。发表或录用学术论文70余篇，其中包括IEEE/ACM汇刊等领域重要期刊和CCF A类会议CVPR，AAAI，ICCV，IJCAI，ACM MM等。作为项目负责人主持机器视觉、模式识别理论研究方向的国家自然科学基金项目、国家重点研发计划课题、“173”基础加强重大项目课题、北京市自然科学基金项目、教育部-中移动联合重点项目在内的项目等项目。任2022 PAAP财务主席，2019 IEEE BESC出版主席，CCF A类会议AAAI2021 SPC，ACM MM2021、IEEE ICSP PC等，任SCI期刊《Journal of The Franklin Institute》、《Journal of Electronic Imaging》编委、多家国际国内期刊的客座编委，任中国图象图形学学会交通视频专委会副秘书长，中国图象图形学学会女工委委员，中国计算机学会YOCSEF总部学术秘书（23-24），智慧交通分会常委，多媒体专委会执委等。主编或参编专著教材2部，其中入选“十二五”普通高等教育本科国家级规划教材1部。申请国家发明专利45项，国际PCT发明专利1项，申请相关行业标准草案1项。核心数据处理与分析软件形成自主知识产权的计算机软件著作权6项。研究成果在智慧城市、智能交通、能源电力等领域实现产业化应用。获IEEE Computer Society 年度最佳论文奖 Runner-up（2022），中国计算机学会科学技术奖科技进步优秀奖1项（2020），北京市高等教育教学成果奖二等奖1项（2017），IEEE ICSP突出贡献奖，IEEE BESC最佳服务奖等奖励，入选北京市轨道交通学会杰出青年人才（2023），京东研究院“葡萄树学者计划”（2020）。 [Google Scholar 个人主页] 教育背景 金一，女，博士，北京交通大学计算机与信息技术学院教授，计算机科学与技术专业，博士研究生导师。2010年1月获得北京交通大学信号与信息处理专业博士学位。后进入北京交通大学计算机科学与技术博士后流动站工作两年。主要研究经历： 2021/01-今，北京交通大学，计算机与信息技术学院，教授； 2016/01-2020/12，北京交通大学，计算机与信息技术学院，副教授； 2012/01-2015/12，北京交通大学，计算机与信息技术学院，讲师； 2013/03-2014/03，新加坡南洋理工大学，电气与电子工程学院，博士后研究员，主要从事异质人脸识别研究； 2010/01-2011/12，北京交通大学，计算机与信息技术学院，博士后； 2008/03-2008/9，西班牙马德里理工大学，电信工程学院，图像处理研究组，国际交换生，主要从事3D人体动画研究。 研究兴趣： 多模态数据处理及智能感知，主要关注如何利用机器学习及深度学习，结合图像、视频及3D点云数据处理，研究复杂、开放环境下的特定目标检测与识别、场景理解等任务。 2025年度硕士招生情况（全日制统考生）： 本年度还余3名硕士研究生名额，主要研究方向：多模态融合感知，多媒体大数据分析等方向，要求：有较好的编程能力和素养，有计算机视觉、图像处理等相关基础，了解基本深度学习框架，课题组经费充足，如有意愿者请与我电邮联系。 2025年度硕士招生情况（非全日制统考生）： 本年度拟计划招1名非全日制硕士研究生，主要工作地点：北京，要求：有较好的编程能力，熟悉计算机视觉领域的基本深度学习框架，有较好的文字能力、沟通能力与团队合作精神，全职在交大工作，我们将一起与业内知名企业优秀团队共事（工资面议）。 目前课题组名额较为充足，欢迎联系。 研究方向 计算机技术 软件工程 人工智能 大数据技术与工程 生成式人工智能与安全 低空航行安全保障 智能感知与具身智能 新一代电子信息技术 招生专业 计算机科学与技术硕士 计算机技术硕士 软件工程硕士 人工智能硕士 大数据技术与工程硕士 计算机科学与技术博士 人工智能博士 新一代电子信息技术（含量子技术等）硕士 软件工程博士 计算机技术博士 新一代电子信息技术（含量子技术等）博士 低空技术与工程硕士 科研项目 国家重点研发计划：支持隐私保护的多媒体大数据处理与分析平台（2022YFB3103505 ），2022-12-5--2025-11-30，2513.0万元（国拨513.0万元），主持（在研） 国家自然科学基金“面上”项目：面向复杂场景的无监督迁移学习行人再识别方法研究（61972030），2020-01-01--2023-12-31，58.0万元，主持（已结题） 红果园国家级科技委、后勤保障项目：***目标感知与认知一体化技术研究，2020-08-01--2022-07-31，100.0万元，主持（已结题） 教育部-中移动基金项目：智慧城市安全治理复杂场景下的人体行为分析关键技术研究（MCM20200203），2020.12-2022.12，150.0万元，主持（已结题） 国家自然科学基金“青年基金”：跨模态人脸特征学习方法及其应用研究，2015-01-01--2017-12-31，26.0万元，主持（结题） 北京市自然科学基金“预探索项目”：基于特征学习的跨视角行人再识别方法及其应用研究，2016-01-01--2018-12-31，6.0万元，主持 （结题） 基本科研业务费：面向社会网络的三维人脸重建与跨模态识别问题研究，2014-01-01--2015-12-31，主持（结题） 北京交通大学：消费者情感表征模式的自动识别分析，2013-09-01--2015-08-31，主持 博士点基金：基于智能感知的三维人脸特征提取及识别研究，2013-01-09--2015-12-31，主持 科技部国家基础重大研究计划（“973”）：面向公共安全的社会感知数据处理（物理与网络空间的协同感知），2012-01-01--2016-12-31，参加 国家自然科学基金“面上”：三维表情识别中的张量表示及分解理论和算法研究，2015-01-01--2018-12-31，90.0万元，参加 国家自然科学基金“面上”：面向可视媒体内容安全的取证技术研究，2013-01-01--2016-12-31，80.0万元，参加 国家自然科学基金“面上”：基于多目视觉的形体语言感知与识别研究，2012-01-01--2015-12-31，60.0万元，参加 教学工作 [主讲课程]： 本科生课程《操作系统A》，课程号：80L108Q（本科生第三年-春季学期） 研究生课程《机器视觉》，课程号：M502024B（研究生第一年-秋季学期） [招生信息]： 我招收硕士、博士研究生（推免/招考, 硕士生：4-5 名/年，博士生：1 名/年）和学有余力的本科实习生（特别是有意攻读博士学位的本科生），如愿意选择我作为导师（学术型硕士生优先），请电邮联系并附简历。 招生要求：熟悉python、java、C++等语言工具，对深度学习下的图像感知、视频分析等任务有前期基础和较深理解（有读博意愿优先），招收非全日制学生2名（全职在交大工作，薪资面议）。 论文/期刊 News: One paper \"PGAN: Part-Based Nondirect Coupling Embedded GAN for Person Reidentification,\" has been recognized as the Runner-up for the 2020 Best Paper Award from IEEE MultiMedia by the IEEE Computer Society Publications Board. An announcement has been posted online here:   https://www.computer.org/publications/best-paper-award-winners. One paper \"VSLN: View‐aware sphere learning network for cross‐view vehicle re‐identification\" has been acceptted by International Journal of Intelligent Systems(IF=8.7088，Q1). One paper \"Blockchain-Based Decentralized Cloud Storage with Reliable Deduplication and Storage Balancing\" has been acceptted by IEEE Transactions on Network Science and Engineering. One paper \"Weakly Supervised Object Detection with Class Prototypical Network\" has been acceptted by IEEE Transactions on Multimedia(IF=6.513，Q1). Special Issues： ACM TOMM (IF=3.144) \"Multimedia Cognitive Computing for Intelligent Transportation System\". Call for papers. Submission deadlin: March 31, 2022. Expected publication in Dec. 2022. Signal Processing: Image Communication (IF=3.256，Q2) \"Special Issue on Explainable Artificial Intelligence for Image Understanding\". Call for papers. Submission deadline: April 30, 2022. Expected publication in Dec. 2022. IEEE International Conference on Intelligent Transportation Systems（IEEE ITSC 2022, IEEE 智能交通系统学会年度旗舰会议） \"Long-tailed Situation Understanding in New Era of Intelligent Transportation: Benchmarks, Models and Applications\".  【PDF】 October 8-12, 2022 Macau, China. IEEE International Conference on Multimedia and Expo  (IEEE ICME 2022, IEEE国际多媒体领域年度旗舰会议) \"Visual Question Answering for Fine-grained Multimedia Understanding\". July 18-22, 2022 Taipei, Taiwan. 《计算机工程》 (已被Scopus数据库收录) 《区块链理论与技术》专栏征文 投稿截止时间：2022年3月31日，专栏出版时间：2022年6月15日。 Publications: 2021： Yajun Gao, Tengfei Liang, Yi Jin*, Xiaoyan Gu, Wu Liu, Yidong Li, Congyan Lang, MSO: Multi-Feature Space Joint Optimization Network for RGB-Infrared Person Re-Identification. ACM MM 2021. (CCF A类) Minying Zhang, Kai Liu, Yidong Li, Shihui Guo, Hongtao Duan, Yimin Long, Yi Jin. Unsupervised Domain Adaptation for Person Re-identification via Heterogeneous Graph Alignment. AAAI, 2021. (CCF A类) Yi Jin, Yue Zhang, Yigang Cen, Yidong Li, Vladimir Mladenovic, Viacheslav Voronin . Pedestrian detection with super-resolution reconstruction for low-quality image[J]. Pattern Recognition, 2021, 115: 107846. (CCF B类，Q1) Yi Jin, Chenning Li, Yidong Li, Peixi Peng, George A Giannopoulos. Model Latent Views With Multi-Center Metric Learning for Vehicle Re-Identification[J]. IEEE Transactions on Intelligent Transportation Systems, 2021, 22(3): 1919-1931. (CCF B类，Q1) Yidong Li, Wenhua Liu, Yi Jin*, Yuanzhouhan Cao. SPGAN: Face Forgery Using Spoofing Generative Adversarial Networks[J]. ACM Transactions on Multimedia Computing, Communications, and Applications (TOMM), 2021, 17(1s): 1-20. (CCF B类，Q1) Lichen Cheng, Jiqiang Liu, Yi Jin, Yidong Li, Wei Wang. Account Guarantee Scheme: Making Anonymous Accounts Supervised in Blockchain[J]. ACM Transactions on Internet Technology (TOIT), 2021, 21(1): 1-19. (CCF B类，Q1) Gengyu Lyu, Songhe Feng, Yi Jin, Yidong Li. Partial Label Learning via Self-Paced Curriculum Strategy[C]. Machine Learning and Knowledge Discovery in Databases: European Conference, ECML PKDD 2020, Ghent, Belgium, September 14–18, 2020, Proceedings, Part II. Springer International Publishing, 2021: 489-505. (CCF B类) Shuqin Wang, Yongyong Chen, Yi Jin, Yigang Cen, Yidong Li, Linna Zhang. Error-robust low-rank tensor approximation for multi-view clustering[J]. Knowledge-Based Systems, 2021, 215: 106745. (CCF C类，Q1) Ruicong Zhi, Caixia Zhou, Tingting Li, Shuai Liu, Yi Jin. Action unit analysis enhanced facial expression recognition by deep neural network evolution[J]. Neurocomputing, 2021, 425: 135-148. (CCF C类，Q1) Min Wang, Congyan Lang, Songhe Feng, Tao Wang, Yi Jin, Yidong Li. Text to photo-realistic image synthesis via chained deep recurrent generative adversarial network[J]. Journal of Visual Communication and Image Representation, 2021, 74: 102955. (CCF C类，Q1) Xu Wang, Yi Jin*, Yigang Cen, Tao Wang, Yidong Li. Attention Models for Point Clouds in Deep Learning: A Survey[J]. arXiv preprint arXiv:2102.10788, 2021. (Best of arXiv.org for AI, Machine Learning, and Deep Learning – February 2021) Ajian Liu, Xuan Li, Jun Wan, Yanyan Liang, Sergio Escalera, Hugo Jair Escalante, Meysam Madadi, Yi Jin, Zhuoyuan Wu, Xiaogang Yu, Zichang Tan, Qi Yuan, Ruikun Yang, Benjia Zhou, Guodong Guo, Stan Z Li. Cross‐ethnicity face anti‐spoofing recognition challenge: A review[J]. IET Biometrics, 2021, 10(1): 24-43. (Q1) 2020： Yangru Huang, Peixi Peng, Yi Jin*, Yidong Li, Junliang Xing. Domain adaptive attention learning for unsupervised person re-identification[C]. AAAI 2020, 34(07): 11069-11076. (CCF A类) Tao Wang, He Liu, Yidong Li, Yi Jin, Xiaohui Hou, Haibin Ling. Learning combinatorial solver for graph matching[C]. CVPR 2020: 7568-7577. (CCF A类) Yi Jin, Xingyan Guo, Yidong Li*, Junliang Xing, Hui Tian. Towards stabilizing facial landmark detection and tracking via hierarchical filtering: A new method[J]. Journal of the Franklin Institute, 2020, 357(5): 3019-3037. (Q1) Jieru Jia, Qiuqi Ruan, Yi Jin*, Gaoyun An, Shiming Ge. View-specific subspace learning and re-ranking for semi-supervised person re-identification[J]. Pattern Recognition, 2020, 108: 107568. (CCF B类，Q1) Yidong Li, Kai Liu, Yi Jin, Tao Wang, Weipeng Lin. VARIlD: Viewpoint-Aware Re-IDentification of Vehicle Based on Triplet Loss[J]. IEEE Transactions on Intelligent Transportation Systems, 2020. (CCF B类，Q1) Tengfei Liang, Yi Jin*, Yidong Li, Tao Wang, Songhe Feng, Congyan Lang. EDCNN: Edge enhancement-based Densely Connected Network with Compound Loss for Low-Dose CT Denoising[J]. arXiv preprint arXiv:2011.00139, 2020. (Release Code) Zikai Zhang, Yidong Li, Hairong Dong, Honghao Gao, Yi Jin, Wei Wang. Spectral-based Directed Graph Network for Malware Detection[J]. IEEE Transactions on Network Science and Engineering, 2020. (Q1) Yue Zhang*, Yi Jin*, Jianqiang Chen, Shichao Kan, Yigang Cen, Qi Cao. PGAN: Part-based nondirect coupling embedded GAN for person reidentification[J]. IEEE MultiMedia, 2020, 27(3): 23-33. (Best Paper Award from IEEE MultiMedia by the IEEE Computer Society Publications Board，Q1) Yangru Huang, Yi Jin*, Yidong Li, Zhiping Lin. Towards Imbalanced Image Classification: A Generative Adversarial Network Ensemble Learning Method[J]. IEEE Access, 2020, 8: 88399-88409. (Q1) Gengyu Lyu, Songhe Feng, Yidong Li, Yi Jin, Guojun Dai, Congyan Lang. Hera: Partial label learning by combining heterogeneous loss with sparse and low-rank regularization[J]. ACM Transactions on Intelligent Systems and Technology (TIST), 2020, 11(3): 1-19. (Q1) 2019： Lijuan Sun, Songhe Feng, Tao Wang, Congyan Lang, Yi Jin. Partial multi-label learning ",
  "content_length": 26764,
  "method": "requests",
  "crawl_time": "2025-12-01 14:51:05"
}