{
  "name": "Yi Wu 0020",
  "homepage": "https://ywu960702.github.io",
  "status": "success",
  "content": "Yi Wu's Homepage Yi Wu | 武艺 Assistant Professor @University of Oklahoma Ph.D. @University of Tennessee, Knoxville Greetings! Welcome to my homepage. I am an Assistant Professor in the Computer Science department at University of Oklahoma. Previously, I was a Postdoctoral Researcher in the Center of Data Science at Emory University, working with Dr. Xiao Hu. I completed my Ph.D. at Min H. Kao Department of Electrical Engineering and Computer Science at University of Tennessee, Knoxville, under supervison of Dr. Jian Liu. My research interests encompass the areas of mobile sensing & computing, human-computer interaction, and cybersecurity & privacy. Particularly, I utilize machine learning and signal processing techniques to create next-generation applications for human-computer interaction, smart health monitoring, and identifying potential security/privacy issues on IoT devices. My research work has been published at top-tier mobile-computing/security/HCI venues, including S&P/Oakland, ACM CCS, ACM MobiCom, ACM UbiComp, and ACSAC. I will not be recruiting new Ph.D. students for Fall 2026. Thank you for your understanding. Recent News [Sep. 2025] One paper accepted to TS4H NeurIPS 2025 (Workshop). [July 2025] One article published at SIAM News. [July 2025] One paper accepted to Raid 2025. [June 2025] One paper accepted to UbiComp / ISWC 2025. [May 2025] Invited to deliever a talk on security & privacy issues in VR and wireless charging at University of Oklahoma (Cybersecurity Essential Training Workshop). [Apr. 2025] Invited to serve as a panelist for an NSF review panel. [Mar. 2025] Invited to serve on the TPC for ACSAC 2025. [Mar. 2025] Invited to serve on the TPC for IEEE COMPSAC 2025. [Oct. 2024] Invited to deliever a talk on sensing opportunities and security issues in VR/AR at University of North Texas (Data Science Talk Series). [Oct. 2024] One paper accepted to IEEE Transactions on Mobile Computing (TMC). [July 2024] Successfully defended my Ph.D. dissertation! [July 2023] I will join Truveta this fall as a research intern, working on LLM pre-training, LLM fine-tuning, and medical image de-identification. [July 2023] One paper accepted to UbiComp / ISWC 2023. [May 2023] One paper accepted to ACM DRONET 2023. [Mar. 2023] One paper accepted to IEEE S&P 2023. [Feb. 2023] I will join Snap Research this summer as a research intern, working with the Computational Imaging team. [Apr. 2022] BioFace-3D has been selected as the SigMobile Research Highlights 2022. [Aug. 2021] One paper accepted to ACSAC 2021. [Aug. 2021] Two papers accepted to ACM MobiCom 2021. Publications Conference Papers [ACM UbiComp'23] SmarCyPad: A Smart Seat Pad for Cycling Fitness Tracking Leveraging Low-cost Conductive Fabric Sensors [PDF] Yi Wu, Luis Gonzalez, Zhenning Yang, Gregory Croisdale, Cagadas Karatas, Jian Liu [IEEE S&P'23] Privacy Leakage via Unrestricted Motion-Position Sensors in the Age of Virtual Reality: A Study of Snooping Typed Input on Virtual Keyboards [PDF] Yi Wu, Cong Shi, Tianfang Zhang, Payton Walker, Jian Liu, Nitesh Saxena, Yingying Chen [ACM DRONET'23] DroneChase: A Mobile and Automated Cross-Modality System for Continuous Drone Tracking [PDF] Neel R Vora, Yi Wu, Jian Liu, Phuc Nguyen [ACSAC'21] Time to Rethink the Design of Qi Standard? Security and Privacy Vulnerability Analysis of Qi Wireless Charging [PDF] Yi Wu, Zhuohang Li, Nicholas Van Nostrand, Jian Liu [ACM MobiCom'21] BioFace-3D: Continuous 3D Facial Reconstruction Through Lightweight Single-ear Biosensors [PDF] Yi Wu, Vimal Kakaraparthi, Zhuohang Li, Tien Pham, Jian Liu, Phuc Nguyen [Project Website] [SIGMOBILE Research Highlight] [ACM MobiCom'21] Face-Mic: Inferring Live Speech and Speaker Identity via Subtle Facial Dynamics Captured by AR/VR Motion Sensors [PDF] Cong Shi, Xiangyu Xu, Tianfang Zhang, Payton R. Walker, Yi Wu, Jian Liu, Nitesh Saxena, Yingying Chen, Jiadi Yu [AsiaCCS'21] HVAC: Evading Classifier-based Defenses in Hidden Voice Attacks [PDF] Yi Wu, Xiangyu Xu, Payton R. Walker, Jian Liu, Nitesh Saxena, Yingying Chen, Jiadi Yu [ACM CCS'20] AdvPulse: Universal, Synchronization-free, and Targeted Audio Adversarial Attacks via Subsecond Perturbations [PDF] Zhuohang Li, Yi Wu, Jian Liu, Yingying Chen, Bo Yuan [IEEE DySPAN'19] Semi-black-box Attacks Against Speech Recognition Systems Using Adversarial Samples [PDF] Yi Wu, Jian Liu, Yingying Chen, Jerry Cheng Journal Papers & Magazine Articles [IEEE TMC'24] 3D Facial Tracking and User Authentication through Lightweight Single-ear Biosensors [PDF] Yi Wu, Xiande Zhang, Tianhao Wu,Bing Zhou, Phuc Nguyen, Jian Liu [ACM GetMobile'22] BioFace-3D: 3D Facial Tracking and Animation via Single-ear Wearable Biosensors [PDF] Yi Wu, Vimal Kakaraparthi, Zhuohang Li, Tien Pham, Jian Liu, Phuc Nguyen Posters [ACM SenSys'20] Poster Abstract: Security and Privacy in the Age of Cordless Power World [PDF] Yi Wu, Zhuohang Li, Nicholas Van Nostrand, Jian Liu Teaching Teaching Assistant, The University of Tennessee, Knoxville COSC 356 Computer Architecture (Fall 2019, Spring 2020) COSC 361 Operating Systems (Fall 2020, Fall 2021, Fall 2022, Spring 2023) ECE 315 Signals and Systems I (Spring 2022) ECE 469/569 Mobile/Embedded System Security (Spring 2021, Fall 2021) Grader, Rutgers University ECE 501 System Analysis (Spring 2019) Awards Outstanding Graduate Research Assistant of UTK, 2023 S&P Student Travel Award, 2023 ACM SigMobile Research Highlight, 2022 ACSAC Student Conference Grant, 2021 CCS Student Conference Grant, 2021 DySPAN Student Travel Award, 2019 Merit Scholarship of UESTC, 2015 Services Technical Program Committee IEEE COMPSAC 2023 Reviewer The Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies (IMWUT) IEEE Transactions on Image Processing IEEE Transactions on Mobile Computing IEEE Transactions on Neural Systems & Rehabilitation Engineering Virtual Reality RECENT ADVANCES IN ELECTRICAL & ELECTRONIC ENGINEERING Misc. I enjoy watching movies & reading detective fictions in my leisure time. \"The Pursuit of Happyness\", \"Batman: The Dark Knight\" and \"Tokyo Godfathers\" are my favourites. I also enjoy swimming & watching NBA games.",
  "content_length": 6180,
  "method": "requests",
  "crawl_time": "2025-12-01 14:51:07"
}