{
  "name": "Yi Wu 0013",
  "homepage": "https://iiis.tsinghua.edu.cn/en/People/Faculty/WuYi.htm",
  "status": "success",
  "content": "ï»¿ Wu Yi-Institute for Interdisciplinary Information Sciences (IIIS) Home IIIS Headlines Institute Seminars About IIIS Introduction Message From Dean Current Leadership History News Latest News Media Coverage People Faculty Research Honorary Professors Adjunct Instructors Postdocs Administrative Staff Lab Assistants Yao Class About Yao Class Admission Graduate Graduate Programs Graduate Admission CQI Introduction Faculty Research Overview CQI News Research Organization Research Groups Latest Research Research Report Campus Campus Events Student Life Join Us Faculty Recruitment Postdoctoral Recruitment Staff Recruitment Alumni IIIS Alumni Community Giving People Faculty Research Honorary Professors Adjunct Instructors Postdocs Administrative Staff Lab Assistants Yi Wu Reinforcement Learning for LLM & Large Reasoning Mode, Multi-Agent Reinforcement Learning, Human-Robot Interaction, Machine Learning System Research Direction: RL for LLM & Large Reasoning Model, Multi-Agent Reinforcement Learning, Large-Scale Reinforcement Learning, Human-Robot Interaction, Machine Learning System Homepage: https://jxwuyi.weebly.com/ ï¼You need a VPNï¼new homepage under constructionï¼ Google Scholar Page: https://scholar.google.com/citations?user=dusV5HMAAAAJ Office: Tsinghua Science Park Building C, Floor 19 Office Hour: FIT 1-202, Every Thursday, 1 pm to 2 pm (from Feb. 23, 2023 to Jun. 15, 2023 ). Teachingï¼ Deep Learning, Spring 2025 https://openpsi-project.github.io/DeepLearning2025/ Feel free to send me an email with any questions or even if you just want some free chats. :) Related information Email Office C1901-13, Tsinghua University, Beijing, China Google Scholar https://scholar.google.com/citations?user=dusV5HMAAAAJ RM 1-208, FIT Building, Tsinghua University, Haidian District, Beijing, 100084, P. R. China +86-010-62781693      FAX: +86-010-62781693-2000     EMAIL: iiis@mail.tsinghua.edu.cnCopyright@IIIS, Tsinghua University, All Rights Reserved. TOP",
  "content_length": 1980,
  "method": "requests",
  "crawl_time": "2025-12-01 14:51:06"
}