{
  "name": "Yi Zhou 0010",
  "homepage": "https://sites.google.com/view/zhouyi-joey/home",
  "status": "success",
  "content": "NAIL@HNUSearch this siteEmbedded FilesSkip to main contentSkip to navigationProf. Dr. Yi ZhouProfessor at School of AI & Robotics, Hunan University (HNU).Ph.D.  in Engieerning  and Computer Science (ANU)[CV] [GitHub] [LinkedIn] [Google Scholar]E-mail: eeyzhou(at)hnu(dot)edu(dot)cn长期招募博士后，专业方向为机器人视觉导航与感知（包括SLAM，Event-based Vision，自动驾驶，智能辅助驾驶技术 等）News2025/10/20 The workshop on Event-based Vision for Advanced State Estimation and Image Processing was a great success! The slides can be found at here, and the video recap can be found at here. 2025/8/29 The paper \"Stereo-DEVO\" has been accepted by IEEE RA-L. Kudos to Sheng and Junkai. After winning the M3ED SLAM challenge at CVPRW 2025, it now also leads the rankings for the EvSLAM challenge to be held at IROS 2025.2025/6/14 NAIL won the 1st place in SLAM Challenge at the CVPR Workshop on Event-based vision @Nashville. Kudos to Sheng Zhong and Junkai Niu!!!2025/6/12 The paper \"Event-based Visual-Inertial State Estimation for High-Speed Maneuvers\" has been accepted by IEEE T-RO! [Video]2025/4/17 EvTTC has been accepted by IEEE RA-L. [PDF][Project Page]2025/2/28 ESVO2 has been accepted by IEEE T-RO! [Code][PDF][Video]. 2024/10/18 ESVO2 has been released. [Code][PDF]2024/7/1 Three papers are accepted by ECCV 2024! Two led by NAIL, and one collaborated with Westlake University. Stay tuned!2024/5/14 The paper \"Event-based Visual Inertial Velometer\" has been accepted by RSS 2024. [Video][PDF][RSS Presentation]2024/1/26 The paper \"IMU-Aided Event-based Stereo Visual Odometry\" has been accepted by ICRA 2024. Big congrats to Junkai and Sheng for their first publication!2024/1/7 The paper \"Spatio-Temporal Calibration for Omni-Directional Vehicle-Mounted Event Cameras\" has been accepted by IEEE RA-L [arxiv preprint].2023/11/24 The first Autonomous Robot Technology Seminar (ARTS) was successfully held at HKUST (GZ Campus). I served as one of the chairs. Find details at here.2023/9/28 I create a short tutorial on Uniform B-Splines. You may find it at https://arxiv.org/pdf/2309.15477v1.pdf.2023/9/24 We will organize the 1st Autonomous Robotic Technology Seminar (ARTS) at HKUST (GZ) by 25-26 Nov. More details can be found at https://www.caa.org.cn/article/192/4089.html.2023/9/24 I serve as an Associate Editor for ICRA 2024 (Visual Perception and Learning)2023/9/1 I serve as an  Associate Editor for IEEE Robotics and Automation Letters (RA-L).2023/4/6 I gave a talk on \"Robotic Perception and Navigation Using Event-based Cameras\". The talk was invited respectively by Dr. Zetao Chen with Yongjiang Laboratory (Y-LAB). The slides can be found at here.2023/3/8 Two postdoc positions are available in my group. The candidate's expertise is required to be inline with my group's research. The programme will prove very competative salary (470 K RMB / yr). Please find more details at here. Contact me through my email. (Still active!!!)2023/2/1 Welcome Zhongyang on board.2023/1/29 I will serve IROS 2023 as an AE for the SLAM section.2022/7/16 I gave a talk on the development of event-based SLAM in the 3rd National SLAM forum. Please find the slides at here.2022/5/9 Welcome Delei and Jinghang on board.2022/2/22 Two Postdoc positions are available at my lab.2022/2/22 Two PhD scholarships are to be created for students commencing in 2023. Contact me if you feel interested.2022/2/1 I will serve IROS 2022 as an AE for two sections (Flying Robot and SLAM).2021/10/28 I join the School of Robotics at Hunan University as an Associate Professor.2021/10/23 Our paper \"Event-based Motion Segmentation with Spatio-Temporal Graph Cuts\" is accepted by  IEEE T-NNLS. See details at here!2021/6/30 The paper \"Event-based Motion Segmentation by Cascaded Two-Level Multi-Model Fitting\" is accepted by IROS 2021. 2021/6/04  I will give a tutorial on Event-based Visual Odometry at the 3rd Event-based Vision Workshop in CVPR 2021 [Workshop][Video][Slides].2021/2/23 ESVO is integrated into the modular iniVation DV software platform. Download here: https://lnkd.in/deuRKSK2021/2/16 Our paper \"Event-based Stereo Visual Odometry\" was accepted by IEEE T-RO 2021.2020/12/02 Gave a talk on \"Towards Event-based SLAM\" invited by Shenlan XueYuan (Total visits: 5000+).2020/09/08 We are happy to release ESVO -- the first open-source event-based visual odometry pipeline. More information can be found at here.Google SitesReport abusePage detailsPage updated Google SitesReport abuse",
  "content_length": 4436,
  "method": "requests",
  "crawl_time": "2025-12-01 14:51:14"
}