{
  "name": "Yichao Yan",
  "homepage": "https://daodaofr.github.io",
  "status": "success",
  "content": "Yichao Yan | 晏轶超 Yichao Yan Associate Professor, AI Institute, Shanghai Jiao Tong University Google Scholar Github Email: yanyichao(at)sjtu.edu.cn Office: 5-510, Software building, Shanghai Jiao Tong University. Facilities We have a light stage and a motion/volume capture device. We have abundant GPUs. Opening Positions We are looking for post-doc researchers, collaborating with Professor Xiaokang Yang! I am a co-chair of the SJTU [AIGC Class]. Looking for self-motivated undergraduate and graduate students to work with me in computer vision, AIGC, and 3D modeling. For prospective students, please send your resume and transcript to my email. Biography I am a tenure-track associate professor at Shanghai Jiao Tong University. I received my PhD degree from Shanghai Jiao Tong University in 2019, supervised by Professor Xiaokang Yang. I received M. E. from École Centrale de Lyon in France. I received B. E. from Shanghai Jiao Tong University in 2013. I was a research scientist at the Inception Institute of Artificial Intelligence (IIAI) from June 2019 to April 2021. I am interested in computer vision problems. Typically, I am working on (1) 3D representation (2) AIGC (3) Embodied AI. Updates 12/2024, “高精度三维建模关键技术及应用”获得中国图象图形学学会科技进步二等奖（排1）. 11/2025, Topo4D++ is accepted by TPAMI. 06/2025, Four papers on 3D body generation, garment generation, HOI, and large model training are accepted by ICCV 2025. 05/2025, One paper on 3D Gaussian is accepted by ICML 2025. 02/2025, Two papers on 3D face reconstruction are accepted by CVPR 2025. 01/2025, Two papers on 3D reconstruction and image editing are accepted by ICLR 2025. 12/2024, “关系驱动的视觉目标解析理论与方法”获得中国图象图形学学会自然科学二等奖（排2）. 11/2024, One paper on efficient 3D reconstruction is accepted by TVCG. 10/2023, 团队获得中国国际大学生创新大赛（2024）上海赛区 2 项金奖. 09/2024, One paper on inverse rendering is accepted by NeurIPS 2024. 07/2024, Three papers on avatar generation, face animation, and diffusion model are accepted by ACM Multimedia 2024. 07/2024, Two papers on 4D face reconstruction and human-object interaction are accepted by ECCV 2024. 02/2024, Four papers on human interaction generation, face reconstruction and editing are accepted by CVPR 2024. 02/2024, One paper on human action recognition is accepted by TPAMI. 11/2023, 团队获得第十八届“挑战杯”数字人专项赛特等奖. 09/2023, We organize a workshop “AI for Digital Human” on AAAI 2024. 09/2023, One paper on NeRF-based visual localization is accepted by NeurIPS 2023. 07/2023, One paper on human action generation is accepted by ICCV 2023. 06/2023, We win the championship of the 2023 Ego4D Challenge in the Episodic memory: PACO Zero-Shot track. 03/2023, Three papers on 3D digital human generation/reconstruction are accepted by CVPR 2023. Preprints Rethinking Clothes Changing Person ReID: Conflicts, Synthesis, and Optimization. Junjie Li, Guanshuo Wang, Fufu Yu, Yichao Yan, Qiong Jia, Shouhong Ding, Xingdong Sheng, Yunhui Liu, Xiaokang Yang arXiv Preprint, 2024. [paper] Publications Topo4D++: Realistic Physically Based 4D Head Capture with Topology-Preserving Gaussian Splatting and Expression Priors. Yuhao Cheng; Xuanchen Li; Xingyu Ren; Jianyu Wang; Haozhe Jia; Di Xu; Wenhan Zhu; Bingbing Ni; Yichao Yan IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI), 2025. [paper] [project] Skip-Vision: Efficient and Scalable Acceleration of Vision-Language Models via Adaptive Token Skipping. Weili Zeng, Ziyuan Huang, Kaixiang Ji, Yichao Yan International Conference on Computer Vision (ICCV), 2025. [paper] Disentangled Clothed Avatar Generation with Layered Representation. Weitian Zhang, Sijing Wu, Manwen Liao, Yichao Yan International Conference on Computer Vision (ICCV), 2025. [project] Multimodal Latent Diffusion Model for Complex Sewing Pattern Generation. Shengqi Liu, Yuhao Cheng, Zhuo Chen, Xingyu Ren, Wenhan Zhu, Lincheng Li, Mengxiao Bi, Xiaokang Yang, Yichao Yan International Conference on Computer Vision (ICCV), 2025. [project] Perceiving and Acting in First-Person: A Dataset and Benchmark for Egocentric Human-Object-Human Interactions Liang Xu, Chengqun Yang, Zili Lin, Fei Xu, Yifan Liu, Congsheng Xu, Yiyi Zhang, Jie Qin, Xingdong Sheng, Yunhui Liu, Xin Jin, Yichao Yan, Wenjun Zeng, Xiaokang Yang International Conference on Computer Vision (ICCV), 2025. Coming soon! Enhancing Visual Localization with Cross-Domain Image Generation. Yuanze Wang, Yichao Yan, Shiming Song, Songchang Jin, Yilan Huang, Xingdong Sheng, Dianxi Shi International Conference on Machine Learning(ICML), 2025 [paper] SingingHead: A Large-scale 4D Dataset for Singing Head Animation. Sijing Wu, Yunhao Li, Weitian Zhang, Jun Jia, Yucheng Zhu, Yichao Yan, Guangtao Zhai, Xiaokang Yang IEEE Transactions on Multimedia (TMM), 2025. [project] Towards High-fidelity 3D Talking Avatar with Personalized Dynamic Texture. Xuanchen Li, Jianyu Wang, Yuhao Cheng, Yikun Zeng, Xingyu Ren, Wenhan Zhu, Weiming Zhao, Yichao Yan. IEEE Conference on Computer Vision and Pattern Recognition (CVPR), 2025. [project] Revealing Directions for Text-guided 3D Face Editing. Zhuo Chen, Yichao Yan, Sehngqi Liu, Yuhao Cheng, Weiming Zhao, Lincheng Li, Mengxiao Bi, Xiaokang Yang IEEE Transactions on Multimedia (TMM), 2025. [paper] PostEdit: Posterior Sampling for Efficient Zero-Shot Image Editing. Feng Tian, Yixuan Li, Yichao Yan, Shanyan Guan, Yanhao Ge, Xiaokang Yang International Conference on Learning Representations (ICLR), 2025. [paper] AniSDF: Fused-Granularity Neural Surfaces with Anisotropic Encoding for High-Fidelity 3D Reconstruction. Jingnan Gao, Zhuo Chen, Yichao Yan, Xiaokang Yang International Conference on Learning Representations (ICLR), 2025. [project] GPS: Generalizable Person Search on Open-world User-generated Video Content. Junjie Li, Guanshuo Wang, Yichao Yan, Fufu Yu, Qiong Jia, Jie Qin, Shouhong Ding, Xiaokang Yang IEEE Transactions on Circuits and Systems for Video Technology (TCSVT), 2025. [paper] EvaSurf: Efficient View-Aware Implicit Textured Surface Reconstruction on Mobile Devices. Jingnan Gao, Zhuo Chen, Yichao Yan, Bowen Pan, Zhe Wang, Jiangjing Lyu, Xiaokang Yang IEEE Transactions on Visualization and Computer Graphics (TVCG), 2024 [project] Multi-times Monte Carlo Rendering for Inter-reflection Reconstruction. Tengjie Zhu, Zhuo Chen, Jingnan Gao, Yichao Yan, Xiaokang Yang Conference on Neural Information Processing Systems (NeurIPS), 2024. [project] IPAD: Industrial Process Anomaly Detection Dataset. Jinfan Liu, Yichao Yan, Junjie Li, Weiming Zhao, Pengzhi Chu, Xingdong Sheng, Yunhui Liu, Xiaokang Yang IEEE Transactions on Circuits and Systems for Video Technology (TCSVT), 2024. [project] E^3Gen: Efficient, Expressive and Editable Avatars Generation. Weitian Zhang, Yichao Yan, Yunhui Liu, Xingdong Sheng, Xiaokang Yang. ACM Multimedia, 2024. [project] Infusion: Preventing Customized Text-to-Image Diffusion from Overfitting. Weili Zeng, Yichao Yan, Qi Zhu, Zhuo Chen, Pengzhi Chu, Weiming Zhao, Xiaokang Yang. ACM Multimedia, 2024. [project] MMHead: Towards Fine-grained Multi-modal 3D Facial Animation. Sijing Wu, Yunhao Li, Yichao Yan, Huiyu Duan, Ziwei Liu, Guangtao Zhai. ACM Multimedia, 2024. [project] Topo4D: Topology-Preserving Gaussian Splatting for High-Fidelity 4D Head Capture. Xuanchen Li, Yuhao Cheng, Xingyu Ren, Haozhe Jia, Di Xu, Wenhan Zhu, Yichao Yan. European Conference on Computer Vision (ECCV), 2024. [project] HIMO: A New Benchmark for Full-Body Human Interacting with Multiple Objects. Xintao Lv, Liang Xu, Yichao Yan, Xin Jin, Congsheng Xu, Shuwen Wu, Yifan Liu, Lincheng Li, Mengxiao Bi, Wenjun Zeng, Xiaokang Yang. European Conference on Computer Vision (ECCV), 2024. [project] HyperStyle3D: Text-Guided 3D Portrait Stylization via Hypernetworks. Zhuo Chen, Xudong Xu, Yichao Yan, Ye Pan, Wenhan Zhu, Wayne Wu, Bo Dai, and Xiaokang Yang. IEEE Transactions on Circuits and Systems for Video Technology (TCSVT), 2024. [project] 3D-Aware Face Editing via Warping-Guided Latent Direction Learning. Yuhao Cheng, Zhuo Chen, Xingyu Ren, Wenhan Zhu, Zhengqin Xu, Di Xu, Changpeng Yang, Yichao Yan. IEEE Conference on Computer Vision and Pattern Recognition (CVPR), 2024. [project] Inter-X: Towards Versatile Human-Human Interaction Analysis. Liang Xu, Xintao Lv, Yichao Yan, Xin Jin, Shuwen Wu, Congsheng Xu, Yifan Liu, Yizhou Zhou, Fengyun Rao, Xingdong Sheng, Yunhui Liu, Wenjun Zeng, Xiaokang Yang. IEEE Conference on Computer Vision and Pattern Recognition (CVPR), 2024. [paper] [project] ReGenNet: Towards Human Action-Reaction Synthesis. Liang Xu, Yizhou Zhou, Yichao Yan, Xin Jin, Wenhan Zhu, Fengyun Rao, Xiaokang Yang, Wenjun Zeng. IEEE Conference on Computer Vision and Pattern Recognition (CVPR), 2024. [paper] [project] Monocular Identity-Conditioned Facial Reflectance Reconstruction. Xingyu Ren, Jiankang Deng, Yuhao Cheng, Jia Guo, Chao Ma, Yichao Yan, Wenhan Zhu, Xiaokang Yang. IEEE Conference on Computer Vision and Pattern Recognition (CVPR), 2024. [project] A Coding Framework and Benchmark towards Low-Bitrate Video Understanding. Yuan Tian, Guo Lu, Yichao Yan, Guangtao Zhai, Li Chen, Zhiyong Gao. IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI), 2024. [paper] Head3D: Complete 3D Head Generation via Tri-plane Feature Distillation. Yuhao Cheng, Yichao Yan, Wenhan Zhu, Ye Pan, Bowen Pan, Xiaokang Yang. ACM Transactions on Multimedia Computing, Communications, and Applications (TOMM), 2024. [paper] NeRF-IBVS: Visual Servo Based on NeRF for Visual Localization and Navigation. Yuanze Wang, Yichao Yan, Dianxi Shi, Wenhan Zhu, Jianqiang Xia, Jianqiang Xia, Tan Jeff, Songchang Jin, Ke Gao, Xiaobo Li, Xiaokang Yang. Conference on Neural Information Processing Systems (NeurIPS), 2023. [paper] ActFormer: A GAN-based Transformer towards General Action-Conditioned 3D Human Motion Generation. Liang Xu, Ziyang Song, Dongliang Wang, Jing Su, Zhicheng Fang, Chenjing Ding, Weihao Gan, Yichao Yan, Xin Jin, Xiaokang Yang, Wenjun Zeng, Wei Wu. International Conference on Computer Vision (",
  "content_length": 16102,
  "method": "requests",
  "crawl_time": "2025-12-01 14:51:19"
}