{
  "name": "Yifeng Li 0001",
  "homepage": "https://sites.google.com/view/yifengli",
  "status": "success",
  "content": "Yifeng LiSearch this siteEmbedded FilesSkip to main contentSkip to navigationYifeng Li's ProfileNotes:Well funded PhD student positions are usually available. Highly qualified and motivated candidates from Computer Science, Machine Learning, Data Science, Bioinformatics, Biological Sciences, or Biotechnology may email me their transcripts and CV.  Please excuse me for the reality that, due to overwhelming schedule, I can only reply to a small number of inquiries among many excellent ones. Everyone is welcome to apply for my supervision through the official application system.Well funded MSc student positions are also usually available each year. Highly qualified and motivated candidates from Computer Science, Machine Learning, Data Science, Bioinformatics, Biological Sciences, or Biotechnology may email me their transcripts and CV.  Please excuse me for the reality that, due to overwhelming schedule, I can only reply to a small number of inquiries among many excellent ones. Everyone is welcome to apply for my supervision through the official application system.Valuable research opportunities for undergraduate students at Brock may be available through COSC 3P99 or COSC 4F90, (as well as BIOL/BMED 4F90 or BIOL/BMED 4F91) . If you are really interested in my research areas, you may contact me. Yifeng LiAssociate ProfessorCanada Research Chair - Tier 2 Machine Learning for Biomedical Data SciencePI of the Brock Biomedical Data Science LabDepartment of Computer ScienceDepartment of Biological SciencesCentre for BiotechnologyBrock UniversityOffice Phone: (905) 688-5550 ext. 3557Official Home Page:  https://brocku.ca/mathematics-science/computer-science/faculty-staff/yifeng-li Brock Biomedical Data Science Lab: https://www.bmds-lab.com Email: yli2ATbrockuDOTcaWork Experiences:Canada Research Chair - Tier 2 Machine Learning for Biomedical Data Science, July 2022 - NowAssociate Professor, Department of Computer Science, Brock University, July 2024 - NowAssistant Professor, Department of Computer Science, Brock University, January, 2020 - June 2024Research Officer, Digital Technologies Research Centre, National Research Council Canada, August, 2015 - December, 2019Research Interests:Artificial Intelligence: In a long term, I am interested in artificial intelligence algorithms that are inspired by neuroscience and cognitive science. Particularly, computational modelling and realization of the five principles of cognition (perception-action cycle, memory, attention, intelligence and language) are my priorities. Machine Learning: I am very interested in the theoretical studies of the unification of neural networks and probabilistic graphical models, deep generative models, deep network learning, large-scale sparse matrix factorizations, sparse representations, disentangled representation learning, generalized and regularized linear models, kernel/nonlinear approaches, deep feature selection, as well as Bayesian learning and inference. I prefer to formulate and explain various machine learning models from a statistical perspective.Data Science: Theories and applications of big data analytics, structured & unstructured data modelling, and heterogeneous data integration for knowledge discovery and actionable decision making. Particularly interested in multi-view matrix factorizations, multi-modal deep learning models, data visualization, network science, knowledge representation, and knowledge learning from complex data.Bioinformatics: Design and apply machine learning and data mining models to bioinformatics (such as annotation of non-coding regions of the human genome, biomarker identification using next-generation/deep sequence data, systems biology, and high-dimensional biological data analysis). Chemoinformatics: Molecular representation, drug design & repurposing, RNA & protein structure prediction, and biomolecular interaction prediction.Health-informatics: Cancer research, personalized disease diagnosis & treatment, biomedical image processing, and intelligent & integrative health-informatics systems.Optimization: Fast numerical optimization methods for large-scale machine learning and data mining models. Multi-objective optimization problems in machine learning and design tasks.Computational Intelligence: Bio-inspired computation and quantum computing for machine learning.Robotics: Our research group also has team of student researching working on AI+Robotics projects. We have real programable humanoid robots (e.g., Booster K1).  Publications:Dissertation:[1] Yifeng Li, “Sparse machine learning models in bioinformatics,” PhD Dissertation, School of Computer Science, University of Windsor, 334 pages, Oct. 2013. (thesis available: http://scholar.uwindsor.ca/etd/5023/)Published Refereed Journal Papers:[34] Muhetaer Mukaidaisi, Madiha Ahmed, Karl Grantham, Aws Al-Jumaily, Shoukat Dedhar, Michael Organ, Alain Tchagang, Jinqiang Hou, Syed Ejaz Ahmed, Renata Dividino, and Yifeng Li, \"'Several birds with one stone': Exploring the potential of AI methods for multi-target drug design,\" Molecular Diversity, https://doi.org/10.1007/s11030-024-11042-0, 2024. [33] Nicholas Aksamit, Alain Tchagang, Yifeng Li, and Beatrice Ombuki-Berman,  \"Hybrid fragment-SMILES tokenization for ADMET prediction in drug discovery,\" BMC Bioinformatics, vol. 25, 255, 2024.[32] Nicholas Aksamit, Jinqiang Hou, Yifeng Li, and Beatrice Ombuki-Berman, \"Integrating Transformers and Many-objective optimization for drug design,\" BMC Bioinformatics, vol. 25, 208, 2024.[31] Gregory Foran, Ryan Douglas Hallam, Marvel Megaly, Anel Turgambayeva, Daniel Antfolk, Yifeng Li, Vincent C. Luca, and Aleksandar Necakov, \"Notch1 Phase Separation Coupled Percolation facilitates target gene expression and enhancer looping,\" Scientific Reports, vol. 14, article number 21912, 2024. [30] Cameron Andress, Kalli Kappel, Marcus Elbert Villena, Miroslava Cuperlovic-Culf, Hongbin Yan, and Yifeng Li, \"DAPTEV: Deep aptamer evolutionary modelling for COVID-19 drug design,\" PLoS Computational Biology, vol. 19, no. 7, e1010774, 2023.[29] Aws Al-Jumaily, Muhetaer Mukaidaisi, Andrew Vu, Alain Tchagang, and Yifeng Li, \"Examining multi-objective deep reinforcement learning frameworks for molecular design,\" Biosystems, vol. 232, 104989, 2023.[28] Hayley-Ann Bennett, Yifeng Li, Hongbin Yan, “Conformational flexibility and structural dynamics of aptamer - A mini review,” Aptamers, vol. 7m 1-6, 2023.[27] Hayley-Ann Bennett, Yifeng Li, and Hongbin Yan, \"Thermal treatment affects aptamers' structural profiles,\" Bioorganic & Medicinal Chemistry Letters, vol. 82, no. 15, 129150, 2023.[26] Wenjie Liu, Austin M. Hopkins, Peizhi Yan, Shan Du, Leonard G. Luyt, Yifeng Li, and Jinqiang Hou, \"Can machine learning 'transform' peptides/peptidomimetics into small molecules? A case study with ghrelin receptorligands,\" Molecular Diversity, vol. 27, 2239-2255, 2023.[25] Youlian Pan, Yifeng Li, Ziying Liu, Jitao Zou, and Qiang Li, \"Computational genomics insights into cold acclimation in wheat,\" Frontiers in Genetics, vol 13, 1015673, 2022. [24] Muhetaer Mukaidaisi, Andrew Vu, Karl Grantham, Alain Tchagang, and Yifeng Li, \"Multi-objective drug design based on graph-fragment molecular representation and deep evolutionary learning,\" Frontier in Pharmacology, vol 13, Article 920747, 2022.[23] Sheriff Abouchekeir, Andrew Vu, Muhetaer Mukaidaisi, Karl Grantham, Alain Tchagang, and Yifeng Li, \"Adversarial deep evolutionary learning for drug design,\" BioSystems, vol. 222, 104790, 2022.[22] Karl Grantham, Muhetaer Mukaidaisi, Hsu Kiang Ooi, Mohammad Sajjad Ghaemi, Alain Tchagang, and Yifeng Li, \"Deep evolutionary learning for molecular design,\"  IEEE Computational Intelligence Magazine, vol. 17, no. 2, pp. 14-28, May 2022.[21] Wenpeng Lu, Pengyu Zhao, Yifeng Li, Shoujin Wang, Heyan Huang, Shumin Shi, Hao Wu, “Chinese sentence semantic matching based on multi-level relevance extraction and aggregation for intelligent human-robot interaction,” Applied Soft Computing, vol. 131, 109795, 2022.[20] Qiang Li, Wenyun Shen, Ioannis Mavraganis, Liping Wang, Peng Gao, Jie Gao, Dustin Cram, Yifeng Li, Ziying Liu, Brian Fowler, Youlian Pan, Jitao Zou. Elucidating the biochemical basis of trans-16:1 fatty acid change in leaves during cold acclimation in wheat. Plant-Environment Interactions, vol. 2, no. 3, 101-111, 2021. [19] Danny Salem, Yifeng Li, Pengcheng Xi, Miroslava Cuperlovic-Culf, Hilary Phenix, and Mads Kaern, \"YeastNet: Deep learning enabled accurate segmentation of budding yeast cells in bright-field microscopy,\" Applied Sciences, vol. 11, no. 6, 2692, 2021.[18] Lipu Wang, Qiang Li, Ziying Liu, Anu Surendra, Youlian Pan, Yifeng Li, L. Irina Zaharia, Therese Ouellet,  and Pierre R. Fobert, \"Integrated transcriptome and hormone profiling highlight the role of multiple phytohormone pathways in wheat resistance against fusarium head blight,\" PLOS ONE, vol. 13, no. 11, e0207036, 2018. [17] Genevieve L. Stein-O'Brien, Raman Arora, Aedin C. Culhane, Alexander V. Favorov, Lana X. Gamire, Casey S. Greene, Loyal A. Goff, Yifeng Li, Alioune Ngom, Michael F. Ochs, Yanxun Xu and Elana J. Fertig, \"Enter the matrix: factorization uncovers knowledge from omics,\" Trends in Genetics, vol. 34, no. 10,  790-805,  2018.[16] Yifeng Li, Youlian Pan, and Ziying Liu, \"Multi-class non-negative matrix factorization for comprehensive feature pattern discovery,\" IEEE Transactions on Neural Networks and Learning Systems, vol. 30, no. 2, 615-629, 2019.[15] Yifeng Li, Wenqiang Shi, and Wyeth W. Wasserman, \"Genome-wide prediction of cis-regulatory regions using supervised deep learning methods,\" BMC Bioinformatics, no. 19, 202, 2018.[14] Yifeng Li, François Fauteux, Jinfeng Zou, André Nantel and Youlian Pan, \"Personalized prediction of genes with tumor-causing somatic mutations based on multi-modal deep Boltzmann machine,\" Neurocomputing, vol. 324, 51-62, 2018.[13] Yifeng Li, Fangxiang Wu, and Alioune Ngom, “A review on machine learning principles for m",
  "content_length": 30668,
  "method": "requests",
  "crawl_time": "2025-12-01 14:51:21"
}