{
  "name": "Yijie Mao",
  "homepage": "http://faculty.sist.shanghaitech.edu.cn/faculty/maoyj",
  "status": "success",
  "content": "Home About Me Publications Research Lab Activities Teaching Yijie (Lina) Mao Yijie (Lina) Mao Assistant Professor Network Intelligence Center (NICE) School of Information Science and Technology (SIST) ShanghaiTech University Address: Room 302I, SIST Building 2 393 Middle Huaxia Road, Pudong District Shanghai 201210, China Email: maoyj@shanghaitech.edu.cn TEL: +86-21-20684454 I am an Assistant Professor in the Network Intelligence Center (NICE), School of Information Science and Technology (SIST) at the ShanghaiTech University. Previously, I was a post-doctoral research fellow in The University of Hong Kong and Communications and Signal Processing Group at Imperial College London, under the guidance of Prof. Bruno Clerckx (IEEE Fellow). I obtained my Ph.D. in Electrical and Electronic Engineering from The University of Hong Kong, under the supervision of Prof. Victor O.K. Li (IEEE Life Fellow). Research Interests Wireless Communications Artificial Intelligence-empowered Wireless Networks Optimization Theory News 2024 [December 2024] Our work entitled \"Robust max-min fair beamforming design for rate splitting multiple access-aided visible light communications,\" has been accepted for publication in IEEE Internet of Things Journal. [November 2024] Our work entitled \"Simultaneously transmitting and reflecting reconfigurable intelligent surfaces empowered cooperative rate splitting with user relaying,\" has been accepted for publication in Entropy. [November 2024] Our work entitled \"Interference management in space-air-ground integrated networks with fully distributed rate-splitting multiple access,\" has been accepted for publication in IEEE Transactions on Wireless Communications. [August 2024] Congradulations to my Master student Miss Kexin Chen for receiving the IEEE SPS travel grant to attend IEEE SPAWC 2024. [July 2024] Our paper \"A primer on rate-splitting multiple access: Tutorial, myths, and frequently asked questions,\" published in IEEE Journal on Selected Areas in Communications 2023 has been recognized as the (ESI Highly Cited Paper)! [July 2024] Our work entitled \"Rate splitting multiple access: Optimal beamforming structure and efficient optimization algorithms,\" has been accepted for publication in IEEE Transactions on Wireless Communications. [June 2024] Our work entitled \"RS-BNN: A deep learning framework for the optimal beamforming design of rate-splitting multiple access,\" has been accepted for publication in IEEE Transactions on Vehicular Technology. [June 2024] Our work entitled \"Transmitter side beyond-diagonal RIS for mmWave integrated sensing and communications,\" has been accepted by IEEE SPAWC 2024. [May 2024] Our work entitled \"Multiple access techniques for intelligent and multi-functional 6G: Tutorial, survey, and outlook,\" has been accepted for publication in Proceedings of IEEE. [May 2024] Our work entitled \"Weighted sum-rate maximization of rate-splitting multiple access with confidential messages,\" has been accepted for publication in IEEE Transactions on Wireless Communications. [May 2024] Our work entitled \"Rate-splitting multiple access in cell-free massive MIMO-URLLC systems: Achievable rate analysis and optimization,\" has been accepted for publication in IEEE Transactions on Wireless Communications. [May 2024] Our work entitled \"Transformer-based channel prediction for rate-splitting multiple access-enabled vehicle-to-everything communication,\" has been accepted for publication in IEEE Transactions on Wireless Communications. [May 2024] Our work entitled \"Distributed rate-splitting multiple access for multilayer satellite communications,\" has been accepted for publication in IEEE Transactions on Communications. [April 2024] Our work entitled \"Rate-splitting multiple access for covert communications,\" has been accepted for publication in IEEE Wireless Communications Letters. [March 2024] Our work entitled \"Rate-splitting multiple access for simultaneous multi-user communication and multi-target sensing,\" has been accepted for publication in IEEE Transactions on Vehicular Technology. [March 2024] Our work entitled \"Distributed multi-objective dynamic offloading scheduling for air-ground cooperative MEC,\" has been accepted for publication in IEEE Transactions on Vehicular Technology. [March 2024] One paper is accepted by IEEE ICC 2024 Workshop on RSMA for 6G. [February 2024] I am honored to be included in the \"100 Brilliant and Inspiring Women in 6G\" list for 2024 by the Women in 6G community. [February 2024] I am invited by IEEE ComSoc RCC Special Interest Group (SIG) on beyond diagonal reconfigurable intelligent surface (BD-RIS) to deliver an online talk on BD-RIS on February 07, 2024. [January 2024] Our work entitled \"Securing medical sensor data: A novel uplink scheme with rate splitting and active intelligent reflecting surface,\" has been accepted for publication in IEEE Communications Letters. [January 2024] One paper is accepted by IEEE ICC 2024, and one paper is accepted by IEEE WCNC 2024. 2023 [December 2023] Our paper \"Rate-splitting multiple access for downlink communication systems: bridging, generalizing, and outperforming SDMA and NOMA,\" published in EURASIP Journal on Wireless Communications and Networking 2018 has been recognized as the ESI Highly Cited Paper! [December 2023] Our work entitled \"Optimal beamforming structure for rate splitting multiple access,\" has been accepted for publication in IEEE International Conference on Acoustics, Speech and Signal Processing 2024. [December 2023] I received recognition as an Exemplary Reviewer for IEEE Communications Letters 2023. [December 2023] Our paper entitled \"Hierarchical federated edge learning over space-air-ground integrated networks,\" has received the Best Paper Award of IEEE Globecom 2023 in Edge Learning over 5G Mobile Networks and Beyond Workshop. Congradulations! [November 2023] I am invited by Prof. Xudong Wang to give talk on Rate Splitting in UM-SJTU Joint Institute, Shanghai Jiao Tong University on November 21, 2023. [November 2023] Our work entitled \"A low-complexity beamforming design for beyond-diagonal RIS aided multi-user networks,\" has been accepted for publication in IEEE Communications Letters. [November 2023] Our work entitled \"A practical max-min fair resource allocation algorithm for rate-splitting multiple access,\" has been accepted for publication in IEEE Communications Letters. [November 2023] Our work entitled \"Transmitter side beyond-diagonal reconfigurable intelligent surface for massive MIMO networks,\" has been accepted for publication in IEEE Wireless Communications Letters. [October 2023] I am recognized as the “World’s Top 2% Scientists 2023”, based on the Elsevier Data Repository prepared by Prof. John P.A. Loannidis and his team at Stanford University. [October 2023] Our work entitled \"Artificial noise assisted secure transmission for uplink MIMO rate splitting healthcare systems,\" has been accepted for publication in IEEE Communications Letters. [September 2023] Our paper entitled \"Green Federated Learning over Cloud-RAN with Limited Fronthaul and Quantized Neural Networks\" has received the Best Paper Award of IEEE MeditCom 2023! Congradulations! [September 2023] Our paper \"Rate-splitting multiple access: Fundamentals, survey, and future research trends,\" published in IEEE Communications Surveys & Tutorials 2022 has been recognized as the ESI Hot Paper and ESI Highly Cited Paper! [September 2023] I am invited by Prof. Yifei Yuan to give an online talk on Rate Splitting to China Mobile. Time: 8:00 pm -9:00 pm, September 20, 2023. Welcome to join! [September 2023] I am organizing a workshop on \"Rate-Splitting Multiple Access for 6G\" in IEEE International Conference on Communications (ICC) 2024 together with Prof. Daniel Benevides da Costa, Prof. Bruno Clerckx, Prof. Zhaohui Yang. Paper Submission Deadline: 20 January 2022. Welcome to submit your paper! [September 2023] I am serving as the lead editor for the special issue on \"Rate-Splitting Multiple Access for Future Green Communication Networks\". in IEEE Transactions on Green Communications and Networking. Paper Submission Deadline: January 01, 2024. Looking forward to receiving your submission to this SI! [September 2023] One paper is accepted by IEEE VTC-Fall 2023, and one paper is accepted by IEEE Globecom 2023. [September 2023] Our work entitled \"Green federated learning over Cloud-RAN with limited fronthual capacity and quantized neural networks,\" has been accepted for publication in IEEE Transactions on Wireless Communications. [July 2023] I will deliver a tutorial on \"Rate-Splitting Multiple Access for 6G: Recent Advances and Future Research Trends\" in IEEE Globecom 2023, Kuala Lumpur, Malaysia (together with Prof. Daniel Benevides da Costa, Prof. Zhaohui Yang, and Prof. Bruno Clerckx). [June 2023] Our work entitled \"Vertical federated learning over Cloud-RAN: Convergence analysis and system optimization,\" has been accepted for publication in IEEE Transactions on Wireless Communications. [May 2023] I am invited as one of the founding members for IEEE ComSoc RCC Special Interest Group (SIG) on \"Beyond Diagonal Reconfigurable Intelligent Surface (BD-RIS),\". [April 2023] Our work entitled \"Reconfigurable intelligent surfaces empowered green wireless networks with user admission control,\" has been accepted for publication in IEEE Transactions on Communications. [April 2023] I am serving as an Associate Editor for IEEE Communications Surveys and Tutorials since April 2023. [April 2023] I am co-chairing International Conference on Wireless Communications and Signal Processing (WCSP) 2023 \"Integrated Sensing, Communication and Computing Symposium\" together with Prof. Chau Yuen, Prof. Husheng Li, Prof. Haixia Zhang, and Prof. Xiaoming Che. Paper Submission Deadline: 30 June 2023. Welcome to submit your paper! [March 2023] One paper is accepted by IEEE ICC Workshop 2023. [February 2023] I am going to organize a special session on",
  "content_length": 17156,
  "method": "requests",
  "crawl_time": "2025-12-01 14:51:22"
}