{
  "name": "Yijun Wang 0002",
  "homepage": "http://csee.hnu.edu.cn/people/wangyijun",
  "status": "success",
  "content": "王怡君-湖大信息科学与工程学院 教师登录 English 返回首页 学院概况 学院简介 学院领导 师资力量 机构设置 决策机构 教学单位 计算机科学系 软件工程系 通信工程系 信息工程系 计算机工程系 网络空间安全系 实验中心 基础教学部 研究机构 特色学院 条件装备 办事机构 人才培养 本科培养 研究生培养 博士生培养 留学生培养 学科专业方向 科学研究 科研项目 科研成果 成果转化 学术信息 工作流程 招生就业 本科招生 硕士招生 博士招生 学生就业 实习就业基地 学生工作 学生动态 学生党建 团学工作 日常管理 心理健康 奖励工作 社团组织 党群工作 党建工作 工会工作 关工委工作 学术资源 资源管理系统 精品课程 实验仪器设备 王怡君 我的位置在： 首页 > 学院概况 > 师资力量 > 王怡君 教师介绍 王怡君，博士，助理教授。2014年本科毕业于中国科学技术大学，2019年博士毕业于中国科学技术大学大数据分析与应用安徽省重点实验室。2016-2017年于微软亚洲研究院进行研究实习。2021年12月加入湖南大学信息科学与工程学院。主要研究方向为数据挖掘、自然语言处理、神经机器翻译等，已在国际顶级学术期刊与重要学术会议发表论文10余篇，担任KDD、AAAI、CIKM等会议以及TKDE、TNNLS等期刊的审稿人。 中文名： 王怡君 英文名： 学历： 博士 职称： 助理教授 联系电话： 电子邮件： wyjun@hnu.edu.cn 研究方向： 自然语言处理，神经机器翻译，数据挖掘 联系地址： 湖南省长沙市岳麓区麓山南路2号，湖南大学信息科学与工程学院 所属机构： 计算机工程系 学院教师 个人简历 工作经历2021.12至今     湖南大学 信息科学与工程学院 助理教授2019.12-2021.12    华为技术有限公司 高级工程师2016.10-2017.9     微软亚洲研究院 研究实习生教育经历2016.9-2019.12 中国科学技术大学 计算机科学与技术学院  博士2014.9-2016.8 中国科学技术大学 计算机科学与技术学院  硕士2010.9-2014.6 中国科学技术大学 计算机科学与技术学院 本科 学术论文 1. Jianxin Lin, Lianying Yin, Yijun Wang*. Steformer: Efficient Stereo Image Super-Resolution with Transformer. (IEEE TMM 2023) (中科院一区，CCF-B)2. Yijun Wang, Tao Liang, Jianxin Lin, CACOLIT: Cross-domain Adaptive Co-learning for Imbalanced Image-to-Image Translation, Proceedings of the 30th ACM International Conference on Multimedia (MM'2022, Top Rated Paper)3. Yijun Wang, Yingce Xia, Li Zhao, Jiang Bian, Tao Qin, Enhong Chen, Tie-Yan Liu,Semi-supervised Neural Machine Translation via Dual Transfer Learning, IEEE-ACM Transactions on Audio, Speech, and Language Processing (IEEE-ACM TASLP), 2019.4. Yijun Bian, Yijun Wang, Yaqiang Yao, Huanhuan Chen, Ensemble Pruning based on Objection Maximization with a General Distributed Framework, IEEE Transactions on Neural Networks and Learning Systems (IEEE TNNLS), 2019.5. Yijun Wang, Tianxin Wei, Qi Liu, Enhong Chen, Unpaired Multimodal Neural Machine Translation via Reinforcement Learning, In Proceedings of the 26th International Conference on Database Systems for Advanced Applications (DASFAA'2021).6. Yijun Wang, Yingce Xia, Li Zhao, Jiang Bian, Tao Qin, Guiquan Liu, Tie-Yan Liu, Dual Transfer Learning for Neural Machine Translation with Marginal Distribution Regularization, The 32nd AAAI Conference on Artificial Intelligence (AAAI'2018).7. Yijun Wang, Le Wu, Zongda Wu, Enhong Chen, Qi Liu, Selecting Valuable Customers for Merchants in E-commerce Platforms, The 16th IEEE International Conference on Data Mining (ICDM'2016).8. Zhi li, Zhefeng Wang, Zhicheng Wei, Xiangguang Zhou, Yijun Wang, Baoxing Huai, Qi liu, Nicholas Jing Yuan, Renbin Gong, Enhong Chen. Cross-Oilfield Reservoir Classification via Multi-Scale Sensor Knowledge Transfer. The 35th AAAI Conference on Artificial Intelligence (AAAI'2021).9. Shulan Ruan, Kun Zhang, Yijun Wang, Hanqing Tao, Weidong He, Guangyi Lv, Enhong Chen*, Context-Awar Generation-Based Net For Multi-Label Visual Emotion Recognition. (ICME'2020)10. Liyi Chen, Zhi Li, Yijun Wang, Tong Xu, Zhefeng Wang, Enhong Chen, MMEA: Entity Alignment for Multi-Modal Knowledge Graphs, In Proceedings of the 13th International Conference on Knowledge Science, Engineering and Management (KSEM'2020). (Best Paper Award)11. Jianxin Lin, Yijun Wang, Tianyu He, Zhibo Chen. Learning to Transfer: Unsupervised Domain Translation via Meta-Learning. The 34th AAAI Conference on Artificial Intelligence (AAAI'2020).12. Jianxin Lin*, Yingce Xia*, Yijun Wang, Tao Qin, Zhibo Chen. Image-to-Image Translation with Multi-Path Consistency Regularization. The 28th International Joint Conference on Artificial Intelligence (IJCAI'2019).13. Yanan Wang, Qi Liu, Chuan Qin, Tong Xu, Yijun Wang, Enhong Chen*, and Hui Xiong*, Exploiting Topic-based Adversarial Neural Network for Cross-domain Keyphrase Extraction, The 18th International Conference on Data Mining (ICDM'2018).14. Xunpeng Huang, Le Wu, Enhong Chen, Hengshu Zhu, Qi Liu, Yijun Wang, Incremental Matrix Factorization: A Linear Feature Transformation Perspective, The 26th International Joint Conference on Artificial Intelligence (IJCAI'2017).15. Xianyu Zeng, Qi Liu, Hongke Zhao, Tong Xu, Yijun Wang, Enhong Chen, Online Consumption Prediction via Modeling User Behaviors and Choices, In Journal of Computer Research and Development (in Chinese), 2016, 53(8):1673-1683. 湖大官网 湖大微信 湖大微博 版权所有©湖南大学2017          湖南大学党委宣传部          地址：湖南省长沙市岳麓区麓山南路麓山门          邮编：410082          Email：xiaoban@hnu.edu.cn          域名备案信息：[www.hnu.edu.cn,www.hnu.cn/湘ICP备05000239号]          [hnu.cn 湘教QS3-200503-000481 hnu.edu.cn 湘教QS4-201312-010059]",
  "content_length": 4498,
  "method": "requests",
  "crawl_time": "2025-12-01 14:51:23"
}