{
  "name": "Yile Wang 0001",
  "homepage": "https://ylwangy.github.io",
  "status": "success",
  "content": "Yile Wang (王祎乐) Assistant Professor College of Computer Science and Software Engineering, Shenzhen University Email: wangyile AT szu.edu.cn Address: L6-711, Zhizhen Building, Canghai Campus of Shenzhen University, Nanshan District, Shenzhen (深圳市南山区深圳大学沧海校区致真楼L6-711) Yile Wang is currently an assistant professor at the College of Computer Science and Software Engineering, Shenzhen University. Previously, he was a postdoc at the Institute for AI Industry Research (AIR), Tsinghua University, advised by Prof. Yang Liu. He received his Ph.D. degree in Computer Science from Zhejiang University, advised by Prof. Yue Zhang. Before that, he received his B.S./M.S. degree from Zhejiang University and also worked at Huawei Technologies Co., Ltd. His research interests include artificial intelligence, natural language processing, and large language models. Publications (*equal contribution, #corresponding author) AttriLens-Mol: Attribute Guided Reinforcement Learning for Molecular Property Prediction with Large Language Models. [arxiv] [bib] Xuan Lin, Long Chen, Yile Wang#. arxiv preprint, 2025 MUCAR: Benchmarking Multilingual Cross-Modal Ambiguity Resolution for Multimodal Large Language Models. [pdf] [bib] Xiaolong Wang, Zhaolu Kang, Wangyuxuan Zhai, Xinyue Lou, Yunghwei Lai, Ziyue Wang, Yawen Wang, Kaiyu Huang, Yile Wang#, Peng Li#, Yang Liu. In Proceedings of the 2025 Conference on Empirical Methods in Natural Language Processing (EMNLP), 2025 Improving Abstract Reasoning Ability of Large Language Models through Mixture Program-based Data Synthesis. [pdf] Yile Wang, Hui Huang. To Appear in Proceedings of the 24th Chinese National Conference on Computational Linguistics (CCL), 2025 LDIR: Low-Dimensional Dense and Interpretable Text Embeddings with Relative Representations. [pdf] [bib] Yile Wang, Zhanyu Shen, Hui Huang. In Findings of the 63rd Annual Meeting of the Association for Computational Linguistics (ACL Findings), 2025 Ranked Voting based Self-Consistency of Large Language Models. [pdf] [bib] Weiqin Wang, Yile Wang#, Hui Huang. In Findings of the 63rd Annual Meeting of the Association for Computational Linguistics (ACL Findings), 2025 Perspective Transition of Large Language Models for Solving Subjective Tasks. [pdf] [bib] Xiaolong Wang, Yuanchi Zhang, Ziyue Wang, Yuzhuang Xu, Fuwen Luo, Yile Wang#, Peng Li#, Yang Liu. In Findings of the 63rd Annual Meeting of the Association for Computational Linguistics (ACL Findings), 2025 Pre-Training a Graph Recurrent Network for Text Understanding. [pdf] [bib] Yile Wang, Linyi Yang, Zhiyang Teng, Ming Zhou, Yue Zhang. IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI), vol. 47, pp. 4061-4074, 2025 Leveraging Language-based Representations for Better Solving Symbol-related Problems with Large Language Models. [pdf] [bib] Yile Wang, Sijie Cheng, Zixin Sun, Peng Li, Yang Liu. In Proceedings of the 31st International Conference on Computational Linguistics (COLING), 2025 Property Enhanced Instruction Tuning for Multi-task Molecule Generation with Large Language Models. [arxiv] [bib] Xuan Lin, Long Chen, Yile Wang#, Xiangxiang Zeng, Philip S. Yu. arxiv preprint, 2024 Reasoning in Conversation: Solving Subjective Tasks through Dialogue Simulation for Large Language Models. [pdf] [bib] Xiaolong Wang*, Yile Wang*, Yuanchi Zhang, Fuwen Luo, Peng Li, Maosong Sun, Yang Liu. In Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (ACL), 2024 Enhancing Multilingual Capabilities of Large Language Models through Self-Distillation from Resource-Rich Languages. [pdf] [bib] Yuanchi Zhang, Yile Wang, Zijun Liu, Shuo Wang, Xiaolong Wang, Peng Li, Maosong Sun, Yang Liu. In Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (ACL), 2024 DEEM: Dynamic Experienced Expert Modeling for Stance Detection. [pdf] [bib] Xiaolong Wang*, Yile Wang*, Sijie Cheng, Peng Li, Yang Liu. In Proceedings of the 2024 Joint International Conference on Computational Linguistics, Language Resources and Evaluation (LREC-COLING Oral Presentation), 2024 Speak It Out: Solving Symbol-Related Problems with Symbol-to-Language Conversion for Language Models. [pdf] [bib] Yile Wang, Sijie Cheng, Zixin Sun, Peng Li, Yang Liu. In ICLR AGI Workshop: How Far Are We From AGI (ICLR AGI Workshop), 2024 Towards Unified Alignment Between Agents, Humans, and Environment. [pdf] [bib] Zonghan Yang, An Liu, Zijun Liu, Kaiming Liu, Fangzhou Xiong, Yile Wang, Zeyuan Yang, Qingyuan Hu, Xinrui Chen, Zhenhe Zhang, Fuwen Luo, Zhicheng Guo, Peng Li, Yang Liu. In Proceedings of the 41st International Conference on Machine Learning (ICML), 2024 Gradual Syntactic Label Replacement for Language Model Pre-Training. [pdf] [bib] Yile Wang, Yue Zhang, Peng Li, Yang Liu. IEEE/ACM Transactions on Audio, Speech, and Language Processing (TASLP), vol. 32, pp. 486-496, 2024 Lost in Context? On the Sense-wise Variance of Contextualized Word Embeddings. [pdf] [bib] Yile Wang, Yue Zhang. IEEE/ACM Transactions on Audio, Speech, and Language Processing (TASLP), vol. 32, pp. 639-650, 2024 Personal LLM Agents: Insights and Survey about the Capability, Efficiency and Security. [arxiv] [bib] Yuanchun Li, Hao Wen, Weijun Wang, Xiangyu Li, Yizhen Yuan, Guohong Liu, Jiacheng Liu, Wenxing Xu, Xiang Wang, Yi Sun, Rui Kong, Yile Wang, Hanfei Geng, Jian Luan, Xuefeng Jin, Zilong Ye, Guanjing Xiong, Fan Zhang, Xiang Li, Mengwei Xu, Zhijun Li, Peng Li, Yang Liu, Ya-Qin Zhang, Yunxin Liu arxiv preprint, 2024 Self-Knowledge Guided Retrieval Augmentation for Large Language Models. [pdf] [bib] Yile Wang, Peng Li, Maosong Sun, Yang Liu. In Findings of the 2023 Conference on Empirical Methods in Natural Language Processing (EMNLP Findings), 2023 YATO: Yet Another deep learning based Text analysis Open toolkit. [pdf] [bib] Zeqiang Wang*, Yile Wang*, Jiageng Wu, Zhiyang Teng, Jie Yang. In Proceedings of the 2023 Conference on Empirical Methods in Natural Language Processing: System Demonstrations (EMNLP System Demonstrations), 2023 CVT-SLR: Contrastive Visual-Textual Transformation for Sign Language Recognition with Variational Alignment. [pdf] [bib] Jiangbin Zheng, Yile Wang, Cheng Tan, Siyuan Li, Ge Wang, Jun Xia, Yidong Chen, Stan Z. Li. In Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR Highlight), 2023 Prompt-Guided Retrieval Augmentation for Non-Knowledge-Intensive Tasks. [pdf] [bib] Zhicheng Guo, Sijie Cheng, Yile Wang, Peng Li, Yang Liu. In Findings of the 61th Annual Meeting of the Association for Computational Linguistics (ACL Findings), 2023 Pre-Training a Graph Recurrent Network for Language Representation. [pdf] [video] [bib] Yile Wang, Linyi Yang, Zhiyang Teng, Ming Zhou, Yue Zhang. In the second version of the Efficient Natural Language and Speech Processing workshop (NeurIPS ENLSP Workshop), 2022 Using Context-to-Vector with Graph Retrofitting to Improve Word Embeddings. [pdf] [bib] Jiangbin Zheng*, Yile Wang*, Ge Wang, Jun Xia, Yufei Huang, Guojiang Zhao, Yue Zhang, Stan Z. Li. In Proceedings of the 60th Annual Meeting of the Association for Computational Linguistics (ACL), 2022 Can Offline Reinforcement Learning Help Natural Language Understanding? [arxiv] [bib] Ziqi Zhang*, Yile Wang*, Yue Zhang, Donglin Wang. arxiv preprint, 2022 Improving Skip-Gram Embeddings Using BERT. [pdf] [bib] Yile Wang, Leyang Cui, Yue Zhang. IEEE/ACM Transactions on Audio, Speech, and Language Processing (TASLP), vol. 29, pp. 1318-1328, 2021 Does Chinese BERT Encode Word Structure? [pdf] [bib] Yile Wang, Leyang Cui, Yue Zhang. In Proceedings of the 28th International Conference on Computational Linguistics (COLING Oral Presentation), 2020 LogiQA: A Challenge Dataset for Machine Reading Comprehension with Logical Reasoning. [pdf] [bib] Jian Liu, Leyang Cui, Hanmeng Liu, Dandan Huang, Yile Wang, Yue Zhang. In Proceedings of the Twenty-Ninth International Joint Conference on Artificial Intelligence (IJCAI), 2020 Lattice LSTM for Chinese Sentence Representation. [pdf] [bib] Yue Zhang*, Yile Wang*, Jie Yang*. IEEE/ACM Transactions on Audio, Speech, and Language Processing (TASLP), vol. 28, pp. 1506-1519, 2020 Deep reconstruction model for dynamic PET images. [pdf] [bib] Jianan Cui, Xin Liu, Yile Wang, Huafeng Liu. PloS one, 2017 Teaching Algorithm Design and Analysis. Second Semester, 2024-2025. Postgraduate Course. Principle of Compiler. Second Semester, 2024-2025. Undergraduate Course. Data Ming. Second Semester, 2024-2025. Undergraduate Course. Professional Services Chinese Information Processing Society of China, Youth Working Committee Area Chair: ACL Rolling Review (Feb./May./Oct. 2025), EMNLP (2022) Program Committee & Reviewer: ACL Rolling Review (2021~2025), EMNLP (2023, 2024), COLING (2022, 2024, 2025), ICML (2025), AAAI (2023, 2024, 2025, 2026) Grants National Natural Science Foundation of China Youth Program: Retrieval-augmented Methods based on Continuous Knowledge Base. Grant No. 62306161, 2024.01-2025.12. ( last updated on 10/11/2025 )",
  "content_length": 9064,
  "method": "requests",
  "crawl_time": "2025-12-01 14:51:24"
}