{
  "name": "Yili Ren",
  "homepage": "https://yiliren.github.io",
  "status": "success",
  "content": "About - Yili Ren Yili RenAssistant Professor, University of South Florida Follow Tampa, FL Email LinkedIn Google ScholarI am a tenure-track Assistant Professor in the Bellini College of Artificial Intelligence, Cybersecurity and Computing at the University of South Florida (USF).I received my Ph.D. degree from the Department of Computer Science at Florida State University (FSU), supervised by Prof. Jie Yang. Prior to joining FSU, I received M.S. from the School of Electronics and Information Engineering at Beihang University.Email: yiliren[at]usf.eduOpenings I am looking for self-motivated Ph.D. students to join my group. Candidates with research experiences in wireless sensing, network/mobile systems, signal processing, machine learning, and cybersecurity will be given favorable consideration. If you are interested, please feel free to send me an email with your CV, transcripts, TOEFL scores, and any other relevant materials that you believe would support your application. Research InterestsAI/LLM + Mobile Computing and SensingWireless SensingMobile HealthcareHuman-Computer Interaction ApplicationsSmart Home and Internet of Things (IoT) ApplicationsSmart Home and Internet of Things (IoT) Security and PrivacyMobile AuthenticationBiometricsNews10/2025 I served as a panelist for NSF.10/2025 I served as TPC member for ICNC 2026 AMCN.09/2025 Our work “UWB-PostureGuard: A Privacy-Preserving RF Sensing System for Continuous Ergonomic Sitting Posture Monitoring” has been accepted by HICSS.05/2025 Our work on “Large Language Model-powered Wi-Fi-based Human Activity Recognition” has been accepted by the Workshop in MobiSys 2025.04/2025 I served as a panelist for NSF.03/2025 I served as TPC member for IEEE WF-IoT 2025.02/2025 Our work “Wi-Chat: Large Language Model Powered Wi-Fi Sensing” is now available on arXiv.01/2025 I served as TPC member for INFOCOM DeepWireless 2025.12/2024 I served as TPC member for IEEE INFOCOM 2025 Poster.11/2024 I served as TPC member for ICNC 2025 AMCN.07/2024 Our work on “WiFi-based Vital Signs Monitoring” has been accepted by IMWUT/UbiComp.04/2024 Invited talk at Florida State University.01/2024 I served on the TPC for INFOCOM 2024 Poster.01/2024 Our work on “Multi-person 3D Human Mesh Estimation using WiFi” has been accepted by IMWUT/UbiComp.08/2023 I joined the Department of Computer Science and Engineering at the University of South Florida!02/2023 Our work on “3D Human Mesh Construction using WiFi” was covered by: Tech Xplore, News8Plus, etc.10/2022 Our work on “3D Human Mesh Construction using WiFi” has been accepted by ACM SenSys 2022.10/2022 Our work on “Robust Person Re-identification Using WiFi” has been accepted by USENIX Security 2023.04/2022 I received the Graduate Student Research Award in the Department of Computer Science at Florida State University.04/2022 Our work on “3D Human Pose Estimation Using WiFi” has been accepted by ACM UbiComp 2022.04/2022 Our work on “Earable Authentication via Acoustic Toothprint” has been accepted by ACM UbiComp 2022.04/2022 Our survey paper entitled “Commodity WiFi Sensing in 10 Years: Status, Challenges, and Opportunities” has been accepted by the IEEE Internet of Things Journal.Media CoverageWinect: 3D Human Pose Tracking for Free-form Activity Using Commodity WiFi was covered by: Tech Xplore, News8Plus, Lifeboat, etc.ToothSonic: Earable Authentication via Acoustic Toothprint was covered by: Unite.AI, Gigazine, etc.Wi-Mesh: A WiFi Vision-based Approach for 3D Human Mesh Construction was covered by: Tech Xplore, News8Plus, etc.ServicesTechnical Program Committee (TPC) Membership:ICNC’26 AMCN (2026 International Conference on Computing, Networking and Communications (ICNC): AI and Machine Learning for Communications and Networking)IEEE WF-IoT 2025 (2025 IEEE 11th World Forum on Internet of Things (WF-IoT))INFOCOM DeepWireless 2025IEEE INFOCOM 2025 PosterIEEE Conference on Computer Communications (INFOCOM) 2024 Poster2025 International Conference on Computing, Networking and Communications (ICNC): AI and Machine Learning for Communications and NetworkingReviewer for journals:ACM Transactions on Internet TechnologyIEEE Transactions on Biometrics, Behavior, and Identity ScienceIEEE Transactions on Sustainable ComputingIEEE Signal Processing LettersComputer Networks: The International Journal of Computer and Telecommunications NetworkingACM Transactions on Computing for HealthcareIEEE Transactions on ComputersJournal of the International Measurement ConfederationIEEE Journal on Selected Areas in Communications - Positioning and Sensing Over Wireless NetworksACM Transactions on Sensor NetworksIEEE Transactions on Information Forensics and SecurityJournal of Computational Design and EngineeringACM IMWUT/UbiCompIEEE Sensors JournalIEEE Transactions on Artificial IntelligenceIEEE/ACM Transactions on NetworkingIEEE Transactions on Mobile ComputingIEEE Transactions on Dependable and Secure ComputingIEEE Internet of Things JournalSensorsReviewer for conferences: 2025 International Conference on Computing Networking and Communications (ICNC): AI and Machine Learning for Communications and Networking, MobileHCI 2023, CSAE 2023; also helped in reviewing papers of conferences, such as MobiSys 2023, USENIX Security 2023, ICDCS 2022, ESORICS 2022/2021, ASIACSS 2023/2022/2021, INFOCOM 2022/2021, ACSAC 2021, CNS 2022/2021, DCOSS 2021/2020, WiSec 2021/2020, IWQoS 2021/2020, ICCCN 2021, MSN 2019.",
  "content_length": 5445,
  "method": "requests",
  "crawl_time": "2025-12-01 14:51:24"
}