{
  "name": "Yimeng Feng",
  "homepage": "https://researchers.mq.edu.au/en/persons/yimeng-feng",
  "status": "success",
  "content": "Yimeng Feng - Macquarie University View Scopus Profile Yimeng Feng Dr Lecturer in Computing (loT and Networking), School of ComputingFuture Communications Research CentreData Horizons Research CentreSmart Green Cities Research CentreAdvanced Drone Systems Research CentreFinTech and Banking Research Centre https://orcid.org/0000-0002-3605-6829 Emailyimeng.fengmq.eduau h-index 141 Citations 5 h-index Calculated based on number of publications stored in Pure and citations from Scopus 20162025 Research activity per year Personal profile BiographyDr. Yimeng Feng joined the School of Computing at Macquarie University, Sydney, Australia in July 2023 as a Lecturer (Assistant Professor) in Computing. She has been an Associate Director of International Engagement in the School of Computing since Dec 2024. Before she joined Macquarie University, she was a Postdoctoral Research Associate at the School of Computer Science and Engineering, University of New South Wales, Sydney, Australia, and a Visiting Research Fellow at the Hawkesbury Institute for the Environment, Western Sydney University, Sydney, Australia. She received her dual Ph.D. degrees from the Faculty of Engineering and IT, the University of Technology Sydney, and the State Key Laboratory of Networking and Switching Technology, Beijing University of Posts and Telecommunications.  She received her dual Bachelor's degrees from the Beijing University of Posts and Telecommunications and the Queen Mary University of London. She has obtained a high level of achievements, including papers, scholarships, awards, commercialized patents, and professional activities. Research interestsDr. Yimeng Feng's research interests include Intelligent Transportation Systems, the Internet of Things, Service Computing, and Wireless Sensor Network technology. Her professional experiences include mentoring and supervising Ph.D., Master students, and Honours students, as well as serving as a reviewer and TPC member for a number of IEEE/ACM top conferences and journals. PhD scholarships If you are interested in doing a PhD or MRes at Macquarie under my supervision, and are eligible to apply for any of the scholarships listed here, then please contact me in advance of the closing dates. Education/Academic qualificationPh.D. in Computer Science and Technology, Beijing University of Posts and TelecommunicationsBachelor of Management, Beijing University of Posts and TelecommunicationsBachelor of Engineering (Honours), Queen Mary University of LondonDoctor of Philosophy (Engineering), University of Technology Sydney Fingerprint Dive into the research topics where Yimeng Feng is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Road Engineering 100% Magnetic Sensor Engineering 73% Mobile Application Computer Science 54% Application Development Computer Science 45% Development Environment Computer Science 36% Data Association Computer Science 36% Traffic Monitoring Computer Science 36% Intelligent Transportation System Engineering 33% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research Outputs Research output per year 2016 2016 2017 2020 2022 2024 2025 2025 10 Conference proceeding contribution 6 Article 2 Conference abstract Research output per year Research output per year Continuous marine monitoring via autonomous UAV handoffKim, H., James, A., Seth, A., Kuantama, E., Williamson, J., Feng, Y. & Han, R., 2025, MobiSys '25: proceedings of the 23st ACM international Conference on Mobile Systems, Applications, and Services. New York: Association for Computing Machinery, p. 711-716 6 p.Research output: Chapter in Book/Report/Conference proceeding › Conference proceeding contribution › peer-review Open AccessFile Unmanned Aerial Vehicle 100% Handoff 100% Drone 40% Vision System 20% Illumination Variation 20% 1 Downloads (Pure) High-resolution uplink sensing in millimeter-wave ISAC systemsZhao, L., Ni, Z., Feng, Y., Li, J., Bu, X. & Andrew Zhang, J., 4 Jul 2025, (E-pub ahead of print) In: IEEE Transactions on Communications. 16 p.Research output: Contribution to journal › Article › peer-review Mobile Network 100% Communication Protocol 50% Signal-to-Noise Ratio 50% Reference Signal 50% Parameter Estimate 50% Passive sensing for multiple vehicles in bi-static ISAC systemsZhao, L., Feng, Y., Ni, Z. & Bu, X., 2025, 2025 IEEE 101st Vehicular Technology Conference (VTC2025-Spring): proceedings. Piscataway, NJ: Institute of Electrical and Electronics Engineers (IEEE), 6 p.Research output: Chapter in Book/Report/Conference proceeding › Conference proceeding contribution › peer-review 6G 100% Computer Hardware 50% Classification Algorithm 50% Covariance Matrix 50% Estimation Scheme 50% Smart road studs with magnetic sensors for multilane traffic volume detectionSun, Y., Quan, W., Wang, H., Feng, Y., Ma, X., Li, H., Sun, J. & Cheng, J., 1 Apr 2025, In: IEEE Sensors Journal. 25, 7, p. 11737-11748 12 p.Research output: Contribution to journal › Article › peer-review Magnetic Sensor 100% Road 100% Multiscale 100% Traffic Volume 100% Vehicle Detection 100% CAV as a mobile control platform: a paradigm for traffic management on highwaysWu, X., Yue, W., Sha, Z. & Feng, Y., 2024, 2024 IEEE 99th Vehicular Technology Conference (VTC2024-Spring): proceedings. Piscataway, NJ: Institute of Electrical and Electronics Engineers (IEEE), 5 p.Research output: Chapter in Book/Report/Conference proceeding › Conference proceeding contribution › peer-review Control Strategy 100% Traffic Management 100% Speed Limit 100% Connected Vehicle 100% Automated Vehicle 100% View all 18 research outputs Prizes Asian Deans’ Forum 2022 – The Rising Stars Women in Engineering WorkshopFeng, Y. (Recipient), 2022Prize Faculty Strategic Startup FundFeng, Y. (Recipient), 2024Prize FSE Staff Travel SchemeFeng, Y. (Recipient), 2024Prize MQ ECR Enabling SchemeFeng, Y. (Recipient), 2024Prize School of Computing Incentive FundsFeng, Y. (Recipient), 2024Prize",
  "content_length": 6343,
  "method": "requests",
  "crawl_time": "2025-12-01 14:51:26"
}