{
  "name": "Yiming Zhang 0003",
  "homepage": "http://nicexlab.com/zym.htm",
  "status": "success",
  "content": "Yiming Zhang's academic Homepage Yiming Zhang Professor, Director of NICE Lab, SJTU & XMU, China E-mail: zhangyiming at cs dot sjtu dot edu dot cn; zhangyiming at xmu dot edu dot cn Dr. Yiming Zhang is a professor at SJTU and XMU. He is also the director of the NICE Lab (Laboratory of Networked Intelligent Computing at Exascale). His research is focused on operating, networking, storage, and AI systems. As the first/corresponding author, he has published many highly-influential papers in top conferences like NSDI, FAST and EuroSys, and famous Journals like TOCS, TOS and TON. He is an associate editor of IEEE Transactions on Computers and IEEE Transactions on Services Computing, and a member of 2022 EuroSys Roger Needham Award Committee. He has received the Best Paper Award of USENIX FAST'23, the National Science and Technology Award (2nd prize), the Natural Science Award of Hunan province (1st prize), and the (top 10) Outstanding Dissertation Award. His research (TianheGraph) is ranked No. 1 in the latest Graph500 on Tianhe supercomputer. As the team leader, he won the CCF Award of Science and Technology (1st prize) in 2021. Here is the CV. Selected Publications: Recent Conference Papers zBuffer: Zero-Copy and Metadata-Free Serialization for Fast RPC with Scatter-Gather Reflection. Xiangyu Liu, Huiba Li, Shun Gai, Rui Du, Youmin Chen, Yiming Zhang (Corresponding). ACM PPoPP 2026 (to appear) Predicting DRAM Failures at Scale: A Two-Stage Approach for Heterogeneous Systems. Chenglin Wang, Shouxin Wang, Shuyue Zhou, Ronglong Wu, Zhirong Shen, Lu Tang, Jialiang Yu, Min Zhou, Yiming Zhang. IEEE HPCA 2026 (to appear) SkySync: Accelerating File Synchronization with Collaborative Delta Generation. Zhihao Zhang, Huiba Li, Lu Tang, Jiwu Shu, Yiming Zhang (Corresponding). USENIX FAST 2026 (to appear) Phoenix: A Refactored I/O Stack for GPU Direct Storage without Phony Buffers. Jianqin Yan, Shi Qiu, Yina Lv, Hao Chen, Zhirong Shen, Xin Yao, Renhai Chen, Jiwu Shu, Gong Zhang, Yiming Zhang (Corresponding). ACM SC 2025 MixNet: A Runtime Reconfigurable Optical-Electrical Fabric for Distributed Mixture-of-Experts Training. Xudong Liao, Yijun Sun, Han Tian, Xinchen Wan, Yijun Jin, Zilong Wang, Zhenghang Ren, Xinyang Huang, Wenxue Li, Kin Fai Tse, Zhizhen Zhong, Guyue Liu, Ying Zhang, Xiaofeng Ye, Yiming Zhang, Kai Chen. ACM SIGCOMM 2025 AC-Cache: A Memory-Efficient Caching System for Small Objects via Exploiting Access Correlations. Fulin Nan, Ronglong Wu, Zhirong Shen, Jiahui Yang, Li Cheng, Zheng Chen, Yiming Zhang, Jiwu Shu. ACM PPoPP 2025 GeminiFS: A Companion File System for GPUs. Shi Qiu, Weinan Liu, Yifan Hu, Jianqin Yan, Zhirong Shen, Xin Yao, Renhai Chen, Gong Zhang, Yiming Zhang (Corresponding). USENIX FAST 2025 AtomicDisk: A Secure Virtual Disk for TEEs against Eviction Attacks. Hongliang Tian, Xinyi Yu, Weijie Liu, Shaowei Song, Zhihao Zhang, Shiyu Wang, Qingsong Chen, Erci Xu, Shoumeng Yan, Yiming Zhang (Corresponding). USENIX FAST 2025 Vegeta: Parallel Smart Contract Execution for Leaderless Blockchain. Tianjing Xu*, Yongqi Zhong*, Yiming Zhang*, Ruofan Xiong, Jingjing Zhang, Guangtao Xue, Shengyun Liu. USENIX NSDI 2025 *Co-primary authors Cheetah: Metadata Aggregation for Fast Object Storage without Distributed Ordering. Yiming Zhang, Li Wang, Shengyun Liu, Shun Gai, Haonan Wang, Kai Chen, Dongsheng Li, Jiwu Shu. ACM EuroSys 2025 EXO: Accelerating Storage Paravirtualization with eBPF. Shi Qiu, Li Wang, Yiming Zhang (Corresponding). ACM SC 2024 Removing Obstacles before Breaking Through the Memory Wall: A Close Look at HBM Errors in the Field. Ronglong Wu, Shuyue Zhou, Jiahao Lu, Zhirong Shen, Zikang Xu, Jiwu Shu, Kunlin Yang, Feilong Lin, Yiming Zhang. USENIX ATC 2024 Bandle: Asynchronous State Machine Replication Made Efficient. Bo Wang, Shengyun Liu, He Dong, Xiangzhe Wang, Wenbo Xu, Jingjing Zhang, Ping Zhong, Yiming Zhang (Corresponding). ACM EuroSys 2024 Perseus: A Fail-Slow Detection Framework for Cloud Storage Systems. Ruiming Lu, Erci Xu, Yiming Zhang (Corresponding), Fengyi Zhu, Zhaosheng Zhu, Mengtian Wang, Zongpeng Zhu, Guangtao Xue, Jiwu Shu, Minglu Li, Jiesheng Wu. USENIX FAST 2023 (Best Paper Award!) vGRAPH: Memory-Efficient Multicore Graph Processing for Traversal-Centric Algorithms. Menghan Jia*, Yiming Zhang* (Corresponding), Xinbiao Gan, Dongsheng Li, Ruibo Wang, Kai Lu. ACM SC 2022 *Co-primary authors NVMe SSD Failures in the Field: the Fail-Stop and the Fail-Slow. Ruiming Lu, Erci Xu, Yiming Zhang (Corresponding), Zhaosheng Zhu, Mengtian Wang, Zongpeng Zhu, Guangtao Xue, Minglu Li, Jiesheng Wu. USENIX ATC 2022 InfiniFS: An Efficient Metadata Service for Large-Scale Distributed Filesystems. Wenhao Lv, Youyou Lu, Yiming Zhang, Peile Duan, Jiwu Shu. USENIX FAST 2022 XTree: Traversal-Based Partitioning for Extreme-Scale Graph Processing on Supercomputers. Xinbiao Gan, Yiming Zhang (Corresponding), Ruigeng Zeng, Jie Liu, Ruibo Wang, Tiejun Li, Li Chen, Kai Lu. IEEE ICDE 2022 MapperX: Adaptive Metadata Maintenance for Fast Crash Recovery of DM-Cache Based Hybrid Storage Devices. Lujia Yin, Li Wang, Yiming Zhang (Corresponding), Yuxing Peng. USENIX ATC 2021 ParaX: Boosting Deep Learning for Big Data Analytics on Many-Core CPUs. Lujia Yin*, Yiming Zhang* (Corresponding), Zhaoning Zhang, Yuxing Peng, Peng Zhao. VLDB 2021 *Co-primary authors MapX: Controlled Data Migration in the Expansion of Decentralized Object-Based Storage Systems. Li Wang, Yiming Zhang* (Corresponding), Jiawei Xu, Guangtao Xue. USENIX FAST 2020 *Co-primary authors UrsaL: Ultra-Efficient, Reliable, Scalable, and Available Block Storage at Low Cost. Huiba Li*, Yiming Zhang* (Corresponding), Haonan Wang, Ping Zhong. IEEE INFOCOM 2020 *Co-primary authors TopoX: Topology Refactorization for Efficient Graph Partitioning and Processing. Dongsheng Li*, Yiming Zhang* (Corresponding), Jinyan Wang, Kian-Lee Tan. VLDB 2019 *Co-primary authors URSA: Hybrid Block Storage for Cloud-Scale Virtual Disks. Huiba Li*, Yiming Zhang* (Corresponding), Dongsheng Li, Zhiming Zhang, Shengyun Liu, Peng (Ryan) Huang, Zheng Qin, Kai Chen, Yongqiang Xiong. ACM EuroSys 2019 *Co-primary authors KylinX: A Dynamic Library Operating System for Simplified and Efficient Cloud Virtualization. Yiming Zhang, Jon Crowcroft, Dongsheng Li, Chengfei Zhang, Huiba Li, Yaozheng Wang, Kai Yu, Yongqiang Xiong, Guihai Chen. USENIX ATC 2018 PCatch: Automatically Detecting Performance Cascading Bugs in Cloud Systems. Jiaxin Li, Yuxi Chen, Haopeng Liu, Shan Lu, Yiming Zhang, Haryadi Gunawi, Xiaohui Gu, Xicheng Lu, Dongsheng Li. ACM EuroSys 2018 PariX: Speculative Partial Writes in Erasure-Coded Systems. Huiba Li, Yiming Zhang (Corresponding), Zhiming Zhang, Shengyun Liu, Dongsheng Li, Xiaohui Liu, Yuxing Peng. USENIX ATC 2017 CubeX: Leveraging Glocality of Cube-Based Networks for RAM-Based Key-Value Store. Yiming Zhang, Dongsheng Li, Tian Tian, Ping Zhong. IEEE INFOCOM 2017 CubicRing: Enabling One-Hop Failure Detection and Recovery for Distributed In-Memory Storage Systems. Yiming Zhang, Chuanxiong Guo, Dongsheng Li, Rui Chu, Haitao Wu, Yongqiang Xiong. USENIX NSDI 2015 Journal Papers Qiwen Ke, Yina Lv, Zhihao Zhang, Yue Yu, Hailiang Chen, Zhenlong Song, Xinbiao Gan, Xin Yao, Meiling Wang, and Yiming Zhang (Corresponding). CrossFS: Improving Cross-Domain File System Performance with CRDT-Based Metadata Synchronization. ACM Transactions on Storage (ToS), to appear. Li Wang, Shi Qiu, Jianqin Yan, Zhirong Shen, Qingbo Wu, Xin Yao, Meiling Wang, Renhai Chen, and Yiming Zhang (Corresponding). A Tale of Two Paths: Optimizing Paravirtualized Storage I/O with eBPF. ACM Transactions on Storage (ToS), to appear. Yiming Zhang, Kekun Hu, Gang Dong, Hailiang Chen, and Rengang Li. FrigateBird: Decoupling Metadata/Data Services for Continuously Fast Object Storage. IEEE Transactions on Services Computing (TSC), to appear. Yiming Zhang, Zhihao Zhang, Yan Chen, Huiba Li, Haonan Wang, Ping Zhong, Shengyun Liu, and Dongsheng Li. Efficient Block Storage in the Cloud. IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems (TCAD), 2024, 43(12): 4800-4812, Doi: 10.1109/TCAD.2024.3400690. Ziyang Li, Dongsheng Li, Yingwen Chen, Kai Chen, Yiming Zhang (Corresponding). Decentralized Scheduling for Data-Parallel Tasks in the Cloud. ACM Transactions on Parallel Computing (TOPC), 2024, 11(2): 1-23, Doi: 10.1145/3651858. Yan Chen, Qiwen Ke, Huiba Li, Yongwei Wu, Yiming Zhang. xMeta: SSD-HDD-hybrid Optimization for Metadata Maintenance of Cloud-scale Object Storage. ACM Transactions on Architecture and Code Optimization (TACO), 2024, 21(2): 1-20, Doi: 10.1145/3652606. Huiba Li, Zhihao Zhang, Yifan Yuan, Rui Du, Kai Ma, Lanzhen Liu, Yiming Zhang (Corresponding), Windorsor Hsu. Block-Level Image Service for the Cloud. ACM Transactions on Storage (ToS), 2024, 20(1): 1-28. Yiming Zhang (Corresponding), Huiba Li, Shengyun Liu, Peng Huang. Hybrid Block Storage for Efficient Cloud Volume Service. ACM Transactions on Storage (ToS), 2023, 19(4): 1-25. Ruiming Lu, Erci Xu, Yiming Zhang (Corresponding), Fengyi Zhu, Zhaosheng Zhu, Mengtian Wang, Zongpeng Zhu, Guangtao Xue, Jiwu Shu, Minglu Li, Jiesheng Wu. From Missteps to Milestones: A Journey to Practical Fail-Slow Detection. ACM Transactions on Storage (ToS), 2023, 19(4): 1-28. Jiaxin Li, Yiming Zhang (Corresponding), Haryadi S. Gunawi, Xiaohui Gu, Feng Huang, Dongsheng Li. Performance Bug Analysis and Detection for Distributed Storage and Computing Systems. ACM Transactions on Storage (ToS), 2023, 19(3): 1-33. Doi: 10.1145/3580281. Yiming Zhang, Li Wang, Shun Gai, Qiwen Ke, Wenhao Li, Zhenlong Song, Guangtao Xue, Jiwu Shu. Oasis: Controlling Data Migration in Expansion of Object-Based Storage Systems. ACM Transactions on Storage (ToS), 19(1): 1-22, 2023. Yiming Zhang, Lujia Yin, Dongsheng Li, Yuxing Peng, Kai Lu. ParaX: Bandwidth-Efficient Instance Assignment for DL on Multi-NUMA Many-Core CPUs. IEEE Transactions on Computers (TC). 2022, 71(11): 303",
  "content_length": 15895,
  "method": "requests",
  "crawl_time": "2025-12-01 14:51:27"
}