{
  "name": "Yiming Tang 0002",
  "homepage": "https://yiming-tang-cs.github.io",
  "status": "success",
  "content": "Home | Yiming Tang Skip to main content Link Menu Expand (external link) Document Search Copy Copied Yiming Tang Yiming Tang (汤一鸣)Assistant Professor at Rochester Institute of TechnologyEmail TwitterRochester Institute of Technology (RIT) is a central research institution in the field of Software Engineering, ranking 53th in the United States🇺🇸.I am an Assistant Professor in the Department of Software Engineering at Rochester Institute of Technology, USA, and was a Horizon Postdoctoral Fellow in the Department of Computer Science and Software Engineering at Concordia University, Canada. I received my Ph.D. in Computer Science from City University of New York - Graduate Center, USA. I was the instructor of Hunter College Cyber Security Summer Camp, which was only open to non-CS female undergraduates who were interested in CS. My research areas include software quality, empirical software engineering, and software logging. My research has been published in flagship software engineering research venues such as ICSE, TSE, and EMSE. My work has won the best (distinguished) paper awards at two international software engineering conferences.I am looking for self-motivated Ph.D., Master’s and undergraduate students. Please contact me if you are interested in software engineering research. News📣 [11/2025] I will serve on the review committee of TOSEM. 📣 [09/2025] Paper accepted at IEEE Software. 📣 [05/2025] Paper accepted at QRS ’25. 📣 [05/2025] Paper accepted at FIE ’25. 📣 [01/2025] Paper accepted at ICST ’25 Short Papers, Vision and Emerging Results Track. 📣 [01/2025] I will serve as as a PC chair of PROMISE 2025! Please feel free to contribute! 📣 [01/2025] I will serve as as a PC on the Research Papers Track of ICSE 2026! Contact yxtvse@rit.edu Yiming Tang YimingTang7Internet Provider",
  "content_length": 1809,
  "method": "requests",
  "crawl_time": "2025-12-01 14:51:26"
}