{
  "name": "Yiming Qian",
  "homepage": "https://yi-ming-qian.github.io",
  "status": "success",
  "content": "Yiming Qian, University of Manitoba Yiming Qian Department of Computer Science University of Manitoba Winnipeg, MB Canada R3T 2N2 I am an Applied Scientist at Amazon. Previsouly, I was an Assistant Professor in the Department of Computer Science at the University of Manitoba. Before that, I was a postdoc at Simon Fraser University working with Prof. Yasutaka Furukawa. I obtained my PhD degree from the University of Alberta. My research interests lie at the intersection of computer vision, computer graphis and machine learning. Recently, I focus on reconstruction and generation of 3D environment by combining advances in physics, geometry, imaging, deep learning, etc. Email: qym.ustc [!at!] gmail [!dot!] com Selected Papers See the full list indexed by google scholar Single User WiFi Structure from Motion in the Wild Yiming Qian, Hang Yan, Sachini Herath, Pyojin Kim, Yasutaka Furukawa IEEE International Conference on Robotics and Automation (ICRA), 2022 [Full Paper] HEAT: Holistic Edge Attention Transformer for Structured Reconstruction Jiacheng Chen, Yiming Qian, Yasutaka Furukawa Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR), 2022 [ArXiv], [Project Page] Roof-GAN: Learning to Generate Roof Geometry and Relations for Residential Houses Yiming Qian, Hao Zhang, Yasutaka Furukawa Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR), 2021 [ArXiv], [Supplementary], [Code] Fusion-DHL: WiFi, IMU, and Floorplan Fusion for Dense History of Locations in Indoor Environments Sachini Herath, Saghar Irandoust, Bowen Chen, Yiming Qian, Pyojin Kim, Yasutaka Furukawa IEEE International Conference on Robotics and Automation (ICRA), 2021 [ArXiv], [Video], [Code] Learning Pairwise Inter-Plane Relations for Piecewise Planar Reconstruction Yiming Qian, Yasutaka Furukawa Proceedings of the European Conference on Computer Vision (ECCV), 2020 [Full Paper], [Code] 3D Human Shape Reconstruction from a Polarization Image Shihao Zou, Xinxin Zuo, Yiming Qian, Sen Wang, Chi Xu, Minglun Gong, Li Cheng Proceedings of the European Conference on Computer Vision (ECCV), 2020 [Project Page] Simultaneous 3D Reconstruction for Water Surface and Underwater Scene Yiming Qian, Yinqiang Zheng, Minglun Gong, Yee-Hong Yang Proceedings of the European Conference on Computer Vision (ECCV), 2018 [Full Paper], [Video] Full 3D Reconstruction of Transparent Objects Bojian Wu, Yang Zhou, Yiming Qian, Minglun Gong, Hui Huang ACM Transactions on Graphics (Proceedings of SIGGRAPH), 2018 [Full Paper], [Project Page] Stereo-based 3D Reconstruction of Dynamic Fluid Surfaces by Global Optimization Yiming Qian, Minglun Gong, Yee-Hong Yang Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition (CVPR), 2017 [Full Paper], [Video] Artificial Multi-Bee-Colony Algorithm for k-Nearest-Neighbor Fields Search Yunhai Wang, Yiming Qian, Yang Li, Minglun Gong, Wolfgang Banzhaf Proceedings of the ACM Genetic and Evolutionary Computation Conference (GECCO), 2016 [Full Paper] 3D Reconstruction of Transparent Objects with Position-Normal Consistency Yiming Qian, Minglun Gong, Yee-Hong Yang Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition (CVPR), 2016 [Full Paper] Frequency-based Environment Matting by Compressive Sensing Yiming Qian, Minglun Gong, Yee-Hong Yang Proceedings of the IEEE International Conference on Computer Vision (ICCV), 2015 [Full Paper] Integrated Foreground Segmentation and Boundary Matting for Live Videos Minglun Gong, Yiming Qian, Li Cheng. IEEE Transactions on Image Processing (TIP), 2015 [Full Paper] [Video] Distilled Collections from Textual Image Queries Hadar Averbuch-Elor, Yunhai Wang, Yiming Qian, Minglun Gong, Johannes Kopf, Hao Zhang, Daniel Cohen-Or Computer Graphics Forum (Proceedings of Eurographics), 2015 [Full Paper] Kudos to Vasilios for the template: Plain Academic",
  "content_length": 3925,
  "method": "requests",
  "crawl_time": "2025-12-01 14:51:26"
}