{
  "name": "Yin Zhang 0001",
  "homepage": "http://www.cs.utexas.edu/~yzhang",
  "status": "success",
  "content": "Yin Zhang @ UTCS Yin Zhang (章寅) Associate Professor Department of Computer Science The University of Texas at Austin 2317 Speedway, Stop D9500 Austin, TX 78712-1757, USA Office: Gates 6.808 Campus mail: Computer Science D9500 Tel: +1 (512) 232-7496 (Office) Fax: +1 (512) 471-8885 E-mail: yzhang@cs.utexas.edu Curriculum Vitae (pdf) | Google Scholar Research | Papers | Talks | Patents | Teaching | Awards | Services | Miscellanea Welcome to my home page! I am an Associate Professor in the Department of Computer Science at The University of Texas at Austin. I received my Ph.D. in Computer Science from Cornell University in 2001. Between 2001-2004, I was a researcher at AT&T Labs-Research. Here is my Curriculum Vitae (pdf). Research My research interests span several areas of computer networks, including network management, network measurement, network security, wireless optimization, overlay routing and multihoming, and network algorithms. Previously I also worked on Web performance, congestion control, etc. Papers (or by subject) Talks Patents Google Scholar Selected Publications ViceROI: Catching Click-Spam in Search Ad Networks (CCS 2013) (Coming soon!) Measuring and Fingerprinting ClickSpam in Online Ad Networks (SIGCOMM 2012) (PS) (Slides) Tabulation Based 5-independent Hashing with Applications to Linear Probing and Second Moment Estimation (SICOMP 2012) (PS) Clustered Embedding of Massive Social Networks (SIGMETRICS 2012) (PS) (PPT) Spatio-Temporal Compressive Sensing and Internet Traffic Matrices (Extended Version) (ToN 2012) (PS) Rapid Detection of Maintenance Induced Changes in Service Performance (CoNEXT 2011) (PS) Best Paper Award Q-score: Proactive Service Quality Assessment in a Large IPTV System (IMC 2011) (PS) CRMA: Collision-Resistant Multiple Access (MobiCom 2011) (PS) Model-driven Optimization of Opportunistic Routing (SIGMETRICS 2011) (PS) Secure Friend Discovery in Mobile Social Networks (INFOCOM 2011) (PS) Enabling High-Bandwidth Vehicular Content Distribution (CoNEXT 2010) (PS) Exploiting Temporal Stability and Low-Rank Structure for Localization in Mobile Networks (MobiCom 2010) (PS) Detecting the Performance Impact of Upgrades in Large Operational Networks (SIGCOMM 2010) (PS) R3: Resilient Routing Reconfiguration (SIGCOMM 2010) (PS) Tabulation Based 5-Universal Hashing and Linear Probing (ALENEX 2010) (PS) Scalable Proximity Estimation and Link Prediction in Online Social Networks (IMC 2009) (PS) Spatio-Temporal Compressive Sensing and Internet Traffic Matrices (SIGCOMM 2009) (PS) (Slides) (PPT) Please email me if you want to get a copy of my Matlab implementation for SRSVD. Towards Automated Performance Diagnosis in a Large IPTV Network (SIGCOMM 2009) (PS) (Slides) (PPT) Troubleshooting Chronic Conditions in Large IP Networks (CoNEXT 2008) (PS) (Slides) (PPT) Network Imprecision: A New Consistency Metric for Scalable Monitoring (OSDI 2008) (PS) Predictable Performance Optimization for Wireless Networks (SIGCOMM 2008) (PS) A General Model of Wireless Interference (MobiCom 2007) (PS) STAR: Self-Tuning Aggregation for Scalable Monitoring (VLDB 2007) (PS) dFence: Transparent Network-based Denial of Service Mitigation (NSDI 2007) (PS) (HTML) (Slides) (PPT) COPE: Traffic Engineering in Dynamic Networks (SIGCOMM 2006) (PS) (Slides) (PPT) NetQuest: A Flexible Framework for Large-Scale Network Measurement (SIGMETRICS 2006) (PS) journal version (ToN 2009) (PS) Network Anomography (IMC 2005) (PS) (HTML) (Slides) (PPT) Estimating Point-to-Point and Point-to-Multipoint Traffic Matrices: An Information-Theoretic Approach (ToN 2005) (PS) Online Identification of Hierarchical Heavy Hitters: Algorithms, Evaluation, and Applications (IMC 2004) (PS) (Slides) (PPT) Optimizing Cost and Performance for Multihoming (SIGCOMM 2004) (PS) Tabulation Based 4-Universal Hashing with Applications to Second Moment Estimation (SODA 2004) (PS) Sketch-based Change Detection: Methods, Evaluation, and Applications (IMC 2003) (PS) (Slides) (PPT) An Information-Theoretic Approach to Traffic Matrix Estimation (SIGCOMM 2003) (PS) On Selfish Routing in Internet-like Environments (SIGCOMM 2003) (PS) journal version (ToN 2006) (PS) (Slides) (PPT) Fast Accurate Computation of Large-Scale IP Traffic Matrices from Link Loads (SIGMETRICS 2003) (PS) (Slides) (PPT). ACM SIGMETRICS Test of Time Award On the Characteristics and Origins of Internet Flow Rates (SIGCOMM 2002) (PS) (Slides) (PPT) BGP Routing Stability of Popular Destinations (IMW 2002) (PS) On the Constancy of Internet Path Properties (IMW 2001) (PS) (Slides) (PPT) On the Use and Performance of Content Distribution Networks (IMW 2001) (PS) (Slides) (PPT) Detecting Backdoors (USENIX Security 2000) (HTML) (PS) (Slides) (PPT). Best Student Paper Award Detecting Stepping Stones (USENIX Security 2000) (HTML) (PS) (Slides) (PPT) The Stationarity of Internet Path Properties: Routing, Loss, and Throughput (ACIRI Technical Report) (PS) Teaching CS356: Computer Networks [Fall 2007, Spring 2010, Spring 2011] CS386M: Communication Networks [Fall 2005, Spring 2007, Spring 2008, Fall 2008, Fall 2009, Fall 2010] CS378: Advanced Computer Networks [Spring 2009] CS378: Network Measurement and Intrusion Detection [Fall 2006] CS395T: Advanced Topics in Computer Networks [Spring 2006] CS395T: Network Measurement and Inference [Spring 2005] Note to graduate program applicants Awards IEEE Fellow, 2015. (Citation: for contributions to computer network measurement and management) ACM SIGMETRICS Test of Time Award, 2013. Best Paper Award, ACM CoNEXT Conference, 2011. National Science Foundation Faculty Early Career Award, 2006. Research Excellence Award, AT&T Labs-Research, 2001. Best Student Paper Award, USENIX Security Symposium, 2000. Gold Medal, 33rd International Mathematical Olympiad (IMO), 1992. First Prize (full mark), Chinese High School Mathematics Competition, 1991. Professional Services Organization Committee Member: 2012: IEEE ICNP (TPC Co-Chair) 2009: ACM ANCS (Publicity Chair) 2008: ACM SIGCOMM (Publicity Chair) 2005: LSNI (Organization and TPC Co-chair) Program Committee Member: 2011: ACM SIGCOMM, IEEE INFOCOM, IEEE ICNP, COMSNETS, ITC 2010: ACM SIGCOMM, IEEE INFOCOM, IEEE ICNP, PAM 2009: ACM SIGCOMM, ACM CoNEXT, IEEE INFOCOM, IEEE ICNP, COMSNETS 2008: IEEE INFOCOM, IEEE ICNP, ACM/USENIX IMC, ACM ANCS, ANM, SecureComm 2007: ACM SIGCOMM, ACM ANCS, ACM/USENIX IMC, MineNet, INM, IWQoS, WWW, IM 2006: ACM SIGCOMM, ACM SIGMETRICS, IEEE INFOCOM, IEEE ICDCS, INM 2005: IEEE INFOCOM, ACM/USENIX IMC, LSNI 2004: ACM SIGCOMM, IEEE INFOCOM Miscellanea 6 months of Abilene traffic matrices that I collected. See readme.txt for more information. See also the totem traffic matrix datasets. Last Modified: $Date: 2014/11/27 06:21:14 $",
  "content_length": 6765,
  "method": "requests",
  "crawl_time": "2025-12-01 14:51:33"
}