{
  "name": "Yin Li 0003",
  "homepage": "https://www.biostat.wisc.edu/~yli",
  "status": "success",
  "content": "Yin Li Yin Li Associate Professor Biostatistics & Medical Informatics Computer Sciences University of Wisconsin-Madison 6538, Morgridge Hall yin.li at wisc.edu Short Bio Google Scholar Profile RESEARCH Computer Vision, Mobile Health, Machine Learning TEAM Abrar Majeedi (BDS Ph.D. candidate) Zihao Zhu (CS Ph.D. student) Zhuoyan Xu (Stats Ph.D. candidate, co-supervised with Prof. Yingyu Liang and Prof. Yiqiao Zhong) Zhuoming Liu (CS Ph.D. student) Khoi Duc Nguyen (CS Ph.D. student) Jinhong Lin (ECE Ph.D. student) Lin Zhang (CS Ph.D. student) Bobby Tang (CS undergrad student, Hilldate Fellow 2025) Nick Cheng (CS undergrad student) Viet Luong (CS undergrad student) To work with me: Students: See my note. Postdocs: I am not looking for postdocs at this moment. ALUMNI [Those who spend >= 2 semesters with us] Yiquan Li (BS CS, 2023-2025). Incoming CS PhD student at Northwestern University Alex Huang (BS CS, 2023-2024, Hilldale Fellow 2024). Incoming CS PhD student at University of Michigan Satya Sai Srinath Namburi GNVV (MS CS, 2022-2024). Now AI Scientist at GE HealthCare Viswanatha Reddy Gajjala (MS BDS / CS, 2021-2023). Now SDE at Amazon Zhengyang Lou (PhD ECE, co-supervised with Prof. Yu Hen Hu, 2020-2024). Now Senior Algorithm Engineer at NIO Fangzhou Mu (PhD CS, 2018-2023). Previously Senior Deep Learning Algorithms Engineer at NVIDIA. Now Research Scientist at Meta Yiwu Zhong (PhD CS, 2018-2023). Now postdoc at CUHK, incoming Tenure-Track Assistant Professor, School of Intelligence Science and Technology, Peking University Evelin Yin (BS CS, 2022-2023). Now CS PhD student at Purdue Sicheng Mo (BS CS, 2022-2022). Now CS PhD student at UCLA Cameron Ruggles (CS MS, 2021-2023). Now Computer Vision Engineer at Vimaan Liancheng Fang (BDS MS, 2020-2021). Now CS PhD student at University of Illinois Chicago Siddeshwar Raghavan (MS ECE, 2019-2021). Now ECE PhD student at Purdue Zitong Zhan (BS CS, 2020-2021). Previously CS MS student at UIUC, now CS PhD student at University at Buffalo Abrar Majeedi (MS BDS, 2020-2021). Now BDS PhD student at UW Madison Akash Sharma (MS CS, 2020). Now SDE at Microsoft Chen-Lin Zhang (2019-2020). Visiting Ph.D. student from Nanjing University. Now Research Scientist at ByteDance Zixuan Huang (MS CS, 2018-2020). Previously CS PhD student at UIUC, now research scientist at Meta. Zhe Huang (BS CS, 2019-2020). Previously MS Robotics student at CMU, now Software Engineer at Waymo Shashank Verma (MS ECE, 2019-2020). Now SDE at Nvidia Yuke Liang (BS CS, 2019). Now SDE at Twitter TEACHING Fall 2025: BMI 771 / CS 771 Learning Based Methods for Computer Vision Fall 2024: BMI 771 / CS 771 Learning Based Methods for Computer Vision Fall 2023: BMI 771 / CS 771 Learning Based Methods for Computer Vision Fall 2022: BMI 771 / CS 771 Learning Based Methods for Computer Vision Fall 2021: BMI 826 Learning Based Methods in Computer Vision Fall 2020: CS540 Introduction to Artificial Intelligence Fall 2019: BMI 826 / CS 838 Learning Based Methods in Computer Vision Spring 2019: BMI 826 / CS 838 Learning Based Methods in Computer Vision NEWS Oct 2025: Journal papers accepted to Machine Vision and Applications (video-based injury risk assessment) and Journal of Perinatology (automated assessment of laryngoscope insertion depth during neonatal intubation). Sep 2025: One paper accepted to NeurIPS. Aug 2025: I am serving as area chairs for CVPR 2026 and ICLR 2026. June 2025: Four papers accepted to ICCV. June 2025: I am serving as an area chair for WACV 2026. May 2025: One paper accepted to ICML 2025. Apr 2025: One paper accepted to MobiSys 2025. Feb 2025: One paper accepted to CVPR 2025. Feb 2025: I am serving as an area chair for NeurIPS 2025. Jan 2025: One paper (computer vision for lifting monitoring) accepted to IEEE THMS. Dec 2024: I am serving as an area chair for ICCV 2025. Dec 2024: One paper (a perspective paper on facial expression modeling) accepted to Cognition and Emotion. Nov 2024: One paper (automated detection of glottic opening during neonatal intubation using video laryngoscopy) accepted to Journal of Perinatology. Sep 2024: One paper (freehand 3D ultrasound reconstruction) accepted to IEEE TUFFC. Sep 2024: I am serving as an area chair for CVPR 2025. July 2024: One paper accepted to ECCV. June 2024: I am serving as an area chair for WACV 2025. June 2024: One paper (quantification of care manipulation in NICU with video and sensor data) accepted to npj Digital Medicine. May 2024: I am serving as an area chair for NeurIPS 2024. Feb 2024: Three papers accepted to CVPR. Jan 2024: One paper accepted to ICLR. Dec 2023: One paper (drone-based object tracking benchmark) accepted to IJCV. See more details here. Nov 2023: I am serving as an area chair for ECCV 2024. July 2023: Two papers accepted to ICCV. June 2023: I am serving as an area chair for CVPR 2024. June 2023: Our team was the first place winner in the 2023 challenges of EPIC-Kitchens for Action Detection and the second place winner in the 2023 Ego4D Challenge for the Episodic memory: Moments queries (MQ). June 2023: One paper (automatic segmentation of recylcing materials in contruction sites) accepted to Automation in Construction. Mar 2023: I am serving as an area chair for NeurIPS 2023. Feb 2023: One paper accepted to CVPR. Jan 2023: One paper accepted to ICLR. Dec 2022: Papers accepted to TODAES and Pattern Recognition. Oct 2022: Our team was the second place winners in the 2022 Ego4D Challenge for Episodic Memory Moments and Natural Language Queries (MQ and NLQ). Sep 2022: One paper accepted to NeurIPS Datasets and Benchmarks track. See the project page here. Sep 2022: I am serving as an area chair for CVPR 2023. Aug 2022: Our team was the first place winner in the VIMS/IAARC Datathon 2022 competition (link to certificate). Aug 2022: One paper accepted to WACV (round 1). July 2022: Four papers accepted to ECCV. June 2022: Two papers accepted to ICCP, including one conditionally accepted to TPAMI Special Issue on Computational Photography. May 2022: I am serving as an area chair for WACV 2023. Apr 2022: We are hosting UW Madison GI Tract Image Segmentation challenge on Kaggle. Update: a description of our dataset is published here. Mar 2022: Three papers accepted to CVPR (one oral and two posters). Feb 2022: Check out our new tech report with code on temporal action localization, with SOTA performance across benchmarks. Update: the paper is accepted to ECCV. Feb 2022: I am serving as an area chair for ECCV 2022. Jan 2022: Our paper on the design of adaptive video object detection systems (with Purdue) was accepted to EuroSys. Dec 2021: Check out our new project on creating stylized 3D photos from a single image. Update: The paper is accepted to CVPR 2022 as an oral presentation. July 2021: Two papers accepted to ICCV (two posters). June 2021: Our work (with Purdue) on benchmarking object detectors on embedded devices was presented at EMDL workshop, MobiSys 2021. See the project page here June 2021: I am serving as an area chair for WACV 2022. Mar 2021: Two papers accepted to CVPR (one oral and one poster). Jan 2021: One paper accepted to IEEE TPAMI (arXiv preprint). Dec 2020: One paper accepted to AAAI. Oct 2020: One paper with Purdue accepted to SenSys. Oct 2020: Our work on lifting load prediction was presented at HFES 2020. See the project page here. Sep 2020: Our presentation of FingerTrak was selected as a best presentation nominee at UbiComp 2020. Aug 2020: Our demo on wearable 3D hand tracking (FingerTrak) was selected as a best demo nominee (3/41) at ECCV 2020. Aug 2020: Our work on wearable hand tracking (with Cornell) was recently coverd by UW Madison News and Cornell Chronicle, and featured in Engadget, Gizmodo, VentureBeat, BBC, Yahoo News and Forbes. We will also present a demo at ECCV 2020 and our paper at UbiComp 2020. Aug 2020: One paper accepted to BMVC as an oral presentation. July 2020: I am serving as an area chair for IJCAI 2021. July 2020: Two papers accepted to ECCV (one oral and one poster). June 2020: Congratulations to Miao Liu for winning EPIC-Kitchens Challenge 2020 (3rd place in action recognition). See our preprint here. May 2020: One paper with Cornell accepted to IMWUT (UbiComp 2020). Mar 2020: One paper accepted to CVPR as an oral presentation. Dec 2019: One paper accepted to ICLR. Oct 2019: I am serving as an area chair for ECCV 2020. Jun 2019: I am serving as an area chair for WACV 2020. Jan 2019: One paper accepted to IEEE TIP. Nov 2018: I am serving as area chairs for CVPR'19 and ICCV'19. Oct 2018: One paper accepted to IEEE TIP. Sep 2018: One paper accepted to NeurIPS. Aug 2018: Joined UW-Madison as an assistant professor. HIGHLIGHTS ActionFormer: Localizing Moments of Actions with Transformers 3D Photo Stylization: Learning to Generate Stylized Novel Views from a Single Image RegionCLIP: Region-based Language-Image Pretraining Learning to Generate Scene Graph from Natural Language Supervision DSMIL for Whole Slide Image Classification Comprehensive Image Captioning via Scene Graph Decomposition FingerTrak Interpretable and Accurate Fine-grained Recognition via Region Grouping Gradients as Features for Deep Representation Learning Learning to Grasp without Seeing Georgia Tech First Person Vision Repository Unsupervised Learning of Edges from Video BioGlass MIT Tech Review, New Scientist, WIRED UK Detecting Bids for Eye Contact using a Wearable Camera PASCAL-S Dataset (The Secrets of Salient Object Segmentation) Decoding Children's Social Behavior (MMDB Dataset) SELECTED PUBLICATIONS NeurIPS 2025: Matthew Dutson, Nathan Labiosa, Yin Li, Mohit Gupta Instant Video Models: Universal Adapters for Stabilizing Image-Based Networks ICCV 2025: Zhuoyan Xu, Khoi Duc Nguyen, Preeti Mukherjee, Saurabh Bagchi, Somali Chaterji, Yingyu Liang, Yin Li Learning to Inference Adaptively for Multimodal Large Language Models [arXiv] [project] [code] ICCV 2025: Carter Sifferman, Yiquan Li, Yiming Li, Fangzhou Mu, Michael G",
  "content_length": 20734,
  "method": "requests",
  "crawl_time": "2025-12-01 14:51:29"
}