{
  "name": "Yingbin Liang",
  "homepage": "https://sites.google.com/view/yingbinliang/home",
  "status": "success",
  "content": "Yingbin Liang's WebsiteSearch this siteEmbedded FilesSkip to main contentSkip to navigationProfessor, Department of Electrical and Computer EngineeringDeputy Director, AI-Edge InstituteCore Faculty, Translational Data Analytics Institute (TDAI)The Ohio State UniversityOffice: DL 606Email: liang.889@osu.eduGoogle Scholar ProfileMultiple PhD (available in Fall 2026) and Postdoc Positions (available immediately)Dr. Yingbin Liang 's lab will have multiple PhD positions (supported by research assistantship) starting in Fall 2024. Her lab also has postdoc positions available immediately. All positions are in the areas of Machine Learning, Deep Learning, and Large-scale Optimization. Students and postdocs working with her will also be affiliated with the NSF AI Institute for Future Edge Networks and Distributed Intelligence (AI-EDGE) and will have opportunities to collaborate with the faculty in the institute. Short BiographyDr. Yingbin Liang is currently a Professor at the Department of Electrical and Computer Engineering at the Ohio State University (OSU), and a core faculty of the Ohio State Translational Data Analytics Institute (TDAI).  She also serves as the Deputy Director of the AI-EDGE Institute at OSU. She received the Ph.D. degree in Electrical Engineering from the University of Illinois at Urbana-Champaign in 2005, and served on the faculty of University of Hawaii and Syracuse University before she joined OSU. Dr. Liang’s research interests include machine learning, optimization, statistical signal processing, information theory, and wireless communications. Dr. Liang received the National Science Foundation CAREER Award in 2009, and the State of Hawaii Governor Innovation Award in 2009. Her paper received EURASIP Best Paper Award in 2014. She is currently serving as an Associate Editor for IEEE Transactions on Information Theory. She is an IEEE fellow.Research InterestsMy research lies at the intersection of machine learning (ML), large-scale optimization, statistical signal processing, information theory, and wireless communications and networks, with growing applications of AI and ML to other scientific domains such as food science and astrophysics. More specifically, my research is centered around the following directions:Foundation of Machine Learning: My research develops fundamental theory on modern machine learning approaches, encompassing various aspects such as their underlying working mechanisms, generalization performance, and sample and computational complexity, and further use theory as guidelines for developing innovative and scalable algorithms. My focuses include topics such as language and reasoning models, generative models such as diffusion models, meta-learning, continual learning, self-supervised learning, robust machine learning, and more.Reinforcement Learning: My research develops innovative reinforcement learning (RL) algorithms that address critical challenges in sequential decision-making and in the training of modern foundation models, guided by rigorous characterizations of their statistical and computational complexity. My work spans a range of fundamental settings, such as nonstationary, reward-free, offline and off-policy, and non-Markovian RL, and RL with soft and instantaneous hard constraints. My research also explores new frontiers of RL, advancing algorithms for training and fine-tuning language and diffusion models and establishing theoretical performance guarantees for these methods.Large-scale Optimization: My research is dedicated to creating cutting-edge and scalable algorithms for solving complex large-scale optimization problems, which often arise from modern data-driven machine learning applications. My work emphasizes the characterization of convergence rates and computational complexity of these algorithms. Some of our recent efforts revolve around bilevel optimization, distributionally robust optimization (DRO), minimax, and multi-objective optimization.AI for Engineering and Science: My research applies advanced AI techniques to address fundamental problems in engineering and the sciences. A major thrust focuses on the development of novel communication techniques driven by emerging advances in AI and machine learning, enabling more efficient data-driven designs and online adaptation to dynamic environments. In addition, my work develops new AI methodologies for food science and explores the use of machine learning techniques to tackle novel problems in astrophysics.Information Theory and Communications: My research develops fundamental, information-theoretic performance limits for wireless communications and networks, and translates these insights into provably (near-)optimal designs for communication schemes, resource allocation, and control. I also leverage the information-theoretic insights and techniques to analyze the performance of ML systems.Honors and AwardsFellow of IEEE, 2022Numerous Spotlight Presentations in recent NeurIPS and ICLR ConferencesJohn E. and Patricia A. Breyer Endowed Associate Professor, Syracuse University, 20172014 EURASIP Best Paper Award for the EURASIP Journal on Wireless Communications and NetworkingNational Science Foundation CAREER Award, 2009State of Hawaii Governor Innovation Award, 2009M. E. Van Valkenburg Graduate Research Award, University of Illinois, 2005Vodafone-US Foundation Fellows Initiative Research Merit Award, 2005Vodafone-US Foundation Graduate Fellowship, 2003-2005Google SitesReport abusePage detailsPage updated Google SitesReport abuse",
  "content_length": 5544,
  "method": "requests",
  "crawl_time": "2025-12-01 14:51:35"
}