{
  "name": "Ying Wang 0001",
  "homepage": "https://wangying-ict.github.io",
  "status": "success",
  "content": "wangying-ict Wang Ying (王颖) Professor Institute of Computing Technology, Chinese Academy of Sciences wangying2009 (at) ict (dot) ac (dot) cn About me I am a Professor at Institute of Computing Technology, Chinese Academy of Sciences. At ICT, my research interests primarily focus on the area of reliable computer architecture and VLSI design, with an emphasis on memory systems, AI-driven processor chip design automation, and large scale integrated chips. I'm also leading the DeepBurning, Zhejiang big chips, MLC-CIM, ChipGPT and LPCM Projects. News [Oct 2022] Gave a keynote speak on \" Towards Agile development of specialized processors \" at the INTERNATIONAL WORKSHOP ON EDGE INTELLIGENT COMPUTING (EIC) 2022. [Aug 2022] I'm giving a talk on Cognitive Storage in the workshop of CCF CHIP 2022. [Jul 2022] Cangyuan won the third place in this year DAC SDC.- [Feb 2022] Four papers are accepted by DAC2022. Congrats to Shengwen, Yintao, Songyun, Xinghua and Yuquan! [Dec 2021] Ying joined the virtual round table for IEEE Computer on low-power computer vision, hosted by Prof. Yung-Hsiang Lu and Prof. George K. Thiruvathukal(https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=9755195). [Dec 2021] Ying was named as a recipient of the IEEE/ACM Design Automation Conference Under-40 Innovators Award. [June 2021] Mengdi's work on multi-task learning accelerator has been granted the best paper award (2nd place) of GLVLSI2021. [June 2021] The codes of Optimus: A memory-efficient scheduler for Neural Networks have been verified by ACM and is now released. [Apr 2021] \"GLIST: Towards In-Storage Graph Learning\" will be presented at Usenix ATC2021 by Cangyuan Li. [Apr 2021] \"PicoVO: A Lightweight RGB-D Visual Odometry Targeting Resource-Constrained IoT Devices\" will be presented at ICRA2021 by Yuquan He. [Apr 2021] Two of Our works are accepted by GLVLSI2021, one of which is nominated as the best paper candidate. Congrats to Mengdi! [Apr 2021] Two of Our works on neural network architecture and scheduler co-design are accepted by LCTES2021. The code under the Artifact Evaluation process will be open-sourced. [Mar 2021] Our work on NAS acceleration processor has been accepted by ISCA2021. Congrats to Xiaohan. [Feb 2021] Six papers are accepted by DAC2021. The second and third works on Intelligent Video Processing Unit will be presented at the conference. [July 2020] Three papers are accepted by ICCAD2020. The work of DeepBurning-GL, which is the first automated framework for GNN accelerator design, will be presented in Dec. 2020. [Feb 2019] Four papers are accepted by DAC2020, congrats to Songyun, Yintao, Xiandong and Yongchen! [Feb 2019] Our first ICLR paper got accepted, congrats to Xiandong! The best part is that it will be a great experience for us to explore the great continent of wild Africa! [Nov 2019] Three papers are accepted by DATE2020. The interesting thing is that the paper \"You Only Search Once: An Automated Framework for Fast DNN/Accelerator Co-design\" actually proposed a novel NAS algorithm, which coincides with the idea of one contemporary work submitted to ICLR2020. However, we missed to claim the contribution due to the lack of backgrounds knowledge on AI algorithms 😃 [2019] Wen's work on Computing-in-Memory has been elected as the sole best paper of ICCD2019. [2019] Invited to give a talk on \"A case of Agile development flow for edge AI processors\" at ICTA2019, Chengdu. [2018] 🥈We are the champions of 2018 DAC System Design Contest (GPU category), big congrats to Hao Lv! The source-code of the low-power object tracking solution will be released soon. [2018] The first detailed architectural simulator for Processing-in-Memory is now released by Professor Yinhe Han's lab!! [2018] Our AI-enabled RISC-V duo-core chip passed the final test! I will give a talk-A Tightly-coupled Light-Weight Neural Network Processing Units with RISC-V Core-at the 7th RISC-V Workshop, Milpitas, CA. [2017] Two papers are accepted by ICCAD 2017. [Jan.10th 2017], I'm attending 2017 ASPDAC, Chiba, JP. [2017] Two papers are accepted by DAC 2017. [Nov.7th-Nov.10th 2016] I'm attending 2016 International Conference On Computer Aided Design and giving a talk at Austin,TX. [2016] 🥇We are the champions of this year Low-Power Image Recognition Challenge (LPIRC) 2016! [Jun.5th-Jun.10th 2016] we are attending the 53nd IEEE/ACM Design Automation Conference and giving three presentations at Austin, TX. [2016] Three papers are accepted as regular and one paper is accepted as WIP poster by DAC 2016, Congrats to Lili and Bosheng. [2016] One paper is accepted by DATE 2016 Giving a talk on machine learning accelerator generation at Jiangnan Institute of Computing Technology, Wuxi. [2015] Our work on memory security and 3D NoC is presented at ATS 2015, Mumbai, India. [Jun.7th-Jun.14th 2015] I'm attending 52nd IEEE/ACM Design Automation Conference and giving three presentations at San Francisco. [Jun.6th-Jun.6th 2015] I'm attending Chinasys 2015 and giving a talk on \"Computational Memory Architecture\" at Xiamen. Awards & Honors 2020 CCF Early Career Award for ICers （CCF集成电路Early Career Award） 2017 CCF-Intel Young Faculty Researcher Program ，YFRP（CCF –Intel青年学者提升项目） 2017 CAST/CCF Young Talent Development Program Awardee （中国科协青年人才托举计划） 2016 Outstanding Faculty Award in Institute of Computing Technology, CAS 2015 Outstanding Faculty Award in Institute of Computing Technology, CAS Services Program Committee Member of IEEE CoolChips XVIII Program Committee Member and Session Chair of IEEE WRTLT 2014 Reviewer of IEEE Trans. on VLSI systems, ACM Trans. on DAES, Elsevier Journal of System Architecture, Journal of Computer Science and Technology. External Reviewer of conferences:ITC, ATS, ATS, DFT, VLSI-DAT Links Onur Mutlu , Long Cheng, Lei Liu, Shigang Li",
  "content_length": 5803,
  "method": "requests",
  "crawl_time": "2025-12-01 14:51:30"
}