{
  "name": "Ying Cao 0001",
  "homepage": "http://www.ying-cao.com",
  "status": "success",
  "content": "Ying CAO's Homepage Ying CAO Email: caoying59@gmail.com About me I received the PhD degree in Computer Science from the City University of Hong Kong (CityU), under supervision of Rynson Lau and Antoni Chan. I obtained the BEng and MEng degrees in Software Engineering from Northeastern University (China). I was an intern at Microsoft Research Aisa (MSRA). I was a postdoctoral researcher in the Department of Computer Science at the CityU. Research My primary research interest is Data-driven Design Intelligence, which aims to answer a challenging question: how can computers learn to design from data and augment humans in the design process? The long-term goal of my research is to empower computers with design intelligence: the capabilities of machines to perceive, understand and create designs like humans. I am particularly interested in learning rich models that describe the structure, semantics, style and functionality of designs, and exploring their potential use in the creative process. Publications Design Order Guided Visual Note Optimization Xiaotian Qiao, Ying Cao, Rynson W.H. Lau IEEE Transactions on Visualization and Computer Graphics (TVCG), 2022 [Paper] Instance-aware Scene Layout Forecasting Xiaotian Qiao, Quanlong Zheng, Ying Cao, Rynson W.H. Lau International Journal of Computer Vision (IJCV), 2022 [Paper] Object-level Scene Context Prediction Xiaotian Qiao, Quanlong Zheng, Ying Cao, Rynson W.H. Lau IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI), 2021 [Paper] Automatic Comic Generation with Stylistic Multi-page Layouts and Emotion-driven Balloon Generation Xin Yang, Zongliang Ma, Letian Yu, Ying Cao, Baocai Yin, Xiaopeng Wei, QiangZhang, Rynson W.H. Lau ACM Transactions on Multimedia Computing Communications and Applications, 2021 [Paper] Night-time Scene Parsing with a Large Real Dataset Xin Tan, Ke Xu, Ying Cao, Yiheng Zhang, Lizhuang Ma, Rynson W.H. Lau IEEE Transactions on Image Processing, 2021 [Paper] Weakly-Supervised Salient Object Detection With Saliency Bounding Boxes Yuxuan Liu, Pengjie Wang, Ying Cao, Zijian Liang, Rynson W.H. Lau IEEE Transactions on Image Processing, 2021 [Paper] Selective Region-based Photo Color Adjustment for Graphic Designs Nanxuan Zhao, Quanlong Zheng, Jing Liao, Ying Cao, Hanspeter Pfister, Rynson W.H. Lau ACM Transactions on Graphics, 2020 (to be presented at SIGGRPAH 2021) [Paper] [Project] Tactile Sketch Saliency Jianbo Jiao, Ying Cao, Manfred Lau, Rynson W.H. Lau ACM Multimedia 2020 [Paper] Content-aware Generative Modeling of Graphic Design Layouts Xinru Zheng*, Xiaotian Qiao*, Ying Cao, Rynson W.H. Lau (*Joint first authors) ACM Transactions on Graphics (Proc. SIGGRAPH 2019) [Paper] [Project] ButtonTips: Design Web Buttons with Suggestions Dawei Liu, Ying Cao, Rynson W.H. Lau, Antoni B. Chan ICME 2019 (Oral) [Paper] [Project] Tell Me Where I Am: Object-level Scene Context Prediction Xiaotian Qiao, Quanlong Zheng, Ying Cao, Rynson W.H. Lau CVPR 2019 (Oral) [Paper] [Project] Distraction-Aware Shadow Detection Quanlong Zheng, Xiaotian Qiao, Ying Cao, Rynson W.H. Lau CVPR 2019 [Paper] [Project] Modeling Fonts in Context: Font Prediction on Web Designs Nanxuan Zhao, Ying Cao, Rynson W.H. Lau Computer Graphics Forum (Proc. Pacific Graphics 2018) [Paper] [Project] Task-driven Webpage Saliency Quanlong Zheng, Jianbo Jiao, Ying Cao, Rynson W.H. Lau ECCV 2018 [Paper] [Project] Look Deeper into Depth: Monocular Depth Estimation with Semantic Booster and Attention-Driven Loss Jianbo Jiao, Ying Cao, Yibing Song, Rynson W.H. Lau ECCV 2018 [PDF][Project (coming soon)] What Characterizes Personalities of Graphic Designs? Nanxuan Zhao, Ying Cao, Rynson W.H. Lau ACM Transactions on Graphics (Proc. SIGGRAPH 2018) [PDF] [Project] Mining Probabilistic Color Palettes for Summarizing Color Use in Artwork Collections Ying Cao, Antoni B. Chan, Rynson W.H. Lau SIGGRAPH Asia 2017 Symposium on Visualization [PDF] [Project] Directing User Attention via Visual Flow on Web Designs Xufang Pang*, Ying Cao*, Rynson W.H. Lau, Antoni B. Chan (*Joint first authors) ACM Transactions on Graphics (Proc. SIGGRAPH Asia 2016) [PDF] [Project] DynamicManga: Animating Still Manga via Camera Movement Ying Cao, Xufang Pang, Antoni B. Chan, Rynson W.H. Lau IEEE Transactions on Multimedia, 2016 [PDF] [Project] A Robust Panel Extraction Method for Manga Xufang Pang, Ying Cao, Rynson W.H. Lau, Antoni B. Chan ACM Multimedia 2014 [PDF] Look Over Here: Attention-Directing Composition of Manga Elements Ying Cao, Rynson W.H. Lau, Antoni B. Chan ACM Transactions on Graphics (Proc. SIGGRAPH 2014) [PDF] [Project] Automatic Stylistic Manga Layout Ying Cao, Antoni B. Chan, Rynson W.H. Lau ACM Transactions on Graphics (Proc. SIGGRAPH Asia 2012) [PDF] [Project] Honors First Runner-Up, Postgraduate Student Research Paper Competition 2013-2014, IEEE (Hong Kong) CI Chapter Research Tuition Scholarship (CityU) Outstanding Academic Performance Award for Research Degree Students (CityU) POSCO Asia Fellowship Excellent Paper Award of Software College at Northeastern University Merit Graduate Student of Northeastern University Excellent Graduate of Northeastern University Model of Excellent Student Leader of Northeastern University Professional Service Conference reviewer: SIGGRAPH/SIGGRAPH Asia CVPR ICCV IJCAI Eurographics Pacific Graphics Journal reviewer: IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI) ACM Transactions on Graphics (TOG) IEEE Transactions on Visualization and Computer Graphics (TVCG) IEEE Transactions on Multimeida (TMM) Program committee: WACV 2021 IJCAI 2020 MMM [2020, 2021] International Workshop on coMics ANalysis, Processing and Understanding (MANPU) [2016, 2017, 2019] International Workshop on Multimedia Artworks Analysis (MMArt) [2016, 2017, 2018, 2019] Talks 2050@2021, Hangzhou, 2021 (Keynote Speaker) AI for Content Creation Workshop, CVPR, 2020 (Keynote Speaker) Google Research, USA, 2019 Dalian University of Technology, China, 2018 Multimedia Artworks Analysis Workshop, ICME, 2017 (Keynote Speaker) Shenzhen University, China, 2016 SIGGRAPH, Canada, 2014 SIGGRAPH Asia, Singapore, 2012 Patents Ying Cao, Xufang Pang, Antoni B. Chan, Rynson W.H. Lau. System and Method for Optimizing a User Interface and Manipulating a User's Interaction with an Interface.",
  "content_length": 6327,
  "method": "requests",
  "crawl_time": "2025-12-01 14:51:29"
}