{
  "name": "Yingying Wang 0004",
  "homepage": "https://www.eng.mcmaster.ca/cas/faculty/dr-yingying-wang",
  "status": "success",
  "content": "Dr. Yingying Wang – Faculty of Engineering Skip to main content Keyword Search Clear search Search Current Website Search McMaster Tools A-Z Campus Index Ask McMaster Virtual Tour How to get to McMaster Faculty and Staff Directory Mosaic Faculties DeGroote School of Business Faculty of Engineering Faculty of Health Sciences Faculty of Humanities Faculty of Science Faculty of Social Sciences Students Current Students Future Students International Students Student Success Centre McMaster Viewbook Centre for Continuing Education Student Wellness Centre Campus Life Alumni Athletics Libraries Mosaic Research Give to McMaster Expertise Character animation, computer graphics, vision, deep learning, AR/VR, game, motion capture, synthesis and perception Areas of Specialization Computing Methodologies Human-Centred Computing Contact Information wang840@mcmaster.ca ITB 130 Assistant Professor Computing and Software Overview I joined McMaster University January 2022. I am currently looking for Ph.D. and Master students to join my research group. I have many interests in generating expressive animations for AR/VR applications and games, including: * Generative model for human motion style transfer and generation* Motion simulation in physics environment* Audio driven intelligent virtual character synthesis* Dance choreography for virtual characters* Cartoon animation synthesis and perception* Gesture synthesis for conversational characters* Markerless hand and body motion capture* … or you propose interesting graphics + vision + deep learning topics … For future students, please send me an email if these aligns with your research interests. Students should have fundamental knowledge in graphics, vision and deep learning and basic coding experience.  It would be a bonus if students are familiar with Deep Reinforcement Learning, GAN, Unity, OpenGL, Maya these knowlege and tools. Did you know? I am looking for Ph.D. students who are interested in working on hand motion capture, hand pose estimation and tracking, either sensor-based or vision-based. Related Courses CAS 737 Computer Animation (Systems) – Offered in 2025-26 Winter Term Computer animation has been widely used in AR/VR applications, game development and entertainment industry. The goal of this course is to provide knowledge in different aspects of computer animation area for research and development purposes. This course will first introduce the fundamentals of computer animation, then further delve into kinematics, rigging, skinning and blendshapes for animating characters. It will cover classic motion capture, synthesis and editing techniques, as well as state-of-the-art research in animation area using deep learning, reinforcement learning and physics simulations. To take this course, students are expected to have prerequisite knowledge in Linear Algebra, Geometry, Data Structure and programming. Instructor Dr. Yingying Wang Contact Information wang840@mcmaster.ca ITB 130",
  "content_length": 2974,
  "method": "requests",
  "crawl_time": "2025-12-01 14:51:43"
}