{
  "name": "Yingjiu Li",
  "homepage": "https://cs.uoregon.edu/profile/yingjiul",
  "status": "success",
  "content": "Computer Science | School of Computer and Data Sciences Skip to main content Search Search this site Search Menu School of Computer and Data Sciences Menu Computer Science Computer Science The Department of Computer Science at the University of Oregon offers students and faculty a close-knit community in which to learn, discover, and innovate, in a shared quest for computational solutions to a spectrum of challenging problems. We are home to state-of-the-art research in several fields of computing ranging from foundational theory for programming languages to applications in data science, with substantial research groups in high performance computing, networking and distributed systems, and machine learning and artificial intelligence. Computer Science News UO researcher wins $200,000 grant and top paper honor November 18, 2025 COMPUTER SCIENCE — Computer science professor Yu Wang has received two major honors in the past few months. First, a team he has been leading won a $200,000 grant from the National Science Foundation. Second, his dissertation, which investigates ways to improve limited data sets to promote equity in data science, was awarded an honorable mention. Cybersecurity program receives important designation from NSA November 17, 2025 COMPUTER SCIENCE, CYBERSECURITY — The Department of Computer Science is wearing a new badge of honor. The National Security Agency designated the College of Arts and Sciences' Cybersecurity program as a National Center of Academic Excellence in Cybersecurity Research (CAE-R), which specifically recognizes institutions that contribute significant, peer-reviewed cybersecurity research and is the result of a rigorous review process. Finding the needle in the information haystack November 6, 2025 COMPUTER SCIENCE — With the help of the UO resources and research assistants, Assistant Professor Yu Wang’s research is helping us move toward a world where the accurate information we need to solve nearly any problem is right at our fingertips. The potential applications of Wang and his team’s efforts to mitigate this gap are nearly limitless. All CS news » The Future of TechIndustry partnerships with companies such as Intel, Amazon, Nike, Microsoft, and Providence help prepare students to work and lead in high-demand fields. Our faculty met with local tech leaders—and special guest Senator Ron Wyden—when SCDS hosted a board meeting for the Technology Association of Oregon.Read About the TAO meeting What you can do with a degree in Computer ScienceOur educational programs combine a strong computer science core curriculum with an array of cutting-edge topics. Students at all levels are prepared to step forth to make meaningful and high-quality contributions in the field of computing, going on to successful careers as software developers and engineers, data scientists, systems analysts, and cybersecurity personnel.Careers for UndergraduatesCareers for Graduates Is Cybersecurity a Fit for You?The cybersecurity program is designed to meet the growing demand for skilled cybersecurity professionals. It is deeply rooted in computer science and offers core and depth courses in cybersecurity. Students gain hands-on skills through computer and network security lab courses and field studies, graduating career-ready.Explore Cybersecurity as a Major Helping you find your path in Computer Science “I appreciate the fact that we had the freedom to follow our research interests while still benefiting from the faculty’s constant support. It helped me to be more productive in my Ph.D. and gain the experience that can help me in my future career. Also, since the department provides a variety of options for the curriculum, I was able to choose the path that best fits into my research.”——Amir Pouran Ben Veysey, PhD, '23 Our Degree ProgramsThe CS major includes interdisciplinary and internal tracks to prepare our students for future careers in this rapidly changing field. The Mathematics and Computer Science (MACS) degree offers students the opportunity to study computer science while retaining strong foundations in mathematics.The master's degree program in CS provides students with advanced coursework in the field of computer science as well as opportunities to complete an in-depth project or to become involved in research. The Ph.D. is an advanced degree reserved for students who demonstrate both a comprehensive understanding of computer science and an ability to do creative research.Graduate Degrees:Computer Science (MS)Computer Science (PhD) Undergraduate Degrees:Computer Science (BS or BA)CybersecurityMathematics and Computer Science (BS or BA)Computer Science MinorComputer and Information Technology MinorHonors Degrees:Computer Science ApplyDeclare or Change MajorVisit UO Class of 2024Fedi AniefuaBS, Mathematics and Computer ScienceFedi Aniefua will be heading to Seattle soon after his Spring 2024 graduation—he just landed a job as a software developer for Amazon. But before leaving Eugene, this MaCS major (and anime aficionado) would like to give credit to those who helped take him the distance.Read Fedi's story Learn from Experts in the FieldOur faculty are international leaders in their fields including:InformaticsNetworkingSecuritySoftware engineeringAssistive technologiesTheoryScientific visualizationHigh-performance computingWe are home to the Center for Cyber Security and Privacy, which serves as a cutting-edge hub for interdisciplinary research and collaboration in cybersecurity and accepts student assistants.ResearchFaculty Directory Faculty Spotlight Phil ColbertDirector of the computer information technology minor in the Department of Computer ScienceSenior Instructor Phil Colbert is one of three recipients of the Tykeson Teaching Award, an annual prize given to one outstanding faculty member in each division of the College of Arts and Sciences who goes above and beyond in the classroom.Read the story Brittany EricksonAssistant Professor of Computer ScienceAssistant Professor Brittany Erickson, a native of the San Francisco Bay Area, had her first encounter with an earthquake in 1989. She was an 8-year-old, playing outside when Loma Prieta violently shook California’s Central Coast at a magnitude of 6.9 and a maximum Modified Mercalli intensity of IX. The event was terrifying and memorable.  Fast forward to 2024 and Erickson now holds a joint position in the UO Computer Science and Earth Sciences departments, using computational mathematics and machine learning to address outstanding questions in earthquake science.Read the story Get Real-World ExperienceThe UO Cyber Security Operations Center offers students interested in a career in cybersecurity the opportunity for exposure to professional, hands-on learning experiences. Students are encouraged to attend our annual security day, enter competitions across the department, join student groups, and get involved in research during their time at the UO.Experiential Learning Once a Duck, Always a Duck Liz Olson '17Computer Science majorSince graduating in Computer Science from UO in 2017, Liz Olson has held a steady focus on the study of robotics. More specifically, she’s been researching perception in robotics or, how robots learn from sensory data—how they perceive, comprehend and reason. Now, having almost completed her PhD at the University of Michigan, Olson has set her sights on academia and industry to continue her research.Read Liz's story Battle to LearnSaghar SalehiMajor : Computer Science\"We were girls, we were doing science, we were building robots.” College of Arts and Sciences computer science student Saghar Salehi has vivid memories of the work she and her fellow “dreamers” were pursuing at school in Afghanistan. “We were all about proving that the world of engineering and computer science was not the exclusive domain of boys.” Read about Saghar’s story on CAS ConnectionRead Saghar's story Scholarships and FundingMultiple grants are available to help fund undergraduate and graduate CS students. Our PhD students are fully supported by various research funding sources, including the National Science Foundation, Army Research Office, Intelligence Advanced Research Projects Activity, and Department of Energy.Undergraduate Scholarships Graduate FundingAcademic SupportCS advisors are here to help guide students through their entire undergraduate program. Students will be assigned a \"track advisor\" who oversees student progress through the CS major, and can advise students on how to best prepare for grad school, internships, jobs, etc.Undergraduate Advising Graduate Student Support Give to the Department of Computer Science",
  "content_length": 8670,
  "method": "requests",
  "crawl_time": "2025-12-01 14:51:39"
}