{
  "name": "Ying He 0001",
  "homepage": "https://www3.ntu.edu.sg/home/yhe",
  "status": "success",
  "content": "Ying He @NTU Ying He Associate Professor College of Computing and Data Science Nanyang Technological University Office: N4-02a-23 Tel: +65 6514 1008 Email: yhe `at' ntu.edu.sg Research Interests My research interests lie broadly in the area of visual computing, with a particular focus on problems that require geometric analysis and computation. I have applied geometric methods across a wide range of engineering domains, including computer graphics, 3D vision, computer-aided design, wireless sensor networks, and medical imaging. I lead the Digital Geometry Processing and 3D Vision research group at NTU. We are continuously seeking motivated students to join our team. Current NTU students who are interested in exploring 3D Deep Learning, whether through URECA, FYP, or an MSc thesis project, are welcome to approach me. Requirements: CGPA ≥ 4.5 and strong background in mathematics and programming. Selected Publications (Since 2006) Monograph M. Jin, X. Gu, Y. He and Y. Wang. Conformal Geometry: Computational Algorithms and Engineering Applications, Springer, 2018. Journal papers L. Du, J. Hu, S. Wang, Y. Jiang, N. Lei, Y. He, and Z. Luo. Topo-GenMeta: Generative Design of Metamaterials based on Diffusion Model with Attention to Topology, Computer-Aided Design, Vol. 190, 103977, 2026. H. Xiao, W. Kang, Y. Guo, H. Liu, and Y. He. Enhanced Geometry and Semantics for Camera-based 3D Semantic Scene Completion, IEEE Transactions on Image Processing, accepted, 2025. P. Du, X. Wang, Z. Wu, X. Ru, X. Granier, and Y. He. LaPDA: Latent-space Point Cloud Denoising with Adaptivity, IEEE Transactions on Visualization and Computer Graphics, accepted, 2025. B. Fei, Y. Li, W. Yang, L. Ma, and Y. He. Towards Unified Representation of Multi-Modal Pre-training for 3D Understanding via Differentiable Rendering, IEEE Transactions on Visualization and Computer Graphics, accepted, 2025. Y. Zhao, Q. Zhang, J. Hou, J. Xia, W. Wang, and Y. He. FlexPara: Flexible Neural Surface Parameterization, IEEE Transactions on Pattern Analysis and Machine Intelligence, accepted, 2025. Z. Liu, Z. Huang, M. Pan, and Y. He. Deterministic Point Cloud Diffusion for Denoising, IEEE Transactions on Visualization and Computer Graphics, accepted, 2025. B. Fei, J. Xu, Y. Li, W. Yang, Q. Zhou, L. Liu, T. Luo, and Y. He. Self-supervised Learning for Pre-Training 3D Point Clouds: A Survey, Computational Visual Media, accepted, 2025. Y. Feng, H. Dai, G. Wei, L. Ma, P. Wang, Y. Zhou, and Y. He. D-FRAME: Direction-Field-Based Wireframe Extraction for Complex CAD Models, IEEE Transactions on Visualization and Computer Graphics, accepted, 2025. B. Fei, J. Wang, L. Bai, K. Liu, X. Xu, W. Yang, Y. Zhang, Y. He, D. Lin, Z. Lyu, and B. Dai. GetMesh: A Controllable Model for High-Quality Mesh Generation and Manipulation, IEEE Transactions on Pattern Analysis and Machine Intelligence, accepted, 2025. J. Hu, B. Fei, B. Xu, F. Hou, S. Wang, N. Lei, W. Yang, C. Qian, and Y. He. TopoGen: Topology-Aware 3D Generation with Persistence Points, Computer Graphics Forum, 44: e70257, 2025. Z. Li, F. Hou, W. Wang, X. Lu, and Y. He. A Divide-and-Conquer Approach for Global Orientation of Non-Watertight Scene-Level Point Clouds with 0-1 Integer Optimization, ACM Transactions on Graphics (Proceedings of ACM SIGGRAPH '25), Vol. 44, No. 4, Article No. 48, 2025. H. Xiao, W. Kang, H. Liu, Y. Li, and Y. He. Semantic Scene Completion via Semantic-aware Guidance and Interactive Refinement Transformer, IEEE Transactions on Circuits and Systems for Video Technology, Vol. 35, No. 5, pp. 4212-4225, 2025. W. Liu, J. Li, X. Chen, F. Hou, S. Xin, X. Wang, Z. Wu, C. Qian, and Y. He. Diffusing Winding Gradients (DWG): A Parallel and Scalable Method for 3D Reconstruction from Unoriented Point Clouds, ACM Transactions on Graphics, Vol. 44, No. 2, Article No. 19, 2025 (presented at ACM SIGGRAPH 2025). X. Chen, F. Yu, F. Hou, W. Wang, Z. Zhang, and Y. He. DCUDF2: Improving Efficiency and Accuracy in Extracting Zero Level Sets from Unsigned Distance Fields, IEEE Transactions on Visualization and Computer Graphics, Vol. 31, No. 10, pp. 9052 -9065, 2025. K. Yu, Y. Wang, P. Song, X. Meng, Y. He, and J. Chen. Weighted Squared Volume Minimization (WSVM) for Generating Uniform Tetrahedral Meshes, IEEE Transactions on Visualization and Computer Graphics, Vol. 31, No. 10, pp. 8969-8980, 2025. P. Qiu, R. Chen, P. Song, and Y. He. Modeling Wireframe Meshes with Discrete Equivalence Classes, IEEE Transactions on Visualization and Computer Graphics, Vol. 31, No. 10, pp. 7998 - 8011, 2025. Q. Sun, C. Fang, S. Liu, Y. Sun, Y. Shang, and Y. He. PolyGraph: A Graph-based Method for Floorplan Reconstruction from 3D Scans, IEEE Transactions on Visualization and Computer Graphics, Vol. 31, No. 10, pp. 7350-7362, 2025. J. Wang, X. Lu, M. Wang, F. Hou, and Y. He. Learning Implicit Fields for Point Cloud Filtering, IEEE Transactions on Visualization and Computer Graphics, Vol. 31, No. 9, pp. 5408-5420, 2025. L. Ma, Y. He, J. Zheng, Y. Zhou, S. Xin, C. Zhang, and W. Wang. Computing Smooth and Integrable Cross Fields via Iterative Singularity Adjustment, IEEE Transactions on Visualization and Computer Graphics, Vol. 31, No. 9, pp. 4850 - 4867, 2025. B. Fei, J. Xu, R. Zhang, Q. Zhou, W. Yang, and Y. He. 3D Gaussian Splatting as New Era: A Survey, IEEE Transactions on Visualization and Computer Graphics, Vol. 31, No. 8, pp. 4429-4449, 2025. G. Wei, L. Ma, Y. Zhou, C. Wang, J. Zheng, and Y. He. Design and Optimization of Self-Supporting Surfaces with Arch Beams, IEEE Transactions on Visualization and Computer Graphics, Vol. 31, No. 7, pp. 4003-4017, 2025. B. Fei, T. Luo, W. Yang, L. Liu, R. Zhang, and Y. He. Curriculumformer: Taming Curriculum Pre-Training for Enhanced 3D Point Cloud Understanding, IEEE Transactions on Neural Networks and Learning Systems, Vol. 36, No. 4, pp. 7316-7330, 2025. K. Yu, B. Wang, X. Chen, Y. He and J. Chen. Minimal Surface-guided Higher-order Mesh Generation for CAD Models, Computer-Aided Design, Vol. 178, 103810, 2025. J. Wang, Z. Lyu, B. Fei, J. Yao, Y. Zhang, B. Dai, D. Lin, Y. He, and Y. Wang. SLIDE: A Unified Mesh and Texture Generation Framework with Enhanced Geometric Control and Multi-View Consistency, International Journal of Computer Vision, Vol. 133, pp. 3105-3128, 2025. Y. Xu, G. Hou, J. Hu, T. Ren, X. Wang, Y. Zhang, C. Qian, F. Hou, and Y. He. Physics and Geometry-Augmented Neural Implicit Surfaces for Rigid Bodies, Computer Aided Geometric Design, Vol. 119, 102437, 2025. H. Xiao, Y. He, H. Liu, W. Kang, and Y. Li. Point Cloud Completion via Self-Projected View Augmentation and Implicit Field Constraint, IEEE Transactions on Circuits and Systems for Video Technology, Vol. 34, No. 11, pp. 11564-11578, 2024. Z. Liu, S. Zhan, Y. Zhao, Y. Liu, R. Chen, and Y. He. PCDNF: Revisiting Learning-based Point Cloud Denoising via Joint Normal Filtering, IEEE Transactions on Visualization and Computer Graphics, Vol. 30, No. 8, pp. 5419-5436, 2024. J. Hu, S. Wang, Y. He, Z. Luo, N. Lei and L. Liu. A Parametric Design Method for Engraving Patterns on Thin Shells, IEEE Transactions on Visualization and Computer Graphics, Vol. 30, No. 7, pp. 3719-3730, 2024. J. Li, Z. Wen, L. Zhang, J. Hu, F. Hou, Z. Zhang and Y. He. GS-Octree: Octree-based 3D Gaussian Splatting for Robust Object-Level 3D Reconstruction Under Strong Lighting, Computer Graphics Forum, 43: e15206, 2024. J. Li, L. Zhang, J. Hu, Z. Zhang, H. Sun, G. Song, and Y. He. Real-Time Volume Rendering with Octree-Based Implicit Surface Representation, Computer-Aided Geometric Design, Vol. 111, 102322, 2024. J. Hu, Y. He, B. Xu, S. Wang, N. Lei, Z. Luo. IF-TONIR: Iteration-free Topology Optimization based on Implicit Neural Representations, Computer-Aided Design, Vol. 167, 103639, 2024. F. Hou, X. Chen, W. Wang, H. Qin and Y. He. Robust Zero Level-Set Extraction from Unsigned Distance Fields Based on Double Covering, ACM Transactions on Graphics (Proceedings of ACM SIGGRAPH Asia '23), Vol. 42, No. 12, Article No. 247, 2023. R. Chen, P. Qiu, P. Song, B. Deng, Z. Wang, and Y. He. Masonry Shell Structures with Discrete Equivalence Classes, ACM Transactions on Graphics (Proceedings of ACM SIGGRAPH '23), Vol. 42, No. 4, Article No. 115, 2023. Y. Qian, J. Hou, Q. Zhang, Y. Zeng, S. Kwong, and Y. He. Task-Oriented Compact Representation of 3D Point Clouds via a Matrix Optimization-Driven Network, IEEE Transactions on Circuits and Systems for Video Technology, Vol. 33, No. 11, pp. 6981-6995, 2023. Q. Zhang, J. Hou, Y. Qian, Y. Zeng, J. Zhang, and Y. He. Flattening-Net: Deep Regular 2D Representation for 3D Point Cloud Analysis, IEEE Transactions on Pattern Analysis and Machine Intelligence, Vol. 45, No. 8, pp. 9726-9742, 2023. Z. Liu, X. Xin, Z. Xu, W. Zhou, C. Wang, R. Chen, and Y. He. Robust and Accurate Feature Detection on Point Clouds, Computer-Aided Design, Vol. 164, 103592, 2023. A. Mao, Z. Du, J. Hou, Y. Duan, Y.-J. Liu, and Y. He. PU-Flow: A Point Cloud Upsampling Network with Normalizing Flows, IEEE Transactions on Visualization and Computer Graphics, Vol. 29, No. 12, pp. 4964-4977, 2023. A. Mao, C. Dai, Q. Liu, J. Yang, L. Gao, Y. He, and Y.-J. Liu. STD-Net: Structure-Preserving and Topology-Adaptive Deformation Network for Single-View 3D Reconstruction, IEEE Transactions on Visualization and Computer Graphics, Vol. 29, No. 3, pp. 1785-1798, 2023. A. Mao, W. Dong, C. Xie, H. Wang, Y.-J. Liu, G. Li, and Y. He. Yarn-Level Simulation of Hygroscopicity of Woven Textiles, IEEE Transactions on Visualization and Computer Graphics, Vol. 29, No. 12, pp. 5250-5264, 2023. N. Yuan, P. Wang, W. Meng, S. Chen, J. Xu, S. Xin, Y. He, and W. Wang. A Variational Framework for Curve Shortening in Various Geometric Domains, IEEE Transactions on Visualization and Computer Graphics, Vol. 29, No. 4, pp. 1951-1963, 2023. Q. Zhang, J. Hou, Y. Qian, A.B. Chan, J. Zhang, and Y. He. ReGeoNet: Learning Regular Representations for Large-scale 3D Point Clouds, International Journal of Co",
  "content_length": 34638,
  "method": "requests",
  "crawl_time": "2025-12-01 14:51:29"
}