{
  "name": "Yingxia Shao",
  "homepage": "https://shaoyx.github.io",
  "status": "success",
  "content": "Shao Yingxia’s Home Yingxia ShaoProfessor at SCS, BUPT Follow Beijing, China Github Google ScholarYingxia Shao (邵蓥侠)ProfessorEmail: shaoyx [AT] bupt.edu.cnBioYingxia Shao is a Professor at School of Computer Science, Beijing University of Posts and Telecommunications. He obtained his PhD from Peking University in 2016, advised by Prof. Bin Cui. He worked with Prof. Lei Chen as a visiting scholar at HKUST in 2013 and 2014. He has served in the Technical Program Committee of various international conferences including VLDB, ICDE, KDD, AAAI, IJCAI, CIKM, WSDM, DASFAA, BigData, etc. He is serving as a reviewer of international journals including VLDBJ, IEEE TKDE, IEEE TPDS, IEEE TBD, etc. He received the ACM SIGMOD China Rising Star Award, ACM SIGMOD China Doctoral Dissertation Award, was selected into the MSRA Star-Track Young Scholar Program, won the VLDB 2022 Best Regular Research Paper Award, and the DASFAA 2020 Best Student Paper Award.He is a distinguished member of CCF, senior member of ACM, senior member of IEEE. NOTE: I'm looking for highly self-motivated students to work with me as PhD and/or master students (Fall 2026). Candidates who are interested please contact me directly. Research InterestsLarge-scale Graph Processing & Analysis, Large-scale Graph Learning, Network/Graph RepresentationPublicationsArticles on [Google Scholar], [DBLP] or here.Academic ServicesSelected Conference PC MembershipVLDB: 2019, 2022 (Demo PC), 2023, 2024ICDE: 2022, 2023，2025KDD: 2019, 2020, 2021, 2022, 2023, 2024, 2025AAAI: 2019, 2021，2022 (SPC), 2023 (SPC), 2024 (SPC)IJCAI: 2018, 2019, 2020, 2021 (SPC), 2022, 2023 DASFAA: 2020 (Publicity Co-Chair), 2021, 2022, 2023 (Publication Co-Chair), 2024PAKDD: 2023 (SPC), 2024 (SPC) Journal ReviewersVLDBJ, TKDE, TPDS, TNNLS, TBD, TM, TNet, WWWJ, DSEResearch GrantsResearch on Key Technologies of Data Processing in Large-Scale Distributed Graph Neural Network Systems. NSFC No. 62272054, 2023-2026Research on Key Techniques of Knowledge Graph-Based Social Media Management and Analysis. NSFC No. U1936104, 2020-2022Querying Similar Nodes on Large-scale Knowledge Graphs. NSFC No. 61702015, 2018-2020Ad-hoc Generation of Weighted Graph with Complex Relation on Large-scale Knowledge Graph. China Postdoctoral Science Foundation No. 2017M610020, 2017-2018",
  "content_length": 2309,
  "method": "requests",
  "crawl_time": "2025-12-01 14:51:39"
}