{
  "name": "Yingxue Zhang 0002",
  "homepage": "https://www.binghamton.edu/computer-science/people/profile.html?id=yzhang42",
  "status": "success",
  "content": "Yingxue Zhang - Our Faculty | School of Computing | Binghamton University Skip to main content School of Computing Our Faculty Yingxue Zhang Assistant Professor School of Computing yzhang42@binghamton.edu EB N04 BackgroundZhang is an assistant professor in the School of Computing at Binghamton University. She got her PhD in data science from Worcester Polytechnic Institute in 2022. Her broad research interests include: Designing novel data mining, machine learning and AI techniques to solve spatial-temporal big data analytics problems related to smart cities and public safetyHuman behavior analysis and decision-making Website Publications Yingxue Zhang, Yanhua Li, Xun Zhou, Zhenming Liu, Jun Luo (2021). C3-GAN: Complex-Condition-Controlled Urban Traffic Estimation through Generative Adversarial Networks. In 2021 IEEE International Conference on Data Mining (ICDM 2021).Yingxue Zhang, Yanhua Li, Xun Zhou, Jun Luo, Zhi-Li Zhang (2021). Urban Traffic Dynamics Prediction---A Continuous Meta-Learning Approach. In ACM Transactions on Intelligent Systems and Technology (TIST).Han Bao, Xun Zhou, Yiqun Xie, Yingxue Zhang, Yanhua Li (2021). COVID-GAN+: Estimating Human Mobility Responses to COVID-19 through Spatio-Temporal Generative Adversarial Networks with Enhanced Features. In ACM Transactions on Intelligent Systems and Technology (TIST).Yingxue Zhang, Yanhua Li, Xun Zhou, Jun Luo (2020). cST-ML: Continuous Spatial-Temporal Meta-Learning for Traffic Dynamics Prediction. In 2020 IEEE International Conference on Data Mining (ICDM).Yingxue Zhang, Yanhua Li, Xun Zhou, Xiangnan Kong, Jun Luo (2020). Off-Deployment Traffic Estimation — A Traffic Generative Adversarial Networks Approach. In IEEE Transactions on Big Data.Han Bao, Xun Zhou, Yingxue Zhang, Yanhua Li, Yiqun Xie (2020). COVID-GAN: Esti-mating Human Mobility Responses to COVID-19 Pandemic through Spatio-Temporal Conditional GenerativeAdversarial Networks. In Proceedings of the 28th ACM SIGSPATIAL International Conference on Advances inGeographic Information Systems (SIGSPATIAL).Yingxue Zhang, Yanhua Li, Xun Zhou, Xiangnan Kong, Jun Luo (2020). Curb-GAN: Conditional Urban Traffic Estimation through Spatio-Temporal Generative Adversarial Networks. In Proceedings of the 26th ACM SIGKDD Conference on Knowledge Discovery and Data Mining.Yingxue Zhang, Yanhua Li, Xun Zhou, Xiangnan Kong, Jun Luo (2019). TrafficGAN: Off-Deployment Traffic Estimation with Traffic Generative Adversarial Networks. In 2019 IEEE International Conference on Data Mining (ICDM).EducationPhD, Worcester Polytechnic InstituteMS, Stevens Institute of TechnologyBS, Shanghai Jiao Tong UniversityResearch InterestsDeep learningMeta-learningImitation learningSpatial-temporal data mining Return to Top Last Updated: 3/31/25",
  "content_length": 2778,
  "method": "requests",
  "crawl_time": "2025-12-01 14:51:41"
}