{
  "name": "Ying Wen 0001",
  "homepage": "https://yingwen.io",
  "status": "success",
  "content": "Ying Wen Search Ying Wen Associate Professor School of Artificial Intelligence John Hopcroft Center for Computer Science Shanghai Jiao Tong University Biography Ying Wen is now a tenure-track associate professor in School of Artificial Intelligence and John Hopcroft Center, Shanghai Jiao Tong University. His research interests include deep reinforcement learning, multi-agent systems, game theory and machine learning systems. He received his PhD in the Department of Computer Science, University College London in 2020. Before that, Ying earned his MRes(Master of Research) with Distinction Honor from University College London in 2016 and B.Eng. with First Class Honor from Queen Mary, University of London and Beijing University of Posts and Tel. in 2015. He was an intern at Huawei, MediaGamma, Amazon and Baidu. Recent News Selected preprints. Language Games as the Pathway to Artificial Superhuman Intelligence. Rema: Learning to meta-think for llms with multi-agent reinforcement learning. Natural language reinforcement learning. Openr: An open source framework for advanced reasoning with large language models. A survey of ai agent protocols. AT-Drone: Benchmarking Adaptive Teaming in Multi-Drone Pursuit. [05/25] Two papers get accepted in ACL 2025. Leveraging dual process theory in language agent framework for real-time simultaneous human-AI collaboration. Retrieval-Augmented Process Reward Model for Generalizable Mathematical Reasoning. [02/25] One paper gets accepted in AAAI 2025 RAT: Adversarial Attacks on Deep Reinforcement Agents for Targeted Behaviors. [12/24] Two papers get accepted in AAMAS 2025. PMAT: Optimizing Action Generation Order in Multi-Agent Reinforcement Learning. Unlocking the Potential of Decentralized LLM-based MAS: Privacy Preservation and Monetization in Collective Intelligence. [12/24] Three papers get accepted in NeurIPS 2025. Zsc-eval: An evaluation toolkit and benchmark for multi-agent zero-shot coordination. Reinforcing LLM Agents via Policy Optimization with Action Decomposition. Aligning Individual and Collective Objectives in Multi-Agent Cooperation. [05/24] One paper gets accepted in JAIR. Tackling cooperative incompatibility for zero-shot human-ai coordination. [05/24] Two papers get accepted in ICML 2024. Alphazero-like tree-search can guide large language model decoding and training. DS-Agent: Automated Data Science by Empowering Large Language Models with Case-Based Reasoning. [04/24] One paper gets accepted in SIGIR 2024. TRAD: Enhancing LLM Agents with Step-Wise Thought Retrieval and Aligned Decision. [12/23] One paper gets accepted in AAAI 2024. Critic-guided decision transformer for offline reinforcement learning. [05/23] Two papers get accepted in ICML 2023. Cooperative Open-ended Learning Framework for Zero-shot Coordination. GEAR: a GPU-centric experience replay system for large reinforcement learning models. [04/23] One paper gets accepted in FCS. Large sequence models for sequential decision-making: a survey. [02/23] A white paper about large-scale pre-trained and multi-agent reinforcement learning. Multi-agent Reinforcement Learning in (Open-ended) Multimodal Environments (Chinese Version) [01/23] One paper gets accepted in ICLR 2023. Order Matters: Agent-by-agent Policy Optimization. [04/22] One paper gets accepted in ACL 2022. Cross-Utterance Conditioned VAE for Non-Autoregressive Text-to-Speech. [04/22] One paper gets accepted in IEEE TWC. Multi-Agent Feedback Enabled Neural Networks for Intelligent Communications. [01/22] One paper gets accepted in ICLR 2022. Trust Region Policy Optimisation in Multi-Agent Reinforcement Learning. [09/21] Two papers get accepted in NeurIPS 2021. Towards Unifying Behavioral and Response Diversity for Open-ended Learning in Zero-sum Games. Discovering Multi-Agent Auto-Curricula in Two-Player Zero-Sum Games. [06/21] Open sourced MALib: A Parallel Framework for Population-based Multi-agent Reinforcement Learning Papers gets accepted in JMLR Paper PDF: Paper Link Project Repo: https://github.com/sjtu-marl/malib [05/21] Two papers get accepted in ICML 2021. Learning in Nonzero-Sum Stochastic Games with Potentials. [05/21] Awarded a Grant from the Shanghai Sailing Program, by STCSM. [01/21] One paper gets accepted in AAMAS 2021. Diverse Auto-Curriculum is Critical for Successful Real-World Multiagent Learning Systems. Best Paper Award, Blue Sky Ideas Track. [01/21] One paper gets accepted in ICC 2021. [11/20] One paper gets accepted in CoRL 2020. SMARTS: An Open-Source Scalable Multi-Agent RL Training School for Autonomous Driving. Best System Paper Award. [06/20] One paper gets accepted in ICML 2020. Multi-Agent Determinantal Q-Learning. [05/20] One paper gets accepted in IJCAI 2020. Modelling Bounded Rationality in Multi-Agent Interactions by Generalized Recursive Reasoning. Selected Publications Quickly discover relevant content by filtering publications. Ming Zhou, Ziyu Wan, Hanjing Wang, Muning Wen, Runzhe Wu, Ying Wen, Yaodong Yang, Weinan Zhang, Jun Wang. MALib: A Parallel Framework for Population-based Multi-agent Reinforcement Learning. Preprint, 2021. PDF Cite Code Project Yaodong Yang, Jun Luo, Ying Wen, Oliver Slumbers, Daniel Graves, Haitham Bou Ammar, Jun Wang, Matthew E. Taylor. Diverse Auto-Curriculum is Critical for Successful Real-World Multiagent Learning Systems. Blue Sky Track, AAMAS, Best Paper Award, 2021. Cite PDF Ying Wen, Yaodong Yang, Liheng Chen, Jun Wang, Kun Shao, David Mguni, Weinan Zhang. Multi-Agent Determinantal Q-Learning. ICML, 2020. Cite Code Arxiv Ying Wen, Yaodong Yang, Rui Luo, Jun Wang. Modelling Bounded Rationality in Multi-Agent Interactions by Generalized Recursive Reasoning. IJCAI, 2020. PDF Cite Ying Wen, Yaodong Yang, Rui Luo, Jun Wang, Wei Pan. Probabilistic Recursive Reasoning for Multi-Agent Reinforcement Learning. ICLR, 2019. Preprint PDF Cite Code Poster See all publications Projects * All Multi-Agent Learning MALib A Muti-agent Learning Framework. SMARTS Scalable Multi-Agent RL Training School. Contact ying.wen@sjtu.edu.cn 800 Dongchuan Road, Minghang, Shanghai, Shanghai, 200240 Cite × Copy Download",
  "content_length": 6137,
  "method": "requests",
  "crawl_time": "2025-12-01 14:51:33"
}