{
  "name": "Yinghuan Shi",
  "homepage": "http://cs.nju.edu.cn/shiyh",
  "status": "success",
  "content": "Yinghuan Shi (史颖欢) - Yinghuan Shi HomePage About Me Hi, I am Yinghuan. I received my B.Sc. and Ph.D. degree both in Computer Science at Nanjing University in 2007 and 2013, respectively. Currently, I am a Professor in the Department of Computer Science and Technology at Nanjing University, and a member of the National Key Laboratory for Novel Software Technology. Also, I am a member of the Reasoning and Learning Research Group, led by Prof. Yang Gao. In 2011-2012, I visited the IDEA Lab of the University of North Carolina at Chapel Hill (UNC) under the support from the China Scholarship Council (CSC), and worked with Prof. Dinggang Shen. In 2016, I returned to the IDEA Lab for a three months visiting. Also, I spent two months in 2014 as a Visiting Scholar at the Data Science Lab of the University of Technology, Sydney (UTS), working with Prof. Longbing Cao. Currently, our interests lie broadly in machine learning, pattern recognition, computer vision, and medical image analysis. Specifically, we have been focusing on developing theories, models, and methods for semi-supervised learning, weakly-supervised learning, domain adaptation, and domain generalization. Our goal is to create efficient and effective solutions to these challenges. We have also been developing machine learning-based tools to help address data analysis problems in medical imaging and clinical data. We hope that these tools can contribute towards building real-world systems for use in clinical scenarios. Chinese Version (中文简介) News 课题组2026年招收名额目前还有1位联合培养博士与3位联合培养硕士（科研地点均为鼓楼，以智能医疗系统工程研发为主）。欢迎有意申请的同学通过邮件提交材料，包括个人简历、成绩单和简要的研究计划说明。邮件中请注明报考类型（博士/硕士），并务必同时抄送给李泽昆（lizekun@smail.nju.edu.cn）。 [Sept, 2025] 祝贺姝萌入选首届蚂蚁Intech博士生奖学金（2025年仅10位获奖者），丽鹤入选首届蚂蚁Intech博士生奖学金Future. (Congratulations to Shumeng on being selected for Ant Intech PhD Scholarship. Congratulations to Lihe on being selected for Ant Intech PhD Scholarship Future.) [Sept, 2025] One paper about multi model learning for bimetallic materials has been accepted by Chemical Science. Congratulations to Maochen. [Sept, 2025] One paper has been accepted by TIP 2025. Congratulations to Yue. [Aug, 2025] 祝贺桂冠毕业论文入选2025年度南京大学优秀硕士论文. (Guan was awarded by a Excellent Master Thesis of Nanjing University). [Aug, 2025] 课题组牵头获批国家自然科学基金重点项目. (Granted by NSFC Key Project). [Aug, 2025] 张剑博士获批国家自然科学基金青年科学基金项目. (Jian has been granted by NSFC Young Scientists Fund). [Aug, 2025] 张剑博士获批江苏省自然科学基金青年项目. (Jian has been granted by JSNSF Young Scientists Fund). [Aug, 2025] 课题组牵头获批江苏省前沿技术研发计划项目. (Granted by Jiangsu Frontier Technology R&D Project). [July, 2025] One paper has been accepted by TMI 2025. Congratulations to Shumeng. [July, 2025] 祝贺段岳入选2025年度中国电子学会—腾讯博士生科研激励计划（混元大模型专项）. [July, 2025] One paper has been accepted by ACM MM 2025. Congratulations to Luyang. [July, 2025] One paper has been accepted by Pattern Recognition 2025. Congratulations to Ruofan. [Jun, 2025] Two papers have been accepted by ICCV 2025. Congratulations to Yue and Haoran. [Jun, 2025] Two papers have been accepted by MICCAI 2025. Congratulations to Ruofan and Shumeng. [Jun, 2025] 祝贺段岳入选2025年度腾讯犀牛鸟精英人才计划. [Jun, 2025] 祝贺雅元与鼓楼医院毕艳院长团队合作的工作被医学期刊 Military Medical Research（SCI一区，影响因子22.9）录用. [May, 2025] One paper has been accepted by TMI 2025. Congratulations to Qinghe. [May, 2025] One paper has been accepted by TIP 2025. Congratulations to Luyang. [Apr, 2025] Two papers have been accepted by TMI 2025. Congratulations to You and Zihan. [Mar, 2025] Two papers have been accepted by TMI 2025. Congratulations to Shumeng and Haoran. [Feb, 2025] We have 3 papers accepted by CVPR 2025. Congratulations to Maochen, Xiran, Qinghe and all the collaborators. [Jan, 2025] One paper has been accepted by ICLR 2025. Congratulations to Ze. [Jan, 2025] 祝贺金涛入选首届中国科协青年人才托举工程博士生专项（托举学会：中国人工智能学会）. [Dec, 2024] 祝贺段岳获批国家自然科学基金青年学生基础研究项目（博士研究生）. [Dec, 2024] 祝贺段岳获批2024年度南京大学研究生栋梁奖学金特等奖. [Dec, 2024] 祝贺课题组2位同学入选2024年度南京大学优秀研究生标兵，5位同学入选优秀研究生. [Dec, 2024] One paper has been accepted by AAAI 2025. Congratulations to Yayuan. [Sept, 2024] 史颖欢获得第四届南京大学教师教学竞赛优秀奖. [Sept, 2024] One paper has been accepted by NeurIPS 2024. Congratulations to Jintao. [Sept, 2024] 祝贺泰财获得2024年度南京大学小米特等奖学金. [Sept, 2024] 祝贺泽昆获得2024年博士研究生创新引领计划-创优项目. [Sept, 2024] One paper has been accepted by TIP. Congratulations to Jintao. [July, 2024] Two papers have been accepted by ECCV 2024. Congratulations to Jiajun and Muyang. [Jun, 2024] 祝贺桂冠、王娜获得2024年度南京大学计算机科学与技术系优秀硕士论文奖(提名奖). (Congratulations to Gui Guan and Wang Na for Excellent Master Thesis (Nominee) of Department of Computer Science and Technology of Nanjing University.) [May, 2024] 史颖欢获得2024年度南京大学青年五四奖章. [Apr, 2024] Two papers about Domain Generalization and Semi-Supervised Medical Image Segmentation have been accepted by TKDE and CVPR 2024. Congratulations to Jian and Qinghe. [Feb, 2024] One paper has been accepted by TKDE. Congratulations to Zekun. Recent Publication Yue Duan, Lei Qi, Yinghuan Shi, Yang Gao. “ An Adaptor for Triggering Semi-supervised Learning to Out-of-Box Serve Deep Image Clustering. ” IEEE Transactions on Image Processing (TIP), 2025. Shumeng Li, Jian Zhang, Lei Qi, Luping Zhou, Yinghuan Shi, Yang Gao. “ Diversity-enhanced Collaborative Mamba for Semi-supervised Medical Image Segmentation. ” IEEE Transactions on Medical Imaging (TMI), 2025. [Code] Haoran Wang, Zekun Li, Jian Zhang, Lei Qi, Yinghuan Shi. “ Correspondence as Video: Test-Time Adaption on SAM2 for Reference Segmentation in the Wild. ” IEEE/CVF International Conference on Computer Vision (ICCV), 2025. [Code] Yue Duan, Taicai Chen, Lei Qi, Yinghuan Shi. “ Divide-and-Conquer for Enhancing Unlabeled Learning, Stability, and Plasticity in Semi-supervised Continual Learning. ” IEEE/CVF International Conference on Computer Vision (ICCV), 2025. [Code] Luyang Cao, Han Xu, Jian Zhang, Lei Qi, Jiayi Ma, Yinghuan Shi, Yang Gao. “ Towards Perfection: Building Inter-component Mutual Correction for Retinex-based Low-light Image Enhancement. ” ACM Conference on Multimedia (ACM MM), 2025. [Code] Qinghe Ma, Jian Zhang, Lei Qi, Qian Yu, Yinghuan Shi, Yang Gao. “ Unleashing the Power of Intermediate Domains for Mixed Domain Semi-Supervised Medical Image Segmentation. ” IEEE Transactions on Medical Imaging (TMI), 2025. [Code] Luyang Cao, Jianwei Li, Yinghuan Shi. “ Background Matters: A Cross-view Bidirectional Modeling Framework for Semi-supervised Medical Image Segmentation. ” IEEE Transactions on Image Processing (TIP), 2025. [Code] Zihan Cheng, Jintao Guo, Jian Zhang, Lei Qi, Luping Zhou, Yinghuan Shi, Yang Gao. “ Mamba-Sea: A Mamba-based Framework with Global-to-Local Sequence Augmentation for Generalizable Medical Image Segmentation. ” IEEE Transactions on Medical Imaging (TMI), 2025. [Code] You Wang, Zekun Li, Lei Qi, Qian Yu, Yinghuan Shi, Yang Gao. “ Balancing Multi-Target Semi-Supervised Medical Image Segmentation with Collaborative Generalist and Specialists. ” IEEE Transactions on Medical Imaging (TMI), 2025. [Code] Haoran Wang, Lian Huai, Wenbin Li, Lei Qi, Xingqun Jiang, Yinghuan Shi. “ WeakMedSAM: Weakly-Supervised Medical Image Segmentation via SAM with Sub-Class Exploration and Prompt Affinity Mining. ” IEEE Transactions on Medical Imaging (TMI), 2025. [Code] Shumeng Li, Lei Qi, Qian Yu, Jing Huo, Yinghuan Shi, Yang Gao. “ Stitching, Fine-tuning, Re-training: A SAM-enabled Framework for Semi-supervised 3D Medical Image Segmentation. ” IEEE Transactions on Medical Imaging (TMI), 2025. [Code] Qinghe Ma, Jian Zhang, Zekun Li, Lei Qi, Qian Yu, Yinghuan Shi. “ Steady Progress Beats Stagnation: Mutual Aid of Foundation and Conventional Models in Mixed Domain Semi-Supervised Medical Image Segmentation. ” IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR), 2025. [Code] Xiran Wang, Jian Zhang, Lei Qi, Yinghuan Shi. “ Balanced Direction from Multifarious Choices: Arithmetic Meta-Learning for Domain Generalization. ” IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR), 2025. [Code] Maochen Yang, Zekun Li, Jian Zhang, Lei Qi, Yinghuan Shi. “ Taste More, Taste Better: Diverse Data and Strong Model Boost Semi-Supervised Crowd Counting. ” IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR), 2025. [Code] More Papers Visitors",
  "content_length": 8243,
  "method": "requests",
  "crawl_time": "2025-12-01 14:51:37"
}