{
  "name": "Yinpeng Dong",
  "homepage": "https://dongyp13.github.io",
  "status": "success",
  "content": "Yinpeng Dong Yinpeng Dong Assistant Professor College of AI, Tsinghua University Beijing, China, 100084 Email: dongyinpeng@mail.tsinghua.edu.cn; dongyinpeng@gmail.com [Curriculum Vitae] [Google Scholar] [Twitter] [Github] Biography I am an assistant professor of College of AI at Tsinghua University. Previously, I was a postdoctoral researcher in the Department of Computer Science and Technology, Tsinghua University, collaborated with Prof. Jun Zhu. I received my B.E. and Ph. D. degrees from the Department of Computer Science and Technology, Tsinghua University in July, 2017 and January, 2022. My research interests are primarily on machine learning and AI safety. I'm enthusiastic about advancing the scientific understanding of frontier models and algorithms (e.g., large language models, multimodal models, AI alignment, diffusion models) as a foundation for developing safe, reliable, and trustworthy AI/AGI systems. I am looking for highly motivated PhD students and research interns interested in AI theory, algorithms, and safety. News [Nov. 2025] I served as an Area Chair for NeurIPS2025/AAAI2026/ICLR2026. [Dec. 2024] Our workshop Test-time Scaling for Computer Vision has been accepted by CVPR 2025. [Dec. 2024] I will serve as an Area Chair for ICML 2025. [Sep. 2024] I'm invited to give a talk at ECCV 2024 Workshop on The Dark Side of Generative AIs and Beyond. Please find my slide here. [Sep. 2024] I am named in the list of world's top-2% scientists for the single-year (2023) impact released by Stanford/Elsevier. [Aug. 2024] I will serve as an Area Chair for ICLR 2025. [Aug. 2024] Our paper \"Omniview-Tuning: Boosting Viewpoint Invariance of Vision-Language Pre-training Models\" has been selected for an oral presentation at ECCV 2024. Please see more details in our project page. [Jun. 2024] We open-sourced MultiTrust, a comprehensive benchmark to evaluate the trustworthiness of multimodal large language models (MLLMs). Please see more details in our paper and code. [Oct. 2023] I am named in the list of world's top-2% scientists for the single-year impact released by Stanford/Elsevier. [Sep. 2023] Our recent paper shows that multimodal large language models are also vulnerable to adversarial perturbations of images. Our attack leads to 45% success rate against GPT-4V, 22% success rate against Google's Bard, 26% success rate against Bing Chat, and 86% success rate against ERNIE Bot. Code is available. [Dec. 2022] My PhD Thesis \"Adversarial Attacks and Robustness Evaluation in Deep Learning\" (in Chinese) has been selected as the CCF Outstanding Doctoral Dissertation Award. [Oct. 2022] Our paper \"BadDet: Backdoor Attacks on Object Detection\" has been selected as the Best Paper Award in the ECCV 2022 workshop on Adversarial Robustness in the Real World. Publications (* equal contribution; # corresponding author) 2025 Red-Teaming Text-to-Image Systems by Rule-based Preference Modeling Yichuan Cao, Yibo Miao, Xiao-Shan Gao, and Yinpeng Dong# Advances in Neural Information Processing Systems (NeurIPS), San Diego, USA, 2025 Mitigating Overthinking in Large Reasoning Models via Manifold Steering Yao Huang, Huanran Chen, Shouwei Ruan, Yichi Zhang, Xingxing Wei, and Yinpeng Dong# Advances in Neural Information Processing Systems (NeurIPS), San Diego, USA, 2025 DeceptionBench: A Comprehensive Benchmark for AI Deception Behaviors in Real-world Scenarios Yao Huang, Yitong Sun, Yichi Zhang, Ruochen Zhang, Yinpeng Dong, and Xingxing Wei Advances in Neural Information Processing Systems (NeurIPS), San Diego, USA, 2025 STAIR: Improving Safety Alignment with Introspective Reasoning (Oral, Accept rate ~1%) Yichi Zhang, Siyuan Zhang, Yao Huang, Zeyu Xia, Zhengwei Fang, Xiao Yang, Ranjie Duan, Dong Yan, Yinpeng Dong#, and Jun Zhu# International Conference on Machine Learning (ICML), Vancouver, Canada, 2025 Efficient Input-level Backdoor Defense on Text-to-Image Synthesis via Neuron Activation Variation (Highlight, Accept rate ~2%) Shengfang Zhai, Jiajun Li, Yue Liu, Huanran Chen, Zhihua Tian, Wenjie Qu, Qingni Shen, Ruoxi Jia, Yinpeng Dong#, and Jiaheng Zhang International Conference on Computer Vision (ICCV), Honolulu, Hawaii, USA, 2025 AdvDreamer Unveils: Are Vision-Language Models Truly Ready for Real-World 3D Variations? (Highlight, Accept rate ~2%) Shouwei Ruan, Hanqing Liu, Yao Huang, Xiaoqi Wang, Caixin Kang, Hang Su, Yinpeng Dong, and Xingxing Wei International Conference on Computer Vision (ICCV), Honolulu, Hawaii, USA, 2025 Exploring the Generalizability of Factual Hallucination Mitigation via Enhancing Precise Knowledge Utilization Siyuan Zhang, Yichi Zhang, Yinpeng Dong, Hang Su Empirical Methods in Natural Language Processing (EMNLP), Suzhou, China, 2025 Breaking the Ceiling: Exploring the Potential of Jailbreak Attacks through Expanding Strategy Space Yao Huang, Yitong Sun, Shouwei Ruan, Yichi Zhang, Yinpeng Dong#, and Xingxing Wei# The 63rd Annual Meeting of the Association for Computational Linguistics (ACL), Vienna, Austria, 2025 A Comprehensive Study on Robustness of Image Classification Models: Benchmarking and Rethinking Chang Liu*, Yinpeng Dong*, Wenzhao Xiang, Xiao Yang, Hang Su, Jun Zhu, Yuefeng Chen, Yuan He, Hui Xue, and Shibao Zheng International Journal of Computer Vision (IJCV), 2025 Face3DAdv: Exploiting Robust Adversarial 3D Patches on Physical Face Recognition Xiao Yang, Longlong Xu, Tianyu Pang, Yinpeng Dong#, Yikai Wang, Hang Su, and Jun Zhu International Journal of Computer Vision (IJCV), 2025 Real-World Adversarial Defense Against Patch Attacks Based on Diffusion Model Xingxing Wei, Caixin Kang, Yinpeng Dong, Zhengyi Wang, Shouwei Ruan, Yubo Chen, and Hang Su IEEE Transaction on Pattern Analysis and Machine Intelligence (TPAMI), 2025 Distributionally Location-Aware Transferable Adversarial Patches for Facial Images Xingxing Wei, Shouwei Ruan, Yinpeng Dong, Hang Su, and Xiaochun Cao IEEE Transaction on Pattern Analysis and Machine Intelligence (TPAMI), 2025 2024 MultiTrust: A Comprehensive Benchmark Towards Trustworthy Multimodal Large Language Models Yichi Zhang, Yao Huang, Yitong Sun, Chang Liu, Zhe Zhao, Zhengwei Fang, Yifan Wang, Huanran Chen, Xiao Yang, Xingxing Wei, Hang Su, Yinpeng Dong#, and Jun Zhu International Conference on Machine Learning (ICML), Vienna, Austria, 2024 T2VSafetyBench: Evaluating the Safety of Text-to-Video Generative Models Yibo Miao, Yifan Zhu, Lijia Yu, Jun Zhu, Xiao-Shan Gao, and Yinpeng Dong# Advances in Neural Information Processing Systems (NeurIPS) Datasets and Benchmarks Track, Vancouver, Canada, 2024 Diffusion Models are Certifiably Robust Classifiers Huanran Chen, Yinpeng Dong, Shitong Shao, Zhongkai Hao, Xiao Yang, Hang Su, and Jun Zhu Advances in Neural Information Processing Systems (NeurIPS), Vancouver, Canada, 2024 Membership Inference on Text-to-Image Diffusion Models via Conditional Likelihood Discrepancy Shengfang Zhai, Huanran Chen, Yinpeng Dong#, Jiajun Li, Qingni Shen, Yansong Gao, Hang Su, and Yang Liu Advances in Neural Information Processing Systems (NeurIPS), Vancouver, Canada, 2024 Improving Robustness of 3D Point Cloud Recognition from a Fourier Perspective Yibo Miao, Yinpeng Dong#, Jinlai Zhang, Lijia Yu, Xiao Yang, and Xiao-Shan Gao Advances in Neural Information Processing Systems (NeurIPS), Vancouver, Canada, 2024 Omniview-Tuning: Boosting Viewpoint Invariance of Vision-Language Pre-training Models (Oral) Shouwei Ruan, Yinpeng Dong, Liu Hanqing, Yao Huang, Hang Su, and Xingxing Wei European Conference on Computer Vision (ECCV), Milano, Italy, 2024 DIFFender: Diffusion-Based Adversarial Defense against Patch Attacks Caixin Kang, Yinpeng Dong, Zhengyi Wang, Shouwei Ruan, Yubo Chen, Hang Su, and Xingxing Wei European Conference on Computer Vision (ECCV), Milano, Italy, 2024 Natural Language Induced Adversarial Images Xiaopei Zhu, Peiyang Xu, Guanning Zeng, Yinpeng Dong, and Xiaolin Hu ACM International Conference on Multimedia (MM), Melbourne, Australia, 2024 Making Them Ask and Answer: Jailbreaking Large Language Models in Few Queries via Disguise and Reconstruction Tong Liu, Yingjie Zhang, Zhe Zhao, Yinpeng Dong, Guozhu Meng, and Kai Chen 33rd USENIX Security Symposium (USENIX Security '24), Philadelphia, PA, USA, 2024 Robust Classification via a Single Diffusion Model Huanran Chen, Yinpeng Dong, Zhengyi Wang, Xiao Yang, Chengqi Duan, Hang Su, and Jun Zhu International Conference on Machine Learning (ICML), Vienna, Austria, 2024 Efficient Black-box Adversarial Attacks via Bayesian Optimization Guided by a Function Prior Shuyu Cheng, Yibo Miao, Yinpeng Dong#, Xiao Yang, Xiao-Shan Gao, and Jun Zhu International Conference on Machine Learning (ICML), Vienna, Austria, 2024 Machine Vision Therapy: Multimodal Large Language Models Can Enhance Visual Robustness via Denoising In-Context Learning Zhuo Huang, Chang Liu, Yinpeng Dong, Hang Su, Shibao Zheng, and Tongliang Liu International Conference on Machine Learning (ICML), Vienna, Austria, 2024 Toward Availability Attacks in 3D Point Clouds Yifan Zhu, Yibo Miao, Yinpeng Dong, and Xiao-Shan Gao International Conference on Machine Learning (ICML), Vienna, Austria, 2024 Exploring the Transferability of Visual Prompting for Multimodal Large Language Models (Highlight, Accept rate ~2.8%) Yichi Zhang, Yinpeng Dong#, Siyuan Zhang, Tianzan Min, Hang Su, and Jun Zhu IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR), Seattle, USA, 2024 Towards Transferable Targeted 3D Adversarial Attack in the Physical World Yao Huang, Yinpeng Dong#, Shouwei Ruan, Xiao Yang, Hang Su, and Xingxing Wei IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR), Seattle, USA, 2024 Focus on Hiders: Exploring Hidden Threats for Enhancing Adversarial Training Qian Li, Yuxiao Hu, Yinpeng Dong, Dongxiao Zhang, and Yuntian Chen IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR), Seattle, USA, 2024 Rethinking Model Ensemble in Transfer-based Adversarial Attacks Huanran Chen, Yichi Zhang,",
  "content_length": 27087,
  "method": "requests",
  "crawl_time": "2025-12-01 14:51:42"
}