{
  "name": "Yinqian Zhang",
  "homepage": "http://yinqian.org",
  "status": "success",
  "content": "Yinqian Zhang's Homepage Yinqian Zhang (张殷乾） Professor Department of Computer Science and Engineering Research Institute of Trustworthy Autonomous Systems (RITAS) Southern University of Science and Technology (SUSTech) Email: yinqianz at acm dot org My research lab has multiple openings for Research Associate/Assistant Professors, Post-doctoral Researchers, Research/Software Engineers, Research Assistants, Research Interns, please drop me an email for more information. For Ph.D. and Master applicants, please visit the website of SUSTech graduate school and contact me. Short Bios I am a Professor of the Department of Computer Science and Engineering at SUSTech and director of the Information Security Research Center at RITAS and TeeCert Labs of SUSTech. Before joining SUSTech in 2021, I was an Associate Professor of the Department of Computer Science and Engineering at The Ohio State University, where I started my academic career in 2015 and got promoted to tenured Associate Professor in 2019. I received my Ph.D. degree from University of North Carolina at Chapel Hill adviced by Prof. Michael K. Reiter. My research interest lies in the security of computer systems. My current research focus is the security and applications of confidentail computing and trusted execution environments, which broadly involves research on hardware vulnerabilities, microarchitectural side channels, operating systems and virtualization, program analysis, formal verification, crypto protocol design and analysis, blockchain and decentralized computing, machine learning, etc. Publications Top-tier conferences Complete publications list: [by year] [Google scholar] [dblp] Honors and Awards ACM Distinguished Member (2024) IEEE-CS Young Scientist Award, Chinese Computer Federation (2023) Privacy-Preserving Computation Tech Innovators by MIT Technology Review China (2022) Top 2% Scientists Worldwide by Stanford University (2022) AMiner Most Influential Scholar Honorable Mentions (2018-2023) Rising Star Award, Association of Chinese Scholars in Computing (2019) Department of Computer Science and Engineering Outstanding Teaching Award (2019) College of Engineering Lumley Research Award (2019) National Science Foundation CAREER Award (2018) IEEE Conference on Computer Communications (INFOCOM) Distinguished TPC Member Award (2016 & 2017) Google Ph.D. fellowship in Security (2013) IEEE S&P Distinguished Paper Award (2025) DAC Best Paper Award Nominee (2025) Best Practical Paper in Cybersecurity Award (2025) ACM CCS Distinguished Paper Award (2024) ACM CCS Distinguished Paper Award (2023) ACM CCS Test-of-Time Award (2022) ACM CCS Best Paper Awards Honorable Mention (2022) ACM CCS Best Paper Awards Runner-up (2021) Top Picks in Computer Architecture Awards Honorable Mentions (2019) Best of CAL paper (2019 & 2022) Top 10 Finalists of CSAW Best Applied Research Paper Award (2016 & 2018 & 2022) CTO Office Challenge Award at EMC Innovation Conference (2011) Professional Services TPC Chairs: ACM Asia Conference on Computer and Communications Security (ASIACCS) 2025 ACM Cloud Computing Security Workshop (CCSW), 2020, 2021 IEEE International Symposium on Secure and Private Execution Environment Design (SEED), 2021 TPC Area/Track Chairs ACM Conference on Computer and Communications Security (CCS), Software Security Track, 2025 ACM Conference on Computer and Communications Security (CCS), Hardware Security Track, 2024 Journal Editors IEEE Transactions on Dependable and Secure Computing (TDSC), Associate Editor, 2022- ACM Transactions on Privacy and Security (TOPS), Associate Editor, 2024- Conference Steering Committee ACM Cloud Computing Security Workshop (CCSW) IEEE International Symposium on Secure and Private Execution Environment Design (SEED) Award Committee ACM Asia Conference on Computer and Communications Security (ASIACCS) Test-of-Time Award 2025, 2026 Network and Distributed System Security Symposium (NDSS) Test-of-Time Award, 2024 TPC Members: IEEE Symposium on Security and Privacy(S&P), 2016, 2017, 2018, 2020, 2022, 2023 ACM Conference on Computer and Communications Security (CCS), 2015, 2016, 2017, 2018, 2019, 2020, 2022, 2026 USENIX Security Symposium, 2017 Network and Distributed System Security Symposium (NDSS), 2017, 2018, 2019, 2020, 2021 IEEE International Symposium on Secure and Private Execution Environment Design (SEED), 2022 European Symposium on Research in Computer Security (ESORICS), 2021 ACM Asia Conference on Computer and Communications Security (ASIACCS), 2016, 2019, 2020 ACM Conference on Data and Application Security and Privacy (CODASPY), 2023 ACM Cloud Computing Security Workshop (CCSW), 2015, 2016, 2017 International Conference on Information and Communications Security, 2021 International Conference on Applied Cryptography and Network Security, 2022 IEEE Conference on Computer Communications (INFOCOM), 2016, 2017 IEEE International Conference on Cloud Computing Technology and Science (CloudCom), 2015, 2016, 2018 EAI International Conference on Security and Privacy in Communication Networks (SecureComm), 2016 International Conference on Availability, Reliability and Security (ARES), 2012, 2013 International Conference on Cryptology And Network Security (CANS), 2017 World Conference on Information Security Applications (WISA), 2017, 2018 Microarchitecture Security Conference (uASC), 2026 Members of Teecert Labs: Postdoc: Yusi Feng (Ph.D., Chinese Academy of Science, 2025 -) Ke Jiang (Ph.D., Nanyang Technological University, 2025 -) Ph.D. Students: Yinshuai Li (SUSTech) Zhiyuan Sun (SUSTech & PolyU, co-advised with Prof. Xiaopu Luo) Guanlong Wu (SUSTech) Jinyi Xian (SUSTech, co-advised with Prof. Fengwei Zhang) Ju Yang (SUSTech) Junlin Yang (SUSTech) Yuke Peng (SUSTech) Han Wang (SUSTech) Master Students: Tong Liu (SUSTech) Hong Zhu (SUSTech) Qingzhe Bing (SUSTech) Kaiyuan Zhang (SUSTech) Shubo Peng (SUSTech) Zhaohan Li (SUSTech) Junjie Chen (SUSTech) Dahui Li (SUSTech) Yang Zhang (SUSTech) Visiting Students: Jinyan Xu (Zhejiang University, 2023-) Research Assistants & Interns: Yakun Wu (2024 -) Alumni: Jianyu Niu (Research Assistant Professor 2021-2025, Now with City University of Hong Kong Guoxing Chen (OSU Ph.D., 2019, Asst Prof. at Shanghai Jiao Tong University, co-advised with Prof. Steve Lai) Yuan Xiao (OSU Ph.D., 2020, Intel Labs) Sanchuan Chen (OSU Ph.D., 2021, Asst Prof. at Fordham University, co-advised with Prof. Zhiqiang Lin) Wubing Wang (OSU, Ph.D., 2021, Researcher at DAS-Security, Co-advised with Prof. Zhiqiang Lin) Xiaokuan Zhang (OSU, Ph.D., 2021, Asst Prof. at George Mason University as of Fall 2022) Mengyuan Li (OSU, Ph.D., 2022, Asst. Prof. at University of Southern California as of Fall 2024) Mengya Zhang (OSU, Ph.D., 2024, Meta as of 2024, co-advised with Prof. Zhiqiang Lin) Mohit Kumar Jangid (OSU, Ph.D. Asst Prof. at Indian Institute of Technology (IIT) Jodhpur as of fall 2025, co-advised with Prof. Zhiqiang Lin) Sen Deng (Master Student, 2020-2023, Ph.D. student at Hong Kong University of Science and Technology) Weili Wang (Master Student, 2020-2023, Ph.D. student at Duke University) Shuai Zhou (Master Student, 2021-2024, Software Engineer) Minjie Wang (Master Student, 2021-2025) Yining Tang (Master Student, 2022-2025, Research Engineer) Pinshen Xu (Master Student, 2022-2025, Ph.D. student at City University of Hong Kong) Hanzheng Lyu (Visiting Student, 2022-2023, Ph.D. student at University of British Columbia) Yinxi Liu (Visiting Student, 2023-2024, Ph.D. student at Chinese University of Hong Kong) Jie Wang (Visiting Student, 2022-2024, Ph.D. student at Wuhan University) Jiuqin Zhou (Research Assistant, 2020-2021, Ph.D. student at Chinese University of Hong Kong as of Fall 2021) Shixuan Zhao (Research Assistant, 2021-2022, Ph.D. student at The Ohio State University as of Fall 2021) Xingyu Lyu (Research Assistant, 2021-2022, Ph.D. student at University of Massachusetts, Lowell as of Fall 2022) Guanlong Wu (Research Assistant, 2022-2023, Ph.D. student at SUSTech as of Fall 2023) Jinyi Xian (Research Assistant, 2022-2023, Ph.D. student at SUSTech as of Fall 2023) Qingyang Zhou (Research Assistant, 2022-2023, Ph.D. student at Waterloo University as of Fall 2023) Jianquan Cai (Research Assistant, 2023-2024, Ph.D. student at Chinese University of Hong Kong as of Fall 2024) Weijie Chen (Research Assistant, 2023-2024, Ph.D. student at Huazhong University of Science and Technology as of Fall 2024) Wei Peng (Research Assistant, 2021-2024)",
  "content_length": 8501,
  "method": "requests",
  "crawl_time": "2025-12-01 14:51:42"
}