{
  "name": "Yinxi Liu",
  "homepage": "https://yinxi.site",
  "status": "success",
  "content": "Yinxi Liu GCI-3781 1 Kimball Dr Henrietta, NY 14623 I am an Assistant Professor in the Department of Cybersecurity at Rochester Institute of Technology, where I am affiliated with the Global Cybersecurity Institute and participate as a faculty member in the Computing and Information Sciences Ph.D. program. I received my Ph.D. degree in Computer Science and Engineering from The Chinese University of Hong Kong. 💡 I aim to ignite a beacon for vulnerability discovery in the sea of program states and execution paths. My research provides (in)formal models of undesirable behaviors in various programs, significantly reducing the complexities involved in analyzing these programs for certain security risks. This leads to a broad array of related topics in computer security, programming languages, software engineering, and algorithms & complexity, such as security audit, program analysis, test-input generation, and worst-case complexity of algorithms. openings I seek motivated students with solid programming skills to work with for at least 6 months, kindly read my letter to prospective students if you are interested. Apart from doing research, I engage in regular workouts and also take pleasure in practicing Chinese calligraphy as a form of meditation. selected publications SP’21 Revealer: Detecting and Exploiting Regular Expression Denial-of-Service Vulnerabilities Yinxi Liu, Mingxue Zhang, and Wei Meng In 2021 IEEE Symposium on Security and Privacy (SP), 2021 CCS’22 Acquirer: A Hybrid Approach to Detecting Algorithmic Complexity Vulnerabilities Yinxi Liu, and Wei Meng In 2022 ACM SIGSAC Conference on Computer and Communications Security (CCS), 2022 CCS’23 DSFuzz: Detecting Deep State Bugs with Dependent State Exploration Yinxi Liu, and Wei Meng In 2023 ACM SIGSAC Conference on Computer and Communications Security (CCS), 2023 FSE’25 Detecting Smart Contract State-Inconsistency Bugs via Flow Divergence and Multiplex Symbolic Execution Yinxi Liu, Wei Meng, and Yinqian Zhang In 2025 ACM International Conference on the Foundations of Software Engineering (FSE), 2025",
  "content_length": 2090,
  "method": "requests",
  "crawl_time": "2025-12-01 14:51:44"
}