{
  "name": "Yipeng Zhou",
  "homepage": "https://sites.google.com/site/yipenghomepage",
  "status": "success",
  "content": "Yipeng HomepageSearch this siteEmbedded FilesSkip to main contentSkip to navigationYipeng Zhou's HomeDr Yipeng Zhou is a senior lecturer in the School of Computing at Macquarie University (MQ). He earned his PhD from The Chinese University of Hong Kong, and his BS degree from the University of Science and Technology of China. Dr Zhou was awarded the 2023 Macquarie University Vice-Chancellor's Research Excellence Award and the 2023 IEEE Open Journal of the Communications Society Best Editor Award. He was also the recipient of the 2018 Australia Research Council Discovery Early Career Researcher Award. Currently, he serves as an associate editor for IEEE Transactions on Cloud Computing and Springer Nature Scientific Reports. His research interests include federated learning, data privacy preservation, and medical data analysis. Dr. Zhou has published over 150 papers in leading venues, including ICML, INFOCOM, IJCAI, AAAI, TheWebConf, ICNP, ToN, TDSC, JSAC, TPDS, and TMC.Research Interest:large language modelsfederated learningdata privacy-preservationnetworkingMy Google Scholar LinkContact Information:Mailing Address: Room 371, 4 Research Park Drive, Macquarie Park, 2119, North RydeEmail: yipeng.zhou  at mq.edu.au Awards:Best Editor Award, IEEE Open Journal of the Communications Society, 2023Vice Chancellor's Research Excellence Awards, Macquarie University, 2023Discover Early Career Researcher Award, Australia Research Council, 2018Early Career Research Networking Award, University of South Australia, 201719th place in the world final of the ACM   International Collegiate Programming Contest (ACM/ICPC), San Antonio, Texas, USA, 2006.6th place in ACM/ICPC Regional Contest, Beijing China, 2005.Publications (List)Students and Visiting ScholarsBehnaz Soltani, PhD at MQ 2021.11-present (Rising Star, School of Computing, MQ)Shazia Riaz, visiting PhD 2023.4-2023.11Chonghe Zhao, visiting PhD 2023.7-2024.6  (Rising Star, School of Computing, MQ)Saqr Thabet, PhD at MQ 2023.9-presentZekun Xu, visiting PhD 2023.9-2024.9Xianzhi Zhang, visiting PhD 2024.4-2025.8 (Rising Star, School of Computing, MQ)Prof Shengli Zhang, visiting scholar 2024.8-2025.8Nader Awad, Honours student at MQ 2025.2-2026.02Vichayuth Ngamsittipong, visiting student from Mohidol University in Thailand, 2025.05-2025.08Jakkaphat Jumratboonsom, visiting student from Mohidol University in Thailand, 2025.05-2025.08Xubin Chen, MRes student at MQ 2025.7-2026.7Pallika Kafle, Honours student at MQ 2025.08-2026.07Adya Saanv,  Honours student at MQ 2025.08-2026.07Google SitesReport abusePage detailsPage updated Google SitesReport abuse",
  "content_length": 2627,
  "method": "requests",
  "crawl_time": "2025-12-01 14:51:43"
}