{
  "name": "Yiqun Wang 0001",
  "homepage": "https://sites.google.com/view/yiqun-wang/home",
  "status": "success",
  "content": "Yi-Qun Wang's HomeSearch this siteEmbedded FilesSkip to main contentSkip to navigationYi-Qun Wang (王逸群)BiographyI am currently an Associate Professor at the College of Computer Science, Chongqing University. Before that, I was a Postdoctoral Research Fellow in the Professor Peter Wonka group at the Visual Computing Center (VCC) in King Abdullah University of Science and Technology (KAUST). I received my Ph.D. from the National Laboratory of Pattern Recognition (NLPR), Institute of Automation, Chinese Academy of Sciences (CASIA), and University of Chinese Academy of Sciences (UCAS). My supervisors were Professor Xiaopeng Zhang and Professor Dong-Ming Yan. Previously, I received my Bachelor's degree from Chongqing University in 2016. Research Interests: Computer Graphics, Geometric Learning, and 3D Vision.I'm constantly on the lookout for driven PhD/Master students who are self-motivated, as well as research interns, whether they prefer working remotely or on-site.Welcome to view my CV,  Google Scholar  (full publications) and Chinese website (中文主页, 学院主页)cv-wangyiqun.pdfSelected PublicationsPET-NeuS: Positional Encoding Tri-planes for Neural Surfaces[code] [project]Yiqun Wang, Ivan Skorokhodov, Peter Wonka IEEE Conference on Computer Vision and Pattern Recognition (CVPR), 2023 HF-NeuS: Improved Surface Reconstruction Using High-Frequency Details[code] [project]Yiqun Wang, Ivan Skorokhodov, Peter Wonka Advances in Neural Information Processing Systems (NeurIPS), 2022EpiGRAF: Rethinking training of 3D GANs[code] [project]Ivan Skorokhodov, Sergey Tulyakov, Yiqun Wang, Peter Wonka Advances in Neural Information Processing Systems (NeurIPS), 2022MGCN: Descriptor Learning using Multiscale GCNs[code] [slides]Yiqun Wang, Jing Ren, Dong-Ming Yan, Jianwei Guo, Xiaopeng Zhang, Peter Wonka ACM Transactions on Graphics (TOG) (Proceedings of SIGGRAPH), 39, 4, Article 1 (July 2020)A Robust Local Spectral Descriptor for Matching Non-Rigid Shapes with Incompatible Shape Structures     [supp][project][code, matlab code]Yiqun Wang,  Jianwei Guo, Dong-Ming Yan, Kai Wang, Xiaopeng ZhangIEEE Conference on Computer Vision and Pattern Recognition (CVPR), 2019: 6231-6240.Isotropic Surface Remeshing without Large and Small Angles     [supp][project][data]Yiqun Wang,  Dong-Ming Yan, Xiaohan Liu, Chengcheng Tang, Jianwei Guo, Xiaopeng Zhang, Peter WonkaIEEE Transactions on Visualization and Computer Graphics (TVCG), 2019, 25(7):2430-2442.A Wavelet Energy Decomposition Signature for Robust Non-Rigid Shape Matching   [matlab code]Yiqun Wang,  Jianwei Guo, Jun Xiao, Dong-Ming YanSIGGRAPH Asia Posters, ACM, 2019, 9.Obtuse Triangle Elimination for Isotropic RemeshingYiqun Wang, Dong-Ming Yan, Chengcheng Tang, Xiaohan LiuSIGGRAPH Posters, ACM, 2017, 81.High-quality 2D Mesh Generation without Obtuse and Small AnglesDawar Khan, Dong-Ming Yan, Yiqun Wang, Kaimo Hu, Juntao Ye, Xiaopeng ZhangComputers and Mathematics with Applications, 2018, 75(2):582-595.Obtuse triangle removal for 2D mesh generationDawar Khan, Dong-Ming Yan, Yiqun Wang, Juntao Ye, Xiaopeng ZhangSIGGRAPH Asia Posters, ACM, 2016, 31.Google SitesReport abuseGoogle SitesReport abuse",
  "content_length": 3164,
  "method": "requests",
  "crawl_time": "2025-12-01 14:51:45"
}