{
  "name": "Yiqun Liu 0001",
  "homepage": "http://www.thuir.cn/group/~yqliu",
  "status": "success",
  "content": "Yiqun Liu | Home Yiqun Liu yiqunliu AT tsinghua.edu.cn Follow Location Weibo Github Google Scholar English Resume Chinese Resume Our paper \"Explicit factor models for explainable recommendation based on phrase-level sentiment analysis\" won the Test of Time Award at SIGIR 2024. Our paper \"Scaling Laws For Dense Retrieval\" won the Best Paper Award at SIGIR 2024. I serve as Steering Committee co-Chair for SIGIR-AP. I served as co-chair for SIGIR 2024 Short Paper Track and PC for Perspectives/DC/Tutorial papers. I was recognized as a member of the ACM SIGIR Academy for \"significant, cumulative contributions to the development of the field of information retrieval\". I serve as General Co-chair of NTCIR-18. I am on the editorial board of JASIST and Information Retrieval Journal. From 2017 to 2024, I serve as co-Editor-in-Chief of Foundations and Trends@ in Information Retrieval. Selected Publications IN THE YEAR OF 2025 Changyue Wang, Weihang Su, Qingyao Ai, Yiqun Liu. Joint Evaluation of Answer and Reasoning Consistency for Hallucination Detection in Large Reasoning Models. The 40th Annual AAAI Conference on Artificial Intelligence (AAAI 2026) Preprint Version. Junjie Chen, Weihang Su, Zhumin Chu, Haitao Li, Yujia Zhou, Dingbo Yuan, Xudong Wang, Jun Zhou, Yiqun Liu, Min Zhang, Shaoping Ma, Qingyao Ai. Auto-PRE: An Automatic and Cost-Efficient Peer-Review Framework for Language Generation Evaluation. The 40th Annual AAAI Conference on Artificial Intelligence (AAAI 2026) Preprint Version. Junjie Chen, Haitao Li, Minghao Qin, Yujia Zhou, Yanxue Ren, Wuyue Wang, Yiqun Liu, Yueyue Wu, Qingyao Ai. Simulating Dispute Mediation with LLM-Based Agents for Legal Research. The 40th Annual AAAI Conference on Artificial Intelligence (AAAI 2026) Preprint Version. Yujia Zhou, Hexi Wang, Qingyao Ai, Zhen Wu, Yiqun Liu. Investigating Prosocial Behavior Theory in LLM Agents under Policy-Induced Inequities. The 40th Annual AAAI Conference on Artificial Intelligence (AAAI 2026) Preprint Version. Haitian Chen, Qingyao Ai, Xiao Wang, Yiqun Liu, Fen Lin, Qin Liu. Unsupervised dense retrieval with conterfactual contrastive learning. The 19th ACM International Conference on Web Search and Data Mining (WSDM 2026) Preprint Version. Qian Dong, Jia Chen, Qingyao Ai, Hongning Wang, Haitao Li, Yi Wu, Yao Hu, Yiqun Liu, Shaoping Ma. SelfRACG: Enabling LLMs to Self-Express and Retrieve for Code Generation. The 2025 Conference on Empirical Methods in Natural Language Processing (EMNLP 2025) Preprint Version. Bangde Du, Ziyi Ye, Zhijing Wu, Monika A. Jankowska, Shuqi Zhu, Qingyao Ai, Yujia Zhou, Yiqun Liu. SimVBG: Simulating Individual Values by Backstory Generation. The 2025 Conference on Empirical Methods in Natural Language Processing (EMNLP 2025) Preprint Version. Changyue Wang, Weihang Su, Qingyao Ai, Yichen Tang, Yiqun Liu. Knowledge Editing through Chain-of-Thought. The 2025 Conference on Empirical Methods in Natural Language Processing (EMNLP 2025) Preprint Version. Yichen Tang, Weihang Su, Yujia Zhou, Yiqun Liu, Min Zhang, Shaoping Ma, Qingyao Ai. Augmenting Multi-Agent Communication with State Delta Trajectory. The 2025 Conference on Empirical Methods in Natural Language Processing (EMNLP 2025) Preprint Version. Changyue Wang, Weihang Su, Qingyao Ai, Yujia Zhou, Yiqun Liu. Decoupling Reasoning and Knowledge Injection for In-Context Knowledge Editing. The 63nd Annual Meeting of the Association for Computational Linguistics (ACL 2025) Preprint Version. Haitao Li, Junjie Chen, Jingli Yang, Qingyao Ai, Wei Jia, Youfeng Liu, Kai Lin, Yueyue Wu, Guozhi Yuan, Yiran Hu, Wuyue Wang, Yiqun Liu, Minlie Huang. LegalAgentBench: Evaluating LLM Agents in Legal Domain. The 63nd Annual Meeting of the Association for Computational Linguistics (ACL 2025) Preprint Version. Haitao Li, Junjie Chen, Qingyao Ai, Zhumin Chu, Yujia Zhou, Qian Dong, Yiqun Liu. CalibraEval: Calibrating Prediction Distribution to Mitigate Selection Bias in LLMs-as-Judges. The 63nd Annual Meeting of the Association for Computational Linguistics (ACL 2025) Preprint Version. Bangde Du, Ziyi Ye, Monika Jankowska, Zhijing Wu, Qingyao Ai, Yujia Zhou, Yiqun Liu. EEG reveals the cognitive impact of polarized content in short video scenarios. Scientific Reports. Preprint Version. Yiteng Tu, Weihang Su, Yujia Zhou, Yiqun Liu, Qingyao Ai. Robust Fine-tuning for Retrieval-Augmented Generation against Retrieval Defects. The 48th International ACM SIGIR Conference on Research and Development in Information Retrieval (SIGIR 2025) Preprint Version. Shuqi Zhu, Ziyi Ye, Yi Zhong, Qingyao Ai, Yujia Zhou, Yiqun Liu. Brain Image Reconstruction with Retrieval-Augmented Diffusion. The 48th International ACM SIGIR Conference on Research and Development in Information Retrieval (SIGIR 2025) Preprint Version. Weihang Su, Yichen Tang, Qingyao Ai, Junxi Yan, Changyue Wang, Hongning Wang, Ziyi Ye, Yujia Zhou, Yiqun Liu. Parametric Retrieval Augmented Generation. The 48th International ACM SIGIR Conference on Research and Development in Information Retrieval (SIGIR 2025) Preprint Version. Bangde Du, Ziyi Ye, Zhijing Wu, Monika Jankowska, Qingyao Ai, Yiqun Liu. Understanding the Effect of Opinion Polarization in Short Video Browsing. The 48th International ACM SIGIR Conference on Research and Development in Information Retrieval (SIGIR 2025) Preprint Version. Jia Chen*, Qian Dong*, Haitao Li, Xiaohui He, Yan Gao, Shaosheng Cao, Yi Wu, Ping Yang, Chen Xu, Yao Hu, Qingyao Ai, Yiqun Liu. Qilin: A Multimodal Information Retrieval Dataset with APP-level User Sessions. The 48th International ACM SIGIR Conference on Research and Development in Information Retrieval (SIGIR 2025) Preprint Version. Haitao Li, Yifan Chen, Yiran Hu, Qingyao Ai, Junjie Chen, Xiaoyu Yang, Jianhui Yang, Yueyue Wu, Zeyang Liu, Yiqun Liu. LexRAG: Benchmarking Retrieval-Augmented Generation in Multi-Turn Legal Consultation Conversation. The 48th International ACM SIGIR Conference on Research and Development in Information Retrieval (SIGIR 2025) Preprint Version. Weihang Su, Baoqing Yue, Qingyao Ai, Yiran Hu, Jiaqiy Li, Changyue Wang, Kaiyuan Zhang, Yueyue Wu, Yiqun Liu. JuDGE: Benchmarking Judgment Document Generation for Chinese Legal System. The 48th International ACM SIGIR Conference on Research and Development in Information Retrieval (SIGIR 2025) Preprint Version. Bulou Liu, Yiran Hu, Qingyao Ai, Yiqun Liu, Yueyue Wu, Chenliang Li, Weixing Shen. Generating Clarifying Questions for Conversational Legal Case Retrieval without External Knowledge. ACM Transactions on Information Systems (TOIS 2025). Ziyi Ye, Qingyao Ai, Yiqun Liu, Maarten de Rijke, Min Zhang, Christina Lioma, Tuukka Ruotsalo. Generative language reconstruction from brain recordings. Communications Biology. Preprint Version. Ziyi Ye, Xiangsheng Li, Qiuchi Li, Qingyao Ai, Yujia Zhou, Wei Shen, Dong Yan, Yiqun Liu. Beyond Scalar Reward Model: Learning Generative Judge from Preference Data. The Thirteenth International Conference on Learning Representations. (ICLR 2025). Preprint Version. Qian Dong, Qingyao Ai, Hongning Wang, Yiding Liu, Haitao Li, Weihang Su, Yiqun Liu, Tat-Seng Chua, and Shaoping Ma. Decoupling Knowledge and Context: An Efficient and Effective Retrieval Augmented Generation Framework via Cross Attention. The Web Conference 2025. (theWebConf 2025). Preprint Version. Weihang Su, Qingyao Ai, Yueyue Wu, Anzhe Xie, Changyue Wang, Yixiao Ma, Haitao Li, Zhijing Wu, Yiqun Liu, Min Zhang. Caseformer: Pre-training for Legal Case Retrieval Based on Inter-Case Distinctions. ACM Transactions on Information Systems (TOIS 2025) Preprint Version. Qingyao Ai, Jingtao Zhan, Yiqun Liu. Foundations of Generative Information Retrieval. Information Access in the Era of Generative AI. Preprint Version. Haitao Li, Qingyao Ai, Xinyan Han, Jia Chen, Qian Dong, Yiqun Liu, Chong Chen, Qi Tian. DELTA: Pre-train a Discriminative Encoder for Legal Case Retrieval via Structural Word Alignment. The 39th Annual AAAI Conference on Artificial Intelligence (AAAI 2025) Preprint Version. Haitao Li, Qingyao Ai, Jia Chen, Qian Dong, Zhijing Wu, Yiqun Liu, Chong Chen, Qi Tian. BLADE: Enhancing Black-box Large Language Models with Small Domain-Specific Models. The 39th Annual AAAI Conference on Artificial Intelligence (AAAI 2025) Preprint Version. IN THE YEAR OF 2024 Haitao Li, You Chen, Qingyao Ai, Yueyue WU, Ruizhe Zhang and Yiqun Liu. LexEval: A Comprehensive Chinese Legal Benchmark for Evaluating Large Language Models. The Thirty-Eighth Annual Conference on Neural Information Processing Systems. (NeurIPS 2024) Preprint Version. Changyue Wang, Weihang Su, Hu Yiran, Qingyao Ai, Yueyue Wu, Cheng Luo, Yiqun Liu, Min Zhang, Shaoping Ma. LeKUBE: A Legal Knowledge Update BEnchmark. The 2nd International ACM SIGIR Conference on Information Retrieval in the Asia Pacific (SIGIR-AP 2024) Preprint Version. Weihang Su, Yichen Tang, Qingyao Ai, Changyue Wang, Zhijing Wu, and Yiqun Liu. Mitigating Entity-Level Hallucination in Large Language Models. The 2nd International ACM SIGIR Conference on Information Retrieval in the Asia Pacific (SIGIR-AP 2024) Preprint Version. Weihang Su, Yiran Hu, Anzhe Xie, Qingyao Ai, Zibing Que, Ning Zheng, Yun Liu, Weixing Shen, and Yiqun Liu. STARD: A Chinese Statute Retrieval Dataset with Real Queries Issued by Non-professionals. The 2024 Conference on Empirical Methods in Natural Language Processing (EMNLP 2024) Preprint Version. Bulou Liu, Zhenhao Zhu, Qingyao Ai, Yiqun Liu, and Yueyue Wu. LeDQA:AChinese Legal Case Document-based Question Answering Dataset. The 33rd ACM International Conference on Information and Knowledge Management (CIKM 2024) Preprint Version. Zhumin Chu, Qingyao Ai, Yiteng Tu, Haitao Li, and Yiqun Liu. Automatic Large Language Model Evaluation via Peer Review. The 33rd ACM International Conference on Information and Knowledge Management (CIKM 2024) Preprint Version. Ziyi Ye, Qingyao Ai, and Yiqun Liu. Brain-Computer Interface Meets Information Retrieval: Perspectiv",
  "content_length": 55944,
  "method": "requests",
  "crawl_time": "2025-12-01 14:51:47"
}