{
  "name": "Yiran Chen 0001",
  "homepage": "https://ece.duke.edu/faculty/yiran-chen",
  "status": "success",
  "content": "Yiran Chen | Duke Electrical & Computer Engineering Yiran Chen, Ph.D. Electrical and Computer Engineering John Cocke Distinguished Professor Yiran Chen, Ph.D. Profile Photo Research Themes Artificial Intelligence & Machine Learning, Hardware & Software, Trustworthy Computing Research Interests rnEmerging memory and storage technologiesrnEmbedded systems, CPS, edge computing, and mobile applicationsrnNeuromorphic computing, deep learning and system securityrnLow power circuit and systemrn Bio Yiran Chen earned his B.S. in 1998 and M.S. in 2001 from Tsinghua University and completed his Ph.D. in 2005 at Purdue University. In 2010, he joined the University of Pittsburgh as an Assistant Professor, where he was later promoted to Associate Professor with tenure in 2014, holding the prestigious Bicentennial Alumni Faculty Fellowship. He currently serves as the John Cocke Distinguished Professor of Electrical and Computer Engineering at Duke University. Dr. Chen is the Director of the National Science Foundation (NSF) AI Institute for Edge Computing Leveraging (Athena), one of the 27 National AI Institutes in the United States. He also leads the NSF Industry-University Cooperative Research Center (IUCRC) for Alternative Sustainable and Intelligent Computing (ASIC) and co-directs the Duke Center for Computational Evolutionary Intelligence (DCEI). His research group focuses on innovations in emerging memory and storage systems, machine learning and neuromorphic computing, and edge computing. Throughout his career, Dr. Chen has supervised or is currently supervising over 60 Ph.D. students and 4 postdoctoral scholars. Many of his mentees have achieved significant success, with 14 joining faculties at institutions in the United States, Turkey, Hong Kong, and China, including four NSF CAREER Awardees. Dr. Chen has an extensive publication record, including one book, over 700 technical papers, and 96 U.S. patents. His work has earned 15 paper awards, including two Test-of-Time Awards, and 17 best paper nominations from leading international journals and conferences. Among his numerous accolades, he is one of only three individuals to receive Technical Achievement Awards from both the IEEE Circuits and Systems Society and the IEEE Computer Society, organizations with histories spanning 76 and 79 years, respectively. He has served as a Distinguished Lecturer for the IEEE Council on Electronic Design Automation (CEDA) and the IEEE Circuits and Systems Society (CASS), as well as a Distinguished Visitor of the IEEE Computer Society (CS). He is a Fellow of the AAAS, ACM, IEEE, and NAI, and a member of the European Academy of Sciences and Arts. From 2021 to 2024, he chaired the ACM Special Interest Group on Design Automation (SIGDA), and he was Editor-in-Chief of the IEEE Circuits and Systems Magazine from 2020 to 2023. Currently, he is the inaugural Editor-in-Chief of the IEEE Transactions on Circuits and Systems for Artificial Intelligence (TCASAI) and the inaugural Chair of the IEEE Circuits and Systems Society Machine Learning Circuits and Systems (MLCAS) Technical Committee. He has served as a member of the Committee on Using Machine Learning in Safety-Critical Applications: Setting a Research Agenda, The National Academies of Sciences, Engineering, and Medicine. Beyond academia, Dr. Chen has contributed to industry as Chairman of the Board, Independent Director, and consultant for several startups and venture capital firms. He is a passionate advocate for the responsible use of AI technologies. Dr. Chen is a founding member of the steering committee for the Academic Alliance on AI Policy (AAAIP) and a Fellow of the Asian American Scholar Forum (AASF). Education Ph.D. Purdue University, 2005 Positions John Cocke Distinguished Professor Professor in the Department of Electrical and Computer Engineering Professor of Computer Science Awards, Honors, and Distinctions Member. European Academy of Sciences and Arts. 2025 Professional Member . IEEE-Eta Kappa Nu, the Eta Chapter of the Board of Governors. 2025 Inaugural Editor-in-Chief of the IEEE Transactions on Circuits and Systems for Artificial Intelligence (TCASAI). IEEE. 2024 Dean's Award for Excellence in Mentoring. Duke University. 2024 Distinguished Visitor. IEEE Computer Society . 2024 Fellow. National Academy of Inventors. 2023 Distinguished Lecturer. IEEE Circuits and Systems Society. 2023 Charles A. Desoer Technical Achievement Award. Institute of Electrical and Electronics Engineers (IEEE), Circuits and Systems Society. 2023 Edward J. McCluskey Technical Achievement Award. Institute of Electrical and Electronics Engineers (IEEE), Computer Society. 2022 Stansell Family Distinguished Research Award. Pratt School of Engineering, Duke University. 2022 Fellow. American Association for the Advancement of Science. 2022 Outstanding Electrical and Computer Engineer (OECE) Award. Purdueu2019s School of Electrical and Computer Engineering. 2021 Clarivate Highly Cited Researchers. Clarivate. 2021 HPCA Hall of Fame. IEEE Computer Society, Technical Committee on Computer Architecture. 2020 Fellow. Association for Computing Machinery. 2020 Distinguished Lecturer. IEEE Council on Electronic Design Automation. 2018 Fellow. Institute of Electrical and Electronics Engineers. 2018 Outstanding New Faculty Award . ACMu2019s Special Interest Group on Design Automation (SIGDA). 2014 National Science Foundation CAREER Awards - Multiple Sciences. National Science Foundation (NSF). 2013 Courses Taught ECE 899: Special Readings in Electrical Engineering ECE 891: Internship ECE 661: Computer Engineering Machine Learning and Deep Neural Nets ECE 550D: Fundamentals of Computer Systems and Engineering ECE 493: Projects in Electrical and Computer Engineering ECE 392: Projects in Electrical and Computer Engineering ECE 391: Projects in Electrical and Computer Engineering Publications Kim B, Huang Q, Taylor B, Zheng Q, Ku J, Chen Y, et al. MulPi: A Multi-class and Patient-Independent Epileptic Seizure Classifier With Co-Designed Input-stationary Computing-in-SRAM. IEEE transactions on biomedical circuits and systems. 2025 Aug;19(4):756u201366. Cheng F, Zhang T, Zhang J, Ku JHC, Wang Y, Yang X, et al. AutoRAC: Automated Processing-in-Memory Accelerator Design for Recommender Systems. In: Proceedings of the ACM Great Lakes Symposium on VLSI Glsvlsi. 2025. p. 791u20137. Ali AH, Sridharan A, Guo C, Hwang W, Tsai W, Zhang J, et al. FP-SMR: A Fully Digital Floating-Point Processing-in-SAS-MRAM for Session-based Recommender System. In: Proceedings of the ACM Great Lakes Symposium on VLSI Glsvlsi. 2025. p. 341u20137. Wei C, Duan B, Guo C, Zhang J, Song Q, Li H, et al. Phi: Leveraging Pattern-based Hierarchical Sparsity for High-Efficiency Spiking Neural Networks. In: Proceedings International Symposium on Computer Architecture. 2025. p. 930u201343. Cheng F, Guo C, Wei C, Zhang J, Zhou C, Hanson E, et al. Ecco: Improving Memory Bandwidth and Capacity for LLMs via Entropy-Aware Cache Compression. In: Proceedings International Symposium on Computer Architecture. 2025. p. 793u2013807. Zhang J, Wang H, Ding Q, Gu J, Assouly R, Oliver W, et al. QPlacer: Frequency-Aware Component Placement for Superconducting Quantum Computers. In: Proceedings International Symposium on Computer Architecture. 2025. p. 1554u201367. Guo C, Wei C, Tang J, Duan B, Han S, Li H, et al. Transitive Array: An Efficient GEMM Accelerator with Result Reuse. In: Proceedings International Symposium on Computer Architecture. 2025. p. 990u20131004. Du H, Zhao Y, Zhao J, Xu S, Lin X, Chen Y, et al. Advancing real-time infectious disease forecasting using large language models. Nature computational science. 2025 Jun;5(6):467u201380. Navardi M, Aalishah R, Fu Y, Lin Y, Li H, Chen Y, et al. GenAI at the Edge: Comprehensive Survey on Empowering Edge Devices. In: Aaai Spring Symposium Technical Report. 2025. p. 180u20137. Pan J, Chang CC, Xie Z, Chen Y, Li H. EDALearn: A Comprehensive RTL-to-Signoff EDA Benchmark for Democratized and Reproducible ML for EDA Research. In: IEEE ACM International Conference on Computer Aided Design Digest of Technical Papers Iccad. 2025. Kim B, Li S, Taylor B, Chen Y. Efficient and Robust Edge AI: Software, Hardware, and the Co-design. ACM Transactions on Embedded Computing Systems. 2025 Apr 4;24(3). Chang CC, Ho CT, Li Y, Chen Y, Ren H. DRC-Coder: Automated DRC Checker Code Generation Using LLM Autonomous Agent. In: Proceedings of the International Symposium on Physical Design. 2025. p. 143u201351. Chang CC, Lin WH, Pan J, Zhou G, Xie Z, Hu J, et al. PRICING: Privacy-Preserving Circuit Data Sharing Framework for Lithographic Hotspot Detection. In: Proceedings of the Asia and South Pacific Design Automation Conference ASP DAC. 2025. p. 1308u201313. Pan J, Zhou G, Chang CC, Jacobson I, Hu J, Chen Y. A Survey of Research in Large Language Models for Electronic Design Automation. ACM Transactions on Design Automation of Electronic Systems. 2025 Feb 24;30(3). Guo C, Cheng F, Du Z, Kiessling J, Ku J, Li S, et al. A Survey: Collaborative Hardware and Software Design in the Era of Large Language Models. IEEE Circuits and Systems Magazine. 2025 Jan 1;25(1):35u201357. Sridhar A, Chang CC, Zhang J, Chen Y. Improving Routability Prediction via NAS Using a Smooth One-Shot Augmented Predictor. In: Proceedings International Symposium on Quality Electronic Design Isqed. 2025. Zhou G, Korrapati B, Reddy GR, Zhang J, Chen Y, Thakurta DG. Vario: Enhance Pattern Diversity with Diffusion Model. In: Proceedings of SPIE the International Society for Optical Engineering. 2025. Yu F, Xu Z, Shangguan L, Wang D, Stamoulis D, Madhok R, et al. Rethinking Latency-Aware DNN Design With GPU Tail Effect Analysis. IEEE Transactions on Computer Aided Design of Integrated Circuits and Systems. 2025 Jan 1;44(1):266u201379. Sridhar A, Chen Y. Delta-NAS: Difference of Architecture Encoding for Predictor-Based Evolutionary Neural Architecture Search. In: Proceedings",
  "content_length": 133529,
  "method": "requests",
  "crawl_time": "2025-12-01 14:51:48"
}