{
  "name": "Yiu-Ming Cheung",
  "homepage": "http://www.comp.hkbu.edu.hk/~ymc",
  "status": "success",
  "content": "Cheung, Yiu-ming CHEUNG, Yiu-ming (±i¾å©ú), PhD MEASA, FIEEE, FAAAS, FIAPR, FIET, FBCS RGC Senior Research Fellow (¬ã¸ê§½°ª¯Å¬ã¨s¾ÇªÌ) Chair Professor in Artificial Intelligence, Department of Computer Science, Hong Kong Baptist University, Hong Kong [Recruitment: I am recruiting several Research Assistants with Machine Learning / Computer Vision Background. If you are interested, please send me your CV via email.] Mail Address: Room 630, Department of Computer Science, 6/F, David C. Lam Building, Hong Kong Baptist University, Kowloon Tong, Kowloon, Hong Kong SAR, China. ¶l±H¦a§}: ­»´ä¤EÀs¶í­»´ä®û·|¤j¾Ç«ä»ô¼Ó6¼Ó­pºâ¾÷¬ì¾Ç¨t630«Ç Tel.: (+852) 3411 5155 Fax: (+852) 3411 7892 E-mail: (1) ymc(at)comp.hkbu.edu.hk, (2) ymcheung789(at)gmail.com, or (3) ymc(at)hkbu.edu.hk Profile [Â²][Ác]: Yiu-ming Cheung is currently Chair Professor (Artificial Intelligence) in the Department of Computer Science, Dean of the Institute for Research and Continuing Education (IRACE), and Associate Director of the Institute of Computational and Theoretical Studies at Hong Kong Baptist University (HKBU). He received his PhD from the Department of Computer Science and Engineering at The Chinese University of Hong Kong. In recognition of his dedication and exceptional achievements, he has been elected a Member of the European Academy of Sciences and Arts (EASA), and a Fellow of IEEE, AAAS, IAPR, IET, and BCS. Besides, he has been elected a Distinguished Lecturer of the IEEE Computational Intelligence Society and named Chair Professor in the Changjiang Scholars Program by the Ministry of Education of the People¡¦s Republic of China. Professor Cheung¡¦s research interests include machine learning and visual computing, with applications in data science, pattern recognition, multi-objective optimization, and information security. He has published over 300 articles in leading conferences and journals, e.g., TPAMI, TNNLS, TIFS, TIP, TMM, TKDE, TCYB, CVPR, ICML, IJCAI, and AAAI. He is the recipient of: (1) 2023-2024 RGC Senior Research Fellow Award, (2) the President¡¦s Award for Outstanding Performance in Scholarly Work (2023¡V2024), and (3) the 2023 APNNS Outstanding Achievement Award, among others. Furthermore, he has received several prestigious translational research awards, including: (1) the Gold Medal with Distinction (the highest grade in Gold Medals) and the Swiss Automobile Club Prize, at the 45th International Exhibition of Inventions of Geneva 2017, (2) the Gold Award at the Seventh Hong Kong Innovative Technologies Achievement Award in 2017, (3) the Gold Medal with Congratulations of Jury (the highest grade in Gold Medals) at the 46th International Exhibition of Inventions of Geneva 2018, and (4) the Gold Medal Award at the 15th International Invention Fair in the Middle East, held in Kuwait in February 2025. He is ranked among the World¡¦s Top 2% Most-cited Scientists in Artificial Intelligence and Image Processing (actual ranking 0.28%) by Stanford University. Professor Cheung is currently serving as Editor-in-Chief of the IEEE Transactions on Emerging Topics in Computational Intelligence. Also, he is serving / has served as Associate Editor for several prestigious journals, including IEEE Transactions on Cybernetics, IEEE Transactions on Cognitive and Developmental Systems, IEEE Transactions on Neural Networks and Learning Systems, ACM Transactions on Intelligent Systems and Technology, Pattern Recognition, and Neurocomputing, as well as Guest Editor for several international journals. He was the Founding Chairman of the IEEE (Hong Kong) Computational Intelligence Chapter and served as Chair (2018¡V2022) of the Technical Community on Intelligent Informatics (TCII) of the IEEE Computer Society. He has held various roles, including Organizing Committee Chair, Program Committee Chair, Area Chair, and Financial Chair at numerous top-tier international conferences, such as IJCAI 2021, ICPR 2020, ICDM 2017 & 2018, WCCI 2016, WI-IAT 2012, ICDM 2006, and WI-IAT 2006. Currently, Professor Cheung is an Engineering Panel member of the Research Grants Council in Hong Kong, and a member of the assessment panel for the Enterprise Support Scheme (ESS) under the Innovation and Technology Fund (ITF). He also serves on the Fellow Evaluation Committees of both the IEEE Computer Society and the IEEE Computational Intelligence Society. International Software Competition: As lead author, Yiu-ming Cheung proposed a novel approach and developed corresponding software to participate in the International Nonlinear Financial Forecasting Competition (INFFC), held in the USA in 1995. In this competition, all participating software was evaluated using real-life financial data and assessed by more than twelve major performance indices. Their developed software achieved either first or second place according to these major evaluation metrics. The detailed competition results, including the comprehensive performance assessment of their software, are published in the Proceedings of the First INFFC, edited by Randall B. Caldwell (Finance & Technology Publishing, 1997). The List of Patents: 1. ¡§Method and Apparatus for Eye Gaze Tracking ¡¨ [US Patent: US9,563,805, Chinese Patent: ZL201580044543.6, HK Patent: HK1233347]; 2.  ¡§A Lip-password Based Speaker Verification System¡¨ [US Patent: US9,159,321B2, Video: Mandarin, English]; 3. \"An Infrared-Spectrum Based Recognition System for Identifying Chinese Herbal Species, Origins and Growth Mode with High-recognition Rate\" [Chinese Patent: ZL200810005068.3, Introduction]. Selected Publications: I. Selected Refereed Journals (Sorted by Reverse Chronological Order) [J.143] S.Q. Ren, J.L. Ding and Y.M. Cheung, ¡§Diffusion GAN-based Oversampling for Imbalanced Tabular Data¡¨, IEEE Transactions on Knowledge and Data Engineering, in press. [J.142] Y.Q. Zhang, X.X. Chen, L. Zhao, Y.Z. Ji, P. Liu and Y.M. Cheung, ¡§Online Heterogeneous Feature Selection¡¨, IEEE Transactions on Cybernetics, in press, DOI: 10.1109/TCYB.2025.3635888. [J.141] Y.M. Cheung, Y.G. Zhang, J.Y. Jiang, F. Yu and J. Lou, ¡§Federated Principal Component Analysis for Vertically Partitioned Data¡¨, IEEE Transactions on Cognitive and Developmental Systems, in press, DOI: 10.1109/TCDS.2025.3631744. [J.140] Y.Q. Zhang, M.J. Zhao, Y.F. Zhang and Y.M. Cheung, ¡§Trending Applications of Large Language Models --- A User Perspective Survey¡¨, IEEE Transactions on Artificial Intelligence, in press, DOI: 10.1109/TAI.2025.3620272. [J.139] J.T. Huang, C.M. Vong and Y.M. Cheung, ¡§Correlative Fusion-based Multi-instance Partial Multi-label Learning¡¨, IEEE Transactions on Multimedia, in press. [J.138] S.Q. Ren, J.L. Ding, C.I. Yang and Y.M. Cheung, ¡§GOIO: Generative Oversampling Approach to Class Imbalance and Overlap of Tabular Data¡¨, IEEE Transactions on Knowledge and Data Engineering, in press, DOI: 10.1109/TKDE.2025.3608246. [J.137] Z.Q. Yu, X. Liu, Y.M. Cheung, L. Zhu, X. Xu and N.N. Wang, ¡§FPAD: Fuzzy-Prototype-guided Adversarial Attack and Defense for Deep Cross-Modal Hashing¡¨, IEEE Transactions on Circuits and Systems for Video Technology, in press, DOI: 10.1109/TCSVT.2025.3604033. [J.136] H.T. Wu, Y.Y. Chen, Y.M. Cheung, J.K. Hu and Z.H. Tian, ¡§BGN Encryption Based Lossless Data Hiding by Random Number Replacement and Partitioning¡¨, IEEE Transactions on Dependable and Secure Computing, in press, DOI: 10.1109/TDSC.2025.3603618. [J.135] N. Ma, G.L. Pang and Y.M. Cheung, ¡§Exploiting the Complementarity of Bilateral Domains for Fast Lane Detection¡¨, IEEE Transactions on Intelligent Transportation Systems, , Vol. 26, No. 11, pp. 20109-20121, DOI: 10.1109/TITS.2025.3597352. [J.134] S.C. Fu, Q.M. Peng, Y.M. Cheung, Y.Z. Xu, B. Zou, X.Y. Jing and X.G. You, ¡§Multiplex Experts Governance Collaboration for Label Noise-resistant Graph Representation Learning¡¨, IEEE Transactions on Systems, Man and Cybernetics: Systems, Vol. 55, No. 10, pp. 7437-7448, October 2025, DOI: 10.1109/TSMC.2025.3595183. [J.133] Q. Liu, Y.X. Wang, C. Yang, J.L. An and Y.M. Cheung, ¡§Frequency-Domain Feature Reconstruction Network with Memory Units for Anomaly Detection of Fused Magnesium Furnaces¡¨, IEEE Transactions on Artificial Intelligence, in press, DOI: 10.1109/TAI.2025.3591089. [J.132] Z.L. Cheng, Z.H. Wu, Y. Sadikaj, C. Plant, H.N. Nai, S.P. Wang, Y.M. Cheung and W.Z. Guo, ¡§ADEdgeDrop:  Adversarial Edge Dropping for Robust Graph Neural Networks¡¨, IEEE Transactions on Knowledge and Data Engineering, in press, DOI: 10.1109/TKDE.2025.3586369. [J.131] J.Q. Gao, H. Yu, Y.M. Cheung, J. Cao, Raymond C.W. Wong, and Y.G. Zhang, ¡§Shaping Pre-trained Language Models for Task-specific Embedding Generation via Consistency Calibration¡¨, Neural Networks, in press, DOI: 10.1016/j.neunet.2025.107754. [J.130] Q.X. Zha, X. Liu, Y.M. Cheung, S.J. Peng, X. Xu and N.N. Wang, ¡§UCPM: Uncertainty-Guided Cross-Modal Retrieval with Partially Mismatched Pairs¡¨, IEEE Transactions on Image Processing, in press, DOI: 10.1109/TIP.2025.3574918. [J.129] C. Yang, Q. Liu, Y. Liu and Y.M. Cheung, ¡§Continual Semisupervised Learning of Echo State Network for Quality Prediction of Multimode Processes¡¨, IEEE Transactions on Industrial Informatics, Vol. 21, No. 9, pp. 7209-7219, September 2025, DOI: 10.1109/TII.2025.3575101. [J.128] M. Pang, W.J. Zhang, Y. Lu, Y.M. Cheung and N.R. Zhou, ¡§A Unified Multi-Domain Face Normalization Framework for Cross-domain Prototype Learning and Heterogeneous Face Recognition¡¨, IEEE Transactions on Information Forensics and Security, Vol. 20, pp. 5282-5295, 2025, DOI: 10.1109/TIFS.2025.3570121. [J.127] Y.Q. Zhang, S. Feng, P.K. Wang, Z.X. Tan, X.P. Luo, Y.Z. Ji, R. Zou and Y.M. Cheung, ¡§Learning Self-Growth Maps for Fast and Accurate Imbalanced Streaming Data Clustering¡¨, IEEE Transactions on Neural Networks and Learning Systems, Vol. 36, No. 9, pp. 16049-16061, September 2025, DOI: 10.1109/TNNLS.2025.3563769 [Source Code]. [J.126] W.C. Lan, Y.M. Cheung, Q. Xu, B.H. Liu, Z.K. Hu",
  "content_length": 74038,
  "method": "requests",
  "crawl_time": "2025-12-01 14:51:51"
}