{
  "name": "Yixin Zou [SP]",
  "homepage": "https://yixinzou.github.io",
  "status": "success",
  "content": "Yixin Zou Yixin Zou Bio / Publications / Group / Teaching / Service / Resources About Me Hello there! Thanks for thinking I’m interesting enough to check up on. If you’ve come this far, I encourage you to say hello before you leave :) My name is Yixin Zou (pronounced “Yee-Shin Zoh”). I am a tenure-track faculty member at the Max Planck Institute for Security and Privacy (MPI-SP) in Bochum, Germany. I am also a principal investigator as part of the CASA Cluster of Excellence at Ruhr University Bochum (RUB). Before joining MPI-SP, I earned my Ph.D. in Information at the University of Michigan. My CV is available here. At MPI-SP, I lead the Human-Centered Security and Privacy group, where we conduct qualitative, quantitative, design, and measurement research aimed at making technologies safer and more equitable for everyone – especially marginalized and underserved communities. Visit our group page to learn more about our current research directions and my amazing team members. Want a brief highlight of my work? Check out this podcast I did with Cube 5 titled “On the Way to More Digital Security and Privacy for All” as well as this video I did with CASA that featured my day-to-day life. Open Positions If you are interested in joining my group, or if you are seeking any form of advising or collaboration, please read this page first before reaching out to me. Selected Honors and Awards Diversity and Inclusion Recognition, ACM Conference on Computer-Supported Cooperative Work and Social Computing (2025) Best Paper Honorable Mention, ACM Conference on Human Factors in Computing Systems (2025, 2020, 2019) Runner-up for CNIL-EHESS Award in Social Science (2025) Google Academic Research Award on Trust and Safety (2024) ACM SIGCHI Outstanding Dissertation Award (2024) Meta Research Award on \"People’s Expectations and Experiences with Digital Privacy\" (2023) John Karat Usable Privacy and Security Student Research Award (2022) Distinguished Paper Award, Symposium on Usable Privacy and Security (2018) Email | Google Scholar | LinkedIn | Site built with Jekyll, template here",
  "content_length": 2096,
  "method": "requests",
  "crawl_time": "2025-12-01 14:51:52"
}