{
  "name": "Yixin Tao",
  "homepage": "http://simecv.sufe.edu.cn/page.aspx?id=74",
  "status": "success",
  "content": "陶亦心 教师介绍 陶亦心 Yixin Tao I’m an assistant professor of Institute for Theoretical Computer Science at SUFE. Before joining SUFE, I was a Postdoctoral Researcher in LSE, mentored/hosted by Prof. László Végh. I received my Ph.D. from NYU in 2020, advised by Prof. Richard Cole. I’m interested in Algorithmic Game Theory and Optimization. Before coming to NYU, I received my BS degree in Computer Science from ACM Honor Class at Shanghai Jiao Tong University. Email: Y.Tao16 [at] lse.ac.uk Publications Journal and Conference papers The Evolution of Uncertainty of Learning in Games with Yun Kuen Cheung and Georgios Piliouras ICLR, 2022 Approximating Equilibrium under Constrained Piecewise Linear Concave Utilities with Applications to Matching Markets with Jugal Garg and László Végh SODA, 2022 Chaos of Learning Beyond Zero-sum and Coordination via Game Decompositions with Yun Kuen Cheung ICLR, 2021 On the Existence of Pareto Efficient and Envy Free Allocations with Richard Cole Journal of Economic Theory, 2021 Parallel Stochastic Asynchronous Coordinate Descent: Tight Bounds on the Possible Parallelism with Yun Kuen Cheung and Richard Cole SIAM Journal on Optimization, 2021 Fully Asynchronous Stochastic Coordinate Descent: A Tight Lower Bound on the Parallelism Achieving Linear Speedup with Yun Kuen Cheung and Richard Cole Mathematical Programming Series A, 2020 Dynamics of Distributed Updating in Fisher Markets with Yun Kuen Cheung and Richard Cole EC, 2018 Large Market Games with Near Optimal Efficiency with Richard Cole EC, 2016 Generalized Second Price Auction with Probabilistic Broad Match with Wei Chen, Di He, Tie-Yan Liu, Tao Qin and Liwei Wang EC, 2014 Spring: A Strategy-proof and Privacy Preserving Spectrum Auction Mechanism Qianyi Huang, Yixin Tao and Fan Wu INFOCOM, 2013 Working papers Mode Connectivity in Auction Design with Christoph Hertrich and László A. Végh Selecting a Match: Exploration vs Decision with Ishan Agarwal and Richard Cole Balancing the Robustness and Convergence of Tatonnement with Richard Cole An Analysis of Asynchronous Stochastic Accelerated Coordinate Descent with Richard Cole 862ZrMjFUFyq",
  "content_length": 2147,
  "method": "requests",
  "crawl_time": "2025-12-01 14:51:51"
}