{
  "name": "Yixuan Zhang 0001",
  "homepage": "http://zjanice.github.io",
  "status": "success",
  "content": "Yixuan Zhang Yixuan (\"Janice\") Zhang Ph.D. Pronounce as [y-ee] [sh-oo-en] [j-AH-ng] Preferred name: Janice Assistant Professor Department of Computer Science William & Mary Google Scholar yzhang104@wm.edu Recent news Read more... [August 2025] Received a three-year NSF grant to examine how to enhance AI literacy and resilience through intergenerational digital storytelling among older adults, as the lead PI! [April 2025] Received a grant from COVA CCI (Commonwealth Cyber Initiative) to examine integrated security and privacy solutions for multi-modal AI. [March 2025] Received SEED Funding from William & Mary to explore the capacity of K-12 teachers to integrate AI into the Virginia Disciplinary Standards of Learning, in collaboration with the School of Education. [Feb 2025] Our paper, titled \"Understanding the Practices, Perceptions, and (Dis)Trust of Generative AI among Instructors: A Mixed-methods Study in the U.S. Higher Education\" was accepted by top-tier journal--Computers and Education: Artificial Intelligence! [Jan 2025] Received a grant from The General Assembly of Virginia to design an interactive AI-enabled learning system to support Alzheimer's Disease and Alzheimer's Disease Related Dementias (ADRD) Awareness, Early Detection, and Care through community health workers, with Dr. Alicia Hong. [Jan 2025] Our CHI'25 paper \"Understanding Attitudes and Trust of Generative AI Chatbots for Social Anxiety Support\" (led by PhD student Yvonne Wang) got accepted! See you in Yokohama, Japan! [Dec 2024] Our paper titled \"MetaAgents: Large Language Model Based Agents for Decision-Making on Teaming\" got accepted by CSCW'25 (Bergen, Norway)! [Aug 2024] Received a 3-year grant from the National Science Foundation (NSF)'s Research on Innovative Technologies for Enhanced Learning (RITEL) program (~$900,000) to develop novel LLM-powered systems to foster mathematical modeling competencies through collaborative learning, with Dr. Ziyu Yao (George Mason University), and Dr. Jennifer M Suh (George Mason University). [May 2024] Three papers focused on LLM X HCI got accepted by ICML! The topics include trust in LLM, Emotions in Generative AI, and competition dynamics of LLM-based agents. [April 2024] I received the 2024-25 W&M FRC Faculty Research Grant for research on the ethics of Generative AI and LLMs in CS education. [April 2024] Congrats to Wenhan Lyu and Yimeng Wang (1st year PhD students in our lab) for their paper \"Evaluating the Effectiveness of LLMs in Introductory Computer Science Education: A Semester-Long Field Study,\" which was accepted by Learning @ Scale (L@S '24')!",
  "content_length": 2615,
  "method": "requests",
  "crawl_time": "2025-12-01 14:51:53"
}