{
  "name": "Yixuan He",
  "homepage": "https://sherylhyx.github.io",
  "status": "success",
  "content": "Yixuan He's Homepage I am an Assistant Professor at Arizona State University. My research interests focus on, but not limited to graph neural networks, machine learning and mathematical modelling. In 2024, I completed my PhD (DPhil) degree in the Department of Statistics at University of Oxford. It is my pleasure to be supervised by Prof. Gesine Reinert and Prof. Mihai Cucuringu during my doctoral studies. In my free time, I enjoy table tennis (2022-2024 squad member and 2023-2024 President of Oxford University Table Tennis Club (OUTTC), winning Oxford Blues Award in the 2023/24 academic year), badminton (2022-2024 squad member of Oxford University Badminton Club (OUBaC)), piano, photography, and travelling. I am recruiting PhD students (Statistics, Computer Science, Data Science, Analytics and Engineering, Applied Mathematics, Mathematics, etc.) and postdocs. Please contact me via email (please attach your CV, transcripts, and mention your research experience & research plan) if you are interested! Further, my colleagues and I are recruting two fully-funded Presidential Graduate Assistants via ISEE due on Jan. 1st 2026. Applications should be submitted here. Please also consider applying for these unique opportunities in addition to the traditional PhD programs. Please note that I am not able to respond to every single inquiry (indeed I may only respond to very few of them), as I alreay have more than 1000 such inquiries in my mailbox. You can send me a reminder ONLY if you think I should respond, but please do this sparingly. Thank you! I am organizing the 2025's Learning on Graphs conference at ASU. Register here to experience the first edition of the in-person LoG conference! Selected volunteers can receive registration fee back after completing an 2h shift, apply here now to contribute! My Curriculum Vitae 中文版简历 Publications GNNRank: Learning Global Rankings from Pairwise Comparisons via Directed Graph Neural Networks. [paper] Yixuan He, Quan Gan, David Wipf, Gesine Reinert, Junchi Yan, Mihai Cucuringu Robust Angular Synchronization via Directed Graph Neural Networks. [paper] Yixuan He, Gesine Reinert, David Wipf, Mihai Cucuringu SSSNET: Semi-Supervised Signed Network Clustering. [paper] Yixuan He, Gesine Reinert, Songchao Wang, Mihai Cucuringu MSGNN: A Spectral Graph Neural Network Based on a Novel Magnetic Signed Laplacian. [paper] Yixuan He, Michael Perlmutter, Gesine Reinert, Mihai Cucuringu DIGRAC: Digraph Clustering Based on Flow Imbalance. [paper] Yixuan He, Gesine Reinert, Mihai Cucuringu PyTorch Geometric Signed Directed: A Software Package on Graph Neural Networks for Signed and Directed Graphs. [paper] Yixuan He, Xitong Zhang, Junjie Huang, Benedek Rozemberczki, Mihai Cucuringu, Gesine Reinert Learning to Fuse Temporal Proximity Networks: A Case Study in Chimpanzee Social Interactions. [paper] Yixuan He, Aaron Sandel, David Wipf, Mihai Cucuringu, John Mitani, Gesine Reinert Generalization Error of Graph Neural Networks in the Mean-field Regime. [paper] Gholamali Aminian*, Yixuan He*, Gesine Reinert, Łukasz Szpruch, Samuel N Cohen (* indicates equal contribution) MagNet: A Neural Network for Directed Graphs. [paper] Xitong Zhang, Yixuan He, Nathan Brugnone, Michael Perlmutter, Matthew Hirn PyTorch Geometric Temporal: Spatiotemporal Signal Processing with Neural Machine Learning Models. [paper] Benedek Rozemberczki, Paul Scherer,Yixuan He, George Panagopoulos, Maria Astefanoaei, Oliver Kiss, Ferenc Beres, Nicolas Collignon, Rik Sarkar GNNs for Node Clustering in Signed and Directed Networks. [paper] Yixuan He DIFFormer: Scalable (Graph) Transformers Induced by Energy Constrained Diffusion. [paper] Qitian Wu, Chenxiao Yang, Wentao Zhao, Yixuan He, David Wipf, Junchi Yan Inferring Metabolic States from Single Cell Transcriptomic Data via Geometric Deep Learning. [paper] Holly R Steach, Siddharth Viswanath, Yixuan He, Xitong Zhang, Natalia Ivanova, Matthew Hirn, Michael Perlmutter, Smita Krishnaswamy Pyramid Graph Neural Network: A Graph Sampling and Filtering Approach for Multi-scale Disentangled Representations. [paper] Haoyu Geng, Chao Chen, Yixuan He, Gang Zeng, Zhaobing Han, Hua Chai, Junchi Yan CEP3: Community Event Prediction with Neural Point Process on Graph. [paper] Xuhong Wang, Sirui Chen, Yixuan He, Minjie Wang, Quan Gan, Junchi Yan PGT-I: Scaling Spatiotemporal GNNs with Memory-Efficient Distributed Training. [paper] Seth Ockerman, Amal Gueroudji, Tanwi Mallick, Yixuan He, Line Pouchard, Robert Ross, Shivaram Venkataraman Data Study Group Final Report: Greenvest Solutions. [paper] Peter Strong Eduardo Arnold,Jiaxin Chen, Ivan Croydon-Veleslavov, Anurag Deshpande, Tanaya Guha,Yixuan He,Ben Moseley, Gim Seng Ng, Luke Prince,Thomas Statham Scan-flood Fill (SCAFF): an Efficient Automatic Precise Region Filling Algorithm for Complicated Regions. [paper] Yixuan He, Tianyi Hu, Delu Zeng Ro-SOS: Metric Expression Network (MEnet) for Robust Salient Object Segmentation. [paper] Delu Zeng, Yixuan He, Li Liu, Zhihong Chen, Jiabin Huang, Jie Chen, John Paisley A Model of Deforestation for Agricultural Land Clearance in the Brazilian Rainforest. [poster] Yixuan He, Raymong Chu, Joseph McGuire, Bohan Chen, Kaiyan Peng, Christian Parkinson, Andrea Bertozzi, Stanley Osher Patrol Strategies for Illegal Logging in the Brazilian Rainforest. [poster] Bohan Chen, Kaiyan Peng, Yixuan He, Raymong Chu, Joseph McGuire, Christian Parkinson, Andrea Bertozzi, Stanley Osher What's new 2025 November I have been selected to participate in the Jetstream2 NAIRR AI Fellows Program! As a cluster effort with my colleagues, our proposal for funding for the 2026-27 Presidential Graduate Assistant Scholars program at Arizona State University has been approved for 2 positions! September I was invited to serve as a reviewer for ICLR 2026. August I was invited to serve as a reviewer for AISTATS 2026. July I was invited to serve as a program committee member for AAAI 2026. June One paper got accepted by SC25. April I was invited to give a talk at Department of Statistics, Baskin School of Engineering @ University of California, Santa Cruz. I won a SUN award @ ASU for organizing the 2025 Machine Learning Day. We hosted the 6th Machine Learning Day @ ASU. February I was invited to serve as a reviewer for NeurIPS 2025. January I was invited to serve as a reviewer for IEEE Transactions on Signal and Information Processing over Networks. 2024 December I was invited to serve as a reviewer for IEEE Transactions on Neural Networks and Learning Systems (TNNLS). I was invited to serve as a reviewer for ICML 2025. November I was invited to serve as a reviewer for IEEE Transactions on Neural Networks and Learning Systems (TNNLS). We hosted the Learning on Graphs Local Meetup at Arizona @ ASU. October I was invited to give a talk at the Research Innovation in the Mathematical Sciences Seminar @ ASU. I was invited to serve as a reviewer for AISTATS 2025. September I was invited to give a talk at the CAM/DoMSS Seminar @ ASU. I was invited to give a talk at the Statistics seminar @ ASU. I won a SUN award @ ASU for organizing the AI seminar. I joined Arizona State University as an assistant professor. August I was invited to serve as a reviewer for ICLR 2025. June I was awarded the G-Research June Grant mainly for attending ICML 2024. I was invited to serve as a program committee member for AAAI 2025. I was granted Leave to Supplicate by University of Oxford, meaning that I have satisfied all degree requirements for a doctoral degree. I delivered a talk during the CNRS GdR IASIS Graph Learning Day. I was provided with ICML 2024 Financial Assistance to attend ICMl 2024 by ICML organizers. May I was invited to serve as a reviewer for NeurIPS 2024. One paper got accepted by ICML 2024. March I was provided with ICLR 2024 Financial Assistance to attend ICLR 2024 by ICLR organizers. I was awarded the Blues Award by University of Oxford. The Blue is the highest honour granted to individual sportspeople at the University of Oxford and is a highly sought-after achievement for Oxford student athletes. February I was awarded the Balliol College Support Grant to complete my studies at University of Oxford. January One paper got accepted by ICLR 2024. One paper got accepted by RECOMB 2024. 2023 December I was invited to serve as a reviewer for ICML 2024. November One paper got accepted by LoG 2023. August I was invited to serve as a reviewer for ICLR 2024. I was invited to serve as a reviewer for the journal Statistics and Computing. July I was invited to serve as a program committee member for AAAI 2024. June I was awarded the Floreat Grant from Balliol College on extra-curricular activities (sports). May One paper got accepted by KDD 2023. I was elected to be the president of Oxford University Table Tennis Club (OUTTC). March I was invited to serve as a reviewer for NeurIPS 2023. I delivered three talks at the workshop: statistical learning on LARge scale GRaphs (LARGR). As one of the organizers, we started the seminar series: LoG2 @ Oxford: Learning on Graphs and Geometry. January One paper got accepted by ICLR 2023. 2022 December I was invited to serve as a reviewer for ICML 2023. I was invited to serve as a reviewer for The Web Conference 2023 (WWW 2023). November Three papers got accepted by LoG 2022. I was invited to serve as a reviewer for IEEE Transactions on Knowledge and Data Engineering (TKDE). September I delivered a talk in the 4th IMA Conference on The Mathematical Challenges of Big Data. The recording for our ICML spotlight paper became available online. July I was invited to serve as a program committee member for AAAI 2023. June I was offered participant grant by the ICML 2022 conference. UC Berkeley has granted me accommodation and travel fund for Simons Institute Deep Learning Theory Workshop 2022. My college has granted me on the 4th IMA Conference on The Mathematical Challenges of Big Data registration. May One paper was accepted at ICM",
  "content_length": 15309,
  "method": "requests",
  "crawl_time": "2025-12-01 14:51:52"
}