{
  "name": "Yiying Zhang 0005",
  "homepage": "https://cseweb.ucsd.edu/~yiying",
  "status": "success",
  "content": "Yiying Zhang's Home Page Yiying Zhang Associate Professor Computer Science and Engineering Department University of California, San Diego 9500 Gilman Drive, M/C 0404 La Jolla, CA 92093-0404 Office: CSE 3124 Phone: (858) 246-5216 Email: yiying@ucsd.edu Research Lab: WukLab, MLSys@WukLab My current research interests are primary on building systems for ML/AI and using ML/AI to solve systems problems. I lead WukLab, a systems research lab at UCSD. I am also the founder and CEO of GenseeAI. My past research interests include various co-designs of systems and computer architecture, data-center networking, programming language, and systems security. I have won an OSDI best paper award, a SYSTOR best paper award, an NSF CAREER award, a VMware Early Career Faculty Award, a Google Research Award, a Meta Systems Research Award, and an Amazon Research Award. I have served or will serve as a program committee member of SOSP (2024, 2023, 2021, 2019), OSDI (2022, 2021, 2020, 2018), NSDI (2022, 2021), ASPLOS (2022, 2019, 2018), SIGCOMM (2023), USENIX ATC (2024 co-chair, 2018), FAST (2019, 2016), SoCC (2019, 2018, 2017, 2015), WORDS (2023 co-chair, 2022 co-chair, 2021 co-chair, 2019 co-chair), HotOS (2021, 2019), HotStorage (2023 co-chair, 2022, 2017, 2014), and APSys (2023 co-chair). Before joining UCSD, I was an assistant professor at Purdue ECE from 2015 to 2019. I received my Ph.D. from the Department of Computer Sciences at the University of Wisconsin-Madison. Recent Publications Beat the long tail: Distribution-Aware Speculative Decoding for RL Training Zelei Shao, Vikranth Srivatsa, Sanjana Srivastava, Qingyang Wu, Alpay Ariyak, Xiaoxia Wu, Ameen Patel, Jue Wang, Percy Liang, Tri Dao, Ce Zhang, Yiying Zhang, Ben Athiwaratkun, Chenfeng Xu, Junxiong Wang arxiv preprint arXiv:2511.13841 Demystifying Delays in Reasoning: A Pilot Temporal and Token Analysis of Reasoning Systems Qi Qi, Reyna Abhyankar, Yiying Zhang the 1st Workshop on Efficient Reasoning Co-Located with NeurIPS 2025 (ER '25) OSWorld-Human: Benchmarking the Efficiency of Computer-Use Agents Reyna Abhyankar, Qi Qi, Yiying Zhang the 1st Workshop on Computer-Use Agents Co-Located with ICML 2025 (WUCA '25) An Early Exploration of Deep-Learning-Driven Prefetching for Far Memory Yutong Huang, Zhiyuan Guo, Yiying Zhang the 2025 Workshop on Machine Learning for Systems Co-Located with NeurIPS 2025 (MLForSys '25) Learning Semantics, Not Addresses: Runtime Neural Prefetching for Far Memory Yutong Huang, Zhiyuan Guo, Yiying Zhang arxiv preprint arXiv:2506.00384 Cognify: Supercharging Gen-AI Workflows With Hierarchical Autotuning Zijian He*, Reyna Abhyankar*, Vikranth Srivatsa, Yiying Zhang (* equal contribution) to appear at the 31st ACM SIGKDD International Conference on Knowledge Discovery and Data Mining (KDD '25) Preble: Efficient Distributed Prompt Scheduling for LLM Serving Vikranth Srivatsa*, Zijian He*, Reyna Abhyankar, Dongming Li, Yiying Zhang (* equal contribution) the Thirteenth International Conference on Learning Representations (ICLR '25) SC-Bench: A Large-Scale Dataset for Smart Contract Auditing Shihao Xia, Mengting He, Linhai Song, Yiying Zhang Second International Workshop on Large Language Models for Code (LLM4Code '25) Portable and High-Performance SmartNIC Programs with Alkali Jiaxin Lin*, Zhiyuan Guo*, Mihir Shah, Tao Ji, Yiying Zhang, Daehyeok Kim, Aditya Akella (* equal contribution) Proceedings of the 22nd USENIX Symposium on Networked Systems Design and Implementation (NSDI '25) InferCept: Efficient Intercept Support for Augmented Large Language Model Inference Reyna Abhyankar*, Zijian He*, Vikranth Srivatsa, Hao Zhang, Yiying Zhang (* equal contribution) Proceedings of the 41st International Conference on Machine Learning (ICML '24) DRust: Language-Guided Distributed Shared Memory with Fine Granularity, Full Transparency, and Ultra Efficiency Haoran Ma, Yifan Qiao, Shi Liu, Shan Yu, Yuanjiang Ni, Qingda Lu, Jiesheng Wu, Yiying Zhang, Miryung Kim, Harry Xu Proceedings of the 18th USENIX Symposium on Operating Systems Design and Implementation (OSDI '24) Zenix: Efficient Execution of Bulky Serverless Applications Zhiyuan Guo, Zachary Blanco, Junda Chen, Jinmou Li, Zerui Wei, Bili Dong, Ishaan Pota, Mohammad Shahrad, Harry Xu, Yiying Zhang arxiv preprint arXiv:2206.13444 AuditGPT: Auditing Smart Contracts with ChatGPT Shihao Xia, Shuai Shao, Mengting He, Tingting Yu, Linhai Song, Yiying Zhang arxiv preprint arXiv:2404.04306 How to Save My Gas Fees: Understanding and Detecting Real-world Gas Issues in Solidity Programs Mengting He, Shihao Xia, Boqin Qin, Nobuko Yoshida, Tingting Yu, Linhai Song, Yiying Zhang arxiv preprint arXiv:403.02661 SuperNIC: An FPGA-Based, Cloud-Oriented SmartNIC Will Lin*, Yizhou Shan*, Ryan Kosta, Arvind Krishnamurthy, Yiying Zhang (* equal contribution) Proceedings of the 32nd ACM/SIGDA International Symposium on Field-Programmable Gate Arrays (FPGA '24) (Best Paper Runner-Up) Full publication list Teaching Fall 2025: CSE 291 Systems for LLMs and AI Agents (graduate level) Winter 2025: CSE 291 Virtualization and Cloud Computing (graduate level) Spring 2024: CSE 291 Virtualization and Cloud Computing (graduate level) Winter 2024: CSE 291 Virtualization and Cloud Computing (graduate level) Spring 2023: CSE 120 Principles of Computer Operating Systems (undergraduate level) Fall 2022: CSE 291 Virtualization (graduate level) Winter 2022: CSE 291 Virtualization (graduate level) Fall 2021: CSE 120 Principles of Computer Operating Systems (undergraduate level) Spring 2020: CSE 120 Principles of Computer Operating Systems (undergraduate level) Winter 2020: CSE 291 Virtualization (graduate level) Fall 2019: CSE 291 Modern Datacenter Systems (graduate level) (at Purdue) Spring 2019, Spring 2018, Spring 2017, Spring 2016: ECE 469 Operating Systems Engineering (undergraduate level) (at Purdue) Fall 2018, Fall 2017, Fall 2016: ECE 695 Modern Datacenter Systems (graduate level) (at Purdue) Fall 2015: ECE 565 Computer Architecture (graduate level) News 05/2025 Cognify paper accepted to KDD 2025. 01/2025 Preble paper accepted to ICLR 2025. 01/2025 Alkali paper accepted to NSDI 2024. 09/2024 Received Google's very first Academic Research Award for my ML-for-Systems research. 05/2024 InferCept paper accepted to ICML 2024. 03/2024 DRust paper accepted to OSDI 2024. 03/2024 SuperNIC paper won the Best Paper Runner-Up Award at FPGA'24.",
  "content_length": 6425,
  "method": "requests",
  "crawl_time": "2025-12-01 14:51:53"
}