{
  "name": "Yizhou Zhang 0001",
  "homepage": "https://cs.uwaterloo.ca/~yizhou",
  "status": "success",
  "content": "Yizhou Zhang Yizhou Zhang Assistant Professor Cheriton School of Computer Science, University of Waterloo I design and implement programming languages. I aim for programming models and language abstractions that offer rich expressive power, fast implementations, and strong guarantees. I invite broad-minded, technically strong students (PhD and undergraduate) to join me in exploring fun ideas in PL and beyond. Graduate Students Jianlin Li Cong Ma Ende Jin Zhaoyi Ge Alumni Oghenevwogaga Ebresafe Selected Peer-Reviewed Publications OOPSLA 2025 Zero-Overhead Lexical Effect Handlers No raise, no pay: rethinking the cost of lexically scoped handlers for exceptional effects. Cong Ma, Zhaoyi Ge, Max Jung, Yizhou Zhang [ full paper ] ICFP 2025 Compiling with Generating Functions A compiler uses generating functions to compactly and exactly represent probabilistic programs. Jianlin Li, Yizhou Zhang [ full paper ] PLDI 2025 Certified Compilers à la Carte Extensible, modular compiler proofs via new proof-assistant abstractions. Oghenevwogaga Ebresafe, Ian Zhao, Ende Jin, Arthur Bright, Charles Jian, Yizhou Zhang [ full paper | TR | Rocqet ] OOPSLA 2024 Lexical Effect Handlers, Directly Compiling high-level, modular control effects to low-level, swift stack switching Cong Ma, Zhaoyi Ge, Edward Lee, Yizhou Zhang [ full paper | the Lexa language ] PLDI 2024 Compiling Probabilistic Programs for Variable Elimination with Information Flow A compiler uses information-flow types to factorize recursive probabilistic programs for scalable inference. Jianlin Li, Eric Wang, Yizhou Zhang [ full paper | TR ] OOPSLA 2024 Persimmon: Nested Family Polymorphism with Extensible Variant Types Reconciling algebraic data types with scalable extensibility Anastasiya Kravchuk-Kirilyuk, Gary Feng, Jonas Iskander, Yizhou Zhang, Nada Amin [ full paper ] PLDI 2023 Extensible Metatheory Mechanization via Family Polymorphism An object-oriented idea lends itself to reusable proofs! Ende Jin, Nada Amin, Yizhou Zhang ACM SIGPLAN Distinguished Paper Award [ full paper | TR | implementation ] POPL 2023 Type-Preserving, Dependence-Aware Guide Generation for Sound, Effective Amortized Probabilistic Inference Symbolic methods (a type system and an analysis) aid in neural-network–based inference. Jianlin Li, Leni Aniva, Pengyuan Shi, Yizhou Zhang [ full paper | TR ] POPL 2022 Reasoning about “Reasoning about Reasoning” Reasoning principles for probabilistic programs that model rational agents Yizhou Zhang, Nada Amin [ full paper | TR | mechanized proof ] OOPSLA 2020 Handling Bidirectional Control Flow Handlers for “effectful effects”? Yes, with a type system to defend abstractions. Yizhou Zhang, Guido Salvaneschi, Andrew C. Myers [ full paper | TR | mechanized proof ] RA-L 2020 Path Planning under Malicious Injections and Removals of Perceived Obstacles: a Probabilistic Programming Approach Robots plan paths against both noise and adversarial uncertainty. Jacopo Banfi, Yizhou Zhang, G. Edward Suh, Andrew C. Myers, Mark Campbell [ full paper | code ] POPL 2019 Abstraction-Safe Effect Handlers via Tunneling Algebraic effects (and hence exceptions, asynchrony, ...) made modular Yizhou Zhang, Andrew C. Myers [ full paper | TR | mechanized proof ] OOPSLA 2017 Familia: Unifying Interfaces, Type Classes, and Family Polymorphism A lot of polymorphism and extensibility in a lightweight package Yizhou Zhang, Andrew C. Myers [ full paper | TR ] PLDI 2016 Accepting Blame for Safe Tunneled Exceptions The flexibility of unchecked exceptions, the static guarantees of checked exceptions, and good performance too Yizhou Zhang, Guido Salvaneschi, Quinn Beightol, Barbara Liskov, Andrew C. Myers [ full paper | TR ] PLDI 2015 Lightweight, Flexible Object-Oriented Generics An expressive, lightweight genericity mechanism with better code reuse and stronger static checking Yizhou Zhang, Matthew C. Loring, Guido Salvaneschi, Barbara Liskov, Andrew C. Myers [ full paper | TR ] PhD Thesis Designing Flexible, Modular Linguistic Abstractions [ dissertation ] Recently Taught Courses Winter 2026 CS 747 Formal Reasoning with Proof Assistants Spring 2025 CS 245 Logic and Computation Winter 2025 CS 747 Formal Reasoning with Proof Assistants Winter 2025 CS 444/644 Compiler Construction Spring 2024 CS 842 Probabilistic and Differentiable Languages Other Activities Committee Chairs: The Programming Journal (Vol. 10 and Vol. 11) Artifact Evaluation Review Committees & Program Committees: ICFP 2026, LAFI 2026, RocqPL 2026, HOPE 2025, PLDI 2025 SRC, PLDI 2024, OOPSLA 2024, POPL 2024 SRC, POPL 2024, PLDI 2023, HOPE 2022, PLDI 2022, APLAS 2020.",
  "content_length": 4639,
  "method": "requests",
  "crawl_time": "2025-12-01 14:51:57"
}