{
  "name": "Yizheng Zhao",
  "homepage": "https://ai.nju.edu.cn/zhaoyizheng",
  "status": "success",
  "content": "Yizheng Zhao's Homepage Yizheng Zhao (赵一铮) Associate Professor, PhD Supervisor Knowledge Representation & Reasoning Group (KRistal) School of Artificial Intelligence National Key Laboratory for Novel Software Technology Nanjing University Address: Room A505, Siu Yat-Fu Building, Xianlin Campus, 163 Xianlin Avenue, Qixia District, Nanjing, China Email: zhaoyz [at] nju [dot] edu [dot] cn Short Bio I obtained my Ph.D. degree in Computer Science from The University of Manchester under the esteemed supervision and guidance of Prof. Renate A. Schmidt, within the same research group where I garnered my initial postdoc work experience. Subsequently, I joined the Department of Computer Science at The University of Oxford as a postdoc researcher, delving into the intricacies of Automata Theory and Database Theory. Since May 2019, I have held the position of Associate Professor in the School of Artificial Intelligence at Nanjing University, contributing actively to AI teaching and research. Info for Prospective Research Students Students who are interested in pursuing a research degree, whether at the master's or doctoral level, in the fields of logics, knowledge representation, automated reasoning, ontologies, ontology-based knowledge systems, and other topics within my area of expertise are encouraged to engage in a discussion with me regarding potential projects. The core of a research degree is the successful completion of a research project that makes an original contribution to knowledge in a particular area of study. Although guided and advised by an expert, a research student assumes full responsibility for his/her work, and is expected to adeptly plan and manage a research project and to deliver on time a thesis of appropriate standard. An important aspect of a research degree is the opportunity for training, not only in specialist research techniques but also in transferable skills relevant to employability and personal development. Research students are fueled by naturally inquisitive minds and should possess a fervent passion for problem-solving and advancing human knowledge. Before deciding to join KRistal, you might want to take note of the following information: KRistal's primary area of investigation centers on knowledge representation and reasoning, grounded in logics encompassing set theory, model theory, proof theory, and recursion theory (aka computability theory). This research trajectory necessitates a robust mathematical foundation and may present challenges in publishing academic papers, potentially engendering feelings of anxiety during the course of your studies.KRistal的主要研究方向是基于逻辑语义（集合论 模型论 证明论 递归论）的知识表示与推理，这个方向需要扎实的数学功底并且不好发论文，读硕/博期间可能会产生焦虑情绪 Currently, the industry offers limited opportunities in this area, which means that even with excellent research and well-received publications during Master's or Ph.D. studies, it could still be difficult to find a desirable position at a leading company that aligns impeccably with this research direction or is at the forefront of the industry.目前业界在这个方向上能提供的机会很少，意味着即便读硕/博期间做出了很好的研究或者发表了很好的论文也可能很难在大公司找到\"方向匹配\"或\"处于行业风口\"的工作岗位 Please be honest with yourself and diligently consider personal interests when arriving at decisions. Prudent and responsible decision-making is crucial, as is steadfast commitment to the chosen path. Should your predilections favor inventive thinking and non-conformist actions, we cordially invite you to become a member of KRistal. While KRistal's primary emphasis has traditionally been on the pursuit of fundamental research, our interests have recently begun to gravitate also toward applied research. More specifically, we are broadening our scope by devoting significant efforts to the practical implementation of theoretical insights in matters of commercial or societal import. Our efforts involve exploring and employing KR-based and logic-based methodologies in knowledge-intensive fields and applications, such as those found in medicine and biology. By engaging in these real-world applications, we aim to provide an effective means of validating our theoretical findings and discovering new avenues for further research. Through the continuous refinement of our understanding in practical contexts, we aspire to contribute meaningfully to the advancement of human knowledge and the enhancement of societal well-being. Teaching At overseas universities: Object-Oriented Programming with Java (for first-year undergraduates, 2013 - 2015) Fundamentals of Artificial Intelligence (for first-year undergraduates, 2014 - 2015) Fundamentals of Computation (for first-year undergraduates, 2016 - 2017) Fundamentals of Databases (for second-year undergraduates, 2013 - 2015) Software Engineering (for second-year undergraduates, 2014 - 2015) Logic and Modeling (for second-year undergraduates, 2015 - 2018) Automated Reasoning and Verification (for graduates, 2013 - 2017) Ontology Engineering for the Semantic Web (for graduates, 2013 - 2018) Data Engineering (for graduates, 2013 - 2018) At Nanjing University: Automated Reasoning (for graduates, 2019 - 2025) Knowledge Representation and Processing (for graduates and second-year undergraduates, 2019 - 2025) Mathematical Logics (for first-year undergraduates, 2020 - 2022, work jointly with Prof. Fangmin Song, who is the lead lecturer of the course responsible for organizing course content, designing course materials, delivering lectures, leading discussions, assessing student performance, etc.) © 2025 Yizheng Zhao. All rights reserved.",
  "content_length": 5536,
  "method": "requests",
  "crawl_time": "2025-12-01 14:51:54"
}