{
  "name": "Yizhou Wang 0001",
  "homepage": "https://cfcs.pku.edu.cn/wangyizhou",
  "status": "success",
  "content": "Center on Frontiers of Computing Studies,Peking University People People Directors Faculty Visiting Chair Professors Visiting Faculty Postdocs Visiting Scholars Graduate Students Alumni Staff Join us Home > People > Faculty > Yizhou Wang People Directors Faculty Visiting Chair Professors Visiting Faculty Postdocs Visiting Scholars Graduate Students Alumni Staff Join us Faculty Yizhou Wang Affiliated Professor +86 (0)10 6276-0759 yizhou.wang Room 202-2, Courtyard No.5, Jingyuan Computer Vision, Cognitive Computing, Medical Image Analysis, Computational Aesthetics Yizhou Wang More Bio-Sketch Yizhou Wang, Endowed Boya Professor, Vice Director of CFCS at Peking University. He received his Bachelor's degree in Electrical Engineering from Tsinghua University in 1996, and his Ph.D. in Computer Science from University of California at Los Angeles (UCLA) in 2005. He joined Xerox Palo Alto Research Center (Xerox PARC) as a research staff from 2005 to 2007. Dr. Wang has published over 200 papers and obtained a number of best paper awards. His research interests include computational vision, cognitive computing,  medical image analysis, and computational arts. More Selected Publications 2025 1. VMarker-Pro: Probabilistic 3D Human Mesh Estimation from Virtual Markers ããXiaoxuan Ma, Jiajun Su, Yan Xu, Wentao Zhu, Chunyu Wang, Yizhou Wang ããIEEE Transactions on Pattern Analysis and Machine Intelligence (IEEE-TPAMI), vol. 47 (5), pp 3731-3747, 2025. [PDF] 2. Embodied Representation Alignment with Mirror Neurons ããWentao Zhu, Zhining Zhang, Yuwei Ren, Yin Huang, Hao Xu, Yizhou Wang ããInternational Conference on Computer Vision (ICCV), Honolulu, Oct 19â23th, 2025. [PDF] 3. UnrealZoo: Enriching Photo-realistic Virtual Worlds for Embodied AI ããFangwei Zhong, Kui Wu, Churan Wang, Hao Chen, Hai Ci, Zhoujun Li, Yizhou Wang ããInternational Conference on Computer Vision (ICCV), Honolulu, Oct 19â23th, 2025. [PDF] 4. DyWA: Dynamics-adaptive World Action Model for Generalizable Non-prehensile Manipulation ããJiangran Lyu, Ziming Li, Xuesong Shi, Chaoyi Xu, Yizhou Wang, He Wang ããInternational Conference on Computer Vision (ICCV), Honolulu, Oct 19â23th, 2025. [PDF] 5. Probing and Inducing Combinational Creativity in Vision-Language Models ããYongqian Peng, Yuxi Ma, Mengmeng Wang, Yuxuan Wang, Yizhou Wang, Chi Zhang, Yixin Zhu, Zilong Zheng ããthe 47th Annual Meeting of the Cognitive Science Society (CogSci), San Francisco, July 30th â Aug 2nd, 2025. [PDF] 6. Bayesian Active Learning for Bivariate Causal Discovery ããYuxuan Wang, Mingzhou Liu, Xinwei Sun, Wei Wang, Yizhou Wang ããForty-second International Conference on Machine Learning (ICML), Vancouver, July 13 - 19, 2025. [PDF] 7. Behavior-agnostic Task Inference for Robust Offline In-context Reinforcement Learning ããLong Ma, Fangwei Zhong, Yizhou Wang ããForty-second International Conference on Machine Learning (ICML), Vancouver, July 13 - 19, 2025. [PDF] 8. Free-form Generation Enhances Challenging Clothed Human Modeling ããHang Ye, Xiaoxuan Ma, Hai Ci, Wentao Zhu, Yizhou Wang ããThe IEEE/CVF Computer Vision and Pattern Recognition Conference (CVPR), Nashville, June 11th - 15th, 2025. [PDF] 9. InteractAnything: Zero-shot Human Object Interaction Synthesis via LLM Feedback and Object Affordance Parsing ããJinlu Zhang, Yixin Chen, Zan Wang, Jie Yang, Yizhou Wang, Siyuan Huang ããThe IEEE/CVF Computer Vision and Pattern Recognition Conference (CVPR), Nashville, June 11th - 15th, 2025. [PDF] 10. Simulating Human-like Daily Activities with Desire-driven Autonomy ããYiding Wang, Yuxuan Chen, Fangwei Zhong, Long Ma, Yizhou Wang ããThe Thirteenth International Conference on Learning Representations (ICLR), Singapore, Apr. 24-28, 2025. [PDF] 11. Learning Causal Alignment for Reliable Disease Diagnosis ããMingzhou Liu, Ching-Wen Lee, Xinwei Sun, Xueqing Yu, Yu Qiao, Yizhou Wang ããThe Thirteenth International Conference on Learning Representations (ICLR), Singapore, Apr. 24-28, 2025. [PDF] 12. Aligning Human Motion Generation with Human Perceptions ããHaoru Wang, Wentao Zhu, Luyi Miao, Yishu Xu, Feng Gao, Qi Tian, Yizhou Wang ããThe Thirteenth International Conference on Learning Representations (ICLR), Singapore, Apr. 24-28, 2025. [PDF] 13. AdaManip: Adaptive Articulated Object Manipulation Environments and Policy Learning ããYuanfei Wang, Xiaojie Zhang, Ruihai Wu, Yu Li, Yan Shen, Mingdong Wu, Zhaofeng He, Yizhou Wang, Hao Dong ããThe Thirteenth International Conference on Learning Representations (ICLR), Singapore, Apr. 24-28, 2025. [PDF] 14. A Differential Inclusion Approach for Learning Heterogeneous Sparsity in Neuroimaging Analysis ããWenjing Han, Yueming Wu, Xinwei Sun, Lingjing Hu, Yizhou Wang ããThe 28th International Conference on Artificial Intelligence and Statistics (AISTATS), Mai Khao, May 3 - 5, 2025. [PDF] 15. Autoregressive Sequence Modeling for 3D Medical Image Representation ããSiwen Wang, Churan Wang, Fei Gao, Lixian Su, Fandong Zhang, Yizhou Wang, Yizhou Yu ããThe 39th Annual AAAI Conference on Artificial Intelligence (AAAI), Philadelphia, Feb. 25-Mar. 4, 2025. [PDF] 16. Exploring Fine-Grained Human Motion Video Captioning ããBingchan Zhao, Xinyi Liu, Zhuocheng Yu, Tongchen Yang, Yifan Song, Mingyu Jin, Sujian Li, Yizhou Wang ããThe 31st International Conference on Computational Linguistics (COLING), Abu Dhabi, January 19th - 24th, 2025. [PDF] 2024 1. Human Motion Generation: A Survey ããWentao Zhu, Xiaoxuan Ma, Dongyou Lu, Hai Ci, Jinlu Zhang, Jiaxin Shi, Feng Gao, Qi Tian, Yizhou Wang ããIEEE Transactions on Pattern Analysis and Machine Intelligence (IEEE-TPAMI), vol. 46 (4), pp 2430-2449, 2024. [PDF] 2. The Tong Test: Evaluating Artificial General Intelligence Through Dynamic Embodied Physical and Social Interactions ããYujia Peng, Jiaheng Han, Zhenliang Zhang, Lifeng Fan, Tengyu Liu, Siyuan Qi, Xue Feng, Yuxi Ma, Yizhou Wang, Song-Chun Zhu ããEngineering, vol. 34(3), pp 12-22, 2024. [PDF] 3. Richelieu: Self-Evolving LLM-Based Agents for AI Diplomacy ããZhenyu Guan, Xiangyu Kong, Fangwei Zhong, Yizhou Wang ããThe Thirty-eighth Annual Conference on Neural Information Processing Systems (NeurIPS), Vancouver, Dec. 9-15, 2024. [PDF] 4. CLoG: Benchmarking Continual Learning of Image Generation Models, to Continual FoMo ããHaotian Zhang, Junting Zhou, Haowei Lin, Hang Ye, Jianhua Zhu, Zihao Wang, Liangcai Gao, Yizhou Wang, Yitao Liang ããNeurIPS 2024 Workshop on Scalable Continual Learning for Lifelong Foundation Models (NeurIPSW), Vancouver, Dec. 9-15, 2024. [PDF] 5. ScissorBot: Learning Generalizable Scissor Skill for Paper Cutting via Simulation, Imitation, and Sim2Real ããJiangran Lv, Yuxing Chen, Tao Du, Feng Zhu, Huiquan Liu, Yizhou Wang, He Wang ããConference on Robot Learning (CoRL), Munich, Nov. 6-9, 2024. [PDF] 6. Real-time Holistic Robot Pose Estimation with Unknown States ããShikun Ban, Juling Fan, Wentao Zhu, Xiaoxuan Ma, Yu Qiao, Yizhou Wang ããEuropean Conference on Computer Vision (ECCV), Milan, Sept. 29- Oct. 4, 2024. [PDF] 7. ScoreHypo: Probabilistic Human Mesh Estimation with Hypothesis Scoring ããYuan Xu, Xiaoxuan Ma, Jiajun Su, Wentao Zhu, Yu Qiao, Yizhou Wang ããThe IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR), Seattle, Jun. 17 - 21, 2024. [PDF] 8. Language Models Represent Beliefs of Self and Others ããWentao Zhu, Zhining Zhang, Yizhou Wang ããForty-first International Conference on Machine Learning (ICML), Vienna, Jul. 21-27, 2024. [PDF] 9. Causal Discovery via Conditional Independence Testing with Proxy Variables ããMingzhou Liu, Xinwei Sun, Yu Qiao, Yizhou Wang ããForty-first International Conference on Machine Learning (ICML), Vienna, Jul. 21-27, 2024. [PDF] 10. Fast Peer Adaptation with Context-aware Exploration ããLong Ma, Yuanfei Wang, Fangwei Zhong, Song-Chun Zhu, Yizhou Wang ããForty-first International Conference on Machine Learning (ICML), Vienna, Jul. 21-27, 2024. [PDF] 11. Bongard-OpenWorld: Few-Shot Reasoning for Free-form Visual Concepts in the Real World ããRujie Wu, Xiaojian Ma, Zhenliang Zhang, Wei Wang, Qing Li, Song-Chun Zhu, Yizhou Wang ããTwelfth International Conference on Learning Representations (ICLR), Vienna, May 7-11, 2024. [PDF] 12. Safe RLHF: Safe Reinforcement Learning from Human Feedback ããJosef Dai, Xuehai Pan, Ruiyang Sun, Jiaming Ji, Xinbo Xu, Mickel Liu, Yizhou Wang, Yaodong Yang ããTwelfth International Conference on Learning Representations (ICLR), Vienna, May 7-11, 2024. (spotlight) [PDF] 13. Learning Semantic-Agnostic and Spatial-Aware Representation for Generalizable Visual-Audio Navigation ããHongcheng Wang, Yuxuan Wang, Fangwei Zhong, Mingdong Wu, Jianwei Zhang, Yizhou Wang, Hao Dong ãã2024 IEEE International Conference on Robotics and Automation (ICRA), PACIFICO Yokohama, May 13-17, 2024. [PDF] 2023 1. Dyadic visual perceptual learning on orientation discrimination ããYifei Zhang, Keyan Bi, Jian Li, Yizhou Wang, Fang Fang ããCurrent Biology, vol. 33(12), pp. 2407-2416, 2023. [PDF] 2. Learning Semantic-Agnostic and Spatial-Aware Representation for Generalizable Visual-Audio Navigation ããHongcheng Wang, Yuxuan Wang, Fangwei Zhong, Mingdong Wu, Jianwei Zhang, Yizhou Wang, Hao Dong ãã IEEE Robotics and Automation Letters (RA-L), vol. 8(6), pp. 3900-3907, 2023. [PDF] 3. Decoding Six Basic Emotions from Brain Functional Connectivity Patterns ããChunyu Liu, Yingying Wang, Xiaoyue Sun, Yizhou Wang, Fang Fang ããScience China â Life Science, vol. 66(4), pp. 835-847, 2023. [PDF] 4. Causal Discovery from Subsampled Time Series with Proxy Variables ããMingzhou Liu, Xinwei Sun, Lingjing Hu, Yizhou Wang ããThirty-seventh Conference on Neural Information Processing Systems (NeurIPS), New Orleans, Dec. 10-16, 2023. [PDF] 5. Social Motion Prediction with Cognitive Hierarchies ããWen",
  "content_length": 45085,
  "method": "requests",
  "crawl_time": "2025-12-01 14:51:54"
}