{
  "name": "Yngve Dahl",
  "homepage": "https://www.ntnu.edu/employees/yngveda",
  "status": "success",
  "content": "Yngve Dahl - NTNU Yngve Dahl Download press photo Download press photo Foto: Close Yngve Dahl Associate professor Department of Computer Science yngve.dahl@ntnu.no +4790527892 302 PTS 2 Valgrinda, Trondheim ResearchGate About Yngve Dahl (1976) is Associate Professor at the Department of Computer and Information Science. He belongs to the research group for Information Systems and Software Engineering. Dahl holds a PhD in Computer science from NTNU. His academic interests are in the field of Human–Computer Interaction (HCI). Profile Dahl has have conducted HCI research in areas such as of user-centered design, usability evaluation methodology, values in design, collaborative technology, and ubiquitous computing since the early 2000s. The majority of my work consists of empirical design-oriented research with real users, with a particular focus on digital health care technology for clinical and assistive use. The results of my research have been published in leading international scientific HCI journals and conference proceedings. Work Experience 2017- Associate Professor, Dept. of Computer Science, NTNU 2014-2017 Adjunct Associate Professor, Dept. of Computer Science, NTNU 2010-2017 Research scientist, SINTEF Digital (formerly SINTEF ICT) 2007-2010 Research scientist, Telenor Research & Innovation 2002-2006 Research fellow at Department of Computer and Information Science, NTNU 2002 R&D Engineer, Q-free ASA Competencies HCI Methods in user-centred design Participatory design User Experience User centred design Welfare technology Publications 2025 Jost, Patrick; Divitini, Monica; Dahl, Yngve; Sharma, Kshitij. (2025) Using Serious Games in Decision‐Making Research: From Ideation to Application. Norges teknisk-naturvitenskapelige universitet Norges teknisk-naturvitenskapelige universitet Doctoral dissertation Sand, Adrian; Hertzum, Morten; Ellingsen, Gunnar; Dahl, Yngve. (2025) Implementing EHR Suites: Lessons from a Norwegian Configuration Process. Studies in Health Technology and Informatics Academic article 2024 Myklebust, Peder; Dahl, Yngve; Sitompul, Taufik Akbar. (2024) Investigating the Impact of Applying Design Principles and Guidelines on Usability when Redesigning a Graphical User Interface Derived from a Design System. Norges teknisk-naturvitenskapelige universitet Norges teknisk-naturvitenskapelige universitet Masters thesis Opsahl, Torvid; Dahl, Yngve; Sitompul, Taufik Akbar. (2024) How the Adherence of Design Principles Influences the Usability of User Interfaces Built from a Design System?. Norges teknisk-naturvitenskapelige universitet Norges teknisk-naturvitenskapelige universitet Masters thesis Dahl-Jørgensen, Tangni Cunningham; Parmiggiani, Elena; Svanæs, Dag; Dahl, Yngve. (2024) Exploring end-user participation in the design of digital public services: an empirical study of discourse and practice. Norges teknisk-naturvitenskapelige universitet Norges teknisk-naturvitenskapelige universitet Doctoral dissertation 2023 Zahlsen, Øivind Klungseth; Parmiggiani, Elena; Dahl, Yngve. (2023) Challenges of Scaling Participatory Design: A Systematic Literature Review. Academic chapter/article/Conference paper 2022 Subramanian, Sruti; Moor, Katrien De; Vereijken, Beatrix; Dahl, Yngve; Svanæs, Dag. (2022) Exploring the Influence of Tech Savviness and Physical Activity in Older Adults Playing an Exergame. Academic chapter/article/Conference paper Dahl, Yngve; Sharma, Kshitij. (2022) Six Facets of Facilitation: Participatory Design Facilitators’ Perspectives on Their Role and Its Realization. Academic chapter/article/Conference paper Hanssen, Mikael Røsbak; Dahl, Yngve; Alsos, Ole Andreas; Veitch, Erik Aleksander. (2022) Developing a video game for research and prototyping of unmanned maritime vessels. Norges teknisk-naturvitenskapelige universitet Norges teknisk-naturvitenskapelige universitet Masters thesis Dahl, Yngve; Kshitij, Kshitij; Svanæs, Dag. (2022) Towards Participatory Design Facilitation as Reflective Practice. Academic chapter/article/Conference paper Zahlsen, Øivind Klungseth; Svanæs, Dag; Dahl, Yngve. (2022) Representative Participation in a Large-Scale Health IT Project. Computer Supported Cooperative Work (CSCW) Academic article 2021 Subramanian, Sruti; Skjæret-Maroni, Nina; Dahl, Yngve. (2021) Systematic Review of Design Guidelines for Full-Body Interactive Games. Interacting with computers Academic literature review Zahlsen, Øivind Klungseth; Svanæs, Dag; Dahl, Yngve. (2021) Facilitating User Involvement in a Large IT Project: A Comparison of Facilitators’ Perspectives on Process, Role and Personal Practice. Lecture Notes in Computer Science (LNCS) Academic article 2020 Zahlsen, Øivind Klungseth; Svanæs, Dag; Faxvaag, Arild; Dahl, Yngve. (2020) Understanding the Impact of Boundary Conditions on Participatory Activities. Lessons from a Large-Scale IT Project in Health Care. Academic chapter/article/Conference paper Dahl, Yngve; Svanæs, Dag. (2020) Facilitating Democracy: Concerns from Participatory Design with Asymmetric Stakeholder Relations in Health Care. Academic chapter/article/Conference paper Subramanian, Sruti; Dahl, Yngve; Vereijken, Beatrix; Svanæs, Dag. (2020) ExerTiles: A Tangible Interactive Physiotherapy Toolkit for Balance Training with Older Adults. Academic chapter/article/Conference paper 2019 Subramanian, Sruti; Dahl, Yngve; Skjæret-Maroni, Nina; Vereijken, Beatrix; Svanæs, Dag. (2019) Assessing Motivational Differences Between Young and Older Adults When Playing an Exergame. Games for Health Journal Academic article Subramanian, Sruti; Dahl, Yngve; Skjæret-Maroni, Nina; Vereijken, Beatrix; Svanæs, Dag. (2019) Twelve Ways to Reach for a Star: Player Movement Strategies in a Whole-Body Exergame. Academic chapter/article/Conference paper Wang, Alf Inge; Sætre, Rune; Rydland, Terje; Dahl, Yngve. (2019) Evaluation of Interactive and Gamified Approaches for Teaching ICT Theory - A Study of PowerPoint, Sembly, and Kahoot!. Proceedings of the European Conference on Games Based Learning (ECGBL) Academic article 2018 Dahl, Yngve; Reitan, Jarl; Das, Anita. (2018) Value Tensions in Telecare: An Explorative Case Study. Academic chapter/article/Conference paper Dahl, Yngve; Löfström, Erica. (2018) Supporting Social Interaction in Care Environments: Exploring Stakeholder Perspectives on the Potential of Interactive Technology. International Journal of Human-Computer Interaction Academic article 2017 Mikalsen, Marius; Farshchian, Babak A.; Dahl, Yngve. (2017) Infrastructuring as ambiguous repair: a case study of a surveillance infrastructure project. Computer Supported Cooperative Work (CSCW) Academic article Dahl, Yngve; Hanssen, Geir Kjetil. (2017) “Do You See What I Hear?”: Designing for Collocated Patient–Practitioner Collaboration in Audiological Consultations. Human-Computer Interaction Academic article 2016 Ausen, Dag; Svagård, Ingrid Storruste; Dahl, Yngve; Bøthun, Silje; Øderud, Tone; Dale, Øystein. (2016) Utvikling av tjenestemodell for bruk av GPS i demensomsorgen. Trygg og aktiv hverdag for personer med demens. SINTEF Digital SINTEF Digital Report Hanssen, Geir Kjetil; Dahl, Yngve. (2016) A Participatory Design Approach to Develop an Interactive Sound Environment Simulator. American Journal of Audiology Academic article Dahl, Yngve; Hanssen, Geir Kjetil. (2016) Breaking the Sound Barrier: Designing for Patient Participation in Audiological Consultations. Academic chapter/article/Conference paper Farshchian, Babak A.; Dahl, Yngve. (2016) Implementering av lokaliseringstjeneste i Trondheim kommunes helse- og omsorgstilbud til personer med kognitiv svikt. SINTEF Digital SINTEF Digital Report Dahl, Yngve; Farshchian, Babak A.; Vilarinho, Thomas; Helbostad, Jorunn L.; Nawaz, Ather; Nygård, Arnhild Jenssen. (2016) Stakeholder Attitudes Toward and Values Embedded in a Sensor-Enhanced Personal Emergency Response System. Interacting with computers Academic article Farshchian, Babak A.; Mikalsen, Marius; Dahl, Yngve. (2016) Anskaffelse og implementering av elektroniske dørlåser som velferdsteknologi. SINTEF Digital SINTEF Digital Report 2015 Das, Anita; Bøthun, Silje; Reitan, Jarl; Dahl, Yngve. (2015) The use of generative techniques in co-design of mHealth technology and healthcare services for COPD patients. Lecture Notes in Computer Science (LNCS) Academic article Jaatun, Ellen A. Andreassen; Haugen, Dagny Faksvåg; Dahl, Yngve; Kofod-Petersen, Anders. (2015) Designing a reliable pain drawing tool: avoiding interaction flaws by better tailoring to patients’ impairments. Personal and Ubiquitous Computing Academic article Skjæret, Nina; Nawaz, Ather; Ystmark, Kristine Midjås; Dahl, Yngve; Helbostad, Jorunn L.; Svanæs, Dag. (2015) Designing for movement quality in exergames: Lessons learned from observing senior citizens playing stepping games. Gerontology Academic article Farshchian, Babak A.; Dahl, Yngve. (2015) The role of ICT in addressing the challenges of age-related falls: a research agenda based on a systematic mapping of the literature. Personal and Ubiquitous Computing Academic article 2014 Nawaz, Ather; Helbostad, Jorunn L.; Skjæret, Nina; Vereijken, Beatrix; Bourke, Alan; Dahl, Yngve. (2014) Designing Smart Home Technology for Fall Prevention in Older People. Academic chapter/article/Conference paper Dahl, Yngve; Linander, Hanne; Hanssen, Geir Kjetil. (2014) Co-Designing Interactive Tabletop Solutions for Active Patient Involvement in Audiological Consultations. Academic chapter/article/Conference paper 2013 Jaatun, Ellen A. Andreassen; Haugen, Dagny Faksvåg; Dahl, Yngve; Kofod-Petersen, Anders. (2013) An Improved Digital Pain Body Map. Academic chapter/article/Conference paper Kofod-Petersen, Anders; Dahl, Yngve; Brørs, Kirsti Fossland; Murvold, Viggo. (2013) Trygg Heim - Teknologi og tjenester som effektiviserer og forbedrer omsorgstjenester i hjemmet. SINTEF Digital SINTEF Digital Report Holbø, Kristine; Bøthun, Silje; Dahl, Yngve. (2013) Safe walking technology for peop",
  "content_length": 28580,
  "method": "requests",
  "crawl_time": "2025-12-01 14:51:57"
}