{
  "name": "Yoav Y. Schechner",
  "homepage": "http://webee.technion.ac.il/people/yoav",
  "status": "success",
  "content": "Yoav Schechner Yoav Y. Schechner Prof. Yoav Y. Schechner The Mark and Diane Seiden Chair in Science Viterbi Faculty of Electrical Engineering Technion - Israel Institute of Technology Haifa 3200003, Israel Phone: +972-4-8293236 Fax: +972-4-8295757 E-mail: yoav@ee.technion.ac.il Research Publications Resume Teaching In The Press Lab & Group Life Links Research interests We are involved in CloudCT: a space mission to probe small clouds using 3D optical scattering tomography that will run on images taken by a large orbiting formation of nano-satellites. It will seek better understanding of clouds and climate, while pushing computational photgraphy and space-enginering technologies to new frontiers. PIs Yoav Schechner (Technion), Ilan Koren (WIS) and Klaus Schilling (ZfT). Wanted: Students to join this exciting research breakthrough, having interest in any of the following: computer vision, optics, image processing, meteorology, climate. Resulting studies include: Deep learning in accelerated scattering tomography; 3D atmospheric recovery; medical X-ray CT through scatter; refractive distortions (virtual periscope); imaging through turbid (scattering) media e.g., overcoming haze and underwater imaging; Spaceborne multiview recovery; computational imaging on the electric grid; illumination multiplexing; 3D shape estimation based on defocus and diffracted-rotated PSFs; separation and reconstruction of semireflections and transparent layers; polarization and multispectral imaging; radiometric self-calibration; overcoming and exploiting lens-flare and random illumination caustics; recovery limits under pointwise degradations; audio-visual, cross-modal analysis. Some of the studies involve statistical frameworks to achieve blind estimation. Here is a Wordl based on the research page: What's new? January 2025: Best Poster Award at the 2025 Ilan Ramon International Space Conference. Inbal Kom-Betzer, R. Ronen, V. Holodovsky, I. Koren, K. Schilling. Y. Schechner. January 2025: Winning an ERC Proof of Concept grant, project IPIC. I. âKom Betzer, R. Ronen, V. Holodovsky, Y. Schechner and I. Koren, NeMF: Neural Microphysics Fields, Published in ICCP 2024 IEEE TPAMI special issue Inbal Kom Betzer was awarded Optica Women Scholars 2024 Brief bio B.A. in Physics '90 MSc in Physics '94 PhD in Electrical Eng. '99 All my degrees are from the Technion. Then, Research Scientist in Columbia U. '00-'02. I was a Visiting Associate in Caltech and NASA's Jet Propulsion Laboratory (JPL) '10-'11, and in MIT '16. Now a Professor in the Technion's Viterbi Faculty of Elect. Eng. A Landau Fellow - supported by the Taub Foundation. Best Paper Award, ICCP 2013+2018. Best Student Paper Award, CVPR 2017. Distinguished Teaching Honorable Mention, Technion 2017. Fumio Okano Best 3D Paper Award 2017. Distinguished Lecturer Award, Technion 2020. A Principal Investigator and Coordinator of the ERC-Synergy CloudCT project. More details are in my CV. Copyright © 2007 by Yoav Schechner. All rights reserved. Contact",
  "content_length": 3026,
  "method": "requests",
  "crawl_time": "2025-12-01 14:52:02"
}