{
  "name": "Yoav Artzi [Tech]",
  "homepage": "http://yoavartzi.com",
  "status": "success",
  "content": "Yoav Artzi Yoav Artzi Associate ProfessorDepartment of Computer Science and Cornell Tech Cornell UniversityCornell NLP / Machine Learning at Cornell / Robotics at Cornell ASAPP / arXiv yoav@cs.cornell.edu Please read before emailing yoavartzi.com × Prospective students/interns, please read before emailing: Thank you for your interest in our research! Please do not contact me about admissions or internships, unless for a specific job posting. I am sorry, but I am unable to respond personally. Am I looking for new students? Yes! If you are a Cornell student, please email me. If not, I encourage you to apply. See the PhD, Cornell Tech Masters, or undergraduate admission pages. My lab is located at the NYC Cornell Tech campus. PostDoc search: Cornell is recruiting postdoctoral fellows in foundational technical AI research, acorss both NYC and Ithaca. I am recruiting through these programs too → details and application. I am an Associate Professor in the Department of Computer Science and Cornell Tech at Cornell University, arXiv's associate faculty director, and a researcher at ASAPP. I hold a B.Sc. from Tel Aviv University and a Ph.D. from the University of Washington, where I was advised by Luke Zettlemoyer. I study natural language modeling and learning. My lab has worked on a diverse set of topics over the years, including learning from interactions and feedback, LLM pre- and post-training, reinforcement learning for language acquisition, grounded and multimodal language modeling, and evaluation. Our research is anchored in language modeling, natural language processing, and machine learning, but often reaches out to other areas, including robotics, computer vision, and cognitive science. Our work has been recognized by an NSF CAREER award, paper awards, honorable mentions, and spotlight presentations at ACL, EMNLP, NAACL, NeurIPS, and IROS, as well as a TACL test-of-time award. I post paper recommendations at RecNet (our paper recommendation network), am building a new academic community with COLM, and (very) occasionally (b)log. What's new? Nov 3, 2025: Major update of LM-class is out Oct 7, 2025: First day of COLM 2025 🦙 Oct 3-6, 2025: Talk @ IVADO Workshop on Autonomous LLM Agents, Montreal Aug 15, 2025: Talk @ IVADO Bootcamp on Multi-Agent Interaction, Montreal Jul 30, 2025: Artzi and Zettlemoyer 2013 receives a TACL Test-of-Time Award 🏆 Apr 14, 2025: Talk @ the University of Pennsylvania Nov 14, 2024: Omer's CoGen paper receives an EMNLP 2024 best paper award 🏆 Oct 30, 2024: Talk @ Queen Mary University of London Oct 7, 2024: First day of COLM 2024 🦙 Aug 16, 2024: Talk @ Wordplay workshop at ACL 2024 Aug 16, 2024: Talk @ SpLU-RoboNLP workshop at ACL 2024 Aug 12, 2024: Initial release of LM-class, an education resource for contemporary language modeling (broadly construed) June 25, 2024: Attending and talking at the Simons Workshop on Understanding Higher-Level Intelligence from AI, Psychology, and Neuroscience Perspectives May 3, 2024: Talk at MASC-SLL 2024 Dec 14, 2023: Starting to roll out RecNet, an experimental paper recommendation network. Dec 7, 2023: Talk at Novel Ideas in Learning-to-Learn through Interaction Workshop @ EMNLP 2023 Oct 25, 2023: Talk at Georgia Tech July 10, 2023: CB2 is out (play with our bot!) and gets an outstanding demo paper award at ACL 2023 Apr 1, 2023: Panel at the CMU LLM Seminar Mar 23, 2023: Talk at MSR NYC Mar 22, 2023: Talk at the NLP seminar series at the University of Pennsylvania Mar 1, 2023: Talk at UCLA Feb 3, 2023: Talk at the NLP Round Table at ARL Feb 2, 2023: Talk at Stanford NLP Seminar Dec 20, 2022: Anya Ji is a finalist for the CRA 2023 Outstanding Undergraduate Researcher Award Dec 11, 2022: The KiloGram paper received the best long paper award at EMNLP Dec 4, 2022: KiloGram, a new tangram-based resource to study language and perception, is out! Dec 3, 2022: Workshop on Interactive Learning for NLP (InterNLP 2022) at NeurIPS 2022 Nov 15, 2022: Talk at the University of Washington NLP Seminar Nov 14, 2022: 🟡🔻🟦 lilGym, a new RL benchmark, is out! 🔺🔵🟩 Nov 14, 2022: Talk at the Allen Institute for AI Nov 4, 2022: Talk at CMU LTI Colloquium Oct 31, 2022: Talk at The Ohio State University CSE AI Seminar Oct 24, 2022: Talk at the Microsoft Research Summit Oct 24, 2022: Talk at TTIC Colloquium, Chicago Aug 12, 2022: Talk at Berkeley Multi-Agent Learning Seminar Nov 10, 2021: Tutorial on crowdsourcing for data collection at EMNLP 2021 Oct 5, 2021: Talk @ the University of Michigan, Ann Arbor Aug 5, 2021: Talk @ Workshop on Interactive Learning for Natural Language Processing (InterNLP) at ACL 2021 Jun 20, 2021: Tutorial on vision-and-language research at CVPR 2021 Dec 11, 2020: Commented on NLP+robotics research for a Knowable Magazine article Dec 9, 2020: Posted my remote teaching and talk recording setup Nov 19, 2020: Talk @ Third International Workshop on\tSpatial Language Understanding at EMNLP 2020 Nov 19, 2020: Talk @ Interactive Executable Semantic Parsing Workshop at EMNLP 2020 Nov 13, 2020: Natural Language, Dialog and Speech Symposium (NDS2020) Symposium Aug 20, 2020: Talk @ University of Edinburgh July 18, 2020: Talk @ Language in Reinforcement Learning Workshop at ICML 2020 July 18, 2020: Talk @ Workshop on Learning in Artificial Open Worlds at ICML 2020 July 15, 2020: Talk @ Amazon AI Virtual Speaker Series July 9, 2020: Talk @ Workshop on Advances in Language and Vision Research at ACL 2020 Feb 7, 2020: Talk @ Massachusetts Institute of Technology Feb 6, 2020: Talk @ Brown University Jan 27, 2020: Talk @ Columbia University Jan 16, 2020: Talk @ Amazon NYC Dec 6, 2019: Talk @ Semantic Machines, Microsoft Dec 6, 2019: Talk @ University of California, Berkeley Dec 5, 2019: Talk @ Stanford University Dec 3, 2019: Talk @ University of Pennsylvania Nov 15, 2019: Talk @ University of Texas, Austin Nov 12, 2019: Microsoft Research (NYC) Oct 22, 2019: Talk @ University of Washington Oct 21, 2019: Talk @ Microsoft Research (Redmond) Jun 21, 2019: Talk @ Google AI Jun 17, 2019: Talk @ Visual Question Answering Workshop (CVPR workshop) Jun 6, 2019: Talk @ Shortcomings in Vision and Language (NAACL workshop) Jan 28, 2019: Talk @ Games and Simulations for Artificial Intelligence (AAAI Workshop) For code and data, please see our GitHub page and the links in the publication list. A funding and engagement disclosure is available here. Publications Lab Zizhao (Zoe) Chen (PhD) Yair Feldman (PhD) Nathan Godey (postdoc) Yilun Hua (PhD) Giovanni Monea (PhD) Anne Wu (PhD) Alumni This web page lists only students mentored for extensive periods on research projects, and position after graduation. PhDs Noriyuki Kojima → Co-Founder and CEO of Kotoba Technologies, Inc. Thesis: Exploring Grounded Language Systems: Reasoning and Interactive Learning Alane Suhr → Faculty at the University of California, Berkeley Thesis: Reasoning and Learning in Natural Language Systems; 2022 Valts Blukis → Research Scientist at Nvidia Robotics Research Lab Thesis: Generalizable Learning for Natural Language Instruction Following on Physical Robots; 2021 Dipendra Misra → Researcher at Microsoft Research Thesis: Scalable and Interpretable Approaches for Learning to Follow Natural Language Instructions; 2019 Undergraduates and Interns Anya Ji (RA; 2024) Anna Effenberger (undergraduate; 2021) Tianyi Zhang (undergraduate; 2019) → Stanford PhD Howard Chen (RA; 2020) → Princeton PhD Stephanie Zhou (undergraduate; 2018) → UMD PhD Claudia Yan (undergraduate, CUNY; 2018) → IBM Teaching Natural Language Processing (CS 5740) [Spring 2025] [Spring 2024] Topics in Natural Language Processing and Machine Learning (CS 6741) [Fall 2025] Prior Teaching Natural Language Processing (CS 5740) [Spring 2021] [Spring 2020] [Spring 2019] [Spring 2018] [Spring 2017] [Spring 2016] Topics in Natural Language Processing and Machine Learning (CS 6741) [Fall 2024] [Fall 2023] [Fall 2021] [Fall 2020] Structured Prediction for NLP (CS 6741) [Fall 2017] [Fall 2016] [Fall 2015] Resources LM-class: an education resource for contemporary language modeling (broadly construed) Crowdsourcing Case Studies Tutorial (2021) CCG for Semantic Parsing Tutorial (2013) Address Bloomberg Center 371 Cornell Tech2 West Loop Road New York, NY 10044 Cornell Tech's location from Queensborough Bridge, 1913 / Edward Hooper",
  "content_length": 8338,
  "method": "requests",
  "crawl_time": "2025-12-01 14:51:58"
}