{
  "name": "Yogatheesan Varatharajah",
  "homepage": "https://sites.google.com/view/yoga-personal/home",
  "status": "success",
  "content": "Yoga VaratharajahSearch this siteEmbedded FilesSkip to main contentSkip to navigationAbout meYogatheesan VaratharajahAssistant Professor, Computer Science, University of MinnesotaVisiting Scientist, Mayo Clinic4-203 Keller HallEmail: yvaratha[at]umn[dot]eduI am an Assistant Professor of Computer Science & Engineering at the University of Minnesota. I am also affiliated with the Department of Neurology at the Mayo Clinic. If you are a PhD, MS, or undergraduate student at UMN looking for research opportunities in computational health including machine learning, please reach out to me directly with your current CV and transcript.I obtained my Ph.D. and M.S. degrees from the Department of Electrical and Computer Engineering at the University of Illinois at Urbana-Champaign (UIUC) under the supervision of Prof. Ravi Iyer. During my graduate studies, I was fortunate to be mentored by Dr. Gregory Worrell at the Mayo Clinic through the Mayo-Clinic-Illinois Alliance. Prior to that, I obtained my bachelor's degree in Electronic and Telecommunication Engineering at the University of Moratuwa in Sri Lanka. I also spent a summer at Google and collaborated with researchers at Google Health. My Ph.D. research was supported by a Mayo Clinic-Illinois Alliance Fellowship for Technology-based Healthcare Research and a Rambus Computer Engineering Fellowship. My Ph.D. thesis was awarded the CSL Ph.D. Thesis Award by the Coordinated Science Laboratory (CSL) in 2021. Prior to joining UMN, I was a Research Assistant Professor in the Department of Bioengineering at UIUC and a faculty affiliate at the Center for AI Innovations at the National Center for Supercomputing Applications (NCSA).I am broadly interested in leveraging the recent advances in machine learning (ML) to improve the healthcare system. For my research studies, I work very closely with clinical experts to develop novel domain-guided ML applications that reduce physician burden, augment their capabilities, and enhance the overall patient experience while ensuring reliability, scalability, and trust. A particular focus area of my work has been on improving the treatments for neurological diseases, where we developed novel ML methods to model brain activity alterations in diseases such as Alzheimer's and epilepsy. If you are interested in learning more, please check out my lab webpage -- Health Intelligence Laboratory.You can find my latest cv here and a list of my publications here.HonorsReceiving the CSL Ph.D. Thesis Award 2021 with CSL Director Prof. Klara Nahrshdet and my PhD thesis advisor Prof. Ravi Iyer.Receiving best student paper finalist award from Dr. Nigel Lovell of the IEEE.Received the Rambus computer engineering fellowship certificate from dept. head Prof. William Sanders at the annual ECE award ceremony.Recent newsJuly 2025 - Happy to have papers accepted at Scientific Reports, EMBC, and MLHC!May 2025 - Thanks to Medtronic for their generous support to our lab!July 2024 - Our work on unsupervised ML for large scale clinical EEG data was published in Brain Communications.Jun 2024 - I received the NSF CAREER award!Jan 2024 - Our lab received a seed grant from the Minnesota Robotics Institute (MnRI) to study optimization of brain stimulation for Parkinson's disease.Apr 2023 - I accepted a Tenure-track Faculty Position in Computer Science & Engineering at the University of Minnesota Twin Cities. Feb 2023 - Received the NCSA Faculty Fellowship!Jan 2023 - Our paper on discovering interpretable patterns from large scale EEG data using tensor decomposition was accepted by IEEE NER.Oct 2022 - An article on my transformation from a mentee to a mentor in the Mayo Clinic Illinois Alliance.Sep 2022 - Our recent work on assessing the robustness of EEG ML models under realistic distribution shifts was accepted for publication at Neurips (PAPER, ARTICLE). Aug 2022 - Neeraj receives a Mayo Clinic - Illinois Alliance Fellowship!Jun 2022 - I participated in an Innovation Lab addressing the Ethical Challenges of AI in Biomedicine.Apr 2022 - Our work on predicting epilepsy surgery outcomes was published in Epilepsia (press).Oct 2021 - Our paper on domain-guided self-supervised learning for EEG was accepted for oral presentation at ML4H 2021 (BEST POSTER AWARD!).Oct 2021 - My Ph.D. Thesis was awarded the 2021 CSL Ph.D. Thesis Award by the Coordinated Science Laboratory (CSL) at Illinois (video, slides).Sep 2021 - Our paper titled SCORE-IT, an approach to extract useful clinical information from free-text EEG reports was accepted for publication at the IEEE SPMB Conference 2021 (BEST PAPER AWARD!).Aug 2021 - My lab received an NSF CISE Research Initiation Initiative (CRII) Award to study domain-guided machine learning methods for neurological disease diagnosis.Apr 2021 - My paper titled \"Characterizing the electrophysiological abnormalities in visually reviewed normal EEGs of drug-resistant focal epilepsy patients\" was published at Brain Communications.Jan 2021 - Received Jump Arches Foundation grant to develop a 3D Representation of SEEG data to assist with epilepsy surgery.Nov 2020 - Our paper was accepted for oral presentation at the Neurips ML4H workshop.Oct 2020 - Received Young Investigator Award from the American Epilepsy Society.Aug 2020 - Started as Research Assistant Professor in Bioengineering.Jul 2020 - My paper was selected as a finalist at the EMBC student paper competition.May 2020 - Our proposal on \"Data-Driven Analytics to Predict the Dynamics of the COVID 19 Outbreak and the Impact on Healthcare Providers, Resources, and Communities\" received support from Jump ARCHES COVID-19 Priority Call.Apr 2020 - Successfully defended my Ph.D. Thesis!Mar 2020 - Guest lecture for CS598 Graphical Models with Prof. Sanmi Koyejo.Dec 2019 - Talk at the Clinical Data Animation Center (CDAC) at the Massachusetts General Hospital and Harvard University.Nov 2019 - Invited talk at the Swartz Center for Computational Neuroscience at the University of California San Diego.Nov 2019 - Our work received funding from the NSF center for computational biotechnology and genomic medicine for further investigation.Nov 2019 - Invited talk at the University of Chicago.Aug 2019 - Invited talk at JP Morgan Chase AI research team.Mar 2018 - Received the RAMBUS computer engineering fellowship for 2018-2019!Aug 2016 - Received the inaugural Mayo Clinic-Illinois Alliance Fellowship for Technology based Healthcare Research.Google SitesReport abuseGoogle SitesReport abuse",
  "content_length": 6499,
  "method": "requests",
  "crawl_time": "2025-12-01 14:51:58"
}