{
  "name": "Yogesh Singh Rawat",
  "homepage": "https://www.crcv.ucf.edu/person/rawat",
  "status": "success",
  "content": "Center for Research in Computer Vision Skip to main content Home | News | Publications | Teaching | Service | Team | Hobbies | Biography Yogesh S Rawat Associate Professor CRCV | Center for Research in Computer Vision University of Central Florida 4328 Scorpius St. HEC 241 Orlando, FL 32816-2365 Phone: (407) 823-6495 Email: yogesh[at]crcv.ucf.edu Research Our research group is focused on advancing computer vision and AI, particularly in the areas of video understanding, multimodal learning, and robust AI systems. Our work explores foundational models and machine learning techniques to tackle challenges like action recognition, anomaly detection, and resilience to adversarial conditions. We aim to develop intelligent systems that not only perceive but also reason about complex visual and multimodal data for real-world applications. We are always looking for PhD candidates, please reach out with your resume if you are interested in working with our group. For recent list of research publications please visit Google Scholar page. Latest News [ All News] 3 papers in ICCV'25, congrats to Raiyaan, Shehreen, and Priyank! Received UCF's Reach for the Stars Award 2025! 3 papers in CVPR'25, congrats to Xin, Shehreen, Aaryan and Akash! 2 papers accepted in ICLR'25, congrats to Akash and Priyank! 1 paper accepted in AAAI'25, congrats to Akash and Sirshapan! 2 papers accepted in NeurIPS'24, congrats to Grace and Rajat! 1 paper accepted in EMNLP (Findings) 2024, congrats to Shresth! 1 paper accepted in CVPR 2024, congrats to Shehreen! MSR AFMR Grant on Foundation Models Academic Research Initiative 1 paper accepted in AAAI'24, congrats Ayush, Aayush, Akash! 2 papers accepted in NeurIPS'23, congrats to Rajat and Shresth! 1 paper accepted in ICCV 2023, congrats to Nishant! 2 papers accepted in CVPR 2023, congrats to Aayush and Maddy! Recent Service [ All Service] Area Chair, ACM MM 2025 Area Chair, CVPR 2025 Served in NSF review panel 2025 Area Chair, ECCV 2024 Area Chair, ACM MM 2024 Area Chair, WACV 2024 Senior PC Member AAAI'23 Associate Editor, IEEE TCSVT [Jan 2022-] Area Chair, CVPR 2022 Local arrangement chair, IEEE BigData 2021 Program chair, Workshop in IEEE Big MM 2021 PC member, ICLR [2021, 2022] Associate Editor for MVAP [Jan 2020 - ] Selected Recent Publications [ All Publications] [ Google Scholar] Colors See Colors Ignore: Clothes Changing ReID with Color Disentanglement ICCV 2025 Priyank Pathak, Yogesh Rawat [Paper] [Code] [Project page] DisenQ: Disentangling Q-Former for Activity-Biometrics ICCV 2025 Shehreen Azad, Yogesh Rawat [Paper] [Code] [Project page] Punching Bag vs. Punching Person: Motion Transferability in Videos ICCV 2025 Raiyaan Abdullah, Jared Claypoole, Michael Cogswell, Ajay Divakaran, Yogesh Rawat [Paper] [Code] [Project page] DIFFER: Disentangling Identity Features via Semantic Cues for Clothes-Changing Person Re-ID CVPR 2025 Xin Liang, Yogesh Rawat [Paper] [Code] STPro: Spatial and Temporal Progressive Learning for Weakly Supervised Spatio-Temporal Grounding CVPR 2025 Aaryan Garg, Akash Kumar, Yogesh Rawat [Paper] [Code] [Project page] HierarQ: Task-Aware Hierarchical Q-Former for Enhanced Video Understanding CVPR 2025 Shehreen Azad, Vibhav Vineet, Yogesh Rawat [Paper] [Code] [Project page] LR0.FM: Low-Resolution Zero-Shot Classification Benchmark for Foundation Models ICLR 2025 Priyank Pathak, Shyam Marjit, Shruti Vyas, Yogesh Rawat [Paper] [Code] [Project page] Contextual Self-paced Learning for Weakly Supervised Spatio-Temporal Video Grounding ICLR 2025 Akash Kumar, Zsolt Kira, Yogesh Rawat [Paper] [Code] [Project page] T2L: Efficient Zero-Shot Action Recognition with Temporal Token Learning TMLR 2025 Shahzad Ahmad, Sukalpa Chanda, Yogesh S Rawat [Paper] [Code] Stable Mean Teacher for Semi-supervised Video Action Detection AAAI 2025 Akash Kumar, Sirshapan Mitra, Yogesh Rawat [Paper] [Code] Asynchronous Perception Machine for Test Time Training NeurIPS 2024 Rajat Modi, Yogesh Rawat, [Paper] [Website] [Code] AirSketch: Generative Motion to Sketch NeurIPS 2024 HXG Lim, X Cui, YS Rawat, SN Lim, [Paper] [Code] Navigating Hallucinations for Reasoning of Unintentional Activities EMNLP Findings 2024 Shresth Grover, Vibhav Vineet, Yogesh S Rawat [Paper] [Code] Activity-Biometrics: Person Identification from Daily Activities CVPR 2024 Shehreen Azad, and Yogesh Singh Rawat [Paper] [Code] Group Members Akash Kumar PhD student Priyank Pathak PhD student Rajat Modi PhD student Shehreen Azad PhD student Raiyaan Abdullah PhD student Xin Liang PhD student Grace Lim PhD student Sirshapan Mitra PhD student Former Members Ayush Rana [PhD Student], Now: Qualcomm Madeline Schiappa [PhD Student], Now: Arctic Wolf Rahul Ambati [Master Student], Now: Amazon Xianhang Li [Research Assistant], Now: Ph.D student at UC, Santa Cruz Alex Matasa [Master Student], Now: Machine Learning Engineer II at Vadum Inc. Arushi Rai [REU Student], Now: PhD student at University of Pittsburgh Kara Schatz [REU Student], Now: PhD Student at North Carolina State University Erik Quintanilla [REU Student], Now: Software Engineer at Amazon Sponsors Intelligence Advanced Research Projects Activity (IARPA) Defense Advanced Research Projects Agency (DARPA) National Science Foundation (NSF) DRS",
  "content_length": 5258,
  "method": "requests",
  "crawl_time": "2025-12-01 14:52:00"
}