{
  "name": "Yogesh L. Simmhan",
  "homepage": "https://cds.iisc.ac.in/faculty/simmhan",
  "status": "success",
  "content": "Yogesh Simmhan Yogesh Simmhan is an Associate Professor in the Department of Computational and Data Sciences at the Indian Institute of Science, Bangalore. His research explores scalable software platforms, algorithms and applications on distributed systems. These span Cloud and Edge Computing, Temporal Graph Processing, and Scalable Machine Learning to support emerging Big Data and Internet of Things (IoT) applications. He has published over 100 peer-reviewed papers, and won the Best Paper Award at IEEE International Conference on Cloud Computing (CLOUD) 2019, IEEE TCSC SCALE Challenge Award in 2019 and 2012, the Distinguished Paper award at EuroPar 2018, and the IEEE/ACM Supercomputing HPC Storage Challenge Award in 2008. He is the recipient of the Swarna Jayanti Fellowship in 2019 and IEEE TCSC Award for Excellence in Scalable Computing (Mid Career Researcher) in 2020. He is an Associate Editor of Future Generation Computing System (FGCS), and earlier served as Associate Editor-in-Chief of the Journal of Parallel and Distributed Systems (JPDC), Associate Editor of IEEE Transactions on Cloud Computing and a member of the IEEE Future Directions Initiative on Big Data. Yogesh has a Ph.D. in Computer Science from Indiana University, Bloomington, and was previously a Research Assistant Professor at the University of Southern California (USC), Los Angeles, and a Postdoc at Microsoft Research, San Francisco. He is a Distinguished Member of ACM, a Distinguished Contributor of the IEEE Computer Society and serves on the ACM India Executive Council. My research is on distributed and scalable data platforms to support Big Data, Internet of Things (IoT), UAV and computer vision applications on novel computing infrastructure, such as Clouds and Edge devices. I lead the DREAM:Lab - Distributed Research on Emerging Applications and Machines - at CDS. We have open positions for Ph.D. students, postdocs and Research and Development staff in our group to work on some of these exciting projects! Candidates should have expertise in Big Data platforms, Edge/Cloud Computing and Applied Machine Learning, with strong programming, algorithms and systems skills. Research students need to apply to the research degree admissions at the CDS department at IISc, and choose the DREAM:Lab as one of your lab choices. See here for staff position details. To know more about the lab, check out these video shorts. Some active research areas are: Temporal Graphs: Platforms, Algorithms and Analytics We have developed a novel Interval-centric Computing Model (ICM) [ICDE2020, EuroSys2022, HiPC SRS 2022] that allows time-respecting and time-independent algorithms to be defined over temporal graphs. Graphite is its scalable implementation over Apache Giraph. Over 10 graphs algorithms have been mapped to ICM, and Graphite scaled to graphs with over 130M interval vertices and 5.5B interval edges on a 8-node commodity cluster. We are also examining optimizations to improve the performance through windowing approaches and for incremental execution. There are several new and ongoing projects related to temporal graphs: scalable training of Graph Neural Networks (GNN), incremental computing over temporal and streaming graph updates, memory-efficient out-of-core and window-based graph processing, streaming partitioning of large graphs to conserve local community structures, and temporal graph centrality methods to identify high risk population using COVID-19 contact trace networks as part of the GoCoronaGo project. We are also exploring high-performance temporal and streaming graph analytics as part of the National Supercomputing Mission, jointly with IIT-H and IIIT-H, with an emphasis on parallel algorithmic patterns and application resiliency. In the past, we have also examined the use of cloud elasticity to scale graph processing [CLOUD2019] and subgraph-centric processing of temporal graphs [IPDPS2015], besides a survey on scalable graph processing frameworks [CSUR2018]. We have also explored low-latency path queries over temporal property graphs, which has been published as the Granite system [CCGRID2020, JPDC2021], with a novel query cost model to optimize distributed execution. Scalable Machine Learning Training DNN models on accelerated edge devices is an important problem, given the wide-spread availability of such Nvidia Jetson edge devices on autonomous vehicles, and their collocation with video data sources. Our emphasis on the systems aspect of training models on such edge devices, including optimization of individual edge accelerators for training to balance energy usage against training time [SIGMETRICS2023, PAISE2022], and on concurrent workloads that include training and inferencing. We have a cluster of over 25 Nvidia Jetson devices from different generations we validate over. Federated learning over edge devices is a growing requirement across edge devices distributed on the WAN. We are developing a simple, modular and extensible federated learning framework, together with jointly with BITS-Pilani, to validate various systems challenges and research outcomes for federated training using 10-100s of edge devices. This platform will be used to explore scheduling and orchestration of the deep models to efficiently utilize 100s of edge devices and accelerators in a wide-area network to trade-off accuracy, resiliency performance, and privacy. With the growing availability of large-scale video data from city-scale camera networks, drone cameas and intelligent deep models to perform inferencing over them, there is a critical need for NoSQL databases to manage large video respoitories [HiPC SRS 2022]. We are exploring distributed video storage and querying systems with native query capabilities for inferencing using DNNs and spatio-temporal characteristics and in a privacy-preserving manner. These should also leverage edge accelerators that may be available, with trade-offs between a priori indexing and inferencing at ingest time, and on-demand inferencing at query time. Computing across Edge and Cloud I coordinate the IBM-IISc Hybrid Cloud lab, a collaboration between faculty at IISc and researchers at IBM to explore the role of AI in the efficient management of distributed information, data center operations and microservices within hybrid cloud and edge. Specifically, we have developed XFaaS, a platform for composing and deploying FaaS workflows across hybrid clouds with minimal code changes [ESCIENCE2022, CCGRID2023]. This is being extended to both private and public clouds, and with an emphasis on data-driven applications. More recently, frameworks and strategies at the intersection of quantum and serveless on the cloud [QCE2023]. An active area of interest is on computing, data management and scheduling for autonomous aerial vehicles (UAV) or Drones [INFOCOM2021, TON2023]. Open problems include UAV routing for complex missions; where to schedule machine learning models for execution across UAV and backend; and balancing compute, network and energy capacity against application deadlines in the context of 5G communications. In particular, our Ocularone project explores the use of computer vision, perception and tracking algorithms coupled with inferencing across edge and cloud resources for drones to assist the visually impaired [CHI-LBW2023, CCGRID2023]. ElfStore is a distributed storage platform for the edge, that is designed based on P2P and HDFS concepts [ICWS2019]. We have also extended this to store and query time-series data on distributed edge devices [EUROPAR2020], and are currently investigating data management for mobile edges like drones with IIT-Bhilai. Platforms for large IoT and edge deployments are difficult to validate due to lack of access to edge clusters with 1000s of devices. We developed the VIoLET container-based emulation environment for deploying large-scale edge and fog testbeds on which to validate these platforms [EUROPAR2018, TCPS2021]. We are extending this to Ultra-VIoLET and CORNET, which will support diverse network configuration, device mobility and energy constraints, and coupling the computing and network models with physical system simulators such as Gazego and SUMO for drone, robot and vehicle mobility [COMSNET2020,COMSNET2022, IROS2023]. In the past, we have also examined dataflow execution engines [ICSOC2017], dataflow scheduling [TCPS2017, CCGRID2018, CCGRID2022] and have a survey article on scheduling on edge, fog and cloud resources [SPE2019]. We aso worked in Anveshak, a domain specific model and platform for distributed video analytics, which trades-off scalability, accuracy and latency when running DNN models on edge, fog and cloud resources[TPDS2021]. It won the IEEE TCSC SCALE challenge in 2019 [SCALE2019]. Scalable Data Management and Analytics for Science and Society We engage with our science and engineering collaborators on multi-disciplinary projects of social and scientific impact. The Genome India Project is a new pan-India initiative for next generation genome sequencing of 20,000 subjects. We are part of a 20+ consortium, led by the Center for Brain Research at IISc. We are investigating reliable, scalable and affordable storage and management of the sequencing data, and graph-based analytics over it [HIPCW2019]. In the era of COVID-19, our team developed the GoCoronaGo Contact Tracing App for federated collection of Bluetooth-based proximity data at the institutional scale [JIISC2020]. Various temporal graph techniques are used to assign contact risk scores it users, to help with preventive measures and to perform digital contact tracing if a COVID case is found. This was deployed at the IISc campus. SATVAM was an Indo-US project on low-cost air quality monitoring in urban spaces, with IIT-K, IIT-B and Duke University. Our group examined means for autonomous monitoring and management of the IoT fabric, and machine learning models to enhance the calibration of low-cost commodity sensors",
  "content_length": 52343,
  "method": "requests",
  "crawl_time": "2025-12-01 14:51:59"
}