{
  "name": "Yohan Jo",
  "homepage": "https://yohanjo.github.io/lab.html",
  "status": "success",
  "content": "Lab Members Yohan Jo Assistant Professor Graduate School of Data ScienceSeoul National University yohan.jo@snu.ac.kr Lab: Research | ✔️ Members Our lab values technical depth enriched by diverse perspectives across engineering, social sciences, and the humanities. Together, we pursue a shared goal of advancing AI for human agency through both technical and interdisciplinary approaches. Professor Yohan Jo Show Details Hide Details Education Carnegie Mellon University Ph.D. in Language and Information Technologies (Advisor: Eduard Hovy) (2021) M.S. in Language Technologies (Advisor: Carolyn P. Rosé) (2016) KAIST M.S. in Computer Science (Advisor: Alice Oh) (2011) B.S. in Computer Science (2009) Work Seoul National University Assistant Professor (Sept 2023–Present) Amazon.com, Inc. Applied Scientist (Aug 2021–Aug 2023) Apple Inc. ML Research & NLP Intern (June–Aug 2020) Educational Testing Service (ETS) Research & Development Intern (June–July 2017) Electronics and Telecommunications Research Institute (ETRI) Researcher (Feb 2011–July 2014) MirageWorks Software Engineering Intern (June–Aug 2008) Ph.D. Students Jongwook Han M.S. in Electrical Engineering (KAIST)B.S. in Integrated Technology (Yonsei Univ.) Haesung Pyun B.S. in Electronic Engineering (Hanyang Univ.) Jeonghoon Shim M.S. in Data Science (SNU)B.S. in Urban Planning and Engineering (Hanyang Univ.) Jonghyun Song B.S. in Mechanical Engineering (SNU) Jungwoo Yang M.S. in Computer Science and Engineering (SNU)B.S. in Computer Science and Engineering & Economics (Yonsei Univ.) Master's Students Hyoungjo Bhang B.S. in Computer Science (KAIST) Dongmin Choi B.S. in Mathematics Education (SNU) Gyubin Choi B.S. in Industrial Management Engineering (Korea Univ.) Yunho Choi B.S. in Industrial and Management Engineering (POSTECH) Chaewon Heo B.A. in Psychology (Sogang Univ.) Narim Kim B.S. in Computer Science and Engineering (POSTECH) Injin Kong B.S. in Mathematical Sciences (SNU) Seungwon Kuk B.A. in Elementary Computer Education (SNUE) Jonggeun Lee B.S. in Industrial Management Engineering (Korea Univ.) Naeun Lee B.S. in Applied Artificial Intelligence (Sungkyunkwan Univ.) Jongwon Lim B.A. in Linguistics (SNU) Sungjib Lim B.A. in Psychology (SNU) Minjae Oh B.S. in Industrial Management Engineering (Korea Univ.) Haewon Park B.S. in Artificial Intelligence Engineering (Sookmyung Women's Univ.) Yoonah Park B.S. in Computer Science and Engineering (SNU) Gyuhyeon Seo B.A. in Data Science (UC Berkeley) Woojung Song B.S. in Information System (Hanyang Univ.) Jeongmoon Won M.A. & B.A. in Education (SNU) Jongwook Yoon B.S. in Industrial Engineering (SNU) *Cheyon Jin B.S. in Computer Science and Engineering (SNU) *Sejun Park B.S. in Computer Science and Engineering (SNU) *Sangjun Song B.S. in Computer Science and Engineering (Korea Univ.) *Incoming Spring 2026 Alumni Juhee Kim (Master's 2025) LG CNS Doyoun Kim (Master's 2025) Elice Yooseop Lee (Master's 2025) Elice",
  "content_length": 2954,
  "method": "requests",
  "crawl_time": "2025-12-01 14:51:59"
}