{
  "name": "Yoichi Ochiai",
  "homepage": "https://digitalnature.slis.tsukuba.ac.jp/2018/09/yoichi-ochiai",
  "status": "success",
  "content": "Yoichi Ochiai / 落合陽一 - Digital Nature Group Skip to content Yoichi Ochiai / 落合陽一 Media Artist PhD (Applied Computer Science). Associate Professor at University of Tsukuba, Head of Research Development Center for Digital Nature, University of Tsukuba. Director of Strategic Platform for Digital Nature, by Pixie Dust Technologies and University of Tsukuba. (Graduate School of Library, Information and Media Studies and Research Center for Knowledge Communities) Principal Investigator of JST CREST xDiversity Pixie Dust Technologies.Inc CEO Education Ph.D. in Interdisciplinary Information Studies (Computer Science) Apr. 2013 to May. 2015 Thesis: Graphics by Computational Acoustic Fields Human-Computer Interaction Lab / Applied Computer Science Course Graduate School of Interdisciplinary Information Studies The University of Tokyo Researching real world oriented computer graphics and programable matter with Prof. Jun Rekimoto. 2015年 東京大学大学院学際情報学専攻　博士課程　早期修了（指導教員：暦本純一教授） M.A.S. in Interdisciplinary Information Studies (Computer Science) Apr. 2011 to Mar. 2013 Human-Computer Interaction Lab / Applied Computer Science Course Graduate School of Interdisciplinary Information Studies The University of Tokyo Researching programable matter with Prof. Jun Rekimoto. 2013年 東京大学大学院学際情報学専攻　修士課程　修了　（指導教員：暦本純一教授） B.A. in Media Art and Sciences (Computer Science) Apr. 2007 to Mar. 2011 Communication Design Lab University of Tsukuba Researching new media interaction for CSCW with Prof. Teiichi Nishioka. 2011年 筑波大学情報学群情報メディア創成学類　卒業　（指導教員：西岡貞一教授） Profile 1987生，メディアアーティスト．2015年東京大学学際情報学府博士課程修了（学際情報学府初の短縮終了），博士（学際情報学）．日本学術振興会特別研究員DC1，米国Microsoft ResearchでのResearch Internなどを経て，2015年より筑波大学図書館情報メディア系助教 デジタルネイチャー研究室主宰．2015年，Pixie Dust Technologies.incを起業しCEOとして勤務．2017年から2019年まで筑波大学学長補佐，2017年から大阪芸術大学客員教授，デジタルハリウッド大学客員教授，2020年から金沢美術工芸大学客員教授，2021年から京都市立芸術大学客員教授を兼務．2017年12月より，ピクシーダストテクノロジーズ株式会社による筑波大学デジタルネイチャー推進戦略研究基盤　基盤長 及び 准教授を兼務．2020年6月，デジタルネイチャー開発研究センター センター長に就任．独立行政法人科学技術振興機構 CREST「計算機によって多様性を実現する社会に向けた超AI基盤に基づく空間視聴触覚技術の社会実装」xDiversity（クロスダイバーシティ）研究代表．独立行政法人情報処理推進機構未踏スーパークリエータ・未踏PM・一般社団法人未踏理事．内閣府ムーンショット型研究開発制度ビジョナリー会議構成員・ムーンショットアンバサダー．2025年日本国際博覧会（大阪・関西万博）シグネチャー事業プロデューサー．内閣官房全世代型社会保障会議構成員・デジタル改革関連法案WG構成員．世界経済フォーラムヤンググローバルリーダーズ2022構成員．2020年から2021年まで年度文化庁文化交流使．内閣府知的財産ビジョン専門委員．文化審議会文化政策部会委員．デジタル庁「デジタルの日」検討委員会 構成員． 専門はヒューマンコンピュータインタラクション・バーチャルリアリティ・人工知能領域の学際的展開，特に音響・レーザーホログラムの計算・応用領域に強い興味を持つ．研究論文は分野の最難関国際会議であるACM SIGGRAPHやACM UIST，CHIなどに採択されている．著書に「魔法の世紀（Planets）」「これからの世界をつくる仲間たちへ（小学館）」「超AI時代の生存戦略（大和書房）」など．所属学会はACM，バーチャルリアリティ学会，情報処理学会． 受賞歴として2015年米国WTNよりWorld Technology Award 2015，2016年Ars ElectronicaよりPrix Ars Electronica, EU（ヨーロッパ連合）よりSTARTS Prizeを受賞，欧州最大のVRの祭典Laval VirtualよりLaval Virtual Awardを2017年まで4年連続5回受賞している．他にも，Asia Digital Art Award，ACEとSpringer，ACM Augmented HumanよりBest Paper Award，2012年にはNewscientist誌が選ぶベスト研究ビデオ，2014年にはCG Channelの選ぶBest SIGGRAPH Paperに選ばれた．これまでにBBC, CNN, CNBC, Discovery, AP, ロイター, デイリーメール紙，テレグラフ紙，ロシア国営放送，フランス国営放送などに特集され，世界中100以上の有名新聞，雑誌，テレビ，Webメディアに取り上げられた．国内でもグッドデザイン賞や文化庁メディア芸術祭，経済産業省Innovative Technologiesなどに入選．総務省より異能vation,情報処理推進機構よりスーパークリエータ/天才プログラマ認定． 個展として「Image and Matter (マレーシア・クアラルンプール,2016)」，「Imago et Materia (東京六本木,2017)」，「山紫水明∽事事無碍∽計算機自然（東京,渋谷）」など．デザイン誌Axisやメディアアートの論文誌Leonardoなどのデザイン・アート系雑誌の表紙や，英国Nature誌の増刊研究調査報であるNature Index 2017の表紙を飾るなど，国内外を問わず雑誌・テレビ・ラジオなどメディア露出も多数．国内外の大学やTEDxTokyoなどシンポジウムでの講演も多く，半導体技術の大規模カンファレンスであるSEMICON Japanでは40年の歴史の中で史上最年少で基調講演を務めた．グループ展では「Ars Electronica Festival」「SIGGRAPH Art Gallery」，「県北芸術祭」や「Media Ambition Tokyo」などに参加．過去にSekai No OwariやDom Perignon, Lexus, TDK，ONE OK ROCK, カナヘイ，Sword Art Online劇場版などの作家やアーティスト，ブランド，イベントなどでコラボレーション作品の制作や演出を手掛け，トヨタ・アイシン精機・デンソー・BMW・富士通SSL・電通・博報堂・ADKなど多くの事業者との制作・研究開発を行なっている． Born in 1987, media artist. Completed doctoral course at the University of Tokyo Graduate School of Interdisciplinary Information Studies in 2015 (first time the program has been abbreviated), receiving his PhD in Interdisciplinary Information Studies. After working as a JSPS DC1 research fellow and a research intern at Microsoft Research in the US, he became assistant professor in the Department of Library, Information and Media Studies at the University of Tsukuba in 2015, and headed the Digital Nature Laboratory. In 2015, he founded Pixie Dust Technologies.inc, where he serves as CEO. From 2017 to 2019, he was assistant to the president of the University of Tsukuba, visiting professor at Osaka University of Arts and Digital Hollywood University from 2017, visiting professor at Kanazawa College of Art from 2020, and visiting professor at Kyoto City University of Arts from 2021. Since December 2017, he has served as director and associate professor of the University of Tsukuba Digital Nature Promotion Strategic Research Platform, run by Pixie Dust Technologies Inc. In June 2020, he became director of the Digital Nature Development Research Center. He is the research director of xDiversity (Cross Diversity), a CREST project by the Japan Science and Technology Agency titled “Social implementation of spatial viewing and haptic technology based on a super AI platform towards a society that realizes diversity through computers.” He is also a MITOU Super Creator, MITOU PM and director of MITOU Association, Information-Technology Promotion Agency. He is a member of the Cabinet Office Moonshot Research and Development Program Visionary Council and Moonshot Ambassador. He is a signature project producer for the 2025 World Expo, Japan (Osaka-Kansai Expo). He is a member of the Cabinet Secretariat’s All-Generation Social Security Council and a member of the Digital Reform Related Bill Working Group. He is a member of the World Economic Forum’s Young Global Leaders 2022. He was a cultural exchange ambassador for the Agency for Cultural Affairs from 2020 to 2021. He is a specialist member of the Cabinet Office’s Intellectual Property Vision. He is a member of the Cultural Policy Subcommittee of the Council for Cultural Affairs. He is also a member of the Digital Agency’s “Digital Day” Review Committee. His interests on CG, HCI, VR, visual / audio / tactile presentation method, digital fabrication, automatic driving and human control. He wrote several books “The century of Enchantment (Planets)” and “Survival strategy of super AI era (Daiwa Shobo)”.  He got many award such as World Technology Award 2015 from the WTN in 2015, Prix Ars Electronica from Ars Electronica in 2016, STARTS Prize from EU (European Union), the Laval Virtual Award from Europe’s largest VR festival Laval Virtual for the fourth consecutive year until 2017. In Japan, won the Good Design Award, Media Arts Festival of Agency for Cultural Affairs, Innovative Technologies of Ministry of Economy, Trade and Industry. Certified as genius programmer / super creator certification from Information Promotion Agency Japan, Prize of Innovative Technologies from the Ministry of Economy, Trade and Industry Japan 3 consecutive yearly, selected as Inno-vation from the Ministry of Internal Affairs and Communications Japan. Also,Awarded in Asia Digital Art Award, Best Paper Award in ACE, Springer, ACM Augmented Human, Chosen as Best Video by Newscientist magazine in 2012, Best SIGGRAPH Paper selected by CG Channel in 2014. He has been featured in BBC, CNN, CNBC, Discovery, AP, Reuters, Daily Mail Paper, Telegraph Paper, Russian State Broadcasting, French National Broadcasting etc. and has been featured in more than 100 famous newspapers, magazines, television and web media all over the world. He held  “Image and Matter (Malaysia · Kuala Lumpur, 2016)” and “Imago et Materia (Tokyo Roppongi, 2017)” as a solo exhibition. There are also a lot of media exposures including magazines, television, radio, etc., Covering the cover of design and art magazines such as design magazine Axis and media art journal Leonardo and cover page of Nature Index 2017 which is a research report on the extra work published by Nature magazine in the UK, such as magazines, televisions, and radio There are also many media exposures.  Many lectures were given at universities both in Japan and abroad and at symposiums such as TEDxTokyo, and at SEMICON Japan which is a large-scale conference of semiconductor technology, he served as the keynote speaker at the youngest ever in history in 40 years. As the group exhibition, he participated in “Ars Electronica Festival”, “SIGGRAPH Art Gallery”, “Kempoku Arts Festival” and “Media Ambition Tokyo”. He worked on the collaborative works with famous brands and artists such as Sekai No Owari, Dom Perignon, Lexus, TDK, ONE OK ROCK, Kanahei and Sword Art Online theatrical version, etc. He had collaboration research projects with many business operators such as Toyota, Aisin Seiki, Denso, BMW, Fujitsu SSL, Dentsu, Hakuhodo, ADK, etc. Contact:     contact<-at->digitalnature.slis.tsukuba.ac.jp (Replace <-at-> with @.) Download CV(略歴) PROJECTS PUBLICATION Journals 小澤 知夏, 皆川 達也, 落合 陽一. (2025). Photographic Conviviality: ボディペイント・ワークショップによる同時的かつ共生的な写真体験. 芸術科学会論文誌, 24(4), 14:1-14:17. Nagakura, K., Fushimi, T., Tsutsui, A. et al. Dynamic caustics by ultrasonically modulated liquid surface. Sci Rep 15, 31928 (2025). https://doi.org/10.1038/s41598-025-16190-3 Soma Mochizuki, Yoichi Ochiai, Tatsuki Fushimi; Spatial sound modulation through manual reconfiguration of phased plate. Appl. Phys. Lett. 19 May 2025; 126 (20): 204101. https://doi.org/10.1063/5.0271959 Karen Furuta, Jingjing Li, Tatsuki Fushimi, and Yoichi Ochiai. 2025. Discipline Together with the Self in Kendo: Exploring “Qi” through Mixed Reality and Autoethnography. Proc. ACM Comput. Graph. Interact. Tech. 8, 3, Article 33 (August 2025), 10 pages. https://doi.org/10.1145/3736776 Yuto Asano, Kenta Yamamoto, Tatsuki Fushimi, and Yoichi Ochiai, “Conditional neural holography: a distance-adaptive CGH generator,” Opt. Express 33, 16671-16683 (2025), https://doi.org/10.1364/OE.547343 Igarashi, T., Ochiai, Y. Taste Augmentation of Wine by Artificial Climate Room: Influence of Temperature ",
  "content_length": 82478,
  "method": "requests",
  "crawl_time": "2025-12-01 14:52:02"
}