{
  "name": "Yolande A. A. Strengers",
  "homepage": "https://research.monash.edu/en/persons/yolande-strengers",
  "status": "success",
  "content": "Yolande Strengers - Monash University View Scopus Profile Yolande Strengers Professor ARC Future Fellow, Department of Human Centred Computing https://orcid.org/0000-0002-5664-621X EmailYolande.Strengersmonashedu Accepting PhD StudentsPhD projectssustainable HCI, digital sociology, smart technology, energy futures, feminist technoscience, feminist HCI, human-robot interaction, social practice theory 20052025 Research activity per year Personal profile BiographyYolande Strengers is a Professor of digital technology and society based in the Emerging Technologies Research Lab and Department of Human Centred Computing in the Faculty of Information Technology. She is an Australian Research Council Future Fellow, Director (Research) of the Monash Energy Institute, and Associate Director (Energy Futures) of the  Emerging Technologies Research Lab. Yolande's work spans the disciplines of digital sociology, human-computer interaction (HCI) design, science and technology studies, and human geography. Her research focused on two key challenges in relation to emerging technologies: sustainability and energy consumption; and equity and inclusion. She currently leads two landmark projects: an ARC Future Fellowship project on \"cute\" home helper robots and our emerging relationships with human-like AI; and the RACE for 2030 Scenarios for Future Living project, which explores how people will live in 2050 and the implications for energy forecasting and planning. Yolande's research is highly applied, with past and current partners include ANZ Bank, Ausgrid, AusNet Services, Energy Consumers Australia, Citipower/Powercor/United Energy, Red Energy and Intel Corporation. The Emerging Technologies Research Lab, where Yolande is based, undertakes critical interdisciplinary and international research into the social, cultural and experiential dimensions of the design, use and futures of new and emerging technologies. As part of the lab, Yolande has pioneered methodological and conceptual approaches to understanding our future lives with emerging technologies. Yolande has published widely across leading journals in the social sciences and HCI design fields. Her books include The Smart Wife (MIT Press 2020, co-authored with Dr Jenny Kennedy) and Smart Energy Technologies in Everyday Life (Palgrave McacMillan 2013). Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Education/Academic qualificationInternational Urban and Environmental Management, Master of Social Science, RMIT UniversityAward Date: 1 Aug 2012Social Science, Doctor of Philosophy, RMIT UniversityAward Date: 1 Mar 2010Geography, Bachelor of Arts, Monash UniversityAward Date: 1 Jan 2001 Research area keywordsenergy futuresSmart gridDigital sociologyDigital technologiesSmart homeemerging technologiesConsumptionInclusionSustainabilityGender and diversityAIrobotic assistantshome robotsCute Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Projects Projects per year 2019 2019 2021 2023 2024 2025 2029 3 Finished 4 Active Projects per year CSIRO Next Generation AI for Clean Energy and Sustainability: A welcome addition, or an inevitable intrusion?Wang, H. (Primary Chief Investigator (PCI)), Strengers, Y. (Chief Investigator (CI)), Pink, S. (Chief Investigator (CI)), Bradshaw, A. (Chief Investigator (CI)), Spak, B. (Chief Investigator (CI)) & Grealy, M. (Chief Investigator (CI))7/07/25 → 6/01/29Project: Research Home helper robots: : Home helper robots: Understanding our future lives with human-like AIStrengers, Y. (Primary Chief Investigator (PCI))ARC - Australian Research Council27/06/25 → 31/08/29Project: Research SFL: Scenarios for Future Living: Putting People at the Centre of the Energy TransitionStrengers, Y. (Primary Chief Investigator (PCI)), Pink, S. (Chief Investigator (CI)), Ben-David, R. (Chief Investigator (CI)), MacGill, I. (Chief Investigator (CI)), Roberts, M. (Chief Investigator (CI)), Bruce, A. (Chief Investigator (CI)), Passey, R. (Chief Investigator (CI)), McConnell , D. (Chief Investigator (CI)), Mellick Lopes, A. (Chief Investigator (CI)), Tonkinwise, C. (Chief Investigator (CI)), Briggs, C. (Chief Investigator (CI)), Riedy, C. (Chief Investigator (CI)), Kaviani, F. (Chief Investigator (CI)), Dahlgren, K. (Chief Investigator (CI)) & Lipscombe, S. (Project Manager)6/12/24 → 6/12/27Project: Research AI for Clean Energy and SustainabilityWang, H. (Primary Chief Investigator (PCI)), Jalili, M. (Chief Investigator (CI)), Strengers, Y. (Chief Investigator (CI)), Hill, D. (Chief Investigator (CI)), Razzaghi, R. (Chief Investigator (CI)), Goodwin, S. (Chief Investigator (CI)), Liebman, A. (Associate Investigator (AI)), Pink, S. (Associate Investigator (AI)), Le Bodic, P. (Associate Investigator (AI)), Salehi, M. (Associate Investigator (AI)), Wang, T. (Associate Investigator (AI)), Vered, M. (Associate Investigator (AI)), Rong, J. (Associate Investigator (AI)), George, Y. (Associate Investigator (AI)), Song, H. (Associate Investigator (AI)), Tafakori, L. (Associate Investigator (AI)), Sajjadi, S. (Associate Investigator (AI)), Pourkhanali, A. (Associate Investigator (AI)), Moradiamani, A. (Associate Investigator (AI)) & Kamoona, A. (Associate Investigator (AI))1/01/23 → 31/12/27Project: Research CitiPowerFHD: Future home demand: Anticipating energy and everyday life trends across three Victorian networksStrengers, Y. (Primary Chief Investigator (PCI)), Pink, S. (Chief Investigator (CI)), Nicholls, L. (Chief Investigator (CI)) & Dahlgren, K. (Chief Investigator (CI))Powercor Australia Ltd1/12/21 → 1/12/23Project: Research View all 7 projects Research output Research output per year 2005 2017 2018 2022 2025 60 Article 16 Chapter (Book) 14 Commissioned Report 14 Conference Paper 19 More 6 Audio / Visual Recording 4 Other Report 3 Book 2 Edited Book 2 Comment / Debate 1 Editorial 1 Short Survey Research output per year Research output per year Automation in electric vehicle futuresPink, S., Korsmeyer, H., Dahlgren, K. & Strengers, Y., 2025, In: Mobilities. 20, 2, p. 310-328 19 p.Research output: Contribution to journal › Article › Research › peer-review Open Access 7 Citations (Scopus) Future schools and the energy implications of AI in education: A review of scenarios and method for engaging young people in futures thinkingKaviani, F., Selwyn, N., Strengers, Y., Dahlgren, K., Cumbo, B. & Wagner, M., Sept 2025, In: Policy Futures in Education. 23, 6, p. 1067-1085 19 p.Research output: Contribution to journal › Article › Research › peer-review Open AccessFile 2 Citations (Scopus) Household and home businesses research: emerging lifestyles, preferences and practicesKaviani, F., Strengers, Y. A. A. & Dahlgren, K., Oct 2025, Clayton VIC Australia: Monash University. 90 p.Research output: Book/Report › Commissioned Report › Research File “We'd rather have a clean planet than anything else”: Household values and automated future electric vehicle chargingKaviani, F., Dahlgren, K., Koppel, S., Strengers, Y., Martin, R., Korsmeyer, H. & Pink, S., Mar 2025, In: Energy Research and Social Science. 121, 11 p., 103965.Research output: Contribution to journal › Article › Research › peer-review Open AccessFile 4 Citations (Scopus) “We're already experts in school, right?”: Supporting students’ construction of future school scenariosSelwyn, N., Kaviani, F., Strengers, Y., Dahlgren, K., Cumbo, B. & Wagner, M., Feb 2025, In: Futures. 166, 12 p., 103541.Research output: Contribution to journal › Article › Research › peer-review Open AccessFile 5 Citations (Scopus) View all 123 research outputs Prizes 2021 9th Asia Pacific Eldercare Innovation Awards, Best Ageing Research - Winner: 'Smart homes for seniors: Intelligent home design for independent living'Pink, S. (Recipient), Duque, M. (Recipient), Strengers, Y. (Recipient) & Williams, C. (Recipient), 2021Prize: Prize (including medals and awards) 2021 IoT (Internet of Things) Awards, Diversity, Equity & Inclusion in Action - Winner: 'Smart Homes for Seniors: Intelligent home design for independent living'Strengers, Y. (Recipient), Pink, S. (Recipient), Duque Hurtado, M. (Recipient), Martin, R. (Recipient), Nicholls, L. (Recipient), Mortimer, M. (Recipient), Horan, B. (Recipient), Eugene, A. (Recipient) & Thomson, S. (Recipient), 2021Prize: Prize (including medals and awards) 2024 Good Design Award, Design Research - Gold Winner: 'Digital Energy Futures: Foresights for Future Living'Pink, S. (Recipient), Korsmeyer, H. (Recipient), Dahlgren, K. (Recipient), Strengers, Y. (Recipient), Martin, R. (Recipient), Kaviani, F. (Recipient) & Nicholls, L. (Recipient), Sept 2024Prize: Prize (including medals and awards) Best Paper Award, International Conference on Human Factors in Computing Systems (CHI) 2019Strengers, Y. (Recipient), Kennedy, J. (Recipient), Arcari, P. (Recipient), Nicholls, L. (Recipient) & Gregg, M. (Recipient), 2019Prize: Prize (including medals and awards) Good Design Australia Award for Design Ethnography Pink, S. (Recipient), Fors, V. (Recipient), Lanzeni, D. (Recipient), Duque Hurtado, M. (Recipient), Sumartojo, S. (Recipient) & Strengers, Y. (Recipient), 8 Sept 2023Prize: Prize (including medals and awards) View all 10 prizes Activities Activities per year 2022 2022 2022 1 Public event Activities per year Living with RobotsSumartojo, S. (Contributor), Pink, S. (Contributor), Kulic, D. (Contributor), Strengers, Y. (Contributor) & Mintrom, M. (Contributor)2 May 2022Activity: Community Talks, Presentations, Exhi",
  "content_length": 10935,
  "method": "requests",
  "crawl_time": "2025-12-01 14:52:02"
}