{
  "name": "Yong Jeong Yi",
  "homepage": "https://sco.skku.edu/sco/professor/professor.do?mode=view&perId=LZStrE4KQtg6gNgKmBuBLEB3A7ANgIYAUByGA1ACwBGYA5gLxVA%20&",
  "status": "success",
  "content": "성균관대학교 글로벌융합학부 | 교수소개 | 전임교수 본문 바로가기 주메뉴 바로가기 서브메뉴 바로가기 교수소개전임교수 교수소개 보직교수 전임교수 겸직교수 전임교수 목록 부교수 건강정보행위 이용정 02-760-0259 yjyi@g.skku.edu 교수회관 5층 40514호실 관심분야 건강 및 의학정보학 (Health & Medical Informatics) 소비자건강정보행태 (Consumer Health Information Behavior) 건강문해(Health Literacy) 학력 (Ph.D.) 플로리다 주립대학교, 문헌정보학박사 (M.L.I.S) 텍사스 오스틴, 문헌정보학석사 (B.A) 성균관대학교 문헌정보학과 약력/경력 성균관대학교 글로벌융합학부, 부교수 메타바이오헬스대학원 학술지 논문 (2024) Comparing COVID-19 and general health information-seeking behaviors among Chinese international students in South Korea. JOURNAL OF LIBRARIANSHIP AND INFORMATION SCIENCE. 56, 4 (2024) Understanding Double Stigma Toward Minority Groups on Social Media in the COVID-19 Pandemic: Findings from South Korea. Journal of Asian Sociology. 53, 3 (2024) Revisiting the Andersen Model: Transnational Ties With the Home Country and Healthcare Utilization Among Chinese International Students in South Korea. SAGE OPEN. 14, 1 (2023) The Power of Fake News: Big Data Analysis of Discourse about COVID-19 Related Fake News in South Korea. INTERNATIONAL JOURNAL OF COMMUNICATION. 17, 1 (2022) Understanding coronavirus disease 2019 (COVID-19) vaccine hesitancy: Evidence from the community-driven knowledge site Quora. DIGITAL HEALTH. 8, 1 (2022) 북한이탈주민의 정보빈곤에 관한 연구: Chatman의 정보빈곤이론을 기반으로. 정보관리학회지. 39, 3 (2022) A model for mobile curation services in academic libraries. ELECTRONIC LIBRARY. 40, 1-2 (2021) Health literacy and health information-seeking behavior of immigrants in South Korea. LIBRARY & INFORMATION SCIENCE RESEARCH. 43, 4 (2021) 대학도서관의 다국어 맞춤형 서비스가 중국인 유학생의 이용자 만족도에 미치는 영향. 정보관리학회지. 38, 2 (2021) 대학생들의 모바일 앱을 이용한 금연정보탐색과 행위변화. 한국도서관·정보학회지. 52, 1 (2021) 병원정보탐색 어플리케이션의 지속적 이용에 관한 연구. 정보관리학회지. 38, 1 (2020) 공공도서관 북트레일러 서비스가 이용자 행동반응정도에 미치는 영향. 한국문헌정보학회지. 54, 4 (2020) 소셜 Q&A 사이트의 질문 분석을 통한 청소년의 성 정체성(sexual identity) 고민에 대한 이해. 한국도서관·정보학회지. 51, 4 (2020) 대학생들의 개인정보관리 행태에 영향을 미치는 요인에 관한 연구. 정보관리학회지. 37, 1 (2020) 이용자의 혁신저항이 모바일 건강 앱 이용의도에 미치는 영향. 한국비블리아학회지. 31, 1 (2019) 페이스북 그룹 게시물 분석을 통한 우울증 관련 주제에 대한 고찰. 한국문헌정보학회지. 53, 4 (2019) 온라인 정보원의 인지적 권위에 대한 인식이 정보의 품질 평가에 미치는 영향. 한국비블리아학회지. 30, 4 (2019) 의과대학 대학원생의 학술정보 검색엔진 이용 동기 및 이용자 만족도에 관한 연구. 한국비블리아학회지. 30, 4 (2019) 청소년들의 성 정체성에 관한 지식검색 커뮤니티 정보탐색행태. 정보관리학회지. 36, 4 (2019) Identification and Comparison of the Persuasive Elements Present in \"Best Answers\" to STD-Related Questions on Social QA Sites: Yahoo! Answers (United States) Versus Knowledge-iN (South Korea). INTERNATIONAL JOURNAL OF COMMUNICATION. 13, 수상/공훈 풀브라이트 어워드 학술회의논문 (2021) The Effects of Online User Instruction on Information Literacy Ability: Suggestions for Post COVID-19 Era. 2021 Korean Library and Information Science Society International Conference. 대한민국 (2020) Understanding of Double-Stigmatization of Minority Groups on Social Media during COVID-19 Pandemic: A Case Study of South Korea. 한국사회학회 정기사회학대회. 대한민국 (2020) The influence of immigrants' linguistic and cultural barriers on their health information-seeking behavior(이민자들의 언어·문화적 장벽이 건강정보탐색행위에 미치는 영향). 2020 K-LISS/3rd I-LISS International Conference. 대한민국 (2020) 공공도서관 북트레일러 서비스가 이용자 행동반응정도에 미치는 영향 연구. 한국정보관리학회 학술대회. 대한민국 (2020) 대학도서관 모바일 애플리케이션 지속적 이용 의도에 관한 연구. 한국정보관리학회 학술대회. 대한민국 (2020) 이민자들의 건강문해와 건강정보행위. 한국정보관리학회. 대한민국 (2020) Understanding Information Seeking for Health Supplements in a Social Q&A Site with Topic Modeling. IEEE BigComp2020. 대한민국 (2019) A Model for Customized Mobile Curation Services in Academic Libraries. International Conference on Health Data and Information Services. 대한민국 (2019) A Study on the Continuous Use of Mobile Applications in Hospital Information Seeking. International Conference on Health Data and Information Services. 대한민국 (2019) A Study on the Effects of Multilingual Customized Services on User Satisfaction of Chinese Students in Academic Libraries. International Conference on Health Data and Information Services. 대한민국 (2019) A Study on the Motivation and User Satisfaction of Medical Students Using Academic Search Engines. International Conference on Health Data and Information Services. 대한민국 (2019) A Study on the User Satisfaction of Mobile Applications in an Academic Library. International Conference on Health Data and Information Services. 대한민국 (2019) Adolescents’ Information Seeking Behavior for Gender Identity in a Community-Driven Knowledge Site. International Conference on Health Data and Information Services. 대한민국 (2019) Effects of Self-Stigma on Health Information Behavior of Dementia Caregivers. International Conference onHealth Data and Information Services. 대한민국 (2019) The Effects of Innovation Resistance of Users on Intention to Use Mobile Health Applications. International Conference on Health Data and Information Services. 대한민국 (2019) The Influences of Cognitive Authority of Online Information Sources on Information Quality Evaluation. International Conference on Health Data and Information Services. 대한민국 (2019) Stages of Change in Smoking Cessation and Health Information Behavior. Proceedings of Association for Information Science & Technology Association for Information. 오스트레일리아 (2019) 법학전문도서관 비이용에 관한 연구. 한국정보관리학회 학술대회. 대한민국 (2019) 자기낙인이 치매부양자들의 건강정보행위에 미치는 영향. 한국정보관리학회 학술대회. 대한민국 (2018) Stages of Change to Smoking Cessation and Health Information-Seeking Behavior of Health Application Users. International Conference on Qualitative and Quantitative Methods in Libraries. 그리스 이 사이트는 자바스크립트를 지원하지 않으면 정상적으로 보이지 않을수 있습니다.",
  "content_length": 5402,
  "method": "requests",
  "crawl_time": "2025-12-01 14:52:04"
}