{
  "name": "Yong Wang 0021",
  "homepage": "https://dr.ntu.edu.sg/entities/person/Wang-Yong",
  "status": "success",
  "content": "Asst Prof Wang Yong | Academic Profile | DR-NTU | Research | NTU Singapore Skip to main content DR-NTU has been upgraded! We're still fine-tuning things, so thanks for your patience - and please report any issues to library@ntu.edu.sg ACADEMIC PROFILE: FACULTY Loading...Loading...Asst Prof Wang YongAssistant Professor, College of Computing & Data Scienceyong-wang@ntu.edu.sgWeb Site Website KeywordsGraphics and Interactive ComputingData VisualizationHuman-computer Interaction BiographyDr. Yong Wang is a tenure-track assistant professor at the College of Computing and Data Science, Nanyang Technological University, Singapore. Before that, he was a faculty member and Lee Kong Chian Fellow at the School of Computing and Information Systems, Singapore Management University (SMU). He obtained his PhD degree from the Hong Kong University of Science and Technology, his master degree from Huazhong University and Science Technology, and his bachelor degree from Harbin Institute of Technology. His research interests include information visualization, visual analytics, HCI and applied machine learning, with a special focus on AI-powered data visualization and visual analytics for FinTech, quantum computing and online learning. He was recognized as the AI 2000 Most Influential Scholar Honorable Mention in Visualization in 2024. His work has been published at premier venues of visualization and human-computer interaction (e.g., IEEE VIS, IEEE TVCG, ACM CHI and EuroVis) and has received multiple paper awards, including the Best Paper Honorable Mention Award at ACM CHI 2022, Best Paper Honorable Mention Awards at IEEE VIS 2021 and Best Paper Award at ACM IUI 2017. He has served as a program committee for IEEE VIS, EuroVis, PacificVis, CIKM, ACM IUI, ChinaVis, and a reviewer for multiple visualization conferences and journals. For more details, please refer to https://yong-wang.org/. Research Interests Current Grants Awards & Recognition Teaching",
  "content_length": 1963,
  "method": "requests",
  "crawl_time": "2025-12-01 14:52:06"
}