{
  "name": "Yong-Lae Park",
  "homepage": "https://softrobotics.snu.ac.kr",
  "status": "success",
  "content": "Soft Robotics and Bionics Laboratory - 서울대학교 SOFT ROBOTICS & BIONICS LAB Soft, safe, and wearable robotics HOME RESEARCH PUBLICATIONS PEOPLE MEDIA Welcome to the Soft Robotics and Bionics Lab Our research goal is to analyze the design and dynamics of biological systems and transform them into robotic/mechatronic systems for human life. We are interested in bio-inspired design of soft robots and development of novel manufacturing methods for multi-material smart structures. Softness in Robotics Soft systems are a promising direction for future biomedical systems in which human-machine interactions are highly critical. The use of soft sensing and actuation materials and flexible electronics are imperative to build systems that both interact with and assist humans, as our bodies are covered with soft tissues. Target example systems include soft wearable rehabilitation/assistive devices, motion-sensing suits for whole body biomechanics, active soft prosthetics and orthotics, soft surgical/interventional tools, and haptic interface devices. Research Vision We envision our research being a foundation to establish a design and manufacturing methodology for developing soft robots by implementing biological sensing and actuation mechanisms. News Sohee Yoon received the Best Ph.D. Thesis Award from the Department of Mechanical Engineering, Seoul National University. (Aug. 2025). Sohee Yoon successfully completed the Ph.D. thesis defense. Congrats! (Jun. 2025). Jaehyun Yi successfully completed the Ph.D. thesis defense. Congrats! (Jun. 2025). Jeongnam Kim received M.S. Thesis Presentation Award, Mechanical Engineering, Seoul National University (Jun. 2024). Jaehyun Yi received Bronz Award from the Humantech Paper Award Competition organized by Samsung Electronics (Feb. 2025). Prof. Park received Shin Yang Engineering Academic Award for outstanding research, College of Engineering, Seoul National University (Oct. 2024). Eunsu Lee received the Best M.S. Thesis Award from the Department of Mechanical Engineering, Seoul National University (Aug. 2024). Jihun Yu received the Best Poster Award at the 2024 Soft Robotics Symposium (August 2024). Eunsu Lee received M.S. Thesis Presentation Award, Mechanical Engineering, Seoul National University (May 2024). Jihun Yu received M.S. Thesis Presentation Award, Mechanical Engineering, Seoul National University (May 2024). Dr. Subyeong Ku received the Best Ph.D. Thesis Award in the area of Dynamics and Robotics from the Korean Society of Mechanical Engineers (Apr. 2024). Prof. Park gave a Plenary Speech at the IEEE International Conference on Soft Robotics (RoboSoft 2024), San Diego, CA, USA (Apr. 2024). Myungsun Park received the Best Poster Presentation Award at the SRRC Workshop, Soft Robotics Research Center, Seoul National University (Feb. 2024). Jaewoong Jung successfully completed the Ph.D. thesis defense. Congrats! (Dec. 2023). Dongwook Kim successfully completed the Ph.D. thesis defense. Congrats! (Nov. 2023). Myungsun Park successfully completed the Ph.D. thesis defense. Congrats! (Nov. 2023). Subyeong Ku successfully completed the Ph.D. thesis defense and accepted a job offer from Korea Automotive Technology Institute (KATECH). Congrats! (Jul. 2023). Prof. Park was promoted to Full Professor with Tenure (Mar. 2023). Jaeyoun Choi received the Best M.S. Thesis Award from the Department of Mechanical Engineering, Seoul National University (Feb. 2023). Sohee John Yoon received Bronz Award from the Humantech Paper Award Competition organized by Samsung Electronics (Feb. 2023). Jaeyoun Choi received M.S. Thesis Presentation Award, Mechanical Engineering, Seoul National University (Dec. 2022). Taekyung Kim received the Best Ph.D. Thesis Award from the Department of Mechanical Engineering, Seoul National University. (Aug. 2022). Jaehoon Kim received the Best M.S. Thesis Award from the Department of Mechanical Engineering, Seoul National University. (Aug. 2022). Gyowook Shin successfully completed the Ph.D. thesis defense. Congrats! (Jun. 2022). Jae In Kim successfully completed the Ph.D. thesis defense. Congrats! (Jun. 2022). Taekyung Kim successfully completed the Ph.D. thesis defense. Congrats! (Jun. 2022). Prof. Park was appointed as the Associate Editor of npj Robotics (July. 2023). Prof. Park was appointed as the Associate Editor of Soft Robotics (Jun. 2023). Prof. Park was appointed as the Senior Editor of the IEEE Robotics and Automation Letters (May 2023). Youngjin Choi, Gyowook Shin, and Byungjun Jeon received Merit Award from the Humantech Paper Award Competition organized by Samsung Electronics (Feb. 2022). Yeongmin Park received M.S. Thesis Presentation Award, Mechanical Engineering, Seoul National University (Dec. 2021). Junghan Kwon received the Best Ph.D. Thesis Award from the Dean of the College of Engineering, Seoul National University. One of only five winners among over 200 Ph.D. graduates in Fall 2021! (Aug. 2021). Junghan Kwon successfully completed the Ph.D. thesis defense and accepted an offer for a postdoctoral fellow position from Harvard University, Cambridge, USA. Congrats! (Jun. 2021). Sudong Lee received M.S. Thesis Presentation Award, Mechanical Engineering, Seoul National University (Jun. 2021). \"Hybrid System Analysis and Control of a Soft Robotic Gripper with Embedded Proprioceptive Sensing for Enhanced Gripping Performance\" was selected as a Cover Article of Advanced Intelligent Systems (Mar. 2021). \"Direct Printing of Sub-30 μm Liquid Metal Patterns on Three-Dimensional Surfaces for Stretchable Electronics\" was selected as a ‘Highlight of 2020’ by the Editorial Board of Journal of Micromechanics and Microengineering (Mar. 2021). Minsik Choi and Sohee John Yoon received Silver Award from the Humantech Paper Award Competition organized by Samsung Electronics (Feb. 2021). Taehwan Kim received M.S. Thesis Presentation Award, Mechanical Engineering, Seoul National University (Dec. 2020). \"Soft Miniaturized Actuation and Sensing Units for Dynamic Force Control of Cardiac Ablation Catheters\" was selected as a Cover Article of Soft Robotics (Oct. 2020). Prof. Park received Best Application Paper Award from the IEEE Transactions on Haptics (Mar. 2020). Prof. Park was selected as an JMM Emerging Leader from the Journal of Micromechanics and Microengineering (Jan. 2020). DongWook Kim received M.S. Thesis Presentation Award, Mechanical Engineering, Seoul National University (Dec. 2019). Taekyoung Kim received Global PhD Fellowship from National Research Foundation (NRF), Korea. One of only three winners in the country in mechanical engineering! (Aug. 2019). \"Sensorized Flat Pneumatic Artificial Muscles (sFPAM) Embedded with Biomimetic Microfluidic Sensors for Proprioceptive Feedback\" was selected as a Cover Article of Soft Robotics (Aug. 2019). Sudong Lee received Kwanjeong Fellowship from Kwanjeong Educational Foundation, Korea (Jul. 2019). Taekyoung Kim, Sohee John Yoon and Yong-Lae Park received the Best Conference Paper Award at the IEEE International Conference on Soft Robotics (RoboSoft 2019) (Apr. 2019). Team LIRO (Junghan Kwon, Sehun Park, Dongwook Kim, Myungsun Park, Jaewoong Jung, Hyunsung Cho, and Yong-Lae Park) received the 1st Place Award for Wearable Challenge at the RoboSoft2019 Competition (Apr. 2019). Team HMSG (Taekyoung Kim, Subyeong Ku, Hyungwoong Choi, and Yong-Lae Park) received the 2nd Place Award for Manipulation Challenge at the RoboSoft2019 Competition (Apr. 2019). Team SRBL (Gyowook Shin, Junhyung Kim, Min Sik Choi, Youngjoon Baek, Sudong Lee, and Yong-Lae Park) received the 3rd Place Award for Locomotion Challenge at the RoboSoft2019 Competition (Apr. 2019). Prof. Park organized the IEEE International Conference on Soft Robotics (RoboSoft 2019), Seoul, Korea, as the Program Chair (Apr. 2019). Yeong Hyeon Jeong received M.S. Thesis Presentation Award, Mechanical Engineering, Seoul National University (Dec. 2018). Junghan Kwon and Taekyoung Kim received Research Achievement Awards, respectively, Soft Robotics Research Center (SRRC) (Aug. 2018). Taekyoung Kim received M.S. Thesis Presentation Award, Mechanical Engineering, Seoul National University (Jun. 2018). Prof. Park was promoted to Associate Professor (Mar. 2023). Team SRBL (Jaein Kim, Kyowook Shin, Sehun Park, and Sohee John Yoon) received the Best Project Award at the Design for Manufacture class and presented their work at SMART (Jan. 2018). Click HERE for more details. DongWook Kim and Suhan Kim received Undergraduate Thesis Presentation Awards, respectively, Mechanical Engineering, Seoul National University (Dec. 2017). Team SOFT (Yeong-min Yoon, Dongwook Kim, and Seungbin Baek) received a Merit Award, X-Corp Challenge, Seoul National University (Nov. 2017). Prof. Park received Okawa Foundation Research Grant Award (Dec. 2014). Click HERE for more details. Robo-Ankle appears in Discovery News (Jan. 2014), New Scientist (Jan. 2014), Engadget (Jan. 2014), Med Device Online (Feb. 2014), and Pittsburgh Post-Gazatte (Feb. 2014) Prof. Park received IEEE Sensors Journal Best Paper Award, IEEE Sensors Council (Nov. 2013). Click HERE for more details. Prof. Park received NASA Tech Briefs Award, NASA Johnson Space Center (Sep. 2012). Click HERE for more details. Soft Artificial Skin appears in the IEEE Life Science (Aug. 2012). Click HERE for more details. Copyright © 2019 - All Rights Reserved - Soft Robotics and Bionics Laboratory",
  "content_length": 9438,
  "method": "requests",
  "crawl_time": "2025-12-01 14:52:06"
}