{
  "name": "Yongqiang Tian 0001",
  "homepage": "https://yqtian.com",
  "status": "success",
  "content": "Yongqiang Tian Yongqiang Tian yongqiang.tian at monash.edu About Me I am a researcher in software engineering at Monash University. My research interest lies in software testing and debugging. There are two questions I am always interested in: What properties of software should be tested but have not been studied? How software can be effectively and efficiently tested and debugged w.r.t such properties? I conduct systematic empirical studies and propose novel automated techniques to answer the above questions. I have been working on testing and debugging of the following domains of software: Deep Learning Compilers/Frameworks/Models: ICSE'25x2, TOSEM'23, EmSE'21, ISSTA'23, ... C/C++/Solidity Compilers: ISSTA'24, TOSEM'23, IJCAI'23, ASPLOS'23, OOPSLA'23, FSE'23, ... Data Vislualization Library: FSE'25 More detailed publications can be found at Google Scholar and DBLP. Before joining Monash, I was a Research Assistant Professor at Department of Computer Science and Engineering, the Hong Kong University of Science and Technology from 2023 to 2025. I obtained my dual Ph.D. degree from HKUST and UWaterloo, co-supervised by Prof. Shing-Chi Cheung and Prof. Chengnian Sun. Prior to that, I got my bachelor's degree from City University of Hong Kong with First Class Honors. Openings If you are interested in my research projects, please feel free to reach out to me via email. I would be happy to discuss opportunities for collaboration, which could include funded roles such as PhD student, Research Intern and Research Assistant. I'm open to exploring different formats and arrangements to find the best fit. Please don't hesitate to contact me to learn more. Please read the information here. Updates Oct, 2025: Our paper, Optimization-Aware Test Generation for Deep Learning Compilers, and Bounded Exhaustive Random Program Generation for Testing Solidity Compilers is accepted by ICSE'26. Aug, 2025: Our paper, Latra: A Template-Based Language-Agnostic Transformation Framework for Effective Program Reduction, is accepted by ASE'25. Aug, 2025: Our paper, Boosting Program Reduction with the Missing Piece of Syntax-Guided Transformations, is just accepted by OOPSLA'25. Apr, 2025: Our paper, An Empirical Study of Bugs in Data Visualization Libraries, has been accepted by FSE'25. Mar, 2025: I am invited to be the PC member of ASE'25. Please submit your research work to ASE'25. Mar, 2025: I am invited to be the PC member of ISSRE'25. Please submit your research work to ISSRE'25. Oct, 2024: Two studies about delta debugging, Toward a Better Understanding of Probabilistic Delta Debugging and WDD: Weighted Delta Debugging are accepted by ICSE'25. Services Information Director, ACM Special Interest Group on Software Engineering (SIGSOFT), since 2024 Program Committee: ASE'25, ISSRE'25, ISSTA'25, PROMISE'25, COMPSAC'25, ISSRE'24, ICST'24, AIware'24, Internetware'24 Journal Reviewer: TOSEM, TSE, TDSC, EmSE Artifact Evaluation Committee: OOPSLA'25, FSE'24, PLDI'24, PLDI'23, ISSTA'23, ESEC/FSE'23 Shadow PC: MSR'22 Additional Reviewers within the Technical Track: ICSE'24, FSE'24, ICSE'21, ISSTA'21, ESEC/FSE'22, etc. Volunteer: Emerging Trends in Software Development Workshop 2023, ISSTA'19 Honors and Awards Distinguished Reviewer Award, ASE'25 MSCA Postdoctoral Fellowships, 2025. ACM SIGSOFT CAPS, ISSTA'24, ICSE'24, 2024. ASPLOS'23 Student Travel Grant, 2023. GO-Bell Scholarship, University of Waterloo, 2020-2022. Microsoft Asia Cloud Research Software Fellow (CRSF) Awards, 2019. Hong Kong PhD Fellowship Scheme, Research Grants Council (RGC) of Hong Kong, Annually in 2017-2020. Publications See here, Google Scholar and DBLP. Teaching HKUST COMP1021 Introduction to Computer Science, Fall 2024. Instructor. Extra Course Materials. UWaterloo SE465 Software Testing and Quality Assurance, Winter 2023. Teaching Assistant. UWaterloo SE463 Software Requirements Specification & Analysis, Spring 2022. Teaching Assistant. UWaterloo SE490 Design Project 1, Spring 2022. Teaching Assistant. UWaterloo SE465 Software Testing and Quality Assurance, Winter 2022. Teaching Assistant. HKUST COMP5111 Fundamentals of Software Analysis, Spring 2020. Teaching Assistant. HKUST COMP5111 Fundamentals of Software Analysis, Spring 2019. Teaching Assistant. HKUST COMP3021 Java Programming, Fall 2018. Teaching Assistant. CityU EE3201 Signals and Systems, Fall 2016. Student Tutor Mentored Students It is my greatest honor to work with the following remarkable individuals. Mr. Weiqi Lu, Ph.D. student at HKUST, since 2023 Miss Xiaohan Zhong, Ph.D. student at HKUST, since 2023 Mr. Yiwen Dong, Ph.D. student at UWaterloo, since 2021 Dr. Mengxiao Zhang, Ph.D. student at UWaterloo, 2021-2025. Thesis: Program Reduction: Versatility, Insights, and Efficacy Mr. Zhenyang Xu, Ph.D. student at UWaterloo, since 2020 Mr. Haoyang Ma, Ph.D. student at HKUST, since 2020 Mr. Tzu-yang Kuo, Undergraduate at HKUST, 2018-2020. Now at Google. Mr. Zhihua Zeng, Visiting Intern from Zhejiang University, Summer 2019. Miscellaneous Training and Voluntary Experience Mental Health First Aid (MHFA), Hong Kong, 2024 CPR & AED Training, Fire Services Department, Hong Kong, 2024 Fire Safety Ambassador, Fire Services Department, Hong Kong, 2023 Volunteer of Tree Transplantation, HKUST, 2023 Volunteer of City-Youth Empowerment Project, CityU of HK, Fall 2016 Projects Besides research prototypes, I am actively maintaining the following projects: Guide for using LaTeX in academic writing A collection of awesome and useful resources for research DBLP BibTeX Copier",
  "content_length": 5562,
  "method": "requests",
  "crawl_time": "2025-12-01 14:52:19"
}