{
  "name": "Yong Jae Lee",
  "homepage": "https://pages.cs.wisc.edu/~yongjaelee",
  "status": "success",
  "content": "Yong Jae Lee, UW-Madison Yong Jae Lee (Note: \"Yong Jae\" is my full first name. Though sometimes mistaken as a first and middle name, it's one Korean first name.) Susan Beth Horwitz Professor Department of Computer Sciences University of Wisconsin-Madison Office: Computer Sciences 5395 Email: yongjaelee at cs dot wisc dot edu Phone: 608-262-1804 Bio / CV / Research Statement / Github / Google Scholar I am a Professor in the Computer Sciences Department at UW-Madison, where I lead the Wisconsin AI and Vision Lab (WAIV). My research interests are in computer vision and machine learning, with a focus on creating robust AI systems that can learn to understand our multimodal world with minimal human supervision.  Before joining UW-Madison in Fall 2021, I spent one year as an AI Visiting Faculty at Cruise, and before that, 6 wonderful years as an Assistant and then Associate Professor at UC Davis.  Prior to that, I was a Postdoctoral Fellow in the EECS Dept at UC Berkeley working with Alyosha Efros (8/2013-6/2014).  I also spent a year as a Postdoctoral Fellow in the Robotics Institute at Carnegie Mellon University (8/2012-8/2013), where I had the good fortune to work with Alyosha Efros and Martial Hebert.  I obtained my Ph.D. from the University of Texas at Austin in May 2012 under the supervision of Kristen Grauman, and my B.S. from the University of Illinois at Urbana-Champaign in May 2006.  I have also worked with Larry Zitnick and Michael Cohen as a summer intern at Microsoft Research. Prospective PhD students: please apply to the UW-Madison Computer Sciences program if you'd like to work with me. Unfortunately, I may not be able to respond to individual emails about admissions. News 6/2025: Honored to receive the H.I. Romnes Faculty Fellowship 5/2025: Honored to be appointed to the Susan Beth Horwitz Professorship 5/2025: I've been promoted to Full Professor effective Fall 2025 -- huge thanks to all my wonderful students, colleagues, collaborators, mentors, and letter writers 8/2021: I joined the CS department at UW-Madison as an Associate Professor 9/2020: Our paper on adaptive anti-aliasing in convnets won the Best Paper Award at BMVC 2020 [link] 6/2020: I will join the CS department at UW-Madison as an Associate Professor in Fall 2021, and spend one year at Cruise as an AI Visiting Faculty till then 5/2020: I received tenure -- I am grateful to all my wonderful students, colleagues, collaborators, mentors, and letter writers 10/2019: Our real-time instance segmentation method, YOLACT, won the Most Innovative Award at the COCO Object Detection Challenge, ICCV 2019 9/2019: I received the UC Davis College of Engineering Outstanding Junior Faculty Award [link] 6/2019: My PhD student Krishna Kumar Singh won the 2019 UC Davis Best Graduate Researcher in Computer Science Award (Honorable Mention) -- congrats Krishna! 6/2019: My undergraduate student Daniel Bolya won the 2019 UC Davis Chancellor's Award for Excellence in Undergraduate Research (Honorable Mention)  -- congrats Daniel! 3/2019: I received the Adobe Data Science Research Award -- thanks Adobe! 8/2018: I received the AWS ML Research Award and a new NSF grant to study 1st-3rd person videos 6/2018: My PhD student Fanyi Xiao won the 2018 UC Davis Best Graduate Researcher in Computer Science Award -- congrats Fanyi! 3/2018: I received the NSF CAREER Award [link] 8/2017: I received the Army Research Office (ARO) Young Investigator Award [link] 7/2017: I received the Hellman Foundation Fellowship [link] 4/2016: Organizing the 4th Workshop on Egocentric (First-Person) Vision at CVPR 2016 with Michael Ryoo (Indiana), Kris Kitani (CMU), and Yin Li (Georgia Tech) 7/2014: I joined the CS department at UC Davis as an Assistant Professor Research Interests My main research interests are in computer vision and machine learning. I am particularly interested in creating robust AI systems that can understand our multimodal world with minimal human supervision. Teaching CS 639: Deep Learning for Computer Vision (Spring 2025) CS 839: Learning based Image Synthesis and Manipulation (Fall 2024) CS 639: Deep Learning for Computer Vision (Spring 2024) CS 839: Learning based Image Synthesis and Manipulation (Fall 2023) CS 639: Deep Learning for Computer Vision (Spring 2023) CS 839: Learning based Image Synthesis and Manipulation (Fall 2022) CS 839: Deep Learning for Visual Recognition (Spring 2022) ECS 174: Computer Vision (Spring 2020) ECS 269: Visual Recognition (Fall 2019) ECS 174: Computer Vision (Spring 2019) ECS 269: Visual Recognition (Fall 2018) ECS 174: Computer Vision (Spring 2018) ECS 289G: Visual Recognition (Winter 2018) ECS 174: Computer Vision (Spring 2017) ECS 289G: Visual Recognition (Fall 2016) ECS 289G: Visual Recognition (Fall 2015) ECS 189G: Intro to Computer Vision (Spring 2015) ECS 289H: Visual Recognition (Fall 2014) Lab Members Zhuoran Yu (PhD student) Zeyi Huang (PhD student) Thao Nguyen (PhD student) Anirudh Sundara Rajan (PhD student) Harris Zhang (PhD student) Jaden Park (PhD student) Aniket Rege (PhD student, co-advised with Ramya Vinayak) Bocheng Zou (Undergraduate student); Trewartha Senior Thesis Research Award 2024 Donghyun Lee (Undergraduate student) Sigmund Vanvalkenburgh (Undergraduate student) Le Thien Phuc Nguyen (Undergraduate student) Thomas Liang (Undergraduate student); David DeWitt Scholarship 2025 Alumni Former PhD students Fanyi Xiao (2015-2020) â Research Scientist at Meta AI; UC Davis Best Graduate Researcher in Computer Science Award 2018 Krishna Kumar Singh (2015-2020) â Research Scientist at Adobe Research; UC Davis Best Graduate Researcher in Computer Science Award (Honorable Mention) 2019 Maheen Rashid (2015-2021) â Research Scientist at Univrses Xueyan Zou (2018-2024) â Postdoc at UCSD Utkarsh Ojha (2019-2024) â Postdoc at Carnegie Mellon University Haotian Liu (2019-2024) â Member of Technical Staff at xAI Yuheng Li (2019-2024) â Research Scientist at Adobe Research Mu Cai (2021-2025) â Research Scientist at Google DeepMind Former MS students Zhongzheng (Jason) Ren (2016-2018) â PhD student at UIUC Wenjian Hu (2017-2018) â Research Scientist at Facebook Leonardo Ferrer (2017) â Software Engineer at Google Wei-Pang (Tyler) Jan (2019) â Software Engineer at Amazon Chong Zhou (2019-2020) â PhD student at Nanyang Technological University Yangming Wen (2019-2020) â Research Engineer at Electronic Arts Yang Xue (2020-2022) â AI Perception Engineer at Black Sesame Technologies Rafael A. Rivera-Soto (2020-2021) â PhD student at Johns Hopkins University Former BS students and visitors Antonia Creswell (2014-2015) â PhD student at Imperial College London Yi Mang (Terry) Yang (2017-2018) â Software Engineer at Amazon Xie Zhou (2018-2019) â MS student at UC Berkeley Daniel Bolya (2018-2019) â PhD student at Georgia Tech; Chancellor's Award for Excellence in Undergraduate Research (Honorable Mention) 2019, NSF graduate research fellowship Aron Sarmasi (2018-2019) â MS student at UC Davis Waiyu Lam (2019-2020) â MS student at Cornell Qi Zhu (summer 2015, co-supervised with Ian Davidson) â PhD student at UIUC Xiuye Gu (summer 2016, 2018-2019) â MS student at Stanford Haolin Fu (summer 2016, co-supervised with Cho-Jui Hsieh) â MS student at Yale Haotian Liu (summer 2018) â PhD student at UC Davis Hao Yu (summer 2018) â PhD student at Boston University Weixin Luo (visiting research scholar, 2018-2019) Moniek Smink (2022-2024) â MS student at TU Delft; Hilldale Research Fellowship 2023-2024 Harris Zhang (2023-2024) â MS student at UW Madison; Trewartha Senior Thesis Research Award 2024 Jedidiah Schloesser (2023-2024) Funding I am grateful for the support by the National Science Foundation (CAREER IIS-1751206 / IIS-2150012, IIS-1748387, IIS-1812850 / IIS-2204808, IIS-2404180, and IIS-2435532) , Army Research Office (Young Investigator Program), NASA, Wisconsin Alumni Research Foundation, Hellman Fellows Program, Intel, Adobe, Nvidia, Amazon, ETRI, Samsung, AmFam, NetApp, and Sony. Recent talks Real-time Instance Segmentation with the YOLACT Family OpenMMLab Tutorial, CVPR, June 2021 (virtual) [talk video] Learning to Understand Visual Data with Minimal Human Supervision University of Wisconsin - Madison, April 2020 (virtual) [talk video] Preprints / Blogs NEW! VisualToolAgent (VisTA): A Reinforcement Learning Framework for Visual Tool Selection Zeyi Huang, Yuyang Ji, Anirudh Sundara Rajan, Zefan Cai, Wen Xiao, Junjie Hu, and Yong Jae Lee arXiv 2025 [project page] [arXiv] [code] NEW! UniTalk: Towards Universal Active Speaker Detection in Real World Scenarios Le Thien Phuc Nguyen*, Zhuoran Yu*, Khoa Quang Nhat Cao, Yuwei Guo, Tu Ho Manh Pham, Tuan Tai Nguyen, Toan Ngo Duc Vo, Lucas Poon, Soochan Lee, and Yong Jae Lee (*equal contribution) arXiv 2025 [project page] [arXiv] [code] [data] NEW! Vinoground: Scrutinizing LMMs over Dense Temporal Reasoning with Short Videos Jianrui Zhang*, Mu Cai*, and Yong Jae Lee (*equal contribution) arXiv 2024 [project page] [arXiv] [code] [data] [leaderboard] NEW! TemporalBench: Benchmarking Fine-grained Temporal Understanding for Multimodal Video Models Mu Cai, Reuben Tan, Jianrui Zhang, Bocheng Zou, Kai Zhang, Feng Yao, Fangrui Zhu, Jing Gu, Yiwu Zhong, Yuzhang Shang, Yao Dou, Jaden Park, Jianfeng Gao^, Yong Jae Lee^, Jianwei Yang^ (^equal advising) arXiv 2024 [project page] [arXiv] [code] [data] [leaderboard] LLaVA-NeXT: Improved reasoning, OCR, and world knowledge Haotian Liu, Chunyuan Li, Yuheng Li, Bo Li, Yuanhan Zhang, Sheng Shen, and Yong Jae Lee January 2024 [blog] LLaVA-NeXT: A Strong Zero-shot Video Understanding Model Yuanhan Zhang, Bo Li, Haotian Liu, Yong Jae Lee, Liangke Gui, Di Fu, Jiashi Feng, Ziwei Liu, and Chunyuan Li April 2024 [blog] Publications NEW! How Multimodal LLMs Solve Image Tasks: A Lens on Visual Grounding, Task Reasoning, and Answer Decoding Zhuoran Yu and Yong Jae Lee Conference on Language Modeling (COLM), 2025 [arXiv] NE",
  "content_length": 37235,
  "method": "requests",
  "crawl_time": "2025-12-01 14:52:06"
}