{
  "name": "Yongfeng Zhang",
  "homepage": "http://yongfeng.me",
  "status": "success",
  "content": "Yongfeng Zhang Home Publications Projects Code Dataset Yongfeng Zhang Home Research Interests: Machine Learning, Data Mining, Information Retrieval, Recommender Systems, Natural Language Processing, ML Systems, AI Agents, Explainable, Fair and Personalized AI, AI for Science and Social Good Contact: Department of Computer Science, 110 Frelinghuysen Road, Rutgers University, Piscataway, NJ 08854, USA Education and Experience: 2024 – now,  Associate Professor (Tenured), Department of Computer Science, Rutgers University 2018 – 2024, Assistant Professor, Department of Computer Science, Rutgers University 2016 – 2017, Postdoc, College of Information and Computer Sciences, University of Massachusetts Amherst (Supervisor Prof. W. Bruce Croft) 2011 – 2016, Ph.D. in CS (Supervisors Prof. Shaoping Ma, Min Zhang, Yiqun Liu), Department of Computer Science, Tsinghua University 2014 – 2016, B.S. in Economics, National School of Development, Peking University 2015 – 2016, Assistant Specialist (Supervisors Prof. Yi Zhang and Daniel Friedman), School of Engineering, University of California Santa Cruz 2014 – 2015, Research Assistant (Supervisors Prof. Tat-Seng Chua and Min-Yen Kan), School of Computing, National University of Singapore 2007 – 2011, B.E. in Computer Science, Department of Computer Science and Technology, Tsinghua University Honors and Awards: 2025 The AgentX Prize for Agent Architecture 2024 ACM SIGIR Test of Time Award 2024 Presidential Award for Teaching Excellence 2023 eBay Faculty Research Award 2023 Toyota Faculty Research Award 2023 NEC Faculty Research Award 2021 NSF CAREER Award 2021 Facebook Faculty Research Award 2021 eBay Faculty Research Award 2020 Distinguished Editor for ACM Transactions on Information Systems (TOIS) 2018 Rutgers CS Best Professor Award for Teaching and Mentoring 2017 AIRS Best Paper Award 2017 THU and CAAI Best PhD Dissertation Award 2015 Microsoft PhD Fellowship 2015 Siebel Scholar 2014 Baidu Scholarship 2014 IBM PhD Fellowship 2012 Google Scholarship Recent Talks: Trustworthy AI for Human and Science at Rutgers CS Colloquium. [Slides] Tutorial on Large Language Models for Recommendation at RecSys 2023. [Slides][Website] Large Language Models for Generative Recommendation, Keynote speech on WWW 2023 ISIR-eCom Workshop, Keynote speech on KDD 2023 OARS Workshop, Amazon Research Seminar. [Slides] Towards Trustworthy Recommender Systems: From Shallow Model to Deep Model to Large Model, Microsoft Research Summit 2022, CNCC 2022, AAAI 2023. [Slides] Explainable AI for Science at Rutgers CQB Seminar. [Abstract][Slides] From Kepler to Newton: Explainable AI for Science Discovery at ICML 2022. [Video and Slides] Human-centered Explainable AI at UMass Amherst, USC, Brandeis U., U. of Delaware, Megagon Labs, Salesforce, Instacart, RUC, U. of North Texas, IEEE BigData Special Section on XAI (Keynote). [Slides][Video in English][Video in Chinese] Explainable AI: From Human to Nature at Rutgers University. [Slides] Towards Explainable Artificial Intelligence at Infinia ML Tech Talk. [Slides] Tutorial on Fairness of Machine Learning in Recommender Systems at SIGIR 2021, CIKM 2021. [Slides][Website] Tutorial on Conversational Recommendation Systems at RecSys 2020, WSDM 2021, IUI 2021. [Slides][Video][Website] Tutorial on Explainable Recommendation and Search at WWW 2019, SIGIR 2019, ICTIR 2019. [Slides][Website] Recommender Systems: an Interdisciplinary Perspective at Rutgers University. [Slides] Recent News: 2024-08-26 Congratulations to Wenyue Hua for her successful PhD Thesis defense \"Towards Trustworthy Large Language Models\"! 2024-08-23 Congratulations to Jianchao Ji for his successful PhD Thesis defense \"Integrate Learning and Reasoning for Large Language Model and Recommender Systems\"! 2024-03-27 Congratulations to Zelong Li for his successful PhD Thesis defense \"Automated Machine Learning for Intelligent Systems\"! 2024-03-15 Congratulations to Runhui Wang for his successful PhD Thesis defense \"Large Language Model for Data Driven Applications\"! 2024-03-13 Congratulations to Shuyuan Xu for his successful PhD Thesis defense \"Causal Collaborative Filtering\"! 2024-03-13 Congratulations to Yunqi Li for her successful PhD Thesis defense \"Fairness in Recommender Systems\"! 2024-02-26 Survey on Trustworthy Recommendation accepted by ACM Transactions on Recommender Systems. 2024-02-25 Survey on LLM-based Generative Recommendation accepted by COLING 2024. 2024-02-01 Papers on LLM for Graph Learning and LLM for Fairness-aware Recommendation accepted by EACL 2024. 2023-12-15 Papers on LLM for Generative Recommendation and LLM for News Recommendation accepted by ECIR 2024. 2023-12-05 Congratulations to Juntao Tan for his successful PhD Thesis defense \"Counterfactual Explainable AI for Human and Science\"! 2023-10-17 Congratulations to Yingqiang Ge for his successful PhD Thesis defense \"Towards Trustworthy Recommender Systems\"! 2023-10-07 Paper on VIP5: Towards Multimodal Foundation Models for Recommendation accepted by EMNLP 2023. 2023-09-22 Paper on OpenAGI: When LLM Meets Domain Experts accepted by NeurIPS 2023. 2023-09-10 Paper on How to Index Item IDs for Recommendation Foundation Models accepted by SIGIR-AP 2023. 2023-08-06 Give a keynote speech Large Language Models for Generative Recommendation at KDD 2023 The 3rd International Workshop on Online and Adaptive Recommender Systems (OARS 2023). 2023-08-05 Paper on Prompt Distillation for Efficient LLM-based Recommendation accepted to CIKM 2023. 2023-05-16 Paper on Explainable AI for Science (ExplainableFold: Understanding AlphaFold Prediction with Explainable AI) accepted to KDD 2023. 2023-05-01 Give a keynote speech \"Generative Recommendation with Foundation Models\" at WWW 2023 The 2nd International Workshop on Interactive and Scalable Information Retrieval Methods for E-commerce (ISIR-eCom 2023). 2023-04-08 Paper on using explainable AI in responsible ways accepted to SIGIR 2023. 2023-02-13 Give a keynote speech \"Towards Trustworthy Recommender Systems: From Shallow Model to Deep Model to Large Model\" at AAAI 2023 AI for Web Advertising Workshop. 2023-01-20 Paper on RL-based recommendation in latent action space accepted to WWW 2023. 2023-01-20 Paper on Vision-Language Pre-training accepted to ICLR 2023. 2022-11-23 Congratulations to Shijie Geng for his successful PhD Thesis defense \"Personalized Foundation Models for Decision Making\"! 2022-10-18 Paper on Counterfactual Logical Reasoning accepted by WSDM 2023. 2022-10-06 Papers on Neural-Symbolic Reasoning and Commonsense Explanation Generation accepted by EMNLP 2022. 2022-09-15 Congratulations to Shuchang Liu for his successful PhD Thesis defense \"Multi-Dimensional Federated Learning in Recommender Systems\" co-advised with Prof. Amélie Marian! 2022-09-01 Grateful to recieve NSF-NIH Smart Health grant as co-PI to work on Explainable AI for Healthcare together with Dr. Lanjing Zhang. 2022-08-05 Papers on Auto Machine Learning and Causal Machine Learning accepted by CIKM 2022. 2022-07-12 Congratulations to Pavan Velaga for his successful MS Thesis defense \"Logical Reasoning Models for Graphs and Vision\"! 2022-06-28 Papers on Universal Recommendation Engine (P5) and Federated Fairness accepted by RecSys 2022. 2022-05-11 Give a talk Towards Trustworthy and Responsible Recommender Systems: Explainability, Fairness and Beyond at Microsoft Research. 2022-05-01 Papers on Automatic Loss Function Generation and Explainable Fairness accepted to SIGIR 2022. 2022-03-25 Congratulations to Hanxiong Chen for his successful PhD Thesis defense \"Neural Logic Reasoning and Applications\"! 2022-03-15 Paper on Causal Factorization Machine accepted to JCDL 2022. 2022-03-09 Give an invited talk Human-centered Explainable AI at Renmin University of China. [Slides] 2022-02-28 Paper on Personalized Explanation Generation accepted to ACL 2022. 2022-02-25 Give an invited talk Human-centered Explainable AI at Megagon Labs. [Slides] 2022-02-18 Give an invited talk Human-centered Explainable AI at University of Southern California. [Slides][Video] 2022-01-20 Two papers on Graph Language Models and Explainable Graph Neural Networks accepted to WWW 2022. 2021-11-30 What is the role of Explainable AI in Science Discovery? Can Kepler's and Newton's groundbreaking works be rediscovered by AI based on Tycho Brahe's ancient observation data? Check out paper From Kepler to Newton: Explainable AI for Science Discovery. 2021-11-05 Give an invited talk Human-centered Explainable AI at Brandeis University. [Slides] 2021-10-16 Papers on Graph Collaborative Reasoning and Fairness-Utility Trade-off accepted to WSDM 2022. 2021-09-17 Congratulations to Zuohui Fu for his successful PhD Thesis defense \"Towards Human-centered Recommender System\"! 2021-09-15 How can AI machines have Free Will, why does it help, and how to achieve it in a responsible way? Check out paper Problem Learning: Towards the Free Will of Machines. 2021-09-12 Grateful to receive Facebook Faculty Research Award as PI \"Towards a Sustainable Social Platform based on Explainable and Fairness-aware Recommendation\" to support our research. 2021-08-26 Grateful to receive NSF grant IIS-2127918 as co-PI \"RI: Small: Enabling Interpretable AI via Bayesian Deep Learning\" to support our research. Details can be found on NSF award abstract. 2021-08-16 Papers on Counterfactual Explainable Recommendation, Unbiased Conversational Recommendation, and Causal Recommendation accepted to CIKM 2021. 2021-07-28 Grateful to receive NSF grant IIS-2046457 as PI \"CAREER: Towards Conversational Recommendation Systems: Explainability, Fairness, and Human-in-the-Loop Learning\" to support our research on Conversational AI and Human-in-the-Loop AI. Details can be found on NSF award abstract and our Project Homepage. 2021-07-10 Grateful to receive NSF grant CCF-2124155 as co-PI \"FMitF: Track I: Synthesis and Verification for Programmatic Reinforcement Learning\" to support our research on Neural-Symbolic A",
  "content_length": 20117,
  "method": "requests",
  "crawl_time": "2025-12-01 14:52:08"
}