{
  "name": "Yong Luo 0002",
  "homepage": "https://cs.whu.edu.cn/info/1019/2856.htm",
  "status": "success",
  "content": "ï»¿ ç½å-æ­¦æ±å¤§å­¦è®¡ç®æºå­¦é¢ EN æ§ç æ­¦å¤§ä¸»é¡µ é¦é¡µ å­¦é¢æ¦åµ å­¦é¢ç®ä» åå²æ²¿é© ç°ä»»é¢å¯¼ ç»ç»æºæ èç³»æä»¬ è®¡ç§æ å å¸èµéä¼ é«å±æ¬¡äººæ ä¸ä»»æå¸ å®éªææ¯äººå è£ä¼æå¸ äººæå¹å » æ¬ç§çæè² ç ç©¶çæè² çå­¦çæè² å½é äº¤æµ ç§å­¦ç ç©¶ ç§ç è¿å± å­¦æ¯äº¤æµ é¡¹ç®ç³æ¥ ç ç©¶å¹³å° å ç¾¤å·¥ä½ å å»ºå·¥ä½ çºªæ£å·¥ä½ å·¥ä¼å·¥ä½ å ±éå¢å·¥ä½ å­¦ä¹ èµæ äººææè å²ä½æè åå£«åæè æ ¡åé£é æ°åºæ ¡å æ ¡åå¨æ æ ¡ååº ä¿¡æ¯å ¬å¼ è§ç« å¶åº¦ åäºæµç¨ å¸¸ç¨ä¸è½½ èç³»æ¹å¼ E-mailï¼luoyong@whu.edu.cn åå ¬çµè¯ï¼ 027-68772967 åå ¬å°ç¹ï¼è®¡ç®æºå­¦é¢ ç½å æ­¦æ±å¤§å­¦è®¡ç®æºå­¦é¢ äººå·¥æºè½ç³» å½å®¶å¤åªä½è½¯ä»¶å·¥ç¨ææ¯ç ç©¶ä¸­å¿ ææ (åå¯¼) å§åï¼ç½å ä¸»é¡µï¼https://scholar.google.com/citations?user=zb1oVGIAAAAJ&hl=en æ§å«ï¼ç· èç§°ï¼ææ (åå¯¼) å­¦åå­¦ä½ï¼åå£« çµè¯ï¼027-68772967 åå ¬å°ç¹ï¼è®¡ç®æºå­¦é¢ E-mailï¼luoyong â whu.edu.cn è¯·æå·¥æ¿æ¢ç¬¦å· é¢åï¼æ¨¡å¼è¯å«,äººå·¥æºè½,æ°æ®ææä¸åæ æçä¿¡æ¯ï¼å¹´åº¦ææ¶ç¡å£«0åï¼ææ¶æ¹åï¼ã ææ¶åå£«0åï¼ææ¶æ¹åï¼ã ç ç©¶æ¹å æ­¦æ±å¤§å­¦è®¡ç®æºå­¦é¢ææï¼åå£«çå¯¼å¸ï¼å½å®¶ç¹èéå¹´ä¸å®¶ï¼å¤åªä½æ±åIEEE TMM AEï¼Associate Editorï¼ï¼äººå·¥æºè½é¢åCCF Aç±»é¡¶ä¼AAAIåIJCAIçSenior PC Memberãä¸»è¦ä»äºæºå¨å­¦ä¹ åæ°æ®ææåå ¶å¨è§è§ä¿¡æ¯çè§£ååææ¹é¢çåºç¨ç ç©¶å·¥ä½ãå ±åè¡¨è®ºæ40ä½ç¯é«æ°´å¹³è®ºæï¼å æ¬IEEE TPAMIç­ï¼ï¼æ¯2016å¹´ä¸­å½è®¡ç®æºå­¦ä¼ï¼CCFï¼ä¼ç§åå£«è®ºæè·å¾è ãæ¾è·å¾IJCAIæä½³è®ºææåï¼2540é3ï¼åIEEE Globecomæä½³è®ºæå¥ï¼å¹¶ä¸ä»çåä½è è·å¾IEEE ICMEåIEEE VCIPæä½³è®ºæå¥ã ç ç©¶é¢åï¼äººå·¥æºè½ï¼æºå¨å­¦ä¹ ï¼æ°æ®ææï¼å¤åªä½ä¿¡æ¯å¤çä¸åæ å¥é¡¹ï¼ 2019    æä½³è®ºæï¼IEEEå¤åªä½åè§ä¼è®®ï¼ICMEï¼ 2019    æä½³è®ºæï¼IEEEè§è§éä¿¡åå¾åå¤çä¼è®®ï¼VCIPï¼ 2017    æä½³è®ºæå ¥å´ï¼3/2540ï¼ï¼å½é äººå·¥æºè½èåä¼è®®ï¼IJCAIï¼ 2016    æä½³è®ºæï¼IEEEå ¨çéä¿¡ä¼è®®ï¼GLOBECOMï¼ 2016    ä¼ç§åå£«è®ºæï¼ä¸­å½è®¡ç®æºå­¦ä¼ 2014    ä¼ç§æ¯ä¸çï¼åäº¬å¤§å­¦ 2013    å½å®¶å¥å­¦éï¼åäº¬å¤§å­¦ æè²èæ¯ 2009/9 - 2014/7ï¼åäº¬å¤§å­¦ï¼çå­¦åå£«2005/9 - 2009/7ï¼è¥¿åå·¥ä¸å¤§å­¦ï¼å·¥å­¦å­¦å£« å·¥ä½ç»éª 2020/9 - è³ä»ï¼æ­¦æ±å¤§å­¦ï¼è®¡ç®æºå­¦é¢ï¼ææ2014/9 - 2020/9ï¼åæ´çå·¥å¤§å­¦ï¼è®¡ç®æºç§å­¦ä¸å·¥ç¨å­¦é¢ï¼åå£«å ææè¯¾ç¨ ãæºå¨å­¦ä¹ ä¸æ¨¡å¼è¯å«ã åè¡¨è®ºæ ä¹¦ç±æç« èï¼ [1] Yong Luo, Dacheng Tao, Chao Xu, \"Patch Alignment for Graph Embedding,\" Graph Embedding for Pattern Analysis, Springer, pp. 73-118, 2013. ä¸»è¦æåè®ºæï¼ [1] Yong Luo, Han Hu, Yonggang Wen, Dacheng Tao, \"Transforming Device Fingerprinting for Wireless Security via Online Multi-Task Metric Learning,\" IEEE Internet of Things Journal (IoTJ), Vol. 7, No. 1, pp. 208-219, 2020.[2] Yong Luo, Yonggang Wen, Tongliang Liu, Dacheng Tao, \"Transferring Knowledge Fragments for Learning Distance Metric from A Heterogeneous Domain,\" IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI), Vol. 41, No. 4, pp. 1013-1026, 2019.[3] Yong Luo, Yonggang Wen, Dacheng Tao, \"Heterogeneous Multi-task Metric Learning across Multiple Domains,\" IEEE Transactions on Neural Networks and Learning Systems (TNNLS), Vol. 29, No. 9, pp. 4051-4064, 2018.[4] Yong Luo, Yonggang Wen, Dacheng Tao, Jie Gui, Chao Xu, \"Large Margin Multi-modal Multitask Feature Extraction for Image Classification,\" IEEE Transactions on Image Processing (TIP), Vol. 25, No. 1, pp. 414-427, 2016.[5] Yong Luo, Dacheng Tao, Kotagiri Ramamohanarao, Chao Xu, Yonggang Wen, \"Tensor Canonical Correlation Analysis for Multi-view Dimension Reduction,\" IEEE Transactions on Knowledge and Data Engineering (TKDE), Vol. 27, No. 11, pp. 3111-3124, 2015.[6] Yong Luo, Tongliang Liu, Dacheng Tao, Chao Xu, \"Multi-view Matrix Completion for Multilabel Image Classification,\" IEEE Transactions on Image Processing (TIP), Vol. 24, No. 8, pp. 2355-2368, 2015. [7] Yong Luo, Tongliang Liu, Dacheng Tao, Chao Xu, \"Decomposition based Transfer Distance Metric Learning for Image Classification,\" IEEE Transactions on Image Processing (TIP), Vol. 23, No. 9, pp. 3789-3801, 2014.[8] Yong Luo, Dacheng Tao, Chang Xu, Chao Xu, Hong Liu, Yonggang Wen, \"Multi-view Vectorvalued Manifold Regularization for Multi-label Image Classification,\" IEEE Transactions on Neural Networks and Learning Systems (TNNLS), Vol. 24, No. 5, pp. 709-722, 2013.[9] Yong Luo, Dacheng Tao, Bo Geng, Chao Xu, Stephen J. Maybank, \"Manifold RegularizedMulti-task Learning for Semi-supervised Multi-label Image Classification,\" IEEE Transactions on Image Processing (TIP), Vol. 22, No. 2, pp. 523-536, 2013.[10] Qiang Fu, Yong Luo, Yonggang Wen, Dacheng Tao, Ying Li, Ling-Yu Duan, \"Towards Intelligent Product Retrieval for TV-to-Online (T2O) Application: A Transfer Metric LearningApproach,\" IEEE Transactions on Multimedia (TMM), Vol. 20, No. 8, pp. 2114-2125, 2018.[11] Meng Liu, Chang Xu, Yong Luo, Chao Xu, Yonggang Wen, Dacheng Tao, \"Cost-Sensitive Feature Selection by Optimizing F-Measures,\" IEEE Transactions on Image Processing (TIP), Vol. 27, No. 3, pp. 1323-1335, 2018.[12] Jie Gui, Dacheng Tao, Zhenan Sun, Yong Luo, Xinge You, Yuanyan Tang, \"Group Sparse Multi-view Patch Alignment Framework with View Consistency for Image Classification,\" IEEE Transactions on Image Processing (TIP), Vol. 23, No. 7, pp. 3126-3137, 2014. ä¸»è¦ä¼è®®è®ºæï¼ [1] Yong Luo#, Huaizheng Zhang#, Yonggang Wen, Xinwen Zhang, \"ResumeGAN: An Optimized Deep Representation Learning Framework for Talent-Job Fit via Adversarial Learning,\" ACM International Conference on Information and Knowledge Management (CIKM), pp. 1101-1110, 2019. [2] Yong Luo, Tongliang Liu, Yonggang Wen, Dacheng Tao, \"Online Heterogeneous Transfer Metric Learning,\" International Joint Conference on Artificial Intelligence (IJCAI), pp. 2525-2531, 2018.[3] Yong Luo#, Huaizheng Zhang#, Yongjie Wang, Yonggang Wen, Xinwen Zhang, \"ResumeNet: A Learning-based Framework for Automatic Resume Quality Assessment,\" International Conference on Data Mining (ICDM), pp. 307-316, 2018.[4] Yong Luo, Yonggang Wen, Tongliang, Dacheng Tao, \"General Heterogeneous Transfer Distance Metric Learning via Knowledge Fragments Transfer,\" International Joint Conference on Artificial Intelligence (IJCAI), pp. 2450-2456, 2017. [Distinguished Paper Award Finalist, 3 out of 2540 submissions][5] Yong Luo, Dacheng Tao, Yonggang Wen, \"Exploiting High-Order Information in Heterogeneous Multi-Task Feature Learning,\" International Joint Conference on Artificial Intelligence (IJCAI), pp. 2443-2449, 2017.[6] Yong Luo, Yonggang Wen, Dacheng Tao, \"On Combining Side Information and Unlabeled Data for Heterogeneous Multi-task Metric Learning,\" International Joint Conference on Artificial Intelligence (IJCAI), pp. 1809-1815, 2016.[7] Yong Luo, Yonggang Wen, Dacheng Tao, Qiang Fu, \"Toward Effortless TV-to-Online (T2O) Experience: A Novel Metric Learning Approach,\" IEEE Global Communications Conference (GLOBECOM), December 4-8, 2016. [Best Paper Award][8] Yong Luo, Jian Tang, Jun Yan, Chao Xu, Zheng Chen, \"Pre-trained Multi-view Word Embedding using Two-side Neural Network,\" AAAI Conference on Artificial Intelligence (AAAI), pp. 1982-1988, 2014.[9] Yong Luo, Dacheng Tao, Chang Xu, Dongchen Li, Chao Xu, \"Vector-valued Multi-view Semisupervised Learning for Multi-label Image Classification,\" AAAI Conference on Artificial Intelligence (AAAI), pp. 647-653, 2013.[10] Yong Luo, Dacheng Tao, Bo Geng, Chao Xu, Stephen J. Maybank, \"Shared Feature Extraction for Semi-supervised Image Classification,\" ACM Multimedia (MM), pp. 1165-1168, 2011. [11] Shikang Gan#, Yong Luo#, Yonggang Wen, Tongliang Liu, Han Hu*, \"Deep heterogeneous multi-task metric learning for visual recognition and retrieval,\" ACM Multimedia Conference, pp. 1837-1845, 2020. [12] Huaizheng Zhang, Yong Luo, Qiming Ai, Yonggang Wen, Han Hu*, \"Look, read and feel: Benchmarking Ads understanding with multimodal multitask learning,\" ACM Multimedia Conference, pp. 430-438, 2020. [13] Yangxi Li, Han Hu, Jin Li, Yong Luo*, Yonggang Wen, \"Semi-supervised online multi-task metric learning for visual recognition and retrieval,\" ACM Multimedia Conference, pp. 3377-3385, 2020. [14] Huaizheng Zhang, Yuanming Li, Qiming Ai, Yong Luo, Yonggang Wen, Yichao Jin, Nguyen Binh Duong Ta, \"Hysia: Serving DNN-based video-to-retail applications in cloud,\" ACM Multimedia Conference, pp. 4457-4460, 2020. [15] Yihang Lou, Ling-Yu Duan, Yong Luo, Ziqian Chen, Tongliang Liu, Shiqi Wang, Wen Gao, \"Towards Digital Retina in Smart Cities: A Model Generation, Utilization and Communication Paradigm,\" IEEE International Conference on Multimedia and Expo (ICME), 2019. [Best Paper Award][16] Yan Bai, Ling-Yu Duan, Yong Luo, Shiqi Wang, Yonggang Wen, Wen Gao, \"Toward Intelligent Visual Sensing and Low-cost Analysis: A Collaborative Computing Approach,\" IEEE International Conference on Visual Communications and Image Processing (VCIP), 2019. [Best Paper Award] ç§ç è¯¾é¢ [1] å½å®¶èªç¶ç§å­¦åºéé¢ä¸é¡¹ç®ï¼âå©ç¨å¤æ¨¡æç¹å¾çå¾åæç´¢å ³é®ææ¯ç ç©¶âï¼2014-2017ï¼79ä¸ï¼åä¸ã [2] å½å®¶èªç¶ç§å­¦åºéé¢ä¸é¡¹ç®ï¼âåºäºè¿ç§»å­¦ä¹ çå¾åæç´¢çè®ºä¸æ¹æ³ç ç©¶âï¼2010-2012ï¼32ä¸ï¼åä¸ã ç ç©¶å¢é ç¥è¯äº§æ å­¦æ¯æå¡ ææå±ç¤º å ¶ä» å¿«ééé / Expressway åäºå¤§å ä¼è®®å®¤é¢å® å®éªå¹³å° ä¿¡æ¯å ¬å¼ èç³»æä»¬ / Contact us å°åï¼æ¹åçæ­¦æ±å¸å «ä¸è·¯æ­¦æ±å¤§å­¦ çµè¯ï¼027-68775361 027-68775363 é®ç®±ï¼computer@whu.edu.cn Copyright Â© 2023-2028 æ­¦æ±å¤§å­¦è®¡ç®æºå­¦é¢ çæææ.",
  "content_length": 9874,
  "method": "requests",
  "crawl_time": "2025-12-01 14:52:03"
}