{
  "name": "Yonghwi Kwon 0001",
  "homepage": "https://yonghwi-kwon.github.io",
  "status": "success",
  "content": "Yonghwi Kwon, University of Maryland Yonghwi Kwon @ UMD Software Security, Reverse Engineering, Forensics Yonghwi Kwon University of Maryland I am an Assistant Professor at the University of Maryland (Electrical and Computer Engineering, Maryland Cybersecurity Center (MC2), and UMIACS). I direct the SEED Research Group. My research interests include software security, software engineering, and cyber forensics. I have been honored with NSF CAREER Award, NSF CRII Award, ACM SIGPLAN Distinguished Paper Award, Maurice H. Halstead Memorial Award, ASE Best Paper Award, ACM SIGSOFT Distinguished Paper Award, and Microsoft Most Valuable Professional Award. CV (Resume) Research Group Website Email: I am looking for motivated students. Please see this page. 2025/09: 3 papers accepted in NDSS'26 and ASE'25!! 1. Connecting the Dots: An Investigative Study on Linking Private User Data Across Messaging Apps 2. IMUFUZZER: Resilience-based Discovery of Signal Injection Attacks on Robotic Aerial Vehicles 3. When Does Wasm Malware Detection Fail? A Systematic Analysis of Their Robustness to Evasion 2025/01: 2 papers accepted in WWW'25 (TheWebConf)!! 1. What's in Phishers: A Longitudinal Study of Security Configurations in Phishing Websites and Kits 2. 7 Days Later: Analyzing Phishing-Site Lifespan After Detected 2024/09: 2 papers accepted in IEEE S&P'25 (Oakland)!! 1. RaceDB: Detecting Request Race Vulnerabilities in Database-Backed Web Applications 2. CMASan: Custom Memory Allocator-aware Address Sanitizer 2024/06: Scavy: Automated Discovery of Memory Corruption Targets in Linux Kernel for Privilege Escalation accepted in USENIX'24! 2023/11: BTFuzzer (ICISC'23) wins the Best Paper Award! 2023/08: A Longitudinal Study of Vulnerable Client-side Resources and Web Developers' Updating Behaviors accepted in IMC'23! 2023/04: FreePart: Hardening Data Processing Software via Framework-based Partitioning accepted in ASPLOS'24! 2023/04: UVA CCDC team win the MACCDC, advancing to the national! 2023/01: BFTDetector: Automatic Detection of Business Flow Tampering for Digital Content Service accepted in ICSE'23! 2022/12: SynthDB: Synthesizing Database via Program Analysis for Security Testing accepted in NDSS'23! 2022/11: PyFET: Forensically Equivalent Transformation for Python Binary Decompilation accepted in S&P'23 (Oakland)! 2022/08: Dazzle-attack (WISA'22) wins the Best Student Paper Award! 2022/07: DriveFuzz: Discovering Autonomous Driving Bugs through Driving Quality-Guided Fuzzing accepted in CCS'22! 2022/04: We (UVA CCDC team) win the wild-card competition (of the regional CCDC), advancing to the national! 2022/01: Proposal Awarded by NSF: CAREER: Automated Forensic-in-the-Loop Cyber Defense Infrastructure. Thanks NSF for support! 2021/12: Hiding Critical Program Components via Ambiguous Translation accepted in ICSE'22! 2021/11: SwarmFlawFinder: Discovering and Exploiting Logic Flaws of Swarm Algorithms accepted in S&P'22 (Oakland)! 2021/09: Proposal Awarded by Cisco: Securing the IoT Infrastructure via Execution Diversification and Active Deception. Thanks Cisco Systems for support! 2021/08: 2 papers accepted (ASE'21 NIER and ACSAC'21) 1. Defeating Program Analysis Techniques via Ambiguous Translation (ASE'21 NIER) 2. Sofware Watermarking via a Binary Function Relocation (ACSAC'21) 2021/07: An Empirical Study of Bugs in WebAssembly Compilers accepted in ASE'21! 2021/05: Swarmbug: Debugging Configuration Bugs in Swarm Robotics accepted in FSE'21! 2021/03: Spinner: Automated Dynamic Command Subsystem Perturbation accepted in CCS'21! 2021/02: Security Analysis on Practices of Certificate Authorities in the HTTPS Phishing Ecosystem accepted in ASIACCS'21! 2021/01: TLS 1.3 in Practice: How TLS 1.3 Contributes to the Internet accepted in WWW'21! 2020/11: OSPREY: Recovery of Variable and Data Structure via Probabilistic Analysis for Stripped Binary accepted in S&P'21 (Oakland)! 2020/09: C2SR: Cybercrime Scene Reconstruction for Post-mortem Forensic Analysis accepted in NDSS'21! 2020/05: We (UVA CCDC team) win the National CCDC (NCCDC)!! (Three times in a row, or Three-peat!) 2019/10: Featured on UVA Today and Distinguished Paper Award! 1. UVA Today covered my research group and projects! 2. BDA (OOPSLA'19) wins the ACM SIGPLAN Distinguished Paper Award! 2019/09: 3 papers (one CCS, two S&P) accepted! 1. MalMax: Multi-Aspect Execution for Automated Dynamic Web Server Malware Analysis (CCS'19) 2. PMP: Cost-effective Forced Execution with Probabilistic Memory Pre-planning (S&P'20) 3. TARDIS: Rolling Back The Clock On CMS-Targeting Cyber Attacks (S&P'20) 2019/08: 2 papers (ACSAC and OOPSLA) accepted! 1. CUBISMO: Decloaking Server-side Malware via Cubist Program Analysis (ACSAC'19) 2. BDA: Practical Dependence Analysis for Binary Executables by Unbiased Whole-program Path Sampling and Per-path Abstract Interpretation (OOPSLA'19) 2019/07: NSF Proposal Awarded: Data Provenance Infrastructure towards Robust and Reliable Data Sharing and Analytics. Thanks NSF for support! 2019/06: NSF Proposal Awarded: Doctor WHO: Investigation and Prevention of Online Content Management System Abuse. Thanks NSF for support! 2019/04: We (UVA CCDC team) win the National CCDC (NCCDC)!! 2019/03: We (UVA CCDC team) win the MACCDC. 2019/02: NSF Proposal Awarded: Secure and Comprehensive Forensic Audit Infrastructure for Transparent Heterogeneous Computing. Thanks NSF for support! Read more Publications - Top Venues in Security/Systems (S&P (Oakland) [22, 23, 25, 34, 39, 46, 47], CCS [21, 28, 37], NDSS [2, 8, 13, 24, 40, 52], USENIX [45], ASPLOS [3, 4, 44]), in SE/PL (ICSE [18, 35, 41], FSE [6, 29], ASE [ 1, 11, 30, 50, 51], OOPSLA [7, 19]), in Web (WWW [9, 14, 26, 48, 49], IMC [42]) 52. NDSS'26 - Connecting the Dots: An Investigative Study on Linking Private User Data Across Messaging Apps, In Proc. of 33rd Network and Distributed System Security Symposium - BibTex Junkyu Kang, Soyoung Lee, Yonghwi Kwon, and Sooel Son 51. ASE'25 - When Does Wasm Malware Detection Fail? A Systematic Analysis of Their Robustness to Evasion, In Proc. of 40th IEEE/ACM International Conference on Automated Software Engineering - BibTex Taeyoung Kim, Sanghak Oh, Kiho Lee, Weihang Wang, Yonghwi Kwon, Sanghyun Hong, and Hyoungshick Kim 50. ASE'25 - IMUFUZZER: Resilience-based Discovery of Signal Injection Attacks on Robotic Aerial Vehicles, In Proc. of 40th IEEE/ACM International Conference on Automated Software Engineering - BibTex Sudharssan Mohan, Kyeongseok Yang, Zelun Kong, Yonghwi Kwon, Junghwan Rhee, Tyler Summers, Hongjun Choi, Heejo Lee, and Chung Hwan Kim 49. WWW'25 - What's in Phishers: A Longitudinal Study of Security Configurations in Phishing Websites and Kits, In Proc. of 34th The Web Conference - BibTex Kyungchan Lim, Kiho Lee, Fujiao Ji, Yonghwi Kwon, Hyoungshick Kim, and Doowon Kim 48. WWW'25 - 7 Days Later: Analyzing Phishing-Site Lifespan After Detected, In Proc. of 34th The Web Conference - BibTex Kiho Lee* (co-first author), Kyungchan Lim* (co-first author), Hyoungshick Kim, Yonghwi Kwon, and Doowon Kim 47. S&P'25 - RaceDB: Detecting Request Race Vulnerabilities in Database-Backed Web Applications, In Proc. of the 46th IEEE Symposium on Security and Privacy - BibTex An Chen, Yonghwi Kwon, and Kyu Hyung Lee 46. S&P'25 - CMASan: Custom Memory Allocator-aware Address Sanitizer, In Proc. of the 46th IEEE Symposium on Security and Privacy - BibTex Junwha Hong, Wonil Jang, Mijung Kim, Lei Yu, Yonghwi Kwon, and Yuseok Jeon 45. USENIX'24 - Scavy: Automated Discovery of Memory Corruption Targets in Linux Kernel for Privilege Escalation, In Proc. of the 33rd USENIX Security Symposium - BibTex Erin Avllazagaj, Yonghwi Kwon, and Tudor Dumitraș 44. ASPLOS'24 - FreePart: Hardening Data Processing Software via Framework-based Partitioning and Isolation, In Proc. of the 29th International Conference on Architectural Support for Programming Languages and Operating Systems - BibTex Ali Ahad, Gang Wang, Chung Hwan Kim, Suman Jana, Zhiqiang Lin, and Yonghwi Kwon 43. ICISC'23 - BTFuzzer: a profile-based fuzzing framework for Bluetooth protocols, In Proc. of the 26th Annual International Conference on Information Security and Cryptology - BibTex Min Jang, Yuna Hwang, Yonghwi Kwon, and Hyoungshick Kim Best Paper Award 42. IMC'23 - A Longitudinal Study of Vulnerable Client-side Resources and Web Developers' Updating Behaviors, In Proc. of the 23rd ACM Internet Measurement Conference - BibTex Kyungchan Lim, Yonghwi Kwon, and Doowon Kim 41. ICSE'23 - BFTDetector: Automatic Detection of Business Flow Tampering for Digital Content Service, In Proc. of the 45th International Conference on Software Engineering - BibTex I Luk Kim, Weihang Wang, Yonghwi Kwon, and Xiangyu Zhang 40. NDSS'23 - SynthDB: Synthesizing Database via Program Analysis for Security Testing of Web Applications, In Proc. of the 30th Network and Distributed System Security Symposium - BibTex An Chen, JiHo Lee, Basanta Chaulagain, Yonghwi Kwon, and Kyu Hyung Lee 39. S&P'23 - PyFET: Forensically Equivalent Transformation for Python Binary Decompilation, In Proc. of the 44th IEEE Symposium on Security and Privacy - BibTex Ali Ahad, Chijung Jung, Ammar Askar, Doowon Kim, Taesoo Kim, and Yonghwi Kwon 38. CCS'22 (Poster) - Automated Discovery of Sensor Spoofing Attacks on Robotic Vehicles, In Proc. of the 29th ACM Conference on Computer and Communications Security - BibTex Kyeongseok Yang*, Sudharssan Mohan* (*: co-first authors), Yonghwi Kwon, Heejo Lee, and Chung Hwan Kim 37. CCS'22 - DriveFuzz: Discovering Autonomous Driving Bugs through Driving Quality-Guided Fuzzing, In Proc. of the 29th ACM Conference on Computer and Communications Security - BibTex Seulbae Kim, Major Liu, Junghwan Rhee, Yuseok Jeon, Yonghwi Kwon, and Chung Hwan Kim 36. WISA'22 - Dazzle-attack: Anti-Forensic Server-side Attack via Fail-free Dynamic State Machine, In Proc. of the 23rd World Conference on Information Security Applications - BibTex Bora Lee*, Kyungchan ",
  "content_length": 24782,
  "method": "requests",
  "crawl_time": "2025-12-01 14:52:09"
}