{
  "name": "Yongjune Kim 0001",
  "homepage": "https://iil.postech.ac.kr",
  "status": "success",
  "content": "iil @ POSTECHSearch this siteEmbedded FilesSkip to main contentSkip to navigationInformation and Intelligence LaboratoryOverviewInformation and Intelligence Laboratory (iil) is a research group in the Department of Electrical Engineering (and affiliated with the Graduate School of Artificial Intelligence) at Pohang University of Science and Technology (POSTECH). Our research is centered around the quantification and transmission of information and intelligence. We aim to find fundamental limits, optimal designs, and principled practical implementations of information systems, often by pushing mathematical tools from information theory, coding theory, (convex) optimization, and learning theory in new directions.[Google Scholar] [GitHub]Open PositionsWe are looking for self-motivated [graduate students/interns/postdocs]. Please read this if you are interested in our research.  함께 연구를 수행할 대학원생/학부 인턴을 모집 중입니다. 연구실 지원에 관심이 있는 분들은 openings을 확인하기 바랍니다. Recent News(11/2025) TPC: Invited to serve as a TPC member for IEEE ICC 2026 (Cloud Computing and Networking)(10/2025) Appointment: 한국연구재단 기초연구본부 전문위원 (통신 원천)(10/2025) Award: 한국통신학회 하계종합학술발표회 우수논문상 (송수창, 김용준), \"시각-언어 모델을 이용한 엣지-서버 간 협력 추론\"(10/2025) New manuscript: \"Hierarchical qubit-merging transformer for quantum error correction\" [arXiv] (10/2025) Funding: SSD Architecture/NAND 관리 알고리즘 (SSD architecture and NAND flash management algorithms), Samsung Electronics(10/2025) Funding: 고신뢰성의 System을 위한 DRAM향 ECC 및 신뢰성 강화 연구 (DRAM ECC and reliability enhancement for high-reliability systems), Samsung Electronics(10/2025) Invited talk: APWDSIT, Oct. 2025 [link](09/2025) I am organizing the Workshop on AI-Native Communications at POSTECH [link](07/2025) Accepted paper: \"Regularized deep joint source-channel coding for robust task-oriented semantic communications,\" IEEE Globecom 2025 (Communication Theory)(07/2025) TPC: Invited to serve as a TPC member for IEEE WCNC 2026(07/2025) Award: 학부 종합설계과제 우수상 (강근호, 김지훈), \"압축 알고리즘을 이용한 최소 엔트로피 추정 기법 연구\"(06/2025) Award: 한국통신학회 하계종합학술발표회 학부논문경진대회 우수상 (강근호, 김지훈, 우지헌, 김용준), \"LZ77 압축 알고리즘 기반 최소 엔트로피 추정 기법\" (06/2025) Accepted paper: \"Vision transformer-based semantic communications with importance-aware quantization,\" IEEE Internet of Things Journal (IoTJ)(05/2025) Invited talk: \"Error correction code transformer: Universal transformer,\" 통신학회 미래통신기술 워크숍(05/2025) Accepted paper: \"Hybrid ordered statistics decoding of short-length BCH codes for URLLC systems: Theoretical analysis and decoder implementation,\" IEEE Transactions on Circuits and Systems I (TCAS-I)(04/2025) Funding: 온디바이스용 플래시메모리 기반 인공지능반도체 프로세서 기술 개발 (Development of flash memory-based AI processing unit for on-device AI), 과학기술정보통신부 정보통신기획평가원 (IITP)(04/2025) Invited talk: \"CrossMPT: Cross-attention message-passing transformer for error correcting codes,\" Nanyang Technological University (hosted by Prof. Jun Zhao)(04/2025) Invited talk: \"Semantic-aware and task-oriented communications,\" Samsung Research(04/2025) Accepted paper: \"Quantizing for noisy flash memory channels,\" IEEE International Symposium on Information Theory (ISIT), Jun. 2025.(04/2025) Invited talk: \"Transformer for communications: Semantic encoder and universal decoder,\" ICT Convergence Korea (03/2025) New manuscript: \"Robust deep joint source channel coding for task-oriented semantic communications\" [arXiv] (03/2025) Code release: \"CrossMPT: Cross-attention message-passing transformer for error correcting codes,\" International Conference on Learning Representations (ICLR) [code](03/2025) TPC: Invited to serve as a TPC member for APWDSIT 2025(02/2025) Funding: 과제 지향 시맨틱 통신 (Task-oriented semantic communications), Samsung Research(02/2025) Code release: \"Multiple-masks error correction code transformer for short block codes,\" IEEE Journal on Selected Areas in Communications (JSAC) [code](02/2025) TPC: Invited to serve as a TPC member for IEEE VTC 2025 Spring(02/2025) Invited talk: \"CrossMPT: Cross-attention message-passing transformer for error correcting codes,\" Information Theory and Applications (ITA) Workshop(01/2025) TPC: Invited to serve as a TPC member for IEEE Globecom 2025(01/2025) Accepted paper: \"CrossMPT: Cross-attention message-passing transformer for error correcting codes,\" International Conference on Learning Representations (ICLR), Apr. 2025(01/2025) Invited talk: \"Transformer for communications: Semantic encoder and universal decoder,\" Workshop on Semantic Communication and AI-RAN for 6G (hosted by IEEE South Australia Section) (01/2025) Accepted paper: \"Multiple-masks error correction code transformer for short block codes,\" IEEE Journal on Selected Areas in Communications (JSAC) (Special Issue on Rethinking the Information Identification, Representation, and Transmission Pipeline: New Approaches to Data Compression and Communication)(01/2025) Accepted paper: \"Vision transformer-aided importance-aware quantization for digital semantic communications,\" IEEE International Conference on Communications (ICC), May 2025(01/2025) Accepted posters: \"CrossMPT: Cross-attention message-passing transformer for error correcting codes\" and \"Robust deep joint source channel coding,\" IEEE Communication Theory Workshop (CTW) [link](01/2025) Appointment: An Editor for IEEE Transactions on Communications (Area: Machine Learning and Communications) [link]Google SitesReport abusePage detailsPage updated Google SitesReport abuse",
  "content_length": 5418,
  "method": "requests",
  "crawl_time": "2025-12-01 14:52:11"
}