{
  "name": "Yong Chen 0001",
  "homepage": "http://www.myweb.ttu.edu/yonchen",
  "status": "success",
  "content": "Yong Chen@TTU Yong Chen Professor and Department Chair Department of Computer Science Whitacre College of Engineering Texas Tech University Email: yong.chen@ttu.edu, Office: ENGCTR 102B Tel.: 806-834-0284 Home / Teaching / Research / Publications / Presentations / Services / C.V. Mail: Department of Computer Science Texas Tech University, Box 43104 Lubbock, TX 79409-3104 ﻿ Thank you for visiting my website. I am a Professor and Chair of the Computer Science Department in the Whitacre College of Engineering at Texas Tech University in Lubbock, Texas, and the holder of the Whitacre Chair in Computer Science. I am also the founding Director of the Data-Intensive Scalable Computing Laboratory and the Co-Director of the NSF Cloud and Autonomic Computing Center, supported by the National Science Foundation’s Industry-University Cooperative Research Centers (IUCRC) Program. My research focuses on data-intensive computing, high-performance computing, parallel and distributed computing, cloud computing, computer architectures, and systems software support for high-performance scientific computing/high-end enterprise computing. I am the principal investigator and Co-Director of the NSF REPACSS project, which aims to develop an HPC-AI infrastructure testbed, along with methods and tools for leveraging variable energy in advanced computing tasks. You can find my Google Scholar Profile, ORCID Profile, Scopus Profile, DBLP Profile, and LinkedIn Profile through the provided links. News: I am the Program Co-Chair of The 50th International Conference on Parallel Processing (ICPP). ICPP, the International Conference on Parallel Processing, provides a forum for engineers and scientists in academia, industry and government to present their latest research findings in all aspects of parallel and distributed computing. It is one of the oldest computer science conferences and 2021 will be the 50th year of ICPP. ICPP2021 will be held at the Argonne National Laboratory in Chicago, IL, USA and special events will be held to celebrate the 50th anniversary at the conference. Please consider to make submissions of your high-quality research work there (CFP in PDF format). Other recent services and CFPs: Program Committee: The 35th IEEE International Parallel & Distributed Processing Symposium (IPDPS'21), 2021. Program Committee: The 21st IEEE/ACM International Symposium on Cluster, Cloud and Grid Computing (CCGrid'21), 2021. Program Committee: The ISC High Performance 2020 (ISC'20), 2020. Program Committee: The 49th International Conference on Parallel Processing (ICPP'20), 2020. Program Committee: The International Conference on High Performance Computing in Asia-Pacific Region (HPCAsia'20), 2020. Program Committee: The 2020 IEEE International Conference on Big Data (IEEE BigData 2020), 2020. To Students/Visiting Scholars: The DISCL@TTU and CAC@TTU are looking for qualified and self-motivated graduate and undergraduate students to explore research with financial assistantship available. If you are interested in these opportunities, please visit the Graduate Research Assistant Positions, Undergraduate Research Opportunities, and Visiting Scholars Opportunities to find out more details. Selected Recent Publications: more >>> W. Zhang, S. Byna, H. Sim, S.K. Lee, S. Vazhkudai and Y. Chen. Exploiting User Activeness for Data Retention in HPC Systems. Accepted to appear in Proceedings of The 34th International Conference for High Performance Computing, Networking, Storage and Analysis (SC'21), 2021. (acceptance rate: 86/365=23.6%) X. Wang, A. Tumeo, J. D. Leidel, J. Li, Y. Chen. HAM: Hotspot-Aware Manager for Improving Communications With 3D-Stacked Memory. IEEE Transactions on Computers (TC), Volume: 70, Issue: 6, Page(s): 833-848, 2021. [PDF] [BibTex] [Txt] X. Wang, J. D. Leidel, B. Williams, A. Ehret, M. Mark, M. Kinsy, Y. Chen. xBGAS: A Global Address Space Extension on RISC-V for High Performance Computing. In Proceedings of The 35th IEEE International Parallel & Distributed Processing Symposium (IPDPS'21), Portland, Oregon USA, 2021. (acceptance rate: 105/462=22.7%) Best Paper Award (one out of 105 accepted papers) [PDF] [BibTex] [Txt] T. Dang, N. Nguyen and Y. Chen. HiperView: Real-time Monitoring Dynamic Behaviors of High Performance Computing Centers. Journal of Supercomputing (JoS) by Springer, March 2021. [PDF] [BibTex] [Txt] J. D. Leidel, X. Wang, B. Williams and Y. Chen. Toward a Microarchitecture for Efficient Execution of Irregular Applications. ACM Transactions on Parallel Computing, Volume: 7, Issue: 4, 2020. J. Zhou, Y. Chen, W. Xie, S. He and W. Wang. PRS: A Pattern-Directed Replication Scheme for Heterogeneous Object-Based Storage. IEEE Transactions on Computers (TC), Volume: 69, Issue: 4, Pages: 591 - 605, 2020. X. Wang, J. D. Leidel, B. Williams and Y. Chen. PAC: Paged Adaptive Coalescer for 3D-Stacked Memory. In Proceedings of The 29th International ACM Symposium on High-Performance Parallel and Distributed Computing (HPDC'20), Pages: 137 - 148, 2020. J. Zhou, Y. Chen, W. Wang, S. He and D. Meng. A Highly Reliable Metadata Service for Large-Scale Distributed File Systems. IEEE Transactions on Parallel and Distributed Systems (TPDS), Volume: 31, Issue: 2, Pages: 374 - 392, 2019. D. Dai, Y. Chen, P. Carns, J. Jenkins, W. Zhang and R. Ross. Managing Rich Metadata in High-Performance Computing Systems Using a Graph Model. IEEE Transactions on Parallel and Distributed Systems (TPDS), Volume: 30, Issue: 7, Pages: 1613 - 1627, 2019. W. Zhang, S. Byna, H. Tang, B. Williams and Y. Chen. MIQS: Metadata Indexing and Querying Service for Self-describing File Formats. In Proceedings of the International Conference for High Performance Computing, Networking, Storage and Analysis (SC'19), Pages: 1 - 24, 2019. X. Wang, A. Tumeo, J. Leidel, J. Li and Y. Chen. MAC: Memory Access Coalescer for 3D-Stacked Memory. In Proceedings of the 48th International Conference on Parallel Processing (ICPP'19), Pages: 1 - 10, 2019. W. Xie, Y. Chen, and P.C. Roth. Exploiting Internal Parallelism for Address Translation in Solid State Drives. ACM Transactions on Storage (TOS), Volume: 14, Issue: 4, Article: 32, 2018. W. Zhang, H. Tang, S. Byna and Y. Chen. DART: Distributed Adaptive Radix Tree for Efficient Affix-based Keyword Search on HPC Systems. In Proccedings of the 27th International Conference on Parallel Architectures and Compilation Techniques (PACT'18), Pages: 1 - 12, 2018. J. Cao, O. Rameshwar, M. Zheng, D. Dai, V. Eswarappa, Y. Mu and Y. Chen. PFault: A General Framework for Analyzing the Reliability of High-Performance Parallel File Systems. In Proccedings of the 2018 International Conference on Supercomputing (ICS'18), Pages: 1 - 11, 2018. Research Links: Search Engine: Google, Google Scholar, DBLP, CiteSeerX, Microsoft Academic Journal & Conferences: Call for papers list Conference Statistics Associations: Computing Research Association (CRA) ACM, ACM-SIGHPC IEEE Computer Society, IEEE-TCSC, IEEE-TCPP USENIX Copyright ©: Yong Chen, Texas Tech University",
  "content_length": 7055,
  "method": "requests",
  "crawl_time": "2025-12-01 14:52:05"
}