{
  "name": "Yongpan Zou",
  "homepage": "https://yongpanzou.github.io",
  "status": "success",
  "content": "YONGPAN ZOU Associate Professor, Ph.D supervisor The IoT Research Center Deputy Director, Department of Computer Science and Technology College of Computer Science and Software Engineering, Shenzhen University Room L6-603, Zhizhen Building (致真楼), Canghai Campus, Shenzhen University, Shenzhen 518060, P.R.C (0755) 8983-7853; yongpan AT szu.edu.cn; yongpanzou2012 AT gmail.com [Google Scholar] [DBLP] [ResearchGate] [中文主页] Biography Yongpan Zou (邹永攀, [CV-en], [CV-cn]) is currently a tenured Associate Professor and Ph.D supervisor in the College of Computer Science and Software Engineering of Shenzhen University, since July 2022. Before that, he has been an Assistant Professor in CSSE of Shenzhen University since September 2017. He obtained his Ph.D degree in February 2017 in the CSE Department of HKUST, under the supervision of Prof. Lionel M. Ni. Prior to this, he received his Bachelor degree in School of Chemical Engineering and Technology, Xi’an Jiaotong University in July 2013. From March to August of 2017, he has been working as a research assistant in University of Macau. In the past few years, he has been recognized as Overseas High-Caliber Personnel (深圳市海外高层次人才), High-level Talent in Nanshan District of Shenzhen (南山区领航人才), and Excellent Young Researcher of Shenzhen University (荔园优青). He has also achieved several academic awards owing to his excellent work in the field of ubiquitous and mobile computing, including the First Prize of Shenzhen Natual Science Award (深圳市自然科学奖一等奖), ACM SIGAPP China Rising Star Award (ACM SIGAPP中国新星奖), China Patent Awards of Excellence (中国专利优秀奖), Guangdong Patent Awards of Excellence (广东省专利优秀奖), the First Prize of GDCA Outstanding Research Papers (广东省计算机学会优秀论文一等奖), the Best Paper Award of IEEE MASS (最佳论文奖), and etc.. He has published more than 20 research papers in highly recognized conferences and journals such as ACM Ubicomp, ACM Mobicom, IEEE ICDCS, IEEE PerCom, and IEEE TMC, and received several research funds such as General Program of National NSF (基金委面上项目) and Yonth Program of National NSF (基金委青年项目). Interest My research interest covers Wearable and Mobile Computing, Human-computer Interaction, and Ubiquitous Sensing. My vision is to develop new technologies, algorithms, and systems that enable smart sensing, provide intelligent services, and deliver novel applications. I draw on novel sensing & computing technologies with embedded system design, machine learning models, signal processing algorithms, and mathematical methods to solve real-world problems. I am now leading Intelligent Sensing and Computing (ISAC, /ˈɪzək/) group. NOTE: We are looking for self-motivated postdocs, postgraduate and undergraduate students with a strong background in computer science or electronic engineering. We have also opening positions for associate researchers. Please drop me an email with your resume if you are interested in our group. News [Paper] 2025/10, Two papers have been accepted by IEEE BIBM 2025. Congrats to Wenting, Yulan, and et.al.! [Award] 2025/09, I was awarded with Shenzhen University’s Annual Top Ten Outstanding Young Teachers Award (深圳大学十佳青年教师). [Paper] 2025/07, our paper “VitalEar: An Earable Heartbeat and Respiratory Rate Monitoring System under Aerobic Exercises” has been accepted by IEEE Transactions on Mobile Computing. Congrats to Yuzheng et.al.! [Paper] 2025/07, our paper “DepGuard: Depression Recognition and Episode Monitoring System with A Ubiquitous Wrist-worn Device” has been accepted by IEEE Transactions on Mobile Computing. Congrats to Yufei et.al.! [Paper] 2025/06, our paper “UltraWrite: A Lightweight Continuous Gesture Input System with Ultrasonic Signals on COTS Devices” has been accepted by IEEE Transactions on Mobile Computing. Congrats to Weiyu et.al.! [Paper] 2025/02, our paper “CHAR: Composite Head-body Activities Recognition with A Single Earable Device” has been accepted by IEEE Transactions on Mobile Computing. Congrats to Peizhao and Yuzheng et.al.! [Service] 2025/02, I was invited to serve on the TPC of IEEE BIBM 2025. Welcome to submit papers via the submission site! [Paper] 2024/12, our paper “TimbreSense: Timbre Abnormality Detection for Bel Canto with Smart Devices” has been accepted by ACM Transactions on Sensor Networks. Congrats to Yuzheng and Chengzhe et.al.! [Paper] 2024/10, our paper “Img2Acoustic: A Cross-Modal Gesture Recognition Method Based on Few-Shot Learning” has been accepted by IEEE Transactions on Mobile Computing. Congrats to Jianhao and Wenting et.al.! [Service] 2024/08, I was invited to serve on the TPC of IEEE BIBM 2024. Welcome to submit papers via the submission site! [Service] 2024/08, I was invited to serve on the TPC of IEEE PERCOM 2025. Welcome to submit papers via the submission site! [Award] 2024/08, I was awarded with Best Reviewer Award of CCF TPCI. The award recognizes the reviewing service for CCF TPCI. [Paper] 2024/08, our paper “EmoTracer: A User-independent Wearable Emotion Tracer with Multi-source Physiological Sensors Based on Few-shot Learning” has been accepted by IEEE BIBM 2024. Congrats to Wenting and Shuo Jin et.al.! [Award] 2024/07, I was awarded with Tencent Outstanding Teacher Award. The award recognizes the teaching achievements of faculties in Shenzhen University. [Paper] 2024/06, our paper “PreGesNet: Few-shot Acoustic Gesture Recognition Based on Task-adaptive Pretrained Networks” has been accepted by IEEE Transactions on Mobile Computing. Congrats to Yunshu and Haozhi et.al.! [Paper] 2024/06, our paper “EarPrint: Earphone-based Implicit User Authentication with Behavioural and Physiological Acoustics” has been accepted by IEEE Internet of Things Journal. Congrats to Jianhao et.al.! [Paper] 2024/05, our paper “EchoGest: A Highly Scalable Unseen Gesture Recognition System Based on Feature-wise Transformation” has been accepted by IEEE Internet of Things Journal. Congrats to Yunshu et.al.! [Paper] 2023/12, our paper “UltraWrite: A Lightweight Continuous Gesture Input System Based on Commercial Ultrasonic Signals” has been accepted by IEEE PerCom 2024. Congrats to Weiyu and Canlin! [Award] 2023/09, I was awarded with ACM SIGAPP China Rising Star Award. The award recognizes the research achievements of young scholars in the field of mobile applications in China. [Award] 2023/09, our teaching reform project has been selected as one of the Excellent Education and Teaching Reform Cases of Higher Education Colleges in Guangdong Province. [Paper] 2023/09, our paper “Research on Wearable Emotion Recognition Based on Multi-source Domain Adversarial Transfer Learning” has been accepted by Chinese Journal of Computers (in Chinese). Congrats to Danyang et al.! [Service] 2023/06, I was invited to serve on the TPC of the SmartWear workshop at ACM MobiCom 2023. Welcome to submit papers! [Service] 2023/05, I was invited to serve on the TPC of the CPD workshop at UbiComp/ISWC 2023. Welcome to submit papers! [Award] 2023/03, I was awarded with Outstanding Undergraduate Teaching Award for the 2021-2022 Academic Year (深圳大学2021-2022学年度优秀本科教师奖)! [Award] 2023/03, I was awarded with Tencent “Rhinoceros Birds” - Scientific Research Fund for Young Researchers of Shenzhen University (腾讯“犀牛鸟”-深圳大学青年教师科研基金项目奖)! [Service] 2023/03, I was invited to serve as a Guest Editor of Special Issue of CCF Transactions on Pervasive Computing and Interaction (Intelligent Technologies and Systems for Smart Healthcare). Welcome to submit papers via the submission site! [Service] 2023/02, I was invited to serve as a Guest Editor of Special Issue of Digital Signal Processing Journal (Physical Knowledge and Data-Driven Technologies for Integrated Sensing, Communication and Computing). Welcome to submit papers via the submission site! [Paper] 2023/02, our survey paper “Ubiquitous WiFi and Acoustic Sensing: Principles, Technologies, and Applications” has been accepted by Journal of Computer Science and Technology (JCST). Congrats to Jialing and Yunshu!",
  "content_length": 7965,
  "method": "requests",
  "crawl_time": "2025-12-01 14:52:14"
}