{
  "name": "Yongmei Liu 0001",
  "homepage": "https://ymliu-sysu.github.io",
  "status": "success",
  "content": "Yongmei’s Home Page Skip to the content. Yongmei Liu Professor Dept. of Computer Science Sun Yat-sen University 132 East Waihuan Road Guangzhou 510006 China Email: ymliu@mail.sysu.edu.cn Research Interests Artificial intelligence, Knowledge representation and reasoning, Reasoning about actions and change, Reasoning about knowledge and belief, Reasoning about strategies, Multi-agent epistemic planning, Multi-agent belief change， Generalized planning, Commonsense Reasoning, LLM-based logical reasoning Education Ph.D., Univ. of Toronto; M.Sc., Univ. of Toronto; B.Sc., Wuhan Univ. Teaching Introduction to Artificial Intelligence, Knowledge Representation and Reasoning, Advanced Mathematical Logic, Computability and Logic, Discrete Mathematics Publications Ruikang Hu, Shaoyu Lin, Yeliang Xiu, Yongmei Liu. LTRAG: Enhancing autoformalization and self-refinement for logical reasoning with Thought-Guided RAG. To appear in Proceedings of the 63rd Annual Meeting of the Association for Computational Linguistics (Findings) (ACL-2025), 2025 [pdf] Zheyuan Shi, Hao Dong, Yongmei Liu: Solving QNP and FOND+ with Generating, Testing and Forbidding. To appear in Proceedings of the 34th International Joint Conference on Artificial Intelligence (IJCAI 2025), 2025 [pdf] Hao Dong, Zheyuan Shi, Hemeng Zeng, Yongmei Liu: An Automatic Sound and Complete Abstraction Method for Generalized Planning with Baggable Types. In Proceedings of the Thirty-Ninthth AAAI Conference on Artificial Intelligence (AAAI-25), 2025 [pdf] Ruiqi Jin, Yongmei Liu, Liping Xiong: A Modal Logic for Joint Abilities of Structured Strategies with Bounded Complexity. In Proceedings of the Thirty-Ninthth AAAI Conference on Artificial Intelligence (AAAI-25), 2025. [pdf] Weinan He, Canming Huang, Zhanhao Xiao, Yongmei Liu: Exploring the Capacity of Pretrained Language Models for Reasoning about Actions and Change. In Proceedings of the 61st Annual Meeting of the Association for Computational Linguistics (ACL 2023), 2023 [pdf] Zhenhe Cui, Weidu Kuang, Yongmei Liu: Automatic Verification for Soundness of Bounded QNP Abstractions for Generalized Planning. In Proceedings of the 32nd International Joint Conference on Artificial Intelligence (IJCAI 2023), 2023 [pdf] Aiting Liang, Yongmei Liu: A Model-Theoretic Approach to Belief Revision in Multi-Agent Belief Logic and Its Syntactic Characterizations. In Proceedings of the 26th European Conference on Artificial Intelligence (ECAI 2023), 2023 [pdf] Zhaoshuai Liu, Aiting Liang, Yongmei Liu: Epistemic JAADL: A Modal Logic for Joint Abilities with Imperfect Information. In Proceedings of the 26th European Conference on Artificial Intelligence, (ECAI 2023), 2023 [pdf] S. Ou and Y. Liu. Learning to Generate Programs for Table Fact Verification via Structure-Aware Semantic Parsing. To appear in Proceedings of the 60th Annual Meeting of the Association for Computational Linguistics (ACL-2022), 2022. [pdf] K. Luo and Y. Liu. Automated Synthesis of Generalized Invariant Strategies via Counterexample-Guided Strategy Refinement. In Proceedings of the Thirty-Sixth AAAI Conference on Artificial Intelligence (AAAI-22), 2022. [pdf] W. He, C. Huang, Y. Liu and X. Zhu. WINOLOGIC: A Zero-Shot Logic-based Diagnostic Dataset for Winograd Schema Challenge. In Proceedings of the 2021 Conference on Empirical Methods in Natural Language Processing(EMNLP-2021), 2021 [pdf] C. Huang, W. He and Y. Liu. Improving Unsupervised Commonsense Reasoning Using Knowledge-Enabled Natural Language Inference. In Proceedings of The 2021 Conference on Empirical Methods in Natural Language Processing (Findings) (EMNLP-2021), 2021 [pdf] H. Wan, B. Fang and Y. Liu. A General Multi-agent Epistemic Planner Based on Higher-order Belief Change. Artificial Intelligence 301 (2021) 103562. [pdf] Z. Cui, Y. Liu and K. Luo. A Uniform Abstraction Framework for Generalized Planning. In Proceedings of the Thirtieth International Joint Conference on Artificial Intelligence (IJCAI-21), 2021. [pdf] Z. Liu, L. Xiong, Y. Liu, Y. Lesperance, R. Xu and H. Shi. A Modal Logic for Joint Abilities under Strategy Commitments. In Proceedings of the Twenty-Ninth International Joint Conference on Artificial Intelligence (IJCAI-20), 2020. [pdf] K. Luo, Y. Liu, Y. Lesperance, and Z. Lin. Agent Abstraction via Forgetting in the Situation Calculus. In Proceedings of the Twenty-Fourth European Conference on Artificial Intelligence (ECAI-20), 2020. [pdf] J. Li and Y. Liu. Automatic Verification of Liveness Properties in the Situation Calculus. In Proceedings of the Thirty-Fourth AAAI Conference on Artificial Intelligence (AAAI-20), 2020. [pdf] K. Luo and Y. Liu. Automatic Verification of FSA Strategies via Counterexample-Guided Local Search for Invariants. In Proceedings of the Twenty-Eighth International Joint Conference on Artificial Intelligence (IJCAI-19), 2019. [pdf] L. Fang, Y. Liu and H. van Ditmarsch. Forgetting in multi-agent modal logics. Artificial Intelligence, 266: 51-80, 2019. [pdf] Q. Liu and Y. Liu. Multi-agent Epistemic Planning with Common Knowledge. In Proceedings of the Twenty-Seventh International Joint Conference on Artificial Intelligence (IJCAI-18), 2018. [pdf] X. Huang, B. Fang, H. Wan and Y. Liu. A General Multi-agent Epistemic Planner Based on Higher-order Belief Change. To appear in Proceedings of the Twenty-Sixth International Joint Conference on Artificial Intelligence (IJCAI-17), 2017. [pdf] P. Mo, N. Li and Y. Liu. Automatic Verification of Golog Programs via Predicate Abstraction. In Proceedings of the Twenty-Second European Conference on Artificial Intelligence (ECAI-16), 2016. [pdf] L. Xiong and Y. Liu. Strategy Representation and Reasoning in the Situation Calculus. In Proceedings of the Twenty-Second European Conference on Artificial Intelligence (ECAI-16), 2016. [pdf] L. Xiong and Y. Liu. Strategy Representation and Reasoning for Incomplete Information Concurrent Games in the Situation Calculus. In Proceedings of the Twenty-Fifth International Joint Conference on Artificial Intelligence (IJCAI-16), 2016. [pdf] L. Fang, Y. Liu and H. van Ditmarsch. Forgetting in Multi-Agent Modal Logics. In Proceedings of the Twenty-Fifth International Joint Conference on Artificial Intelligence (IJCAI-16), 2016. [pdf] H. Wan, R. Yang, L. Fang, Y. Liu and H. Xu. A Complete Epistemic Planner without Epistemic Closed World Assumption. In Proceedings of the Twenty-Fourth International Joint Conference on Artificial Intelligence (IJCAI-15), 2015. [pdf] L. Fang, Y. Liu and X. Wen. On the Progression of Knowledge and Belief for Nondeterministic Actions in the Situation Calculus. In Proceedings of the Twenty-Fourth International Joint Conference on Artificial Intelligence (IJCAI-15), 2015. [pdf] N. Li and Y. Liu. Automatic Verification of Partial Correctness of Golog Programs. In Proceedings of the Twenty-Fourth International Joint Conference on Artificial Intelligence (IJCAI-15), 2015. [pdf] X. Wang and Y. Liu. Automated fault localization via hierarchical multiple predicate switching. Journal of Systems and Software, 104:69-81, 2015. [pdf] Y. Liu and H. Levesque. Incorporating action models into the Situation Calculus. In A. Baltag and S. Smets, editors, Johan F. A. K. van Benthem on Logical and Informational Dynamics, Volume 5 of Outstanding Contributions to Logic, Springer, 2014. [pdf] N. Li, Y. Fan and Y. Liu. Reasoning about State Constraints in the Situation Calculus. In Proceedings of the Twenty-Third International Joint Conference on Artificial Intelligence (IJCAI-13), 2013. [pdf] Q. Yu, X. Wen and Y. Liu. Multi-agent Epistemic Explanatory Diagnosis via Reasoning about Actions. In Proceedings of the Twenty-Third International Joint Conference on Artificial Intelligence (IJCAI-13), 2013. [pdf] L. Fang and Y. Liu. Multi-agent Knowledge and Belief Change in the Situation Calculus. In Proceedings of the Twenty-Seventh AAAI Conference on Artificial Intelligence (AAAI-13), 2013. [pdf] Y. Fan, M. Cai, N. Li and Y. Liu. A first-order interpreter for knowledge-based Golog with sensing based on exact progression and limited reasoning. In Proceedings of the Twenty-Sixth AAAI Conference on Artificial Intelligence (AAAI-12), 2012. [pdf] [slides] [poster] Y. Liu and X. Wen. On the Progression of Knowledge in the Situation Calculus. In Proceedings of the Twenty-Second International Joint Conference on Artificial Intelligence (IJCAI-11), 2011. [pdf] Y. Liu and B. Li. Automated Program Debugging via Multiple Predicate Switching. In Proceedings of the Twenty-Fourth AAAI Conference on Artificial Intelligence (AAAI-10), 2010. [pdf] Y. Liu and G. Lakemeyer. On First-Order Definability and Computability of Progression for Local-Effect Actions and Beyond. In Proceedings of the Twenty-First International Joint Conference on Artificial Intelligence (IJCAI-09), 2009. [pdf] Y. Liu. A Formalization of Program Debugging in the Situation Calculus. In Proceedings of the Twenty-Third AAAI Conference on Artificial Intelligence (AAAI-08), 2008. [pdf] Y. Liu and G. Lakemeyer. On the expressiveness of Levesque's normal form. Journal of Artificial Intelligence Research, 31:259-272, 2008. [pdf] M. Patterson, Y. Liu, E. Ternovska and A. Gupta. Grounding for Model Expansion in k-Guarded Formulas with Inductive Definitions. In Proceedings of the Twentieth International Joint Conference on Artificial Intelligence (IJCAI-07), 2007. [pdf] Y. Liu and H.J. Levesque. Tractable reasoning with incomplete first-order knowledge in dynamic systems with context-dependent actions. In Proceedings of the Nineteenth International Joint Conference on Artificial Intelligence (IJCAI-05), 2005. [pdf] Y. Liu and H.J. Levesque. Tractable reasoning in first-order knowledge bases with disjunctive information. In Proceedings of the Twentieth National Conference on Artificial Intelligence (AAAI-05), 2005. [pdf] Y. Liu, G. Lakemeyer, and H.J. Levesque. A logic of limited belief for reasoning with disjunctive information. In Proceedings of the Nint",
  "content_length": 10652,
  "method": "requests",
  "crawl_time": "2025-12-01 14:52:14"
}