{
  "name": "Yongfu Li 0002",
  "homepage": "https://bicasl-en.sjtu.edu.cn/info/1019/1058.htm",
  "status": "success",
  "content": "﻿ Li Yongfu-Bio-Circuits and Systems Lab 中 EN About us Research 模拟与混合信号集成电路设计 面向生物医疗的电路与系统 News Academic Lab'Life Publications Journal Papers Conference Papers Members Teachers Doctoral Master Grade One Master Grade Two Master Grade Three Alumni Administration News Center Teachers 首页 / Members / Teachers / Content Teachers Doctoral Master Grade One Master Grade Two Master Grade Three Alumni Administration Li Yongfu Associate Professor of Shanghai Jiaotong University IEEE Senior Member, Former Chairman of the Singapore Chapter of IEEE Youth Alliance Research Direction: Low-power integrated circuit design, Electronic design automation Address: Room 427, Microelectronics Building, 800 Dongchuan Road, Minhang District, Shanghai Email: Yongfu.li[AT]sjtu.edu.cn Homepage: https://www.yongfu-li.com/ Personal Profile Yongfu Li，he received the B.Eng. and Ph.D. degrees from the Department of Electrical and Computing Engineering, National University of Singapore (NUS), Singapore. He is currently an Associate Professor with the Department of Micro and Nano Electronics Engineering and MoE Key Lab of Artificial Intelligence, Shanghai Jiao Tong University, China. He was a research engineer with NUS, from 2013 to 2014. He was a senior engineer (2014-2016), principal engineer (2016-2018) and member of technical staff (2018-2019) with GLOBALFOUNDRIES, as a Design-for-Manufacturability (DFM) Computer-Aided Design (CAD) research and development engineer. His research interests include analog/mixed signal circuits, data converters, power converters, biomedical signal processing with deep learning technique and DFM circuit automation. Dr. Li received the Singapore Economic Development Board GLOBALFOUNDRIES Graduate Scholarship. He is actively contributing to the Singapore Section Young Professionals Affinity Group and has served as the Secretary (2012–2013) and the Chair (2014–2015). 地址：上海市闵行区东川路800号微电子大楼 Copyright © 上海交通大学生物电路与系统实验室 版权所有. 沪ICP备19003691号-1 Links: IEEE CAS TBioCAS Department of Micro/Nano Electronics",
  "content_length": 2175,
  "method": "requests",
  "crawl_time": "2025-12-01 14:52:07"
}