{
  "name": "YooJung Choi 0001",
  "homepage": "https://yoojungchoi.github.io",
  "status": "success",
  "content": "About me - YooJung Choi YooJung ChoiAssistant Professor, ASU Follow Tempe, AZ yj.choi at asu.edu LinkedIn Google ScholarI am an Assistant Professor in the School of Computing and Augmented Intelligence at Arizona State University. Before joining ASU, I received my PhD from the Computer Science department at UCLA, advised by Guy Van den Broeck. My research interests are in probabilistic reasoning and learning (tractable probabilistic models, graphical models, knowledge compilation) and trustworthy AI/ML (robustness, fairness, explainability, and more).NewsSeptember 2025: Our paper On the Hardness of Approximating Distributions with Probabilistic Circuits was accepted at NeurIPS 2025 as a spotlight!May 2025: Our paper Optimal Transport for Probabilistic Circuits was accepted at UAI 2025!October 2024: I gave a talk in the Dr. Frederica Darema Lecture Series at Illinois Institute of Technology.September 2024: Our paper A Compositional Atlas for Algebraic Circuits was accepted at NeurIPS 2024!May 2024: I am co-organizing the TPM 2024 Workshop at UAI 2024 in Barcelona!August 2023: In Fall 2023, I will be visiting the Simons Institute for the Theory of Computing at UC Berkeley. Recent publications On the Hardness of Approximating Distributions with Tractable Probabilistic Models John Leland and YooJung Choi. In Advances in Neural Information Processing Systems 39 (NeurIPS), 2025. Spotlight presentation (acceptance rate 688/21575 = 3.2%) PDF  BibTex Optimal Transport for Probabilistic Circuits Adrian Ciotinga and YooJung Choi. In the 41st Conference on Uncertainty in Artificial Intelligence (UAI), 2025. PDF  BibTex  Code Fair Image Generation from Pre-trained Models by Probabilistic Modeling Mahdi Ahmadi, John Leland, Agneet Chatterjee, and YooJung Choi. In the Safe Generative AI Workshop at NeurIPS, 2024. BibTex A Compositional Atlas for Algebraic Circuits Benjie Wang, Denis Deratani Mauá, Guy Van den Broeck, and YooJung Choi. In Advances in Neural Information Processing Systems 38 (NeurIPS), 2024. PDF  BibTex  See all publications",
  "content_length": 2060,
  "method": "requests",
  "crawl_time": "2025-12-01 14:52:29"
}