{
  "name": "Yoshihiko Nakamura",
  "homepage": "https://mbzuai.ac.ae/study/faculty/yoshihiko-nakamura",
  "status": "success",
  "content": "Yoshihiko Nakamura - MBZUAI MBZUAI About About Leadership and Governance Alumni Mission Faculty Directory Fast Facts Office of the President Office of the Provost Study Study Graduate Admission Process Undergraduate Admission Process Faculty Directory Aspire Ph.D. Fellowship Program Master in Applied Artificial Intelligence (MAAI) Master’s Programs Ph.D. Programs Undergraduate Program Undergraduate Research Internship Program University Catalogue Research Research Computer Vision Research Machine Learning Research Natural Language Processing Projects Research Centers Innovate Innovate Consulting Incubation and Entrepreneurship Center Institute of Digital Public Health Institute of Foundation Models Office of Public Affairs and Alumni Relations Partnerships and Collaborations Training Programs Student Resources Undergraduate Academic Calendar Graduate Academic Calendar Campus Facilities Career Services and Internships Publications Repository Educational Affairs Library Portal Office of the Registrar Campus Map News & Events Commencement Events Media Center The Node | Stories of MBZUAI MBZUAI Nexus | The Global AI Research & Knowledge Network Apply now Home / Faculty directory / Yoshihiko Nakamura Yoshihiko Nakamura Department Chair and Professor of Robotics Research Interests Having started robotics research from kinematic redundancy and its optimization, Professor Nakamura’s most recent research interest is in the humanoid robotics that includes the design and control of humanoid robots and the human-robot interaction by symbolic and linguistic interpretation of movement. He recently developed small-size electro-hydrostatic actuators for humanoid robots, and a neuro-musculoskeletal model for neuro-biomechanical simulation of human movement. He currently works on the human-digital-twin technology that covers from capturing human motion from natural image, automatic biomechanical motion analysis, data science from automatic archival of human motion data, to digitizing sports movements in the open court and ground. Share Prior to joining MBZUAI, Professor Nakamura had a 33-year association with the University of Tokyo. He is currently Professor Emeritus of the university. Initially joining the Department of Mechano-Informatics in 1991 as Associate Professor, he served as Professor from 1997–2020. Professor Nakamura became Senior Researcher at the university's Research into Artifacts Center for Engineering in 2020–2023, and was named Specially Appointed Researcher at the University of Tokyo Sports Science Initiative in 2023-2024. Meanwhile, Professor Nakamura was Assistant to the President of the university in 2010–2011, and Vice-Dean of the School of Information Science and Technology in 2016–2017. Before his time at the University of Tokyo, Professor Nakamura was Assistant Professor at Kyoto University's Automation Research Laboratory in 1982-1987, and Assistant and Associate Professor at the Department of Mechanical and Environmental Engineering, University of California Santa Barbara in 1987-1991. Alongside his academic career, Professor Nakamura is the Founder and CEO of Kinescopic Inc. — a startup of the video motion capturing and motion analysis, of which founding technology was developed in his laboratory at the University of Tokyo. Ph.D. in mechanical engineering from Kyoto University Master of Science in mechanical engineering from Kyoto University Bachelor of Science in mechanical engineering from Kyoto University Robomech Awad (Academic Research), JSME Annual Conference on Robotics and Mechatronics (with Nakanishi et al) 2022 Tateishi Prize Achievement Award 2022 Excellency Award, Robotics Symposia (with Nakanishi et al) 2021 IEEE RAS Pioneer Award 2021 Advanced Robotics Excellent Paper Award, Robotics Society of Japan (with Ko et al) 2020 IEEE Life Fellow 2020 Professor Emeritus at University of Tokyo 2020 JSME Medal for Distinguished Engineers, JSME 2020 Mike Stilman Award, IEEE-RAS International Conference on Humanoid Robots (with Ko et al) 2018 Research Promotion Award, SI-Division, SICE (with Yamada et al) 2017 Best Paper Award, Transactions of Japan Society of Artificial Intelligence (with Takano et al) 2014 Achievement Award, Robotics Society of Japan 2013 Best Paper Award, Robotics Symposia (with Kaminaga et al) 2013 Best Paper Award, Robotics: Science and Systems (with Pham) 2012 Best Paper Award in Kinematics, 2nd IFToMM Asian Conference on Mechanism and Machine Science (with Ayusawa et al) 2012 Robotics Symposia Research Promotion Prize (with Ayusawa) 2012 Best Paper Award, Robotics Symposia (with Ayusawa) 2012 Excellent Paper Award, Joint Agent Workshop and Symposium (with Takano et al) 2011 TUM Distinguished Affiliated Professor, Technische Universität München 2011 Fellow, IEEE 2011 Research Promotion Prize, System Integration Division, SICE (with Murai et al) 2009 Fellow, Robotics Society of Japan 2009 Fellow, World Academy of Art and Science 2007 Foreign Member, Academy of Engineering Sciences of Serbia and Montenegro 2007 Most Active Distinguished Lecturer Award, IEEE Robotics and Automation Society 2007 Best Paper Award, Journal of Robotics Society of Japan (with Sugihara) 2007 Funai Award, The Second Digital Contents Symposium (with Yamane et al) 2006 Distinguished Lecturer, IEEE Robotics and Automation Society 2006 Best Paper Award, IEEE International Conference on Humanoid Robots (with Sugihara) 2005 Authoring Award, SICE (with Uchiyama) 2005 Fellow, JSME 2005 Best Paper Award, Robotic Symposia (with Sugihara) 2005 Best Paper Award, Journal of Robotics Society of Japan (with Kishi et al) 2004 International 3D Award, Technical Innovation Special Award (with Yamane et al) 2003 Best Paper Award, Annual Conference of Japan Society of Artificial Intelligence (with Takano et al) 2003 Robomech Award, JSME Annual Conference on Robotics and Mechatronics (with Yamane et al) 2003 Society Contribution Award, Division of Robotics and Mechatronics, JSME 2003 King-Sun Fu Memorial Best Transactions Paper Award, IEEE Transaction of Robotics and Automation (with Chung et al) 2002 King-Sun Fu Memorial Best Transactions Paper Award, IEEE Transaction of Robotics and Automation (with Yamane) 2001 Best Paper Award, Journal of Robotics Society of Japan (with Yamane et al) 2000 Academic Contribution Award, Division of Robotics and Mechatronics, JSME 1997 Best Paper Award, Journal of Robotics Society of Japan (with Sørdalen et al) 1996 Best Paper Award, SICE (with Hanafusa et al) 1983 Sawaragi Memorial Research Promotion Prize, SSCIE 1982 Chairing/executive positions Executive board member, International Foundation of Robotics Research (2007-) Member, IEEE-RAS CARES (2020-) EEE-RAS ICRA Steering Committee (2023-) Member, IEEE-RAS AdCom (2021-2023) Co-Chair, IEEE-RAS Technical Committee on Robotics and Automation in Nuclear Facilities (2012-2022) President, International Federation for the Promotion of Mechanism and Machine Science (2012-2015) Professor Nakamura has published 166 journal papers, 404 reviewed conference papers, and three books: Takuya Ohashi, Yosuke Ikegami, Yoshihiko Nakamura. “Synergetic Reconstruction from 2D Pose and 3D Motion for Wide-Space Multi-Person Video Motion Capture in the Wild.” Image and Vision Computing, Elsevier, 104, 2020. Stephane Caron, Quang-Cuong Pham and Yoshihiko Nakamura. \"ZMP support areas for multi-contact mobility under frictional constraints\". IEEE Transactions on Robotics, 2016. Quang-Cuong Pham, Stephane Caron, Puttichai Lertkultanon and Yoshihiko Nakamura. \"Admissible Velocity Propagation: Beyond Quasi-Static Path Planning for High-Dimensional Robots\". International Journal of Robotics Research, 2016. Wataru Takano and Yoshihiko Nakamura. “Statistical mutual conversion between whole body motion primitives and linguistic sentences for human motions.” The International Journal of Robotics Research, vol. 34: pp. 1314-1328, 2015. Ko Ayusawa, Gentianee Venture, Yoshihiko Nakamura. “Identifiability and Identification of Inertial Parameters Using the Underactuated Base-Link Dynamics for Legged Multibody Systems.” International Journal of Robotics Research, vol. 33, No. 3, pp. 446-468, 2014. Dana Kulic, Christian Ott, Dongheui Lee, Junichi Ishikawa, and Yoshihiko Nakamura. “Incremental learning of full body motion primitives and their sequencing through human motion observation.” The International Journal of Robotics Research, vol. 31, No. 3: pp. 330-345, March 2012. Related Tuesday, April 29, 2025 Transforming Healthcare with AI-Powered Robotics The inaugural Abu Dhabi AI-Robotics Conference took place at MBZUAI, exploring the potential for AI-driven robotics to… AD-AIRoC AIRoC robots Intelligent Robots campus medicine conference robotics healthcare Read more Thursday, September 12, 2024 Mechanics and mimicry: Yoshihiko Nakamura’s journey in robotics Over the past five decades, Yoshihiko Nakamura has helped take robotics out of the realm of science… robotics machine learning faculty human motion llms Read more Contact faculty affairs Interested in working with our renowned faculty? Fill out the below form and we will get back to you. x We use cookies We use necessary and analytics cookies to operate our website, analyze traffic, and improve your experience. By continuing to use this website, you agree to our use of cookies. Learn more Got it",
  "content_length": 9361,
  "method": "requests",
  "crawl_time": "2025-12-01 14:52:45"
}