{
  "name": "Yoshiko Wakabayashi",
  "homepage": "http://www.ime.usp.br/~yw",
  "status": "success",
  "content": "Yoshiko Wakabayashi homepage Yoshiko Wakabayashi Dr. rer. nat. - Universität Augsburg, 1986 Professora Titular Departamento de Ciência da Computação Instituto de Matemática e Estatística Universidade de São Paulo (USP) Brazil Tel: (+55) (11) 3091-6052 (office) / 3091-6135 (secretariat) Fax: (+55) (11) 3091-6134 (secretariat) Uma caricatura generosa (de quando eu era adolescente?) feita pelo Alexandre Noma Research interests: Combinatorial optimization, graph theory, algorithms, packing problems, polyhedral combinatorics Member of the Combinatorics, Optimization and Theory of Computing Research Group -- See CombO Research Projects Meetings (Organized) School held in July 2016 at IME-USP Brazil: São Paulo School of Advanced Science on Algorithms, Combinatorics and Optimization LATIN 2020 - 14th Latin American Theoretical INformatics Symposium -- January, 5--8, 2021 (ONLINE) -- Originally scheduled to be in São Paulo, Brazil LAGOS 2021 - XI Latin and American Algorithms, Graphs and Optimization Symposium -- May 17 to 21, 2021 (ONLINE) - Originally scheduled to be in São Paulo, Brazil (Others) Publications Master (M) and Ph.D. (D) theses supervised: [Para ter acesso a algumas teses, veja a Biblioteca Digital da USP] (D) Gabriel Augusto Gonçalves Sobral, jul/2024 (FIAP/SP) ------ Códigos de Identificação de Densidade Mínima na Grade Hexagonal com Número Finito de Linhas ------ (Prêmio Melhor Artigo no ETC/SBC 2022 - Minimum density of identifying codes of hexagonal grids with a finite number of rows) (M) Gabriel Morete de Azevedo, jul/2024 (PhD program, Cornell University) ------ On rounding algorithms for the 2-edge-connected spanning subgraph problem ------ (Prêmio Melhor Artigo no ETC/SBC 2024 - An efficient algorithm to add up-links to a rooted tree to obtain a minimum cost 2-connected graph) (M) Jainor Nestor Cardenas Choque, jul/2021 (back to Peru) ------ Optimal communication spanning tree (D) Renzo Gonzalo Gómez Díaz, set/2019 ------ Covering a graph by nontrivial paths (D) Hugo Vinicius Vaz Braga, dez/2018 (TJAM, Amazonas) ------ Algoritmos exatos para problemas de spanners em grafos (D) Rafael Santos Coelho, jun/2017 ------ The k-hop connected dominating set problem: approximation algorithms and hardness results (D) Phablo Fernando Soares Moura, mar/2017 (postdoc in Belgium) ------ Graph colorings and digraph subdivisions (D) Fábio Happ Botler, fev/2016 ------ Decomposição de grafos em caminhos ------ (Menção Honrosa na Edição de 2017 do Prêmio Gutierrez - o Prêmio é dado à melhor tese de doutorado em Matemática -- iniciativa do ICMC da USP, com apoio da SBM) ------ (Menção Honrosa na Edição de 2017 do Prêmio CAPES de Teses, na área de Ciência da Computação. (M) Renzo Gonzalo Gómez Díaz, agosto/2014 (see above) ------ Empacotamento de Árvores em grafos completos (M) Susanna Figueiredo de Rezende, maio/2014 ------ Caminhos mais longos em grafos ------ (Medalha de Ouro nas Jornadas de Iniciação Científica do IMPA (Instituto Nacional de Matemática Pura e Aplicada, 2010) [mais info] (M) Phablo Fernando Soares Moura, ago/2013 (see above) ------ Recoloração convexa de grafos: algoritmos e poliedros ------ (1o. Prêmio no Concurso Latinoamericano de Teses de Maestría (CLTM-2014), organizado pela CLEI (para mestrados em informática defendidos em 2013) [mais info] ------ (Menção Honrosa no Concurso de Dissertações promovido pela SBMAC 2014) [mais info] (D) Mario Leston-Rey, nov/2012 ------ Um arcabouço generalizado para empacotamento de ramificações e outras estruturas combinatórias (A general framework for packing branchings and other combinatorial structures) (M) Thiago Serra Azevedo Silva, mai/2012 ------ Programação por restrições e escalonamento baseado em restrições: um estudo de caso na programação de recursos para o desenvolvimento de poços de petróleo (M) Rafael da Ponte Barbosa, dez/2011 ------ Algoritmos para o Problema da Cobertura por Sensores (D) Karla Roberta P. Sampaio Lima, nov/2011 ------ Recoloração Convexa de Caminhos (M) Wanderley Guimaraes da Silva, nov/2010 (Facebook - Software Engineer) ------ Conjuntos Dominantes em Grafos (M) Andrea Tieme Nakasato, abr/2008 ------ Ordenação por Reversão (M) Marcel Kenji de Carli Silva, abr/2007 ------ Relações Min-max em Otimização Combinatória (M) Renato Lucindo, mar/2007 (Director of Engineering - Lucid LLC) ------ Partição de Grafos em Subgrafos Conexos (D) Gordana Manic, 2006 ------ Empacotamento de Subgrafos em Grafos ------ (1o. Prêmio CAPES de Tese 2007 na área de Ciência da Computação - tese defendida em 2006) [mais info] (D) Glauber F. Cintra, 2004 ------ IFCE, Inst. Federal de Educação Ciência e Tecnologia do Ceará) ------ Algoritmos para Problemas de Corte de Guilhotina Bidimensional (D) Liliane R.B. Salgado, 2004 ------ Algoritmos de Aproximação para Partições Conexas em Grafos (D) Estela Maris Rodrigues, 2003 ------ Algoritmos para Construção de Árvores Filogenéticas e o Problema dos Pontos de Recombinação (D) Orlando Lee, 1999 (see above) ------ Cobertura por Circuitos em Grafos Mistos . (M) Glauber F. Cintra, 1998 (see above) ------ Algoritmos Híbridos para Problemas de Corte Unidimensional ------ (1o. Prêmio no VI Concurso CLEI-UNESCO de Teses de Mestrado) (para estudantes latino-americanos -- mestrado em informática, 1998) (D) Flávio K. Miyazawa, 1997 ------ Algoritmos de Aproximação para Problemas de Empacotamento ------ (1o. Prêmio CTD'98 -- Concurso de Teses e Dissertações -- Soc. Brasileira de Computação) (M) Orlando Lee, 1994 ------ Passeios e Conexidade em Grafos Mistos: Algoritmos e Complexidade Computacional (M) Renato J. S. Carmo, 1994 ------ O Problema do Subgrafo Planar Ótimo ------ (1o. Prêmio CTD'95 -- Concurso de Teses e Dissertações -- Soc. Brasileira de Computação) ------ (1o. Prêmio no Concurso CLEI-UNESCO de Teses de Mestrado) (M) Ronaldo F. Hashimoto, 1994 ------ Circuitos e Caminhos Pares/Ímpares em Grafos e Digrafos (M) Haroldo G. Benatti, 1993 ------ Homeomorfismo em Grafos: Algoritmos e Complexidade Computacional. (M) Flávio K. Miyazawa, 1993 (see above) ------ Empacotamento Tridimensional: Novas Estratégias e Análises de Desempenho (D) Maria Angela Melo de Campos Gurgel, 1992 ------ Poliedros de Grafos Transitivos (M) Karina Marcus, 1992 ------ Poliedros e Clutters Bloqueadores e Anti-bloqueadores (M) Roberto Duó, 1992 ------ Fluxos Máximos em Redes: Algoritmos e Estruturas de Dados (M) Carlos Eduardo Ferreira, 1989 ------ O Problema de Steiner em Grafos: uma Abordagem Poliédrica Postdocs: Atílio Gomes Luiz (09/2018-02/2019) Maycon Sambinelli (mai/2018-aug/2019) Marcel Kenji de Carli Silva (01/2014-08/2014) Andrea Jiménez (06/2012-02/2015) Bhalchandra D. Thatte (2011-2013) Christiane Neme Campos (2007-2008) Frédéric Chataigner (2006-2007) Current students (M) Arthur Correia Gomes (M) Heloísa de Lazari Bento (M) Bruno Hideki Akamine (IC-PICME) Idian Camargo Capozzoli e-mail: yw at ime.usp.br",
  "content_length": 6915,
  "method": "requests",
  "crawl_time": "2025-12-01 14:52:44"
}