{
  "name": "Yoshito Ohta",
  "homepage": "http://www.bode.amp.i.kyoto-u.ac.jp/member/yoshito_ohta/research-en.html",
  "status": "success",
  "content": "Yoshito Ohta Yoshito Ohta Professor Control Systems Theory Group Department of Applied Mathematics and Physics Graduate School of Informatics Kyoto University Japanese Page Research Home Biography Research Courses Research interests My research interests include control system design, system identification, and networked control systems. The following are specific topics. Control of power networks The increase of renewable energy sources raise problems for control of power networks. For example, power generation and consumption should be balanced, the voltage and the frequency should be kept within the prescribed range, and the power generation and distribution should be efficiently carried out. The aim of the study is to cope with these problems and to develop control techniques to ensure the quality of electric power in the presence of variable renewable energy. Control of electronic power devices such as grid-tie inverters and DC-DC converters is studied in this research work. We apply robust control techniques and improve control performance of the devices. Grid-tie inverters are a device that sends electrical power generated by photovoltaic (PV) cells or wind firms into AC power transmission line. We design the current control loop appropriately to satisfy the FRT (fault-ride-through) capabilities. DC-DC converters are a device that produces desired DC voltage. We design a controller for DC-DC zeta converters that can function both step-up and step-down operations. The voltage regulation at the connection point is necessary to deal with inverse power flow caused by PV generation. We propose a distributed algorithm to control both active power and reactive power to keep the voltage within the allowable range. The algorithm can be applied to both residential solar systems and PV power plants using a\\real-time pricing strategy. System modeling and identification System identification is a fundamental research area studying modeling of dynamical control systems. Currently, a continuous-time system identification method based on system transformation and the Bayesian system identification approach are under investigation. Generalized orthonormal basis functions are a special class of orthonormal basis that induces continuous-time to discrete-time system transformation. This extends to stochastic systems having random processes as inputs and outputs. We propose a continuous-time system identification algorithm based on the transformation. The Bayesian approach is applied to system identification of an FIR (finite impulse response) model. The impulse response is estimated using the maximal likelihood method. Choosing suitable kernels that capture the dynamics of the plant is essential. In this research, we investigate the kernel based on the generalized orthonormal basis functions. Also we study the empirical Bayes approach for the hyper-parameter selection. Networked control The aim of this research is to derive fundamental limitations of networked control systems. Networks are modeled by channels having communication constraints. The main focus of the research is to derive achievable control performances under the given communication constraints. The state estimation problem and the disturbance rejection problem for networked control systems are studied using the information theoretic approach that can handle both Gaussian variables and bounded variables. Publications 2018 2017 2016 2015 2014 2013 2012 2011 2010 2009 2008 2007 2006 2005 2004 2003-1984 2018 Hidenori Shingin, and Yoshito Ohta, “ Reduction of state variables based on regulation and filtering performances, “ Automatica, vol.92, pp.143--154, 2018. Yoshito Ohta, and Paolo Rapisarda, “ System Transformation Induced by Generalized Orthonormal Basis Functions Preserves Dissipativity, “ MTNS 2018, Hong Kong, July, 2018. (accepted) Man Zheng, and Yoshito Ohta, “ Positive FIR System Identification using Maximum Entropy Prior. “ 18th IFAC Symposium on System Identification Stockholm, Sweden, July 9-11, 2018. (accepted) 2017 Yuta Okumura, Kenji Kashima, and Yoshito Ohta, “ Iterative path integral approach to nonlinear stochastic optimal control under compound Poisson noise, “ Asian Journal of Control, vol.19, no.2, pp.781--786, 2017. Kenji Hirata, Hikaru Akutsu, Akihiro Ohori, Nobuyuki Hattori, and Yoshito Ohta, “ Decentralized voltage regulation for PV generation plants using real-time pricing strategy, “ IEEE Transactions on Industrial Electronics, vol. 64, pp.5222--5232, 2017. Kentaro Ohki, Takuya Kakehashi, Hideharu Sugihara, Kenji Kashima, and Yoshito Ohta, “ Analyzing the Effects of Transmission Line Fault on the Stochastic Model Predictive Controlled IEEE 30-Bus System with Uncertain Environment, “ 2017 IEEE CCTA, pp.1064--1069, Kohala Coast, Hawaii, Aug 27-30, 2017. Hidenori Shingin, and Yoshito Ohta, “ SNR analysis for linear quadratic control over Gaussian channels with feedback, “ The 20th IFAC World Congress, pp.6403--6409, Toulouse, France, July 9-14, 2017. Takaaki Kondo, Seiji Yamaoka, and Yoshito Ohta, “ A hyper-parameter estimation algorithm in Bayesian system identification using OBFs-based kernels, “ The 20th IFAC World Congress, pp.14727--14732, Toulouse, France, July 9-14, 2017. Hikaru Akutsu, Kenji Hirata, Akihiro Ohori, Nobuyuki Hattori, and Yoshito Ohta, “ Decentralized active and reactive power control for PV generation plants using real-time pricing strategy, “ 2017 American Control Conference, pp.2761-2766, Seattle, USA, May 24-26, 2017. 2016 Yili Dong, and Yoshito Ohta, “ Attitude synchronization of rigid bodies via distributed control, “ The 55th IEEE Conference on Decision and Control, pp. 3499-3504, Las Vegas, December 12-14, 2016. Hafez Sarkawi, and Yoshito Ohta, “ Optimal state-feedback and proportional-integral controller performance comparison for Dc-Dc Zeta converter operating in continuous conduction mode, “ SICE Annual Conference, pp. 448-451, Tsukuba, Japan, September 20-23, 2016. Hikaru Akutsu, Kenji Hirata, Akihiro Ohori, Nobuyuki Hattori, and Yoshito Ohta, “ Decentralized control of inverter networks for PV generation plants using real-time pricing strategy “ The Seventh Conference on Innovative Smart Grid Technologies (IEEE ISGT 2016), Minneapolis, September 6-9, 2016, 2015 Kenji Kashima, Hiroki Aoyama, and Yoshito Ohta, “ Modeling and linearization of systems under heavy-tailed stochastic noise with application to renewable energy assessment, “ The 54th IEEE Conference on Decision and Control, pp. 1852-1857, Osaka, Japan, December 15-18, 2015. Takaya Ishii, Kenji Hirata, Akihiro Ohori, Nobuyuki Hattori, and Yoshito Ohta, “ Distributed active and reactive-power flow management for grid voltage maintenance using real-time pricing strategy, The 54th IEEE Conference on Decision and Control, pp.1322-1327, Osaka, Japan, December 15-18, 2015. Hideyuki Tanaka, and Yoshito Ohta, “ Grey-box modeling of an inverted pendulum system via identification of a PD-LTI system, “ The 47th ISCIE International Symposium on Stochastic Systems Theory and Its Applications, Honolulu, Hawaii, USA, December 5-8, 2015. Hideyuki Tanaka, and Yoshito Ohta, “ Local structural identifiability for a class of parameter-dependent mechanical systems, “ The 17th IFAC Symposium on System Identification Beijing, China, October 19-21, 2015. Hidenori Shingin, and Yoshito Ohta, “ SNR limitation for amplitude-bounded noise in control over channels with feedback, “ 2015 IEEE Multi-Conference on Systems and Control, Sydney, Australia, September 21-23, 2015. 2014 Hidenori Shingin, and Yoshito Ohta, “ SNR minimization for feedback control systems with amplitude-bounded noise, “ 2014 IEEE Multi-conference on Systems and Control, Antibes, France, October 8-10, 2014. 2013 Kotaro Hashikura, Akira Kojima, and Yoshito Ohta, “ On construction of an H∞ preview output feedback law, “ SICE Journal of Control, Measurement, and System Integration, vol. 6, no. 3, pp. 167--176, 2013. Yoshito Ohta, Akihiro Ohori, Nobuyuki Hattori, and Kenji Hirata, “ Controller design of a grid-tie inverter bypassing DQ transformation, “ The 52nd IEEE Conference on Decision and Control, pp.2927--2932, Florence, Italy, December 10-13, 2013. Marco Bergamasco, Marco Lovera, and Yoshito Ohta, “ Bootstrap-Based Model Uncertainty Assessment in Continuous-Time Subspace Model Identification, “ The 52nd IEEE Conference on Decision and Control, pp.5840--5845, Florence, Italy, December 10-13, 2013. Hideyuki Tanaka, and Yoshito Ohta, “ Grey-box modeling for mechanical systems in frequency domain, “ The 45th ISCIE International Symposium on Stochastic Systems Theory and Its Applications, Okinawa, Japan, November 1, 2013. (extended abstract review) Kotaro Hashikura, Akira Kojima, and Yoshito Ohta “ Reduced-order construction of H∞ state feedback law for discrete-time single input-delayed system, “ The 1st IFAC Workshop on Control of Systems Governed by Partial Differential Equations (CPDE), Paris, September 25-27, 2013. Hidenori Shingin, and Yoshito Ohta, “ Stabilization under signal-to-noise ratio constraints on feedback links with bounded noise, “ The 4th IFAC Workshop on Distributed Estimation and Control in Networked Systems, Rhine-Moselle-Hall, Koblenz, Germany, September 25-26, 2013. 2012 Hidenori Shingin, and Yoshito Ohta, “ Disturbance rejection with information constraints: performance limitations of a scalar system for bounded and Gaussian disturbances ” Automatica, vol.48, no.6, pp.1111-1116, 2012. Kotaro Hashikura, Yoshito Ohta, and Akira Kojima, “ An Internal State Decomposition Approach to a Discrete-time H2 Control Problem with Irrational Input Non-minimum Phase Property ” Systems & Control Letters, vol.61, no.4, pp.513-520, 2012. Xin Tan, Hideyuki Tanaka, and Yoshito Ohta, “ Grey-box Modeling of Rotary Type Pendulum System with Variable Load, “ The 16th IFAC Symposium on System Identification, pp.1263--1268, Brussels, Belgium, July 11-13, 2012. Kotaro Hashikura, Akira Kojima, and Yoshito Oht",
  "content_length": 21069,
  "method": "requests",
  "crawl_time": "2025-12-01 14:52:44"
}