{
  "name": "Yoshihiro Kanamori",
  "homepage": "http://kanamori.cs.tsukuba.ac.jp",
  "status": "success",
  "content": "Yoshihiro Kanamori's homepage [English | Japanese] Yoshihiro Kanamori Ph.D. in Computer Science, Professor Affiliation: Department of Computer Science, Institute of Systems and Information Engineering, University of Tsukuba Concurrently: Center for Artificial Intelligence Research (C-AIR), University of Tsukuba Teaching: Graduate School: Master's/Doctoral Program in Computer Science, Degree Programs in Systems and Information Engineering, Graduate School of Science and Technology (ex: Department of Computer Science, Graduate School of Systems and Information Engineering) Undergraduate: College of Media Arts, Science and Technology (MAST), School of Informatics Laboratory: Computational Geometry and Graphics Laboratory (CGG) (ex: Non-numerical Processing Algorithm Laboratory (NPAL)) Google Scholar Address in Univ. of Tsukuba: Tennoudai 1-1-1, Tsukuba, Ibaraki, 305-8573, Japan [map] Office: Room #1108, Laboratory of Advanced Research B (Phone: +81.29.853.5483, ext. 5483) Lab 1: Room #1125, Laboratory of Advanced Research B (Phone/Fax: +81.29.853.5600, ext. 8473) Lab 2: Room #925, Laboratory of Advanced Research B (Phone/Fax: +81.29.853.5388) E-mail: kanamori(AT)cs.tsukuba.ac.jp Please do not hesitate to contact me if you have any requests/questions. Short biography ¶ Yoshihiro Kanamori received his B.S., M.S., and Ph.D. degrees in computer science from the University of Tokyo, Japan, in 2003, 2005, and 2009, respectively. He is a professor in the University of Tsukuba. He was a visiting researcher in ETH Zurich from 2014 to 2016 funded by the postdoctoral fellowship for research abroad of Japan Society for the Promotion of Science (JSPS). He also stayed in the University of Edinburgh as a visiting researcher in 2019. His research interests center on computer graphics, especially rendering, image processing, and applications of deep learning. For international students ¶ You can apply to the MEXT scholarship for our master's/doctoral programs in computer science. For more details, please visit [this page]. Lectures ¶ 2025 [manaba] Human-centered AI A (Spring C) [manaba] Human-centered AI B (Autumn B) For other lectures, please see the Japanese page. English Documents for Students ¶ Guidelines for Research Paper Introduction Research interests ¶ Computer graphics (CG), rendering, deep learning, image editing techniques, and CG applications for industry. Publications ¶ Journals: Kazuki Higo, Toshiki Kanai, Yuki Endo, Yoshihiro Kanamori: \"TerraFusion: Joint Generation of Terrain Geometry and Texture Using Latent Diffusion Models,\" Virtual Reality & Intelligent Hardware (VRIH), to appear. [arXiv] Zhaorong Wang, Yoshihiro Kanamori, Yuki Endo: \"EG-HumanNeRF: Efficient Generalizable Human NeRF Utilizing Human Prior for Sparse View,\" Computational Visual Media (CVM) Journal, to appear. [arXiv] Taishi Ito, Yuki Endo, Yoshihiro Kanamori: \"SelfAge: Personalized Facial Age Transformation Using Self-reference Images,\" The Visual Computer (Proc. of Computer Graphics International 2025), 2025, to appear. [Project] [arXiv] [Code] Daichi Tajima, Yoshihiro Kanamori, Yuki Endo: \"All-frequency Full-body Human Image Relighting,\" Computer Graphics Forum (Proc. of Eurographics 2025), 2025, to appear. [Project] [Code] [arXiv] Toshiki Kanai, Yuki Endo, Yoshihiro Kanamori: \"Seasonal Terrain Texture Synthesis via Köppen Periodic Conditioning,\" The Visual Computer (Proc. of Computer Graphics International 2024), Volume 40, pages 48574868, 2024. [PDF] [Project] (Second Best Student Award) Taishi Ito, Yuki Endo, Yoshihiro Kanamori: \"Age-dependent face diversification via latent space analysis,\" The Visual Computer (Proc. of Computer Graphics International 2023), Vol. 39, pp. 32213233, 2023. [Project] Xingchao Yang, Takafumi Taketomi, Yoshihiro Kanamori: \"Makeup Extraction of 3D Representation via Illumination-Aware Image Decomposition,\" Computer Graphics Forum (Proc. of Eurographics 2023), Vol. 42, No. 2, pp. 293-307, 2023. [Project] [PDF] Haruka Takahashi, Yoshihiro Kanamori, Yuki Endo: \"3D Terrain Estimation from a Single Landscape Image,\" Computer Animation and Virtual Worlds (Special Issue on Computer Graphics International 2022 Part 2), Vol. 33, Issue 6, e2119, 14 pages, 2022. [Project] [PDF] [Movie] Yuki Endo, Yoshihiro Kanamori: \"Controlling StyleGANs Using Rough Scribbles via One-shot Learning,\" Computer Animation and Virtual Worlds (Special Issue on Computer Graphics International 2022 Part 1), Vol. 33, Issue 5, e2102, 16 pages, 2022. [Project] [PDF] [Code] [Movie] Takato Yoshikawa, Yuki Endo, Yoshihiro Kanamori: \"Diversifying Detail and Appearance in Sketch-Based Face Image Synthesis,\" The Visual Computer (Computer Graphics International 2022), Vol. 38, No. 9, pp. 3121-3133, 2022. [Project] [PDF] [Code] [Movie] Daichi Tajima, Yoshihiro Kanamori, Yuki Endo: \"Relighting Humans in the Wild: Monocular Full-Body Human Relighting with Domain Adaptation,\" Computer Graphics Forum (Proc. of Pacific Graphics 2021), Vol. 40, No. 7, pp. 205-216, 2021. [Project] [PDF] Yuki Endo, Yoshihiro Kanamori: \"Diversifying Semantic Image Synthesis and Editing via Class- and Layer-wise VAEs,\" Computer Graphics Forum (Proc. of Pacific Graphics 2020), Vol. 39, No. 7, pp. 519-530, 2020. [Project][Project (mirror)] Yuki Endo, Yoshihiro Kanamori, Shigeru Kuriyama: \"Animating Landscape: Self-Supervised Learning of Decoupled Motion and Appearance for Single-Image Video Synthesis,\" ACM Transactions on Graphics (Proc. of SIGGRAPH Asia 2019), Vol. 38, No. 6, Article No. 175, 2019. [Project][Project (mirror)] Yuya Kato, Shinichi Tanaka, Yoshihiro Kanamori, Jun Mitani: \"Single-View Modeling of Layered Origami with Plausible Outer Shape,\" Computer Graphics Forum (Proc. of Pacific Graphics 2019), Vol. 38, Issue 7, pages 629-640, 2019. [Project] [PDF (60.8MB)] [Movie (14.4MB)] Yoshihiro Kanamori, Yuki Endo: \"Relighting Humans: Occlusion-Aware Inverse Rendering for Full-Body Human Images,\" ACM Transactions on Graphics (Proc. of SIGGRAPH Asia 2018), 37, 6, Article No. 270, November 2018. [Project] [PDF (highres, 38MB)] [PDF (lowres, 3 MB)] [PPTX (29.5 MB)] [Movie (81 MB)] Takazumi Kikuchi, Yuki Endo, Yoshihiro Kanamori, Taisuke Hashimoto, and Jun Mitani, \"Transferring pose and augmenting background for deep human-image parsing and its applications,\" Journal of Computational Visual Media, 12 pages, 2018. [PDF, Supplemental material (open access)] (CVMJ Honorable Mention Award) Yan Zhao, Yuki Endo, Yoshihiro Kanamori, Jun Mitani: \"Approximating 3D Surfaces using Generalized Waterbomb Tessellations,\" Journal of Computational Design and Engineering, 2018. (ESCI, Accepted) [PDF (open access)] Yan Zhao, Yoshihiro Kanamori, Jun Mitani: \"Design and Motion Analysis of Axisymmetric 3D Origami with Generic Six-crease Bases,\" Computer Aided Geometric Design, Vol. 59, No. Supplement C, pp. 86-97, 2018. https://doi.org/10.1016/j.cagd.2017.10.002 [Project] Yuki Endo, Yoshihiro Kanamori, Jun Mitani: \"Deep Reverse Tone Mapping,\" ACM Transactions on Graphics (Proc. of SIGGRAPH Asia 2017), 36, 6, pp.177:1-177:10, November 2017. [Project] [Project (mirror)] Emi Miyamoto, Yuki Endo, Yoshihiro Kanamori, and Jun Mitani, \"Semi-Automatic Conversion of 3D Shape into Flat-Foldable Polygonal Model,\" Computer Graphics Forum (Proc. of Pacific Graphics 2017), Vol. 36, ISSUE 7, pp.41-50, 2017. [Project] [PDF] Yan Zhao, Yoshihiro Kanamori, and Jun Mitani, \"Geometry of Axisymmetric 3D Origami Consisting of Triangular Facets,\" Journal for Geometry and Graphics, Vol. 21, No. 1, pp. 107-118, 2017. Man Zhang, Yuki Igarashi, Yoshihiro Kanamori and Jun Mitani, \"Component-based building instructions for block assembly,\" Computer-Aided Design and Applications, Vol. 14, No. 3, pp. 293-300, 2017. Takuya Imai, Yoshihiro Kanamori, Jun Mitani: \"Real-Time Screen-Space Liquid Rendering with Complex Refractions,\" Computer Animation and Virtual Worlds (Special issue for CASA 2016), Volume 27, Issue 3-4, pages 425-434, May-August 2016. [Project (Code available)] [PDF] Yuki Endo, Satoshi Iizuka, Yoshihiro Kanamori, Jun Mitani: \"DeepProp: Extracting Deep Features from a Single Image for Edit Propagation,\" Computer Graphics Forum (Proc. of Eurographics 2016), Vol. 35, ISSUE 2, pages 189-201, 2016. [Project (Code available)] [PDF] Satoshi Iizuka, Yuki Endo, Yoshihiro Kanamori, Jun Mitani: \"Single Image Weathering via Exemplar Propagation,\" Computer Graphics Forum (Proc. of Eurographics 2016), Vol. 35, ISSUE 2, pages 501-509, 2016. [Project] [PDF] [Movie] Naoya Tsuruta, Jun Mitani, Yoshihiro Kanamori, Yukio Fukui, \"Random Realization of Polyhedral Graphs as Deltahedra\", Journal of Geometry Graphics, Vol.19, No.2, pp.227-236, 2016. Yuto Kase, Yoshihiro Kanamori, Jun Mitani, \"A method for designing flat-foldable 3D polygonal models,\" Science of Origami Vol.5 No.1, March, 2016. (in Japanese) Shinichi Tanaka, Yoshihiro Kanamori, Jun Mitani, \"A generation method of flat origami model for CG,\" Science of Origami Vol.5 No.1, March, 2016. (in Japanese) Yoshihiro Kanamori, Hiroki Yamada, Masaki Hirose, Jun Mitani, and Yukio Fukui: \"Image-Based Virtual Try-On System with Garment Reshaping and Color Correction,\" Transactions on Computational Science (TCS) XXVI Special Issue on Cyberworlds and Cybersecurity, Vol. 9550, pp.1-16, 2016. doi=10.1007/978-3-662-49247-5 [PDF] Yohei Yamamoto, Yoshihiro Kanamori, Jun Mitani: \"A study on square-tile puzzle with multiple answers,\" Journal of Information Processing Society of Japan (in Japanese), Vol.56, No.6, pp.1507-1516, 2015. Yuki Endo, Yoshihiro Kanamori, Jun Mitani, Yukio Fukui: \"A Design System for Water Flow Stain Images Using Particle Simulation,\" Journal of Information Processing Society of Japan (in Japanese), Vol.56, No.3, pp.1049-1058, 2015. Maki Kitamura, Yoshihiro Kanamori, Reiji Tsuruno: \"2.5D Modeling from Illustrations of Different Views,\" International Journal of Asia Digital Art & Design (ADADA), Vol. 18, No. 4, pp. 74-79, 2015. [PDF], [Movie] Hiroshi Aoki, Jun Mitani, Yoshihiro K",
  "content_length": 28621,
  "method": "requests",
  "crawl_time": "2025-12-01 14:52:41"
}