{
  "name": "Yoshihiro Kawahara",
  "homepage": "http://kawahara.akg.t.u-tokyo.ac.jp",
  "status": "success",
  "content": "Yoshihiro Kawahara / 川原圭博Search this siteEmbedded FilesSkip to main contentSkip to navigationプロフィール川原圭博経歴2019年10月 - 現在 東京大学 インクルーシブ工学連携研究機構 機構長 2019年3月 - 現在東京大学 大学院工学系研究科 教授 2015年10月 - 2022年3月国立研究開発法人科学技術振興機構 ERATO「万有情報網」 研究総括 2013年9月 - 2019年3月東京大学 大学院情報理工学系研究科 准教授 2014年10月 - 2016年3月国立研究開発法人科学技術振興機構 さきがけ 研究者 2011-2013年 ジョージア工科大学客員研究員およびMIT Media Lab客員教員2010年4月 - 2013年8月東京大学 大学院情報理工学系研究科 講師 2007年4月 - 2010年3月東京大学 大学院情報理工学系研究科 助教 2005年4月 - 2007年3月東京大学 大学院情報理工学系研究科 助手 コンピュータや携帯電話，インターネットなど，情報通信分野における新技術はライフスタイルをがらっと変えてしまう力を持っています．コンピュータネットワーク，モバイル，ユビキタスコンピューティングのコアとなる技術の研究開発を通じて，「未来の生活」をデザインすることをライフワークにしています．情報通信の研究の中でも，現在では通信とエネルギーのあるべき関係に興味を持っています．無線通信技術の発達により，コンピュータ同士をケーブルで接続することなく高速な通信ができるようにはなりました．携帯電話などは電池が切れればそこで動作が停止します．通信のみを無線化しても結局機器へのエネルギー供給が足かせとなってしまっています．この問題に対して，二つのアプローチで研究を進めています．一つは環境中のエネルギーから微少な電力を取り出し，その電力で永久動作を目指すのがエナジーハーベスティングと呼ばれる考え方．もう一つは，電磁波を使って無線通信をするように無線で電力を送りあう無線電力伝送．従来の情報系の研究を超えて多面的に研究開発を進めています．学生の頃，IT系ベンチャー企業での就業経験の中で，新しいアイディアをビジネスとして実装する重要性と喜びを学びました．論文を書くだけでなく，新技術を世に問うことにも興味を持っています．研究室への配属を希望される方は、大学院の場合は大学院工学系研究科電気系工学専攻、学部の場合は工学部の電子情報工学科または、電気電子工学科に進学してください。東大電気系(EEIC)のウェブサイトはこちら。担当講義アイデアを形にするモノづくり体験〜ロボットから家電まで〜 (ものゼミ)  S2 主題科目 全学体験ゼミナール (集中))計算製造学（2018〜, 大学院, 隔年)電子情報機器学(2014〜)Webサービス・アプリデザイン概論(2021〜）過去の担当講義プログラミング基礎演習 (-2013まで)ソフトウェアI (2014〜2019)ユビキタスコンピューティング (2014〜2016, 大学院, 隔年)電気電子情報第一(前期)実験/第二(後期)実験電子情報ゼミ: Android によるモバイルプログラミングSpeculative Design (2018, 2019) 主題科目 全学自由ゼミナールアイデアを形にするモノづくり体験〜ロボットから家電まで〜 (ものゼミ)  S2 主題科目 全学体験ゼミナール (集中))研究プロジェクト2016-2021ごろJST ERATO川原万有情報網プロジェクトERATO川原プロジェクトでは、私たちの環境に溶け込むデバイスに関する技術と応用の研究に取り組み、あらゆる環境下にくまなく遍在し、自ら然る（オノズカラシカル）“万有情報網”の構築を探求します。総括：川原圭博グループリーダー：筧 康明、高宮 真、新山 龍馬プロジェクトWebサイト： https://www.jst.go.jp/erato/kawahara/Poimohttps://poimo.akg.t.u-tokyo.ac.jpマルチモード準静空洞共振器（Multimode QSCR）T. Sasatani, et al., ” Nature Electronics, Vol. 4, Issue 9, pp. 689–697, Aug. 2021 Luciolahttps://convivial.tech/2010-2015ごろInstant Inkjet Circuits: 家庭用プリンタを用いたフレキシブル回路の作成熱焼結が不要な銀ナノインクと家庭用インクジェットプリンタ、異方向性導電両面テープ等市販の素材や機材のみを用いて柔軟な回路を実装する技術を開発しています。廉価なプリンタを用いることで数万円の初期投資でだれでも家庭で安全にフレキシブルな電子回路基板を高速に実装できます。電子回路基板だけでなく、独自の特性解析により櫛形電極を用いた高精度な静電容量センサ、ガスセンサ、アンテナなどの実装も可能になりました。Y. Kawahara, S. Hodges, B. S. Cook, C. Zhang, and G. D. Abowd, “Instant Inkjet Circuits: Lab-based Inkjet Printing to Support Rapid Prototyping of UbiComp Devices,” The 2013 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp 2013) , pp. 363-372, Zurich, CH, Sept. 2013 (Best Paper Award).環境電波からのエナジーハーベスティング我々の生活空間中に高密度でセンサを配置し継続的にモニタリングを行うためには，センシング機能を備えた無線通信ノードを低コストで製作し配置するための技術が必要になります．本研究では，環境中に放射された電波を回収し，このセンサの駆動源に利用することを目指して研究を実施しています．最終的には紙の上に主要部品を印刷技術を用いて実装し，空中からばらまくことで広範囲のセンシングが可能になるようなアプリケーションを考えています．本研究は東大がNEDOの支援を受け Georgia Institute of Technology と共同で実施しています．マルチホップ型無線電力伝送現在では非接触充電技術により身の回りの機器を充電器に「置くだけ」で充電できるようになりました．また電磁界共振結合という比較的新しい手法を用いることで，送受信の機器間に間隙がある場合でも高効率で電力を「飛ばす」ことができるようになって来ました．本研究ではこれを更に一歩進め，複数の共振器の共振条件を制御することにより空間中でエネルギーの伝送経路を自在に操る技術の確立を目指しています．方式が実現すれば，宅内でどこでも任意の機器に電力を送ることができるようになります．発表文献研究発表こちらからお願いします解説記事など電源コードをなくす～無線電力伝送とエナジーハーベスティング～ （情報処理 Vol.52, No.1, Jan. 2011）情報爆発時代のセンサ情報処理 （電子情報通信学会学会誌）報道発表，メディア，出演E-Coaching (NPO WINとの共同開発)2005/9/9 日経産業新聞8面「先端技術」 2006/1/27 日本経済新聞15面「テクノロジー」 2005/9/20 テレビ東京 ワールドビジネスサテライト 「トレンドたまご」 2005/10/1 NHK サイエンスZERO 2005/10/14 NHK おはよう日本 2005/10/24 毎日放送 ちちんぷいぷい 2005/10/26 NHKラジオ ラジオあさいちばん 2006/4/6 日本テレビ 未来予報2011 2006/11/26 BS 朝日 be on TV秋葉原スマート環境実証実験スペース2006/5/14 北海道新聞日曜版「ニッポンを歩こう」2006/5/30 朝日新聞夕刊6面「新科論」カロリー消費計2008/9/26 日経産業新聞朝刊 『ＫＤＤＩ研究所、内蔵センサーで分析 携帯持つ人の様子割り出す』エナジーハーベスティング2011/7/10 WBB最新情報 紙に印刷したアンテナで電波エネルギーを収穫して小型電子機器を動かす：ジョージア工科大学と東京大学の共同研究2011/7/20 山路達也の「エコ技術者に訊く」 電池不要の「紙」端末が作るセンサーネットワーク2011/7/20 EE Times Japan ペラペラの紙から電力を収穫、東大がどこにでも張れるアンテナを開発2011/7/21 マイナビニュース テクノフロンティア2011 - 実用化に期待が集まる環境発電技術2011/8/11 朝日新聞夕刊 空中の電波から微量の電力回収 紙使ったアンテナで成功日経エレクトロニクス2011年9月19日号 環境発電の省エネが進展、1μW以下で動作可能に2015/7/23 朝日新聞 夕刊 1面 「微弱エネ集めて発電」Instant Inkjet Circuits2013/11/5 日経産業新聞「銀ナノインクで電子回路を印刷、東大、市販プリンターで」2013/11/8 日刊工業新聞「東大など、家庭用プリンター利用で配線印刷の技術開発ーコスト1/100」2013/11/8 マイナビニュース「東大、家庭用インクジェットプリンタを用いた電子回路印刷技術を開発」2013/11/11 テレビ東京 ワールドビジネスサテライト トレンドたまご2013/10/3 Print a working paper computer on an $80 inkjet. New Scientist2014/5/7 NHK NEWS Web 「大企業に眠る技術にベンチャーが光」2014/3/29 BBC Click2014/6/23 The Bridge 「書くだけで電子回路が出来上がる？大企業に眠る技術を活用して生まれた東大発ベンチャー「AgIC」にインタビュー」2014/9/14 日本経済新聞「線引くだけで回路作成 東大発ベンチャー、ペン発売」SenSprout2013/9/13 Wired UK, SenSprout helps farmers save water and is powered by radio waves2014/5/19 日本農業新聞 「１０００円で水分センサー 家庭用プリンター利用 東京大学大学院開発」2014/12/16 日本経済新聞 「土の水分量 紙で測定 東大がセンサー開発」2015/1/21 the Bridge 世界の水問題を解決するスマート農業センサー「SenSprout」が注目を集める理由2015/1/26 農経しんぽう 「東大・川原准教授に栄誉 土壌水分センサで」2015/7/20 日本経済新聞 13面 「スマート農業支援機器開発」無線給電2014/7/28 日経エレクトロニクス 「できたてほやほや」、東大のマルチホップ型ワイヤレス給電システム2014/8 日経エレクトロニクス 回転体向けやマルチホップ電送 ユニークな無線給電が続々EV検知2014/8 日経エレクトロニクス HEVやEVの接近検知に新手法スマホのマイクで実現2015/1/17日本テレビ 「世界一受けたい授業」一限目2017/4/27NHK BSプレミアム 「フランケンシュタインの誘惑」ゆがめられた天才 幻の世界システム2017/7/8テレビ東京 「ミライダネ」植物を元気に育てるセンサー技術受賞など日本学術振興会特別研究員 21COE (2004-2005)情報処理学会ユビキタスコンピューティングシステム研究会優秀論文賞 (2003)IEEE VTS Japan 2003 Young Researcher's Encouragement Award (2003)UCS2007 Best Poster Presentation Award (2007)情報処理学会ユビキタスコンピューティングシステム研究会優秀論文賞共同受賞  (2006, 2007, 2008 and 2009)情報処理学会DICOMO 2009優秀論文賞，優秀プレゼンテーション賞 (2009)電子情報通信学会IN研究会優秀論文賞 (2010) 電子情報通信学会学術奨励賞 (2010)情報処理学会DICOMO 2010  優秀論文賞 (2010)情報処理学会DICOMO  2011 優秀論文賞 (2011)ACM Ubicomp 2013 Best Paper Award (2013)Microsoft Research 2014 New Faculty Award / マイクロソフト日本情報学研究賞 (2014)Digital Contents Expo、Innovative Technologies 2014 (2014)ACM Ubicomp 2014 Best Paper Nominee Award (2014)JAFOE Best Speakers Award (2014)シーバスブラザーズ・ヤングアントレプレナー基金 (2015)ACM UbiComp Honorable Mention Award (2015)工学部 Best Teaching Award (2016)ヤマト科学賞(2016)World Economic Forum Young Scientists (2017)日本学術振興会賞 (2019)東京大学工学系研究科長賞 (2020)ドコモ・モバイル・サイエンス賞 先端技術部門 (2020)KDDI Foundation Award (2020)学会活動組織委員Ubicomp 2005 Local Arrangement Committee, Student Volunteer Chair IEEE 6th International Workshop on Wearable Computing and Smart Appliances (IWSAWC 2006), Organizing Committee IEEE 7th International Workshop on Wearable Computing and Smart Appliances (IWSAWC 2007), Organizing Committee (Co-chair) The Seventh International Conference on Pervasive Computing (Pervasive 2009), Publicity Chair IEEE IMS 2012, Workshop on wireless energy transfer and scavenging techniques, for autonomous RFID and sensors, organizer情報処理学会ユビキタスコンピューティグシステム研究会 運営委員(2009)，幹事（2010-)電子情報通信学会モバイルマルチメディア研究会 専門委員(2009-)情報処理学会インタラクション運営委員(2010, 2011)情報処理学会DICOMO運営委員（2010,2011）横須賀スマートシティ研究会 構成員(2011)ACM Ubicomp 2015, Publication Chairプログラム委員Fourth International Conference on Networked Sensing Systems (INSS 2007), Program Committee ACM Multimedia 2007, Networking Track Program Committee 6th Annual Workshop on Network and Systems Support for Games: Netgames 2007, Program Committee International Symposium on Ubiquitous Computing Systems 2007, Program Committee International Workshop on Peer-to-Peer Network Virtual Environments 2007 (P2P-NVE 2007), Program Committee 2009 International Workshop on Network Assurance and Security Services in Ubiquitous Environments (NASSUE 2009), Program Committee 9th Workshop of the Multimedia Metadata Community (WMM 2009), Program Committee The Sixth International Conference on Ubiquitous Intelligence and Computing (UIC-09) (UIC2009), Program Committee Eighth International Conference on Networked Sensing Systems (INSS 2008), Program Committee Ninth International Conference on Networked Sensing Systems (INSS 2009), Program Committee Fifth International Symposium on Ubiquitous Computing Systems (UCS 2009) Program Committee KSE 2009 The First International Conference on Knowledge and Systems Engineering, Program Committee 8th Annual Workshop on Network and Systems Support for Games: Netgames 2009, Program Committee International Workshop on Peer-to-Peer Network Virtual Environments 2009 (P2P-NVE 2009), Program Committee IEEE Radio and Wireless Symposium RWS 2010, Technical Program Committee Tenth International Conference on Networked Sensing Systems (INSS 2010), Program Committee The Eighth International Conference on Pervasive Computing (Pervasive 2010), Program Committee PECCS 2011, Program CommitteeINSS 2011, Program CommitteeSAINT 2011, Program CommitteeIEEE P2P 2011, Program CommitteeP2P-NVE 2011, Program CommitteeICPADS 2011, Program CommitteeCCNC 2011, Program CommitteeAHSP 2011 (Ad Hoc, Sensor and P2P Workshop), Program CommitteeFTRA WCC-WTA 2011,INSS 2012, Technical Program CommitteeSAINT 2012, Program CommitteeIEEE RWS 2013, Program CommitteeSENSORNETS 2013 Program CommitteeAHSP 2013 : The 5th Ad Hoc, Sensor and P2P Networks Workshop, Program CommitteeIEEE RWS 2014, Program CommitteeIEEE RFID-TA 2014 Program CommitteeACM Ubicomp 2014 Program CommitteeCEA2014 Program Committee, Publicity Co-ChairHASCA2014 Program CommitteePowerMEMS 2014 Program CommitteeIEEE Globecom 2015 Program CommitteeACM Ubicomp 2015 Program CommitteeIEEE RFID-TA 2015 Program CommitteeThe 5th International Conference on the Internet of Things (IoT 2015) Program Committee論文誌編集委員IEEE Pervasive Computing Magazine, Editorial Board (2015-)情報処理学会論文誌特集号編集委員または編集幹事 (2007,2009,2010,2011, 2015, 2016) 電子情報通信学会和文論文誌または英文論文誌 (2007,2008,2009) 査読委員Ubicomp 2009, Pervasive 2006, Ubicomp 2005, Ubicomp 2004, IWSAWC 2007, IWSAWC 2006, IWSAWC 2005, INSS 2007, INSS 2008, ICMLC 2007 etc.Report abusePage detailsPage updated Report abuse",
  "content_length": 9370,
  "method": "requests",
  "crawl_time": "2025-12-01 14:52:42"
}