{
  "name": "Yossi Gilad",
  "homepage": "https://www.cs.huji.ac.il/~yossigi",
  "status": "success",
  "content": "Yossi Gilad I work on networked systems and their security yossigi@cs.huji.ac.il About Publications I am an Associate Professor at the School of Computer Science and Engineering, the Hebrew University of Jerusalem. Research Interests. I design, build, and analyze secure and scalable protocols and networked systems. My work focuses on the mechanisms that comprise Internet services. It ranges from the core Internet protocols, through content delivery networks, to large-scale Internet applications. My research methodology combines rigorous analysis with experimental evaluation, as well as informing deployment via standardization and interactions with practitioners. Industry Experience. I was the CTO at Algorand, where we developed a breakthrough consensus protocol that scales to support any number of participants. I’ve also worked on large-scale production systems at Google and IBM where I held various R&D roles. Honors, Awards, Grants Israel Science Foundation individual research grant (2023-2027). NSF-BSF research grant (2023-2026). Alon fellowship for outstanding young researchers. Internet Research Task Force Applied Networking Research Prize (2017). RIPE Academic Cooperation Initiative (2017). IBM Research Inventor Recognition Award (2015). The Check Point Institute Information Security Prize (2013-2014). Israel Ministry of Science cybersecurity research scholarship (2012-2014). Best student paper award at USENIX Workshop on Offensive Technologies (2012). Bar-Ilan University presidential scholarship (2012 - 2014). Check Point Institute for Information Security fellowship (2012 - 2013). Israel ministry of education academic scholarship for excelling youth (2003). Academic Service I'm an Associate Editor at ACM Transactions of Privacy and Security, and on the program committee for the following conferences: ACM Conference on Computer and Communications Security (CCS) 2026 SIGCOMM 2025 Usenix ATC 2025 (heavy PC) IEEE Security and Privacy 2023, 2025 EuroSys 2024 ACM Conference on Architectural Support for Programming Languages and Operating Systems (ASPLOS) 2024 USENIX Security 2021, 2022, 2023, 2024 USENIX Symposium on Operating Systems Design and Implementation (OSDI) 2020, 2023 SYSTOR 2021, 2023 (program co-chair) Proceedings on Privacy Enhancing Technologies (PoPETS) 2018, 2019, 2020, 2022 CoNEXT 2021 Algorithmic Principles of Computer Systems (APoCS) 2021 IEEE Conference on Communications and Network Security 2019 Workshop of Security & Privacy on the Blockchain (IEEE S&B) 2018 Sliced PIR: Offloading Heavyweight Work with NTT. Jonathan Weiss, and Yossi Gilad. ACM CCS 2025. Distinguished Paper Award. Sybil-Resistant Parallel Mixing. Maya Kleinstein, Riad Wahby, and Yossi Gilad. Proceedings of Privacy Enhancing Technologies (PETS) 2025. Asynchronous Algorand: Reaching Agreement with Near Linear Communication and Constant Expected Time. Ittai Abraham, Eli Chouatt, Ivan Damgård, Yossi Gilad, Gilad Stern, and Sophia Yakoubov. ACM Symposium on Principles of Distributed Computing (PODC) 2025. Suppressing BGP Zombies with Route Status Transparency. Yosef Edery Anahory, Jie Kong, Nicholas Scaglione, Justin Furuness, Hemi Leibowitz, Amir Herzberg, Bing Wang, and Yossi Gilad. Symposium on Networked Systems Design and Implementation (NSDI) 2025. Distributed PIR: Scaling Private Messaging via the Users' Machines. Elkana Tovey, Jonathan Weiss, and Yossi Gilad. ACM CCS 2024. Practical Rateless Set Reconciliation. Lei Yang, Yossi Gilad, and Mohammad Alizadeh. ACM SIGCOMM 2024. Device Tracking via Linux’s New TCP Source Port Selection Algorithm. Moshe Kol, Amit Klein, and Yossi Gilad. USENIX Security Symposium 2023. The Use of maxLength in the Resource Public Key Infrastructure (RPKI). Yossi Gilad, Sharon Goldberg, Kotikalapudi Sriram, Job Snijders, Ben Maddison. RFC 9319 Best Current Practice, 2022. Twilight: A Differentially Private Payment Channel Network. Maya Dotan, Saar Tochner, Aviv Zohar, and Yossi Gilad. USENIX Security Symposium 2022. Aardvark: An Asynchronous Authenticated Dictionary with Short Proofs. Derek Leung, Yossi Gilad, Sergey Gorbunov, Leonid Reyzin, and Nickolai Zeldovich. USENIX Security Symposium 2022. Groove: Flexible Metadata-Private Messaging. Ludovic Barman, Moshe Kol, David Lazar, Yossi Gilad, and Nickolai Zeldovich. Symposium on Operating Systems Design and Implementation (OSDI) 2022. Proving Server Faults: RPCs for Distributed Systems in Byzantine Networks. Jonathan Weiss, Albert Kwon, and Yossi Gilad. Hot Topics in Networks (HotNets) 2020. DISCO: Sidestepping RPKI’s Deployment Barriers. Tomas Hlavacek, Italo Cunha, Yossi Gilad, Amir Herzberg, Ethan Katz-Bassett, Michael Schapira, and Haya Shulman. Network and Distributed System Security Symposium (NDSS) 2020. Yodel: Strong Metadata Security for Voice Calls. David Lazar, Yossi Gilad, and Nickolai Zeldovich. Symposium on Operating Systems Principles (SOSP) 2019. An extended abstract of this work appeared at HotPETs 2019. Metadata-Private Communication for the 99%. Yossi Gilad. Communications of the ACM (CACM) 2019. Vault: Fast Bootstrapping for Cryptocurrencies. Derek Leung, Adam Shul, Yossi Gilad, and Nickolai Zeldovich. Network and Distributed System Security Symposium (NDSS) 2019. Perfect is the Enemy of Good: Setting Realistic Goals for Interdomain Routing Security. Yossi Gilad, Tomas Halvacek, Amir Herzberg, Michael Schapira, and Haya Shulman. Hot Topics in Networks (HotNets) 2018. Karaoke: Distributed Private Messaging Immune to Passive Traffic Analysis. David Lazar, Yossi Gilad, and Nickolai Zeldovich. Symposium on Operating Systems Design and Implementation (OSDI) 2018. PCC-Vivace: Online-Learning Congestion Control. Mo Dong, Tong Meng, Doron Zarchy, Engin Arslan, Yossi Gilad, Brighten Godfrey and Michael Schapira. Symposium on Networked Systems Design and Implementation (NSDI) 2018. The Unintended Consequences of Email Spam Prevention. Sarah Scheffler, Sean Smith, Yossi Gilad, Sharon Goldberg. Passive and Active Measurement Conference (PAM) 2018. Algorand: Scaling Byzantine Agreements for Cryptocurrencies. Yossi Gilad, Rotem Hemo, Silvio Micali, Georgios Vlachos and Nickolai Zeldovich. Symposium on Operating Systems Principles (SOSP) 2017. Stadium: A Distributed Metadata-Private Messaging System. Nirvan Tyagi, Yossi Gilad, Derek Leung, Matei Zaharia and Nickolai Zeldovich. Symposium on Operating Systems Principles (SOSP) 2017. MaxLength Considered Harmful to the RPKI. Yossi Gilad, Omar Saga and Sharon Goldberg. International Conference on emerging Networking EXperiments and Technologies (CoNEXT) 2017. Are We There Yet? On RPKI's Deployment and Security. Yossi Gilad, Avichai Cohen, Amir Herzberg, Michael Schapira and Haya Shulman. Network and Distributed System Security Symposium (NDSS) 2017. Jumpstarting BGP Security with Path-End Validation. Avichai Cohen, Yossi Gilad, Amir Herzberg and Michael Schapira. SIGCOMM 2016. Awarded IETF/IRTF Applied Networking Research Prize! CDN-on-Demand: An Affordable DDoS Defense via Untrusted Clouds. Yossi Gilad, Amir Herzberg, Michael Sudkovitch and Michael Goberman. Network and Distributed System Security Symposium (NDSS) 2016. One Hop for RPKI, One Giant Leap for BGP Security. Avichai Cohen, Yossi Gilad, Amir Herzberg and Michael Schapira. Hot Topics in Networks (HotNets) 2015. Securing Smartphones: A Micro-TCB Approach. Yossi Gilad, Amir Herzberg and Ari Trachtenberg. IEEE Pervasive Computing 2014. Off-Path TCP Injection Attacks. Yossi Gilad and Amir Herzberg. ACM Transactions on Information and System Security 2014. Off-Path Hacking: The Illusion of Challenge-Response Authentication. Yossi Gilad, Amir Herzberg and Haya Shulman. IEEE Security and Privacy Magazine 2014. When Tolerance Causes Weakness: The Case of Injection-Friendly Browsers. Yossi Gilad and Amir Herzberg. International World Wide Web Conference (WWW) 2013. Plug-and-Play IP Security: Anonymity Infrastructure Instead of PKI. Yossi Gilad and Amir Herzberg. European Symposium on Research in Computer Security (ESORICS) 2013. Fragmentation Considered Vulnerable. Yossi Gilad and Amir Herzberg. ACM Transactions on Information and System Security 2013. LOT: A Defense Against IP Spoofing and Flooding Attacks. Yossi Gilad and Amir Herzberg. ACM Transactions on Information and System Security 2012. Off-Path Attacking the Web. Yossi Gilad and Amir Herzberg. USENIX Workshop on Offensive Technologies (WOOT) 2012. Awarded Best Student Paper. Spying in the Dark: TCP and Tor Traffic Analysis. Yossi Gilad and Amir Herzberg. Privacy Enhancing Technologies Symposium (PETS) 2012. Fragmentation Considered Vulnerable: Blindly Intercepting and Discarding Fragments. Yossi Gilad and Amir Herzberg. USENIX Workshop on Offensive Technologies (WOOT) 2011. Lightweight Opportunistic Tunneling. Yossi Gilad and Amir Herzberg. European Symposium on Research in Computer Security (ESORICS) 2009. Meta-data private communication at scale Private communication over the Internet remains a challenging problem. Even if messages are encrypted, it is hard to deliver them without revealing metadata about which users are communicating. Scalable metadata-hiding systems, such as Tor, are popular but susceptible to traffic analysis attacks. In contrast, the largest-scale systems with metadata privacy require passing all messages through a small number of providers, incurring a very high operational cost for each provider and limiting their deployability in practice. Stadium (SOSP'17) is a point-to-point messaging system that provides metadata and data privacy while scaling its work efficiently across hundreds of low-cost providers operated by different organizations. We show that Stadium can scale to support 4x more users than the current state of the art, using servers that cost an order of magnitude less to operate. However, Stadium induces high latency, and to facilitate broad adoption, the metadata-private system should present comparable performance to ``vanilla'' (non-m",
  "content_length": 13375,
  "method": "requests",
  "crawl_time": "2025-12-01 14:52:48"
}