{
  "name": "Yossi Adi",
  "homepage": "https://www.cs.huji.ac.il/~adiyoss",
  "status": "success",
  "content": "Yossi Adi Yossi Adi My name is Yossi Adi, I'm an Assistant Professor (Senior Lecturer) at the School of Computer Science and Engineering at the Hebrew University and a Research Scientist at the FAIR team, Meta. I'm also a professional drummer at Lucille Crew. I completed my Ph.D in computer science at Bar-Ilan University under the supervision of Prof. Joseph Keshet. My research interests are focused on developing and analyzing machine learning and deep learning algorithms for speech and language applications. In general, my research usually follows the KISS philosophy. My complete CV can be found here. As a musician, I'm the drummer and one of the band members of Lucille Crew, an international Groove, Hip Hop and Soul collective based in Tel Aviv. yossi.adi at mail.huji.ac.il Our research paper On The Landscape of Spoken Language Models: A Comprehensive Survey got accepted to TMLR! We are co-organizing a challenge to ICASSP 2026 on Low-Resource Audio Codec (LRAC)! Two research papers got accepted to TMLR! More details in the publication section. Our research paper GmSLM : Generative Marmoset Spoken Language Modeling got accepted to EMNLP (Findings) 2025! Two research papers got accepted to ASRU 2025! More details in the publication section. Our research paper Scaling Analysis of Interleaved Speech-Text Language Models got accepted to COLM 2025! Our research paper CAFA: a Controllable Automatic Foley Artist got accepted to ICCV 2025! Together with Joseph Keshet I am organizing iSpeech-2025, the second Israeli seminar on Speech & Audio processing using neural nets. Two research papers got accepted to INTERSPEECH 2025! More details in the publication section. Our research paper Slamming: Training a Speech Language Model on One GPU in a Day got accepted to ACL (Findings) 2025! Four research papers got accepted to ICASSP 2025! More details in the publication section. Our research paper Discrete Flow Matching got accepted to NeurIPS 2024! Our research paper Transformers are Multi-State RNNs got accepted to EMNLP 2024! Our research paper The Larger the Better? Improved LLM Code-Generation via Budget Reallocation got accepted to CoLM 2024! Two research papers got accepted to ISMIR 2024! More details in the publication section. Five research papers got accepted to Interspeech 2024! More details in the publication section. We are co-organizing a tutorial to Interspeech 2024 on Recent Advances in Speech Language Models! We are co-organizing two special sessions to Interspeech 2024 on SpeechLMs and Discrete speech representation for speech processing! Our research paper Masked Audio Generation using a Single Non-Autoregressive Transformer got accepted at ICLR 2024! Two research papers got accepted to AAAI 2024! More details in the publication section. I am grateful to be the recipient of the Alon Scholarship for Outstanding Faculty, 2023! Together with Joseph Keshet and Tal Rosenwein I am organizing iSpeech-2023, the first Israeli seminar on Speech & Audio processing using neural nets. I am humbled to be part of TheMarker Magazine's 40 Under 40 list (in Herbrew): [The Marker]. I am grateful to be the recipient of the Best Doctoral Dissertation Award in 2020 given by the Israeli Association for Artificial Intelligence (IAAI)! Spoken Language Processing-Research Lab I am currently leading the Spoken Language Processing Research Lab (SPL-RL) located at the Hebrew University of Jerusalem, Israel. The lab primarily focuses on exploring various areas within spoken language processing, such as automatic speech recognition, speech enhancement, spoken language understanding, and machine learning techniques specifically designed for audio, speech and language applications. For more information on the lab members, activity, publications, etc. please visit the following link. Publications Conferences and Workshops Proceedings Talia Sterngerg, Mickey London, David Omer, Yossi Adi. GmSLM : Generative Marmoset Spoken Language Modeling. Findings of Empirical Methods in Natural Language Processing (EMNLP), 2025, [PDF]. Arnon Turetzky, Nimrod Shabtay, Slava Shechtman, David Haws, Hagai Aronowitz, Ron Hoory, Yossi Adi, Avihu Dekel. Speech Synthesis From Continuous Features Using Per-Token Latent Diffusion. IEEE Automatic Speech Recognition and Understanding Workshop (ASRU), 2025, [PDF]. Robin San Roman, Manel Khentout, Tu Anh Nguyen, Yossi Adi, Emmanuel Dupoux. Benchmarking Fast Domain Adaptation for Unsupervised Speech Units. IEEE Automatic Speech Recognition and Understanding Workshop (ASRU), 2025, [PDF]. Gallil Maimon, Michael Hassid, Amit Roth, Yossi Adi. Scaling Analysis of Interleaved Speech-Text Language Models. The 2nd Conference on Language Modeling (COLM), 2025, [PDF, Project page]. Roi Benita*, Michael Finkelson, Tavi Halperin, Gleb Sterkin, Yossi Adi. CAFA: a Controllable Automatic Foley Artist. The IEEE/CVF International Conference on Computer Vision (ICCV), 2025, [PDF, Project page]. Iddo Yosha, Dorin Shteyman, Yossi Adi. WHISTRESS: Enriching Transcriptions with Sentence Stress Detection. The 26th Annual Conference of the International Speech Communication Association (Interspeech), 2025, [PDF, Project page]. Nadav Har-Tuv, Or Tal, Yossi Adi. PAST: Phonetic-Acoustic Speech Tokenizer. The 26th Annual Conference of the International Speech Communication Association (Interspeech), 2025, [PDF, Project page]. Gallil Maimon*, Avishai Elmakies*, Yossi Adi. Slamming: Training a Speech Language Model on One GPU in a Day. Findings of The 63rd Annual Meeting of the Association for Computational Linguistics (ACL), 2025, [PDF, Project page]. Guy Yariv, Yuval Kirstain, Amit Zohar, Shelly Sheynin, Yaniv Taigman, Yossi Adi, Sagie Benaim, Adam Polyak. Through-The-Mask: Mask-based Motion Trajectories for Image-to-Video Generation. The Conference on Computer Vision and Pattern Recognition (CVPR), 2025, [PDF, Project page]. Gallil Maimon*, Amit Roth*, Yossi Adi. A Suite for Acoustic Language Model Evaluation. The 50th IEEE International Conference in Acoustic, Speech and Signal Processing (ICASSP), 2025, [PDF, Code & Data]. Ella Zeldes, Or Tal, Yossi Adi. Enhancing TTS Stability in Hebrew using Discrete Semantic Units. The 50th IEEE International Conference in Acoustic, Speech and Signal Processing (ICASSP), 2025, [PDF, Code & Demo]. Robin San Roman, Pierre Fernandez, Antoine Deleforge, Yossi Adi, Romain Serizel. Latent Watermarking of Audio Generative Models. The 50th IEEE International Conference in Acoustic, Speech and Signal Processing (ICASSP), 2025, [PDF]. Simon Rouard*, Robin San Roman*, Yossi Adi, Axel Roebel. MusicGen-Stem: Multi-stem music generation and edition through autoregressive modeling. The 50th IEEE International Conference in Acoustic, Speech and Signal Processing (ICASSP), 2025, [PDF]. Itai Gat, Tal Remez, Neta Shaul, Felix Kreuk, Ricky T. Q. Chen, Gabriel Synnaeve, Yossi Adi, Yaron Lipman. Discrete Flow Matching. The 38th Annual Conference on Neural Information Processing Systems (NeurIPS), 2024, [PDF]. Matanel Oren*, Michael Hassid*, Yossi Adi, Roy Schwartz. Transformers are Multi-State RNNs. Conference on Empirical Methods in Natural Language Processing (EMNLP), 2024, [PDF, Code]. Michael Hassid*, Tal Remez*, Jonas Gehring, Roy Schwartz, Yossi Adi. The Larger the Better? Improved LLM Code-Generation via Budget Reallocation. The 1st Conference on Language Modeling (COLM), 2024, [PDF, Samples]. Or Tal*, Alon Ziv*, Itai Gat, Felix Kreuk, Yossi Adi. Joint Audio and Symbolic Conditioning for Temporally Controlled Text-to-Music Generation. The 25th International Society for Music Information Retrieval (ISMIR) Conference, (2024), [PDF]. Simon Rouard, Jade Copet, Yossi Adi, Axel Roebel, Alexandre Defossez. Audio Conditioning for Music Generation via Discrete Bottleneck Features. The 25th International Society for Music Information Retrieval (ISMIR) Conference, (2024), [PDF]. Shoval Messica, Yossi Adi. NAST: Noise Aware Speech Tokenization for Speech Language Models. The 25th Annual Conference of the International Speech Communication Association (Interspeech), 2024, [PDF, Code]. Xuankai Chang, Jiatong Shi, Shinji Watanabe, Yossi Adi, Xie Chen, Qin Jin. The Interspeech 2024 Challenge on Speech Processing Using Discrete Units. The 25th Annual Conference of the International Speech Communication Association (Interspeech), 2024, [PDF]. Shiran Aziz, Yossi Adi, Shmuel Peleg. Audio Enhancement from Multiple Crowdsourced Recordings: A Simple and Effective Baseline. The 25th Annual Conference of the International Speech Communication Association (Interspeech), 2024, [PDF]. Amit Roth, Arnon Turetzky, Yossi Adi. A Language Modeling Approach to Diacritic-Free Hebrew TTS. The 25th Annual Conference of the International Speech Communication Association (Interspeech), 2024, [PDF, Code]. Arnon Turetzky, Or Tal, Yael Segal-Feldman, Yehoshua Dissen, Ella Zeldes, Amit Roth, Eyal Cohen, Yosi Shrem, Bronya R. Chernyak, Olga Seleznova, Joseph Keshet, Yossi Adi. HebDB: a Weakly Supervised Dataset for Hebrew Speech Processing. The 25th Annual Conference of the International Speech Communication Association (Interspeech), 2024, [PDF, Data]. Jean-Marie Lemercier*, Simon Rouard*, Jade Copet, Yossi Adi, Alexandre Defossez. An Independence-promoting Loss for Music Generation with Language Models. The 41st International Conference on Machine Learning (ICML), 2024, [PDF]. Alon Ziv, Itai Gat, Gael Le Lan, Tal Remez, Felix Kreuk, Alexandre Defossez, Jade Copet, Gabriel Synnaeve, Yossi Adi. Masked Audio Generation using a Single Non-Autoregressive Transformer. International Conference on Learning Representations (ICLR), 2024, [PDF, Code & Samples]. Guy Yariv, Itai Gat, Sagie Benaim, Lior Wolf, Idan Schwartz*, Yossi Adi*. Diverse and Aligned Audio-to-Video Generation via Text-to-Video Model Adaptation. The Thirty-Eighth AAAI Conference on Artificial Intelligence (AAAI), 2024, [PDF, Code & Samples]. Guy Lorberbom*, Itai Gat*, Yossi Adi, Alex Schwing, Tamir Hazan. L",
  "content_length": 36041,
  "method": "requests",
  "crawl_time": "2025-12-01 14:52:47"
}