{
  "name": "Yotam I. Gingold",
  "homepage": "http://cs.gmu.edu/~ygingold",
  "status": "success",
  "content": "Yotam Gingold - Computational Reality, Creativity and Graphics Lab (CraGL) Yotam Gingold bio, cv Associate Professor Department of Computer Science George Mason University Office: FUSE 6328 Email: ygingold@gmu.edu or yotam@yotamgingold.com Phone: +1-703-993-9196 About CraGL Welcome to the Computational Reality, Creativity and Graphics Lab (CraGL) at George Mason University, led by Dr. Yotam Gingold (bio). Our mission is to solve challenging visual, geometry, and design problems and pursue foundational research into human creativity. We research and teach as part of GMU's Department of Computer Science. Our work has been supported by the generosity of the National Science Foundation (including CAREER), Adobe, and Google. Our research has been incorporated into Adobe Creative Cloud as Illustrator's Puppet Warp tool. News 2025 Xue Yu's paper Exploring Product Designs with Scaffold-Based Editing was accepted to CHI 2025. This is a collaboration with our friend Stephen DiVerdi. We held Capital Graphics 2025. We received gift money from Adobe. Thank you! Yotam Gingold will serve on the 2025 SIGGRAPH North America, Eurographics, SGP, SMI, and Expressive program committees. 2024 Jianchao Tan's paper Palette-based color harmonization was accepted to TVCG. This is a collaboration with our friend Jose Echevarria. Amrita Ganguly and Chuan Yan's paper ShadowMagic: Designing Human-AI Collaborative Support for Comic Professionals’ Shadowing was accepted to UIST 2024. This is a collaboration with our friends John Joon Young Chung, Tong Steven Sun, Yoon Kiheon, and Ray Hong. Yotam Gingold and Rana Hanocka received an NSF Medium award (Untethered3D: In-Air 3D Modeling Using Non-Visual Feedback) Chuan Yan defended his PhD dissertation. Congratulations, Dr. Yan! His next stop is a post-doc at Stanford with Maneesh Agrawala. Chuan Yan (and Yong Li)'s paper Deep Sketch Vectorization via Implicit Surface Extraction was accepted to SIGGRAPH North America 2024 and will appear in a special issue of TOG. This is a collaboration with our friends Deepali Aneja, Matthew Fisher, and Edgar Simo-Serra. Yong Li's paper I❤️MESH: A DSL for Mesh Processing was accepted to TOG and will appear at SIGGRAPH Asia 2024. This is a collaboration with our friends Shoaib Kamil, Alec Jacobson, and Keenan Crane. Yong Li defended his PhD dissertation. Congratulations, Dr. Li! We held Capital Graphics 2024. Yotam Gingold gave a talk on Color, Shape, and Thought at the Brown Visual Computing Seminar. Yotam Gingold will serve on the 2024 SIGGRAPH North America, SGP, EGSR, and SMI program committees. 2023 Joe Graus defended his PhD dissertation. Congratulations, Dr. Graus! Jialin Huang's paper ShapeSonic: Sonifying Fingertip Interactions for Non-Visual Virtual Shape Perception was accepted to SIGGRAPH Asia 2023. This is a collaboration with our friends Rana Hanocka and Alexa Siu. Yotam Gingold will serve on the Eurographics 2024 program committee. Ted Chao's paper ColorfulCurves: Palette-Aware Lightness Control and Color Editing via Sparse Optimization was accepted to SIGGRAPH North America 2023. Differentiable Heightfield Path Tracing with Accelerated Discontinuities was accepted to SIGGRAPH North America 2023. This is a collaboration with our friends Xiaochun Tong, Hsueh-Ti Derek Liu, Alec Jacobson. Image vectorization and editing via linear gradient layer decomposition was accepted to SIGGRAPH North America 2023. This is a collaboration with our friend Kun Xu's group. Ted Chao's paper LoCoPalettes: Local Control for Palette-based Image Editing was accepted to EGSR 2023. Matthew Yoon and Samantha Tone joined us for the summer. We received gift money from Adobe. Thank you! Capital Graphics 2023 was a success! Henro Kriel defended his Master's thesis on I❤️IQ: A Shader Graphing Calculator for Signed Distance Functions (SDFs). Yotam Gingold will serve on the SGP 2023 and SMI 2023 technical papers program committees. 2022 Yong Li's paper H❤️rtDown: Document Processor for Executable Linear Algebra Papers was accepted to SIGGRAPH Asia 2022. This is a collaboration with our friends Shoaib Kamil and Alec Jacobson. We held Capital Graphics 2022. Yotam Gingold became an associate editor of Computer Graphics Forum (CGF). Yotam Gingold was selected for a SIGGRAPH Member Profile. We received gift money from Adobe. Thank you! Yotam Gingold spoke at the Stanford Seminar on People, Computers, and Design. Watch the recording. Chuan Yan's paper FlatMagic: Improving Flat Colorization through AI-driven Design for Digital Comic Professionals has been conditionally accepted to CHI 2022. This is a collaboration with our friends John Joon Young Chung, Yoon Kiheon, Eytan Adar, and Ray Hong. Yotam Gingold will serve on the SIGGRAPH North America 2022, Eurographics 2022, SGP 2022, EGSR 2022, and SMI 2022 technical papers program committees. 2021 Yong Li gave a talk at the Toronto Geometry Colloquium on I❤️LA. Xue Yu gave a talk at the Toronto Geometry Colloquium on ScaffoldSketch. Yong Li's paper I❤️LA: Compilable Markdown for Linear Algebra was accepted to SIGGRAPH Asia 2021. This is a collaboration with our friends Shoaib Kamil and Alec Jacobson. Xue Yu's paper ScaffoldSketch: Accurate Industrial Design Drawing in VR was accepted to UIST 2021. This is a collaboration with our friends Stephen DiVerdi and Akshay Sharma. Ted Chao's paper PosterChild: Blend-Aware Artistic Posterization was accepted to EGSR 2021. This is a collaboration with our friend Karan Singh. Yotam Gingold moderated the ``Structures and Scenery'' session at SIGGRAPH North America 2021. Jason Klein joined our group. Our paper Video Recoloring via Spatial-Temporal Geometric Palettes was accepted to SIGGRAPH North America 2021. This is a collaboration with our friend Kun Xu's group. Songrun Liu and Jianchao Tan's paper Hyperspectral Inverse Skinning was presented at Eurographics 2021. Gabriel Thomsen joined our group. Yotam Gingold is serving on the SIGGRAPH Research Career Development Committee. Yotam Gingold's 3-year term as an Associate Editor for ACM Transactions on Graphics (TOG) came to an end. Yotam Gingold served on the program committees of SIGGRAPH North America 2021 (technical papers), SGP 2021, SMI 2021, and ICCV SHE 2021. 2020 Chuan Yan's paper A Benchmark for Rough Sketch Cleanup has been accepted to SIGGRAPH Asia 2020. This is a collaboration with our friend David Vanderhaeghe. We received gift money from Adobe. Thank you! Joe Graus's paper Interacting with Self-Similarity was accepted to the journal Computer-Aided Design. Yotam Gingold will be the moderator for the Pattern and Color (virtual) session at SIGGRAPH North America 2020. Josh Park is visiting us for the summer (virtually). Xue Yu is interning at Adobe Research (virtually). Songrun Liu and Jianchao Tan's paper Hyperspectral Inverse Skinning was accepted to Computer Graphics Forum. Yotam Gingold served on the program committees for SGP, SMI, and PG 2020. 2019 Yotam Gingold visited Virginia Tech's School of Architecture and Design. Yotam Gingold is a Visiting Professor at Adobe Research for the 2019–2020 academic year. David Vanderhaeghe and his student Filippo Fanni visited for a month. Yotam Gingold visited the University of Toronto Dynamic Graphics Project and the Fields Institute Workshop on Robust Geometric Algorithms for Computational Fabrication II. We organized Capital Graphics 2019. Dr. Jianchao Tan defended his PhD dissertation. Jianchao Tan was awarded the Computer Science department's Outstanding Graduate Student award. Yotam Gingold served on the program committees for SGP, SMI, and Expressive 2019. Yotam Gingold served on the SIGGRAPH Asia 2019 program committee. 2018 Our collaborator Jose Echevarria presented our SIGGRAPH Asia 2018 paper on Efficient palette-based decomposition and recoloring of images via RGBXY-space geometry. Dr. Songrun Liu defended his PhD dissertation. Yotam Gingold served on the Eurographics 2019 PC. Yotam Gingold became an Associate Professor. Jianchao Tan presented our TVCG paper Pigmento at Expressive. Jianchao Tan presented in the SIGGRAPH Doctoral Symposium. Yotam Gingold became an associate editor of ACM Transactions on Graphics (TOG). Yotam Gingold visited the INRIA group GraphDeco. We hosted Capital Graphics 2018. Yotam Gingold served on the SIGGRAPH 2018 PC. We received gift money from Adobe. Thank you! 2017 Zachary Ferguson presented our SIGGRAPH Asia 2017 paper Seamless: Seam erasure and seam-aware decoupling of shape from mesh resolution. Adobe added the Puppet Warp tool to Adobe Illustrator, based on our work on Skinning Vector Graphics from SIGGRAPH Asia 2014. Jianchao Tan presented our TOG paper on Decomposing Images into Layers via RGB-space Geometry at SIGGRAPH. Our collaborator Eric Yao presented our TOG paper on Interactive Design and Stability Analysis of Decorative Joinery for Furniture at SIGGRAPH. Yotam Gingold served on the SIGGRAPH 2017 PC.",
  "content_length": 8935,
  "method": "requests",
  "crawl_time": "2025-12-01 14:52:55"
}