{
  "name": "Youhei Akimoto",
  "homepage": "https://sites.google.com/site/youheiakimotospage",
  "status": "success",
  "content": "Youhei AkimotoSearch this siteEmbedded FilesSkip to main contentSkip to navigationCurriculum VitaeSee also Black-Box Optimization Lab @ University of Tsukuba for activities of our Lab and publications.ContactAffiliationProfessor at Institute of Systems and Information Engineering / Center for Artificial Intelligence Research, University of TsukubaVisiting Researcher at RIKEN Center for Advanced Intelligence ProjectVisiting Researcher at Osaka UniversityAddress1-1-1 Tennodai, Tsukuba 305-8573, JAPANE-mailakimoto [at] cs [dot] tsukuba [dot] ac [dot] jpResearch InterestsMy main research field is black-box optimization, especially in continuous domain. I am interested in stochastic search algorithms such as covariance matrix adaptation evolution strategies (CMA-ES), a probabilistic model-based derivative-free optimizer. I work on theoretical analysis of stochastic search algorithms and also on design principle for efficient algorithms in practice, and on real-world applications.BiographyYouhei Akimoto received the B.S. degree in computer science in 2007, and the M.S. and Ph.D. degrees in computational intelligence and systems science from the Tokyo Institute of Technology, Japan, in 2008 and 2011, respectively. From 2010 to 2011, he was a Research Fellow at JSPS, Japan, and from 2011 to 2013, he was a Postdoctoral Research Fellow at INRIA, France. From 2013 to 2018, he was an Assistant Professor at Shinshu University, Japan, and from 2018 to 2025, he was an Associate Professor at University of Tsukuba, Japan. Since 2025, he has been a Professor at University of Tsukuba, Japan. His research interests include the design principles, theoretical analyses, and applications of stochastic search heuristics and reinforcement learning. He won the Best Paper Award at GECCO 2018 and FOGA 2019. He is an associate editor of ACM Transactions on Evolutionary Learning and Optimization and a member of the editorial board of Evolutionary Computation. He has given many tutorials on evolution strategies, particularly CMA-ES, in GECCO.EducationMar 2004: Graduated from Waseda High SchoolApr 2004: Entered the 5th Department of Tokyo Institute of TechnologyMar 2007: Early graduation from the Department of Information Engineering, School of Engineering, Tokyo Institute of Technology, Bachelor of EngineeringApr 2007: Entered the Master's Program in the Department of Computational Intelligence and Systems Science, Interdisciplinary Graduate School of Science and Engineering, Tokyo Institute of TechnologyMar 2008: Early completion of the Master's Program in the Department of Computational Intelligence and Systems Science, Interdisciplinary Graduate School of Science and Engineering, Tokyo Institute of Technology, Master of EngineeringApr 2008: Entered the Doctoral Program in the Department of Computational Intelligence and Systems Science, Interdisciplinary Graduate School of Science and Engineering, Tokyo Institute of TechnologyMar 2011: Completed the Doctoral Program in the Department of Computational Intelligence and Systems Science, Interdisciplinary Graduate School of Science and Engineering, Tokyo Institute of Technology, Doctor of EngineeringWorkApr 2010 – Mar 2011: JSPS Research Fellow (DC2)Apr 2011 – Mar 2013: Post-Doctoral Researcher, TAO Team, INRIA-Saclay – Île-de-FranceApr 2013 – Mar 2014: Assistant Professor, Department of Electrical and Electronic Engineering, Faculty of Engineering, Shinshu UniversityApr 2014 – Mar 2018: Assistant Professor, Faculty of Engineering, Shinshu UniversityApr 2018 – Aug 2025: Associate Professor, Institute of Systems and Information Engineering, University of TsukubaFeb 2019 – Present: Visiting Researcher, RIKEN Center for Advanced Intelligence ProjectSep 2025 – Present: Professor, Institute of Systems and Information Engineering, University of TsukubaProfessional ActivitiesJournalsEvolutionary Computation (MIT Press) Editorial Borad (2019--now)ACM Transactions on Evolutionary Learning and Optimization  (ACM) Associate Editors (2019--now)Reviewer for other journals (IEEE TEVC, JMLR, TMLR, etc.)ConferencesChair for ENUM Track of GECCO (2024, 2025)Student Workshop Organizer at GECCO (2018, 2019)Chair for CO Track of GECCO (2015, 2016)PC and SPC for conferences (GECCO, NeurIPS, ICML, ICLR, PPSN, FOGA, IJCAI, AAAI, AISTATS, etc.)LinksTRIOS：https://trios.tsukuba.ac.jp/researcher/0000004102Google Scalar：https://scholar.google.com/citations?user=m7OXdsUAAAAJ&hl=enORCID：https://orcid.org/0000-0003-2760-8123Researchmap：https://researchmap.jp/7000010953Google SitesReport abuseGoogle SitesReport abuse",
  "content_length": 4587,
  "method": "requests",
  "crawl_time": "2025-12-01 14:52:48"
}