{
  "name": "Youhuan Li",
  "homepage": "http://csee.hnu.edu.cn/people/liyouhuan",
  "status": "success",
  "content": "李友焕-湖大信息科学与工程学院 教师登录 English 返回首页 学院概况 学院简介 学院领导 师资力量 机构设置 决策机构 教学单位 计算机科学系 软件工程系 通信工程系 信息工程系 计算机工程系 网络空间安全系 实验中心 基础教学部 研究机构 特色学院 条件装备 办事机构 人才培养 本科培养 研究生培养 博士生培养 留学生培养 学科专业方向 科学研究 科研项目 科研成果 成果转化 学术信息 工作流程 招生就业 本科招生 硕士招生 博士招生 学生就业 实习就业基地 学生工作 学生动态 学生党建 团学工作 日常管理 心理健康 奖励工作 社团组织 党群工作 党建工作 工会工作 关工委工作 学术资源 资源管理系统 精品课程 实验仪器设备 李友焕 我的位置在： 首页 > 学院概况 > 师资力量 > 李友焕 教师介绍 Also：https://youhuanli.github.ioORCID:0000-0002-0650-0458邮箱地址：liyouhuan@hnu.edu.cn工作单位：湖南大学信息科学与工程学院软件工程系通信地址：湖南省长沙市岳麓区麓山南路湖南大学信息科学与工程学院李友焕，副教授，博导，湖南省青年骨干教师，CCF高级会员，CCF数据库专委会、信息系统专委会执行委员，大数据专委会通讯委员。分别于2013年和2018年获北京大学理学学士学位和理学博士学位，目前研究方向为基于大模型多智能体的数据处理优化技术。2018~2020年作为腾讯与北大联合培养博士后，参与风控、反欺诈等项目，聚焦图技术的应用落地，包括图数据库、图计算和图表示学习等。2021年3月加入湖南大学信息科学与工程学院。 中文名： 李友焕 英文名： 学历： 博士 职称： 副教授 联系电话： 电子邮件： liyouhuan AT hnu.edu.cn 研究方向： 聚焦大模型数据推理加速的前沿研究，也从事一些大模型应用研究，包括基于大模型的数据管理（text2sql等）以及大模型驱动的数据分析（安全攻防等） 联系地址： 湖南省长沙市岳麓区麓山南路湖南大学信息科学与工程学院 所属机构： 软件工程系 学院教师 招生信息 有意加入团队者请发简历至 liyouhuan@hnu.edu.cn （来信必回，请避免用163、qq等易被识别为垃圾邮件的邮箱，多次在垃圾邮箱翻到过期半年的求加入邮件）团队招收2026秋季入学博士，入学后研究方向拟定在大模型推理加速(2026秋季入学硕士名额已满），校内本科生科研合作请在大二期末结束后及时联系我，合作建立后将在临近的暑假安排前期学习。联系入学名额的学生请来信附简历和本科成绩单，介绍清楚院系、排名以及编程语言能力情况。表现优秀的学生可以推荐至腾讯、阿里、华为、字节等大型企业实习、工作，以及推荐往北京大学、复旦大学、加拿大滑铁卢大学以及港中文等国内外名校交流访问。团队科研氛围浓厚，数据库方向招生注重C++的能力，大模型方向注重AI或大模型的经验，除了科研训练指导，本人也注重向学生分享我在企业的相关表达、汇报等方面经验，期待积极上进的学生加入我的团队。本人喜欢科研并乐于培养和指导学生，我在学术界和工业界均有丰富经历。目前三位21级、22级硕士生在其研一暑假时均在我推荐下获实习（两位入选腾讯精英人才计划，全国<50)，分别在国内知名研究机构、腾讯深圳、腾讯北京实习3~6月。科研合作的三位本科生分别在我推荐下获北大（23届）、复旦（24届）和北航（25届）录取。（另：本科生科研合作优先考虑有数据库基础的或熟悉后台开发的学生） 研究兴趣 目前聚焦的方向：大模型推理加速和Text2SQL大模型的兴起对应用产生巨大变革作用，本团队一方面在研究LLM在效果和效率方面的提升方法（大模型推理加速），也同时在LLM应用层面考虑相关问题的提升方法（Text2SQL）。另外，在博士期间以及入职高校前几年聚焦在图查询优化方面，后续仍会有一部分精力在深化这方面的研究，尤其是图数据管理在大模型应用方面的促进作用等。(ORCID: 0000-0002-0650-0458)Youhuan Li received his B.S. degree (2013) and Ph.D degree (2018)  in Peking University. He worked as a postdoc in Tencent and Peking University (2018~2020). He joined Hunan University as an associate professor at March 2021, his research interests include  LLM （reasoning） acceleration and LLM-based application technology.----E-mail:liyouhuan@hnu.edu.cnInstitution:Department of Software Engineering, College of ComputerScience and Electronic Engineering, Hunan UniversityPostal address: College of ComputerScience and Electronic Engineering, Hunan University, Yuelu Dist., Changsha, China 部分学术论文（Selected publications） Full list are available on DBLP.Ziming Li, Youhuan Li*, Yuyu Luo, Guoliang Li, Chuxu Zhang. Graph Neural Networks for Databases: A Survey. IJCAI 2025 (CCF A).Ziming Li, Yuequn Dou, Youhuan Li*, Xinhuan Chen, Chuxu Zhang. RSM: Reinforced Subgraph Matching Framework with Fine-grained Operation based Search Plan. WSDM 2025 (CCF B).Zhichao Shi, Youhuan Li*, Ziming Li, Yuequn Dou, Xionghu Zhong, Lei Zou. MatCo: Computing Match Cover of Subgraph Query over Graph Data. SIGMOD 2025 (CCF A)Ziming Li, Youhuan Li*, Xinhuan Chen, Lei Zou, Yang Li, Xiaofeng Yang, Hongbo Jiang. NewSP: A New Search Process for Continuous Subgraph Matching over Dynamic Graphs. ICDE 2024 (CCF A).Chuchu Gao, Youhuan Li*, Zhibang Yang, Xu Zhou. CSM-TopK: Continuous Subgraph Matching with TopK Density Constraints. ICDE 2024 (CCF A).Hangyu Zheng, Youhuan Li*, Fang Xiong, Xiaosen Li, Lei Zou, Peifan Shi, Zheng Qin. Vertex Encoding for Edge Nonexistence Determination with SIMD Acceleration. TKDE 2024 (CCF A).Youhuan Li, Hangyu Zheng, Lei Zou, Xiaosen Li, Ziming Li, Pin Xiao, Yangyu Tao, Zheng Qin. VEND: Vertex Encoding for Edge Nonexistence Determination. ICDE 2023 (CCF A).Youhuan Li, Lei Zou, M Tamer Ozsu, Dongyan Zhao. Space-Efficient Subgraph Search over Streaming Graph with Timing Order Constraint. TKDE 2022 （CCF A).Youhuan Li, Lei Zou, M Tamer Ozsu, Dongyan Zhao. Time constrained continuous subgraph search over streaming graphs. ICDE 2019 (CCF A) .Youhuan Li, Lei Zou, Huaming Zhang, Dongyan Zhao. Longest Increasing Subsequence Computation over Streaming Sequences. TKDE 2017 (CCF A) .Youhuan Li, Lei Zou, Huaming Zhang, Dongyan Zhao. Computing Longest Increasing Subsequence Over Sequential Data Streams. VLDB 2016  (CCF A) . 团队项目 （1）大模型相关项目2025-08~2026-08: “知识增强的 Text2SOL技术研究:语义理解与逻辑推理的融合” CCF蚂蚁科研基金项目（主持，30w）2025-11~2027-11： “基于大模型多智能体框架的数据模式生成”国家级实验室开放基金（主持, 20w）2025-11~2027-11： “基于大模型多智能体框架的数据平台故障检测”国家级实验室开放基金（主持, 30w）2024-12~2025-12： “基于大模型多智能体框架的渗透技术研发”横向（主持, 70w）2024-07~2025-04： “基于大模型结合订单需求文档自动生成生产配套通知单” 横向 （主持, 6w）（2）图计算/数据库相关项目2025-01~2028-12： “动态图上的结构化子图模式监控算法研究” 国家自然科学基金面上项目（主持, 50w，62472154）2024-10~2025~12： “基于TuGraph的图计算课程建设”教育部协同育人项目（主持，10w）2022-11~2025-07： “分布式图数据库研发” 中央部委预研项目（课题负责人，180w/700w）2022-01~2024-12：“图数据流的关联查询处理研究” 国家自然科学基金青年科学基金项目（主持, 30w，62102142）2022-01~2024-12：“动态图场景的子图模式匹配研究” 湖南省自然科学基金青年科学基金项目（主持, 5w，2022JJ40093）2021-03~2029-03： “图数据流的查询管理” 中央高校基本科研业务费（主持，50w） 专利 李友焕; 邹磊;  子图查询方法, 2020-08-07, 中国, ZL201711375508.X.李友焕；郑航宇；秦拯；图结构的查询方法、装置及存储介质，2024-06-25， 中国，ZL202210348471.6李友焕；石沛凡；袁知秋；分布式知识图谱的查询方法、装置及存储介质，2024-12-06，ZL202111440843.X李友焕；李梓铭；石沛凡；秦拯；基于磁盘的数据图中三角形个数确定方法及相关设备，202310553332.1李友焕；李梓铭；郑航宇；秦拯；子图模式监控方法、装置、设备及存储介质，202310353888.6陈信欢; 李友焕; 胡雨松; 陈守志; 一种基于关系网络的社区特征确定方法和相关装置, 2020-10-22, 中国, 2020111396563. 湖大官网 湖大微信 湖大微博 版权所有©湖南大学2017          湖南大学党委宣传部          地址：湖南省长沙市岳麓区麓山南路麓山门          邮编：410082          Email：xiaoban@hnu.edu.cn          域名备案信息：[www.hnu.edu.cn,www.hnu.cn/湘ICP备05000239号]          [hnu.cn 湘教QS3-200503-000481 hnu.edu.cn 湘教QS4-201312-010059]",
  "content_length": 5318,
  "method": "requests",
  "crawl_time": "2025-12-01 14:52:48"
}