{
  "name": "Youki Kadobayashi",
  "homepage": "https://iplab.naist.jp/members/youki",
  "status": "success",
  "content": "Youki Kadobayashi, Ph.D. | IPLab — Laboratory for Cyber Resilience, NAIST [ English / Japanese ] Youki Kadobayashi, Ph.D. Youki Kadobayashi, Ph.D. Professor, NAIST ICT infrastructure is continually evolving, yet its most interesting and important part is disappearing from our sight. For younger generations, Internet has been there when they were born. Building part of the Internet which was daily business for us, is fast becoming privilege. Today, significant number of people are involved in keeping their system running -- just running -- sometimes without sound understanding of its internal workings. Learning from failure and recovery was a norm in the good old days, but it comes with extra cost in todayâs infrastructure. Above discussion illuminates my recent interest: 1) broader participation to Internet co-creation, and 2) infrastructures for learning from failure and recovery. I have been working with a number of colleagues, both industry and academic, to create technologies, testbeds, datasets, as well as social incentive structures in this regard. Detail Profile Degree Osaka University Major Computer Science Birthday March 1969 My Lectures Our Labâs Lecture Page Research interests Internet engineering Web security Cybersecurity education Cybersecurity standards Publications My DBLP Our Labâs Publications Page Membership ACM IEEE ComSoc IEICE IPSJ WIDE Competitions CDMC Hardening Zero Open Router Competition Consortia and industry fora www.wide.ad.jp www.interop.jp www.wasforum.jp Contact Detail Laboratory for Cyber ResilienceInformation Science DivisionGraduate School of Science and TechnologyNara Institute of Science and Technology 3rd Floor, Building A8916-5 Takayama, Ikoma,\tNara 630-0192, Japan Phone: +81-743-72-5216 (Students Room) Fax: +81-743-72-5219 Email: iplab-webis.naist.jp © 2021 Laboratory for Cyber Resilience",
  "content_length": 1866,
  "method": "requests",
  "crawl_time": "2025-12-01 14:52:50"
}