{
  "name": "Youmin Chen",
  "homepage": "https://chenyoumin1993.github.io",
  "status": "success",
  "content": "Youmin Chen's Homepage Youmin Chen Tenure-track Associate Professor Department of Computer Sciences, SJTU Email: chenyoumin at sjtu edu cn, chenym at cs sjtu edu cn Office: SEIEE Building 3-524 CV / Google Scholar / DPLP About Me I am a tenure-track associate professor at the Department of Computer Science and Engineering, Shanghai Jiao Tong University (SJTU). I am also a member of the Data Driven Software Technology (DDST) Lab. I build fast and robust next-gen data and storage systems. My work has appeared at top systems venues such as SOSP, FAST, ASPLOS, Eurosys, USENIX ATC, SIGMOD, VLDB, etc. My current research interests lie at the intersection of storage systems and the following three disciplines: Storage × OS: New abstractions at the OS level with enhanced flexibility, programmability, and schedulability. Storage × H/W: New systems with faster interactions between emerging hardware and storage software. Storage × AI: New applications (e.g., large language models) through algorithm–storage co-design. I received my Ph.D. degree in Computer Science from Tsinghua University, advised by (Jiwu Shu and Youyou Lu), and Bachelor’s degree from Honors College (formerly School of Advanced Engineering), at Beihang University. From 2021 to 2024, I was a postdoctoral researcher at Tsinghua University. Earlier, from 2019 to 2020, I was a visiting scholar in the ADSL lab at the University of Wisconsin–Madison, working with Professors Remzi Arpaci-Dusseau and Andrea Arpaci-Dusseau. I am currently seeking PhD/Master/undergrad students to work on storage systems, operating systems, and interactions between AI and systems. If you are interested, please refer to the details and don't hesitate to reach out via email. NEWS!!! 招收2027年入学的硕/博士生，如果你对存储系统、操作系统、大模型训推系统等相关领域感兴趣，欢迎与我联系，详情请参考链接。 长期有效：欢迎本校大二/大三本科生加入课题组开展系统方向的科研工作，方式包括但不限于PRP项目、毕业设计等。 News Nov, 2025, One paper has been accepted to PPoPP'26. Sept, 2025, Won the ACM SIGOPS ChinaSys Rising Star Award. Sept, 2025, One paper has been accepted to NeurIPS'25. Sept, 2025, Invited to serve in the TPC for EuroSys 2026. Aug, 2025, One paper has been accepted to Trans. on Computers. July, 2025, Our paper (μTPS) has been accepted to SOSP'25. April, 2025, Our paper (crash consistency test of Open CAS) has been accepted to USENIX ATC'25. Nov, 2024, Invited to serve in the TPC for USENIX ATC 2025.",
  "content_length": 2362,
  "method": "requests",
  "crawl_time": "2025-12-01 14:52:50"
}