{
  "name": "Young-Kyoon Suh",
  "homepage": "https://sites.google.com/view/yksuh",
  "status": "success",
  "content": "BiographySearch this siteEmbedded FilesSkip to main contentSkip to navigationYoung-Kyoon Suh, Ph.D., is an Associate Professor in the School of Computer Science and Engineering at Kyungpook National University (KNU), Daegu, Korea. He is also a Vice Manager of the BK FOUR Intelligence Convergence Software Education Research Group in the same school. He served as the Director of the Center for Gifted Education at Kyungpook National University. He is currently leading Big Data & AI Convergence (DAC) Lab. He holds a Ph.D. degree (Advisor: Prof. Richard T. Snodgrass) in Computer Science from the University of Arizona, USA. Phone: +82-53-950-6372 Email: yksuh at knu dot ac dot kr Office: Rm. 520, IT-5 (Bldg. #415), Kyungpook National University, Daegu, 41566 Republic of KoreaResearch InterestsDatabases, Big Data, Data Science, Data Mining, Machine Learning, Deep Learning, Storage Systems, Performance EvaluationEducationPh.D., Department of Computer Science, the University of Arizona, USA (2015)M.S., School of Computing, KAIST, Korea (2005)B.S., School of Computer Science & Engineering, Kyungpook National University, Korea (2003)PublicationsRefer to my lab website (google scholar).AwardsBest Paper Awards: KSC'21 (Outstanding Journal by the Computer System Society of KIISE), KSC'20 (Outstanding Paper), KDBC'20 (Bronze Prize), KDBC'19 (Silver Prize), BigDas'17, and EDB'16.Best Poster Award at ACM/IEEE CCGrid'16.Service Award by National Research Foundation of Korea, 2016.Travel Grant Award at the University of Arizona, 2012.Professional/Work ExperienceVice General Manager, the BK FOUR Intelligence Convergence Software Education Research Group, School of Computer Science & Engineering, Kyungpook National University (2023.02 - current).Associate Professor, School of Computer Science & Engineering, Kyungpook National University (2022.10 - current).Department Chair, Information Science Department (Graduate), Kyungpook National University (2022.2 - current).Director, Institute of IT-Gifted Youth, Kyungpook National University (2020.11- 2021.10).Vice Department Chair (Chair in Data Science Division), School of Computer Science & Engineering, Kyungpook National University (2019.2 - 2022.1).Assistant Professor, School of Computer Science & Engineering, Kyungpook National University (2017.9 - 2022. 9).Senior Researcher, Korea Institute of Science and Technology Information, Daejeon, Republic of Korea (2005 - 2017).Research Associate, Department of Computer Science, University of Arizona, Tucson, AZ, USA (2010 - 2015). Teaching Assistant, Department of Computer Science, University of Arizona, Tucson, AZ, USA (2008 - 2010).Software Engineering Intern, Teradata Corporation, El Segundo, CA, USA (2011.5 - 2011.08 / 2012.1-2012.8). Professional Academic Services Program Committee ICWS 2022 ICWS 2021 ICWS 2020 ICWS 2019 Organizing Committee IEEE MDM 2017 (Local Organizing Co-Chair)KDBC 2022, 2021, 2020, 2019External ReviewerApplied Sciences 2021, 2020Cluster Computing 2021, 2020The Journal of Supercomputing (SUPE) 2020, 2019Entropy 2020 IEEE Access 2020 Journal of Information Processing Systems (JIPS) 2021, 2019SIGMOD 2010ICDE 2011ER 2011Editorship Sustainability 2020-2021 (Special Issue Editor)Professional Memberships  Lifetime member, KIISE - Korea Database SocietyMember, IEEEProfessional Member, ACMMember, IEICEMember, Sigma XIMember, KIISEMember, KIPSMember, KSIIThesis Defense Committee ServicesDoctoral Dissertation Defense Committee  [D1] Laith Baniata, \"A Neural Machine Translation Model for Arabic Dialects That Utilizes Multitask Learning,\" supervised by Prof. Seyoung Park, Kyungpook National University, Spring 2019.Master's Thesis Defense Committee[M21-DEAL_LAB-9] Youngeun Chae (채영은), \"A Deep Reinforcement Learning Model for HVAC Control in an IoT Environment,\" supervised by me, Kyungpook National University, Fall  2022.[M20-DEAL_LAB-8] Junyoung An (안준영), \"An Analysis of Query Evaluation Performance across Multiple GPU DBMSes,\" supervised by me, Kyungpook National University, Spring 2022.[M19-DEAL_LAB-7] Daewoong Seo (서대웅), \"Electrocardiogram-based Sleep Apnea Severity Estimation Neural Network Technique,\" supervised by me, Kyungpook National University, Spring 2022.[M18-DEAL_LAB-6] Jaeseong Kim (김재성), \"Machine Learning Framework for Indoor Environment Forecasting,\" supervised by me, Kyungpook National University, Spring 2022.[M17-INFO_SCI-1] Seong Hyun Kim(김승현), \"정보통신 산업의 지역별 고용 변화 요인 탐색,\" supervised by me, Kyungpook National University, Fall  2021.[M16-DEAL_LAB-5] Karina Karapetian, \"A Transfer Learning Based Scheme for Drug-Suicidal Event Relation Extraction,\" supervised by me, Kyungpook National University, Fall  2021.[M15] Yoon-Chang Chae(채윤창), \"서비스 워크로드에 대한 시스템 콜 시퀀스 패턴 추출 방법\" supervised by Prof. Byungchul Tak, Kyungpook National University, Fall 2021.[M14] Minje Choi(최민제), \"A3C 기반의 적응형 비디오 스트리밍 시스템,\" supervised by Prof. Kyungshik Lim, Kyungpook National University, Spring 2021.[M13]  Hyung In Choi(최형인), \"AI Hub 한영 번역 데이터를 활용한 기계번역 성능 향상을 위한 연구,\" supervised by Prof. Seyoung Park, Kyungpook National University, Spring 2021.[M12-DEAL_LAB-4] Seo-Young Kim (김서영), \"심전도 신호를 이용한 기계 학습 기반 수면무호흡 탐지 방법,\" supervised by me, Kyungpook National University, Spring 2021.[M11-DEAL_LAB-3] Hawon Choo (추하원), \"시공간 IoT 데이터에 대한 트라인 기반 색인 방법,\" supervised by me, Kyungpook National University, Spring 2021.[M10] Seongwook Jung, supervised by Prof. Kyungshik Lim, Kyungpook National University, Fall 2020.[M9-DEAL_LAB-2] Joo-Young Lee (이주영), \"군집 기반 뉴스 기사 관리 방법,\" supervised by me, Kyungpook National University, Fall 2020.[M8-DEAL_LAB-1] Seounghyeon Kim (김성현), \"군집 기반 시뮬레이션 시간 추정 방법\" supervised by me, Kyungpook National University, Spring 2020.[M7] Yongmin Shin, \"Learning Multi-document Summarization Model through Transfer Learning from Single Document Summarization Model\" supervised by Prof. Seyoung Park, Kyungpook National University, Spring 2020.[M6] Soyong Kim, \"Service framework for Internet of Things based on Visible Light Communication,\" supervised by Prof. Seok-Joo Koh, Kyungpook National University, Fall 2019.[M5] Wooyong Choi, \"Surface-level Neutralization and Word Prediction Approaches for Language Style Transfer,\" supervised by Prof. Seyoung Park, Kyungpook National University, Fall 2019.[M4] Ian Jung, \"Timeline-based News Stream Summarization Applying Sentence Abstraction,\" supervised by Prof. Seyoung Park, Kyungpook National University, Spring 2019.[M3] Hojae Son, \"Country Interest Analysis based on Long-term Short-term Memory(LSTM),\" supervised by Prof. Anand Paul, Kyungpook National University, Fall 2018. [M2] Tae-Hyeong Kim, \"Modeling Natural Korean Conversation Using Noise Injection,\" supervised by Prof. Seyoung Park, Kyungpook National University, Fall 2018. [M1] Minwoo Jung, \"Design and Implementation of Device Control Protocol for In-Vehicle Infotainment Services,\" supervised by Prof. Seok-Joo Koh, Kyungpook National University, Fall 2018. Invited Talks\"인공지능을 활용한 스마트 HPC 시뮬레이션 서비스,\" 2021년 한국계산과학공학회 춘계학술대회, 2021.04.\"Smart Simulation Service Using Machine Learning,\" IT21 Global Conference, KIPS, 2019.06.\"Science of Databases,\" POSTECH, 2018.02. \"A Simulation-Provenance Service System,\" Korea Software Conference (winter), 2017.12. Active Projects\"에어컨 맞춤 운전 서비스를 위한 고객 별 사용 패턴 분류 알고리즘 개발\" (LG전자 산학과제: 2022.5 ~ 2023.4) (co-PI)\"에너지 효율을 고려한 복수의압축 공기 컴프레서 제어 플랫폼 개발\" (DSME 전자 산학과제: 2022.4 ~ 2022.12) (PI)\"스토리지 증강을 위한 컨테이너 기반 가상화 기술 연구\" (ETRI 위탁과제: 2022.4 ~ 2022.11) (PI)\"고성능 시공간 데이터 관리 및 지능 엔진 기술 연구\" (NRF 지역대학우수과학자지원사업: 2021.6 ~ 2025. 5.31) (PI)\"거주 환경 내 단말 간 자율군집을 위한 계산 기술 개발\" (NRF 대학중점연구소: 2018.7 ~ 2027.5) (공동연구원)  \"SW중심대학 2단계 사업\" (IITP: 2021.4 ~ 2026.3) (참여교수)\"BK21+ 4단계 (BKFOUR) 지능융합 소프트웨어 교육연구단\" (NRF: 2020.9 ~ 2027.8) (참여교수)  Past Projects\"어떤 주제에 대한 빅데이터를 요약하는 보고서 생성 기술 개발\" (IITP 창의씨앗과제: 2018.01 ~ 2021.12) (공동연구원) \"실디바이스 가상화 플랫폼 연동 데이터 관리 모델 연구\" (ETRI 위탁과제: 2021.06 ~ 2021.11) (PI)\"에너지 절감(전기 사용량)을 위한 건조중인 화물창의 최적 환경 제어 모델 연구\" (DSME 산학과제: 2021.03 ~ 2021.08) (공동연구원)\"다중 데이터-집약형 시스템에 대한 실증 연구 지원 통합 프레임워크\" (NRF 신진연구자지원사업: 2018.03 ~ 2021.02) (연구책임자) \"이종 시공간 사물데이터 검색 및 요약 데이터 생성 기술 개발\" (KISTI 위탁연구: 2020.03 ~ 2020.10) (연구책임자)\"BK21 Smart Life 실현을 위한 SW인력양성 사업단\" (NRF BK21+사업: 2017.09 ~ 2020.08) (공동연구원)  \"SW중심대학\" (IITP: 2017.09 ~ 2020.12) (공동연구원) \"비즈니스 의사 결정을 위한 빅데이터 분석 시스템 연구\" (크레텍책임 산학과제: 2018.10 - 2019.03) (연구책임자) \"효율적인 고성능 시뮬레이션을 위한 시뮬레이션 이력 관리 프레임워크\" (경북대학교 신임교원정착연구과제: 2017.09 ~ 2018.08) (연구책임자)MiscellaneousMy DBLP & Google Scholar CS Rankings How to Read a Paper  by S. Keshav at U of Waterloo How to Write a Great Research Paper by Simon Peyton Jones at MSR Cambridge Writing Research Papers by David R. Caprette at Rice U Writing Technical Articles by Henning Schulzrinne at Columbia U How to Write an Abstract provided by Philip KoopmanTips for Writing Technical Papers provided by Jennifer WidomTips for a Good Conference Talk provided by Jennifer WidomHow to read, write and present papersHow to Be a Good Graduate Student How to Write a Good Paper and How to Give a Good Talk by Liang Huang at CUNY How to Give a Good Research Talk by Stephanie Weirich at UPenn How to (Not) Present a Paper by Anders Møller at Aarhus U Advice on Research and Writing Advice for researchers and student by Michael Ernst at U of Washington  내가 대학원에 들어왔을 때 알았더라면 좋았을 연구 노하우 (UST 대학원 신입생 OT 강연) by Yoon Sup Choi, Director / Founder at Digital Healthcare Institute CS Research Topic Generator Google SitesReport abuseGoogle SitesReport abuse",
  "content_length": 9449,
  "method": "requests",
  "crawl_time": "2025-12-01 14:52:55"
}