{
  "name": "Youngchul Sung",
  "homepage": "https://sites.google.com/view/youngchulsung",
  "status": "success",
  "content": "Youngchul SungSearch this siteEmbedded FilesSkip to main contentSkip to navigationYoungchul SungProfessorSchool of Electrical Engineering, KAISTJoint affiliation with Graduate School of AI at KAIST291 Daehakro, Yuseonggu, Daejeon, 34141Republic of KoreaTel     +82-42-350-3484Fax    +82-42-350-3410Email   ycsung at kaist.ac.krCurriculum VitaeGoogle ScholarDBLPResearch GroupBiographyYoungchul Sung received B.S. and M.S. degrees in Electronics Engineering from Seoul National University, Seoul, Korea in 1993 and 1995, respectively. After working at LG Information and Communications, Ltd. (now merged with LG Electronics) as a research engineer from 1995 to 2000, he joined the Ph.D. program in School of Electrical and Computer Engineering, Cornell University, Ithaca, NY, USA and received Ph.D. degree in Electrical and Computer Engineering with Applied Mathematics as minor in 2005. From 2005 until 2007, he was a senior engineer in the Corporate R & D Center of Qualcomm, Inc., San Diego, CA, USA and participated in design of Qualcomm’s 3GPP R6 WCDMA base station modem. Since 2007 he has been on the faculty of the School of Electrical Engineering in KAIST, Daejeon, South Korea. Dr. Sung’s research interests include wireless communications, statistical signal processing and reinforcement learning with applications to communication, control and related areas. Dr. Sung is currently Vice Director of IEEE Communications Society, Asia-Pacific Board, Voting Member of IEEE Communications Society, Member Services Board, and Executive Editor of ICT Express. He served as Associate Editor of IEEE Transactions on Signal Processing from 2017 to 2021 and an Associate Editor of IEEE Signal Processing Letters from 2012 to 2014. Dr. Sung served as various positions in many technical committees including TPC Co-Chair of Communication Theory Symposium of ICC 2022, TPC Track Chair of IEEE VTC 2014, and Publicity Chair (Asia-Pacific) of IEEE Globecom 2012.Education2000.08 ~ 2005.05, Ph.D. Electrical and Computer Engineering, Cornell University, Ithaca, NY, USA (Advisor: Prof. Lang Tong)1993.03 ~ 1995.02, M.S. Electronics Engineering, Seoul National University (Advisor: Prof. Sangwook Nam)1989.03 ~ 1993.02, B.S. Electronics Engineering, Seoul National UniversityEmployment2018.09 ~ Present, Professor, School of Electrical Engineering, KAIST2010.03 ~ 2018.08, Associate Professor, School of Electrical Engineering, KAIST2007.02 ~ 2010.02, Assistant Professor, School of Electrical Engineering, KAIST2018.01 ~ 2018.12, Visiting Associate Researcher, Electrical Engineering and Computer Science, UC Irvine, CA, USA (Host: Prof. Hamid Jafarkhani)2012.08 ~ 2013.07, Visiting Scientist, The Research Laboratory of Electronics (RLE), MIT, MA, USA (Host: Prof. Lizhong Zheng)2005.10 ~ 2007.01, Senior Engineer, Corporate R & D Center, Qualcomm Inc., San Diego, CA, USA 2005.06 ~ 2005.09, Post-doctoral Associate, Electrical and Computer Engineering, Cornell University, Ithaca, NY, USA1995.01 ~ 2000.06, Senior Research Engineer, LG Information and Communications, Ltd. (now merged with LG Electronics)Research History and Interests2007~Present:  Reinforcement Learning, Statistical Signal Processing and Wireless Communication at KAIST2005~2007:  Wideband CDMA at Qualcomm, Inc., San Diego, CA, USA2000~2005 : Statistical Signal Processing at Cornell University, Ithaca, NY, USA1995 ~ 2000: Code-Division Multiple Access (CDMA) at LG Information and Communications, Ltd.Professional Activities and ServicesSenior Member of IEEE, IEEE Communication Society, IEEE Signal Processing Society, IEEE Information Theory SocietyTechnical  Activities IEEE Communications Society, Asia Pacific Board (APB)  Vice Director,  Jan. 2020 - Dec. 2021,  Jan. 2022 - Dec. 2023,  Jan. 2024 - Present (3 Consecutive Terms)Chair, Chapters Coordination Committee (CCC), Jan. 2018 - Dec. 2019Chair, Membership Development Committee (MDC), Jan. 2016 - Dec. 2017Vice Chair, Information Services Committee (ISC), Jan. 2014 - Dec. 2015Vice Chair, Meeting and Conference Committee (MCC), Jan. 2012 - Dec. 2013Member, IEEE Communications Society, Member Services Board, Jan. 2022 - Dec. 2023, Jan.2024 - Dec. 2025 (Two Terms)Member, IEEE Communications Society, Signal Processing and Communications Electronics (SPCE) TC, Jan. 2014 - PresentMember, Asia-Pacific Signal and Information Processing Association (APSIPA), Signal and Information Processing Theory and Methods (SIPTM) TC, Jan. 2010 - Dec. 2018Associate member, IEEE Signal Processing Society (IEEE SPS), Signal Processing for Communications (SPCOM) TC, Jan. 2010- Dec. 2012TPC Co-Chair, Communication Theory Symposium, IEEE International Conference on Communication (ICC) 2022Organizaing Committee Member (Finance), The 1st IEEE ITSOC East-Asia Summer School of Information Theory (EASIT), 2021TPC Track Chair, IEEE VTC 2014Publicity Chair (Asia-Pacific), IEEE Global Communications Conference (Globecom) 2012Area Chair, ICML 2025, NeurIPS 2025, NeurIPS24.  For more technical activities, please see Curriculum Vitae.  Editorial ServicesInformation & Communications Technology Express (ICT Express) Executive Editor, Sep. 2021 ~ PresentEditor, 2014 ~ 2019 Associate Editor, IEEE Transaction on Signal Processing, Sep. 2017 ~Sep.2019,  Sep.2019~ Sep. 2021 (Two Terms)Associate Editor, IEEE Signal Processing Letters, Jan. 2012 ~ Jan. 2014 Lead Guest Editor, ICT Express, Special Issue on Artificial Intelligence and Machine Learning Approaches to Communication, 2021 ~ 2022Guest Editor of the 2012 IEEE JSAC Special Issue on Theories and Methods for Advanced Wireless Relays  Korean Activities and ServicesKorean Institute of Communications and Information Sciences (KICS)Elected Trustee (2014 - Present )Executive Director, International Affairs, KICS (2018,2017, 2016, 2015), Director, Domestic Journal, KICS (2014)Chair (2015), Vice Chair (2014), Secretary (2013, 2012, 2011), Member (2008 - Present), Coding and Information Theory Technical Committee, KICSMember, Mobile Communication Technical Committee, KICS (2009 - Present)Member, Military Communication Technical Committee, KICS (2008 - Present)Honors and Awards2020.02, Samsung Humantech Paper Award (Silver) Co-authored with W.  Jung et al.2019.02, Samsung Humantech Paper Award Co-authored with W. Kim et al.2018.08, Championship, The 1st AI Soccer Worldcup with Students W. Kim et al.2018.03, Championship, The 1st KAIST Intramural AI Soccer Competition with Students W. Kim et al.2017.12, Second Prize, The 1st AI Soccer Korean Cup with Students W. Kim et al.2015.01, Samsung Humantech Paper Award (Two Bronzes) Co-authored with J. Seo and G. Lee 2014.11, Distinguished Service Award, Korean Institute of Communications and Information Sciences (KICS)2013.02, Samsung Humantech Paper Award (Silver) Co-authored with Juho Park 2011.02, Samsung Humantech Paper Award (Bronze) Co-authored with Heejung Yu 2010.05, 한중일 정상회담 동반 제 1 회 한중일 청년과학자 워크샵, 대한민국 젊은 IT 과학자 대표 (교육과학기술부 KISTEP 선정) 2010.04, JCCI 2010 Best Paper Award Co-authored with Juho Park 2005.05, ICASSP 2005 Best Paper Award  PublicationsBy Research TopicJournal PublicationsConference PublicationsBook ChaptersSelected ProjectsParticipation in National AI Research Lab. (PI: KeeEung Kim, IITP, 2024.09 ~ Present)Development of Core Technologies for Target-Oriented Reinforcement Learning for Commercialization of Autonomous Drones (IITP, 2022.04 ~Present)Development of Artificial Intelligence Technology for Self-Improving Competency-Aware Learning Capabilities (IITP, 2022.04 ~ Present)Information Theory-Based Reinforcement Learning for Generalized Environments (NRF, 2021.03 ~ 2025.02) Research on Information Geometry-Based Performance Enhancement for Policy-Based Reinforcement Learning with Large Action Spaces (NRF, 2017.09 ~ 2021.08)Develoment of Disaster Response Algorithm through Internet Big Data Analysis Based on Artificial Intelligence (NRF, 2019.09 ~ 2022.08)TeachingEE827 Information Geometry, Fall 2019, Fall 2013EE807/MATH501 Real Analysis, Spring 2015EE629 Mobile Communication, Fall 2015EE623 Information Theory, Fall 2011, Fall 2010EE622 Detection and Estimation, Fall 2017, Fall 2014EE619 Mathematical Foundations of Reinforcement Learning, Spring 2023, Spring 2022, Spring 2021EE522 Advanced Communication Systems, Fall 2009, Fall 2008, Fall 2007EE421 Communication Systems, Spring 2016, Spring 2009, Spring 2008, Spring 2007EE321 Communication Engineering, Fall 2020, Spring 2020, Spring 2019, Spring 2015 EE305 Introduction to Electronic Design Lab., Spring 2017, Fall 2016EE214 Machine Learning Basics and Practices, Fall 2023EE210 Probability and Random Processes, Fall 2022, Fall 2021EE202 Signals and Systems, Spring 2014, Spring 2012, Spring 2011, Spring 2010  Google SitesReport abuseGoogle SitesReport abuse",
  "content_length": 8797,
  "method": "requests",
  "crawl_time": "2025-12-01 14:52:59"
}