{
  "name": "Youngwoon Lee",
  "homepage": "https://youngwoon.github.io",
  "status": "success",
  "content": "RLLAB @ Yonsei Welcome to the Yonsei RLLAB! We develop learning algorithms that enable machines to master complex real-world tasks, especially with robots. Our research spans reinforcement learning, imitation learning, generative modeling, and their applications in robotics. Join us! News [Oct, 2025] Youngwoon won 2025 Okawa Foundation Research Grant [Aug, 2025] Two papers were accepted to CoRL 2025 [Jul, 2025] We won two 5-year grants ($150k and $100k per year) on humanoid AI [Apr, 2025] Youngwoon will be giving a talk at RSS 2025 workshop on Robot Evaluation for the Real World [Mar, 2025] Kwanyoung will join UC Berkeley as a PhD student working with Prof. Sergey Levine and Prof. Pieter Abbeel [Mar, 2025] We are co-organizing the workshop on Whole-body Control and Bimanual Manipulation at RSS 2025 [Mar, 2025] We collaborate with Microsoft Research on robot foundation models ($70k) [Mar, 2025] Hokyun will start a 6-month research internship at Microsoft Research Asia [Feb, 2025] Youngwoon serves as an area chair for NeurIPS 2025 [Jan, 2025] One paper was accepted to ICLR 2025 [Dec, 2024] Yonsei AI department won the Brain Korea 21 (BK21) grant ($60k+ per year for each lab) [Nov, 2024] Youngwoon will be giving a talk at CoRL 2024 workshop on Learning Robotic Assembly of Industrial and Everyday Objects [Oct, 2024] Journal extension of FurnitureBench was accepted to IJRR [Sep, 2024] Youngwoon serves as an associate editor for ICRA 2025 [Sep, 2024] One paper was accepted to CoRL 2024 [Aug, 2024] We won two 5-year grants ($100k per year), Global AI Frontier Lab and AI Research Center [Aug, 2024] We are co-organizing the workshop on Whole-body Control and Bimanual Manipulation at CoRL 2024 [Jun, 2024] One paper was accepted to IROS 2024 [May, 2024] Open X-Embodiment Datasets and RT-X won the IEEE ICRA Best Conference Paper Award [May, 2024] Two papers (HumanoidBench and DROID) were accepted to RSS 2024 [Apr, 2024] We won the NRF Outstanding Young Scientist grant ($200k for 5 years) [Mar, 2024] Youngwoon serves as an area chair for NeurIPS 2024 [Mar, 2024] We released DROID, a large-scale robotic dataset [Mar, 2024] We released HumanoidBench, a simulated humanoid robot benchmark [Jan, 2024] One paper was accepted to ICRA 2024 [Jan, 2024] One paper was accepted to ICLR 2024 [Jan, 2024] Youngwoon joined Yonsei University as an assistant professor in AI",
  "content_length": 2385,
  "method": "requests",
  "crawl_time": "2025-12-01 14:53:01"
}