{
  "name": "Young-ri Choi",
  "homepage": "http://ychoi.unist.ac.kr",
  "status": "success",
  "content": "Young-ri Choi, UNISTSearch this siteEmbedded FilesSkip to main contentSkip to navigationProfessorSystem Software Laboratory Department of Computer Science and Engineering UNISTContact InfoEmail: ychoi (_a_t_) unist.ac.kr Office: Engineering BLDG 3 (BLDG 106). Rm. 601-7We are actively looking for excellent graduate students for research positions and undergraduate students for internships. Please contact us via email if interested.Education and EmploymentAssistant, Associate, and Full Professor, UNIST, Feb. 2012 - Present.Senior Researcher, KISTI, Jan. 2010 - Jan. 2012.Member of Technical Staff, VMware, Inc. USA, Aug. 2007 - Dec. 2009. Ph. D. in Computer Sciences, University of Texas at Austin, Aug. 2007. (Advisor: Prof. Mohamed G. Gouda)M.S. in Computer Sciences, University of Texas at Austin, Dec. 2002.B.S. in Computer Sciences, Yonsei University, Seoul, KoreaResearch InterestsComputer Systems, System Software, Cloud computing, Machine learning platforms, Storage systems, Big data analytics platforms, High performance computingPublicationsGyeongchan Yun, Junesoo Kang, Hyunjoon Jeong, Sanghyeon Eom, Minsung Jang, and Young-ri Choi*, JABAS: Joint Adaptive Batching and Automatic Scaling for DNN Training on Heterogeneous GPUs, In Proceedings of the EuroSys 2025 (EuroSys 2025), April 2025.Jin Yang, Heejin Yoon, Gyeongchan Yun, Sam H. Noh, and Young-ri Choi*, A Dynamic Characteristic Aware Index Structure Optimized for Real-world Datasets, ACM Transactions on Storage, Volume 21, Issue 2 (Article No.: 15, Pages 1 - 32), 2025Heejin Yoon, Jin Yang, Juyoung Bang, Sam H. Noh, and Young-ri Choi*, Advocating for Key-Value Stores with Workload Pattern Aware Dynamic Compaction, In Proceedings of the 16th  ACM Workshop on Hot Topics in Storage and File Systems (HotStorage 2024), July 2024.Jin Yang, Heejin Yoon, Gyeongchan Yun, Sam H. Noh, and Young-ri Choi*, DyTIS: A Dynamic Dataset Targeted Index Structure Simultaneously Efficient for Search, Insert, and Scan, In Proceedings of the EuroSys 2023 (EuroSys 2023), May 2023.YU Jinghuan, Sam H. Noh, Young-ri Choi, and Chun Jason Xue, ADOC: Automatically Harmonizing Dataflow Between Components in Log-Structured Key-Value Stores for Improved Performance,  In Proceedings of the 21st USENIX Conference on File and Storage Technologies (FAST 2023), Feb. 2023.Wonbae Kim , Chanyeol Park , Dongui Kim , Hyeongjun Park , Young-ri Choi, Alan Sussman, and Beomseok Nam*, ListDB: Union of Write-Ahead Logs and SkipLists for Incremental Checkpointing on Persistent Memory,  In Proceedings of the 16th USENIX Symposium on Operating Systems Design and Implementation (OSDI 2022), July. 2022.Jay H. Park, Gyeongchan Yun, Chang M. Yi, Nguyen T. Nguyen, Seungmin Lee, Jaesik Choi, Sam H. Noh, and Young‐ri Choi*, HetPipe: Enabling Large DNN Training on (Whimpy) Heterogeneous GPU Clusters through Integration of Pipelined Model Parallelism and Data Parallelism, In Proceedings of the 2020 USENIX Annual Technical Conference (USENIX ATC '20), July 2020. [link]Seontae Kim, and Young‐ri Choi*, Constraint-aware VM placement in heterogeneous computing clusters, Cluster Computing, DOI: 10.1007/s10586-019-02966-6, 23(1):71–85, February 2020. Seontae Kim, Nguyen Pham, Woongki Baek, and Young‐ri Choi*, Holistic VM Placement for Distributed Parallel Applications in Heterogeneous Clusters, IEEE Transactions on Services Computing, 14(5):1411-1425, Sept.-Oct. 1 2021. [Open Access Link]Olzhas Kaiyrakhmet, Songyi Lee, Beomseok Nam, Sam H. Noh, and Young‐ri Choi*, SLM-DB: Single-Level Key-Value Store with Persistent Memory, In Proceedings of the 17th USENIX Conference on File and Storage Technologies (FAST 2019), Feb. 2019. [link]Moohyeon Nam, Hokeun Cha, Young-ri Choi, Sam H. Noh, and Beomseok Nam*, Write-Optimized Dynamic Hashing for Persistent Memory, In Proceedings of the 17th USENIX Conference on File and Storage Technologies (FAST 2019), Feb. 2019. [link] (Errata: Algorithm 1 and Fig 7(b) are fixed)Eunji Hwang, Jik-Soo Kim, and Young‐ri Choi*, Achieving Fairness-aware Two-level Scheduling for Heterogeneous Distributed Systems, IEEE Transactions on Services Computing, 14(3):639-653, May-June 1 2021. [Open Access Link]Eunji Hwang, Hyungoo Kim, Beomseok Nam, and Young‐ri Choi*, CAVA: Exploring Memory Locality for Big Data Analytics in Virtualized Clusters, In Proceedings of the 18th International Symposium on Cluster, Cloud and Grid Computing (CCGrid 2018), Washington, DC, May. 2018. [link]Jaeung Han, Changdae Kim, Jaehyuk Huh, Gil-Jin Jang, and Young-ri Choi*, Configuration Guidance Framework for Molecular Dynamics Simulations in Virtualized Clusters, IEEE Transactions on Services Computing, 10(3):366-380, June 2017.  [link]Wonbae Kim, Young-ri Choi, and Beomseok Nam*, Coalescing HDFS Blocks to Avoid Recurring YARN Container Overhead, In Proceedings of the IEEE International Conference on Cloud Computing (IEEE Cloud 2017), Honolulu, Hawaii, June. 2017. [link]Wonbae Kim, Young-ri Choi, and Beomseok Nam*, Mitigating YARN Container Overhead with input splits, In Proceedings of the 17th International Symposium on Cluster, Cloud and Grid Computing (CCGrid 2017), Madrid, Spain, May. 2017. [link]Eunji Hwang, Seontae Kim, Jik‐Soo Kim, Soonwook Hwang, and Young‐ri Choi*, On the Role of Application and Resource Characterizations in Heterogeneous Distributed Computing Systems, Cluster Computing, DOI: 10.1007/s10586-016-0638-x, 19(4):2225–2240, December 2016. [link]Jaewon Kwak, Eunji Hwang, Tae-kyung Yoo, Beomseok Nam, and Young-ri Choi*, In-memory Caching Orchestration for Hadoop, In Proceedings of the 16th IEEE/ACM International Symposium on Cluster, Cloud and Grid Computing (CCGRID 2016), May 2016. [link]Jaeung Han, Seungheun Jeon,  Young-ri Choi and Jaehyuk Huh*, Interference Management for Distributed Parallel Applications in Consolidated Clusters, In Proceedings of the Twenty First International Conference on Architectural Support for Programming Languages and Operating Systems (ASPLOS 2016), Atlanta, GA, USA, April 2016. [link]Eunji Hwang, Suntae Kim, Tae‐kyung Yoo, Jik‐Soo Kim, Soonwook Hwang, and Young‐ri Choi*, Resource Allocation Policies for Loosely Coupled Applications in Heterogeneous Computing Systems, IEEE Transactions on Parallel and Distributed Systems, 27(8):2349-2362, August 2016.Seontae Kim, Eunji Hwang, Tae‐kyung Yoo, Jik‐Soo Kim, Soonwook Hwang, and Young‐ri Choi*, Platform and Co‐runner Affinities for Many Task Applications in Distributed Computing Platforms, In Proceedings of the 15th IEEE/ACM International Symposium on Cluster, Cloud and Grid Computing (CCGRID 2015), Shenzhen, Guangdong, China, May 2015. [link]Young-ri Choi, and  Mohamed Gouda, A State-based Model of Sensor Protocols, Theoretical Computer Science (Elsevier), 458: 61‐75, 2012.Jeongseob Ahn, Changdae Kim, Jaeung Han, Young-ri Choi, and Jaehyuk Huh, Dynamic Virtual Machine Scheduling in Clouds for Architectural Shared Resources, In Proceedings of the 4th USENIX Workshop on Hot Topics in Cloud Computing (HotCloud), Boston, MA, USA, June 2012. [link]Jaeung Han, Jeongseob Ahn, Changdae Kim, Youngjin Kwon, Young-ri Choi and Jaehyuk Huh, The Effect of Multi-core on HPC Applications in Virtualized Systems,  The 5th Workshop on Virtualization in High-Performance Cloud Computing (VHPC), Ischia-Naples, Italy, August 2010.  [link]Young-ri Choi, Chin-Tser Huang, and Mohamed Gouda, Stabilization of Flood Sequencing Protocols in Sensor Networks, IEEE Transactions on Parallel and Distributed Systems, 21(7):1042-1055, July 2010. (A short version appeared in SSS 2007.)Rida Bazzi, Young-ri Choi, and Mohamed Gouda, Hop Chains: Secure Routing and the Establishment of Distinct Identities, Theoretical Computer Science (Elsevier), 410(6-7): 467-480, February 2009. (A short version appeared in OPODIS 2006.) Hongwei Zhang, Anish Arora, Young-ri Choi, and Mohamed Gouda, Reliable Bursty Convergecast in Wireless Sensor Networks,Computer Communication (Elsevier), 30:2560-2576, June 2007. (A short version appeared in ACM MobiHoc 2005.)Han Chen, Young-ri Choi, and Paul Chou, An Architecture for Programming and Managing Sensor and Actuator Networks in Enterprise Environment, OOPSLA workshop on Building Software for Sensor Networks, October 2006. [Link]Young-ri Choi, Mohamed G. Gouda, Hongwei Zhang, and Anish Arora, Stabilization of Grid Routing in Sensor Networks,  AIAA Journal of Aerospace Computing, Information, and Communication, 3:214-233, May 2006. [Link]Mohamed G. Gouda, and Young-ri Choi, A State-based Model of Sensor Protocols, In Proceedings of 9th International Conference on Principles of Distributed Systems (OPODIS 2005), Pisa, Italy, December 12-14, 2005. [Link]Hongwei Zhang, Anish Arora, Young-ri Choi, and Mohamed Gouda, Reliable Bursty Convergecast in Wireless Sensor Networks, In Proceedings of  6th ACM International Symposium on Mobile Ad Hoc Networking and Computing (MobiHoc 2005). [Link]Anish Arora, Rajiv Ramnath, Emre Ertin, Prasun Sinha, Sandip Bapat, Vinayak Naik, Vinod Kulathumani, Hongwei Zhang, Hui Cao, Mukundan Sridhara, Santosh Kumar, Nick Seddon, Chris Anderson, Ted Herman, Nishank Trivedi, Chen Zhang, Mohamed Gouda, Young-ri Choi, Mikhail Nesterenko, Romil Shah, Sandeep Kulkarni, Mahesh Aramugam, Limin Wang, David Culler, Prabal Dutta, Cory Sharp, Gilman Tolle, Mike Grimmer, Bill Ferriera, Ken Parker, ExScal: Elements of an Extreme Scale Wireless Sensor Network, In Proceeding of 11th IEEE International Conference on Embedded and Real-Time Computing Systems and Applications (RTCSA 2005), 2005. [Link]Mohamed G. Gouda, Young-ri Choi, and Anish Arora, Antireplay Protocols for Sensor Networks, Handbook on Theoretical and Algorithmic Aspects of Sensor, Ad Hoc Wireless, and Peer-to-Peer Networks, (ed. Jie Wu), CRC , 2005.A. Arora, P. Dutta, S. Bapat, V. Kulathumani, H. Zhang, V. Naik, V. Mittal, H. Cao, M. Demirbas, M. Gouda, Y.-R. Choi, T. Herman, S. Kulkarni, U. Arumugam, M. Nesterenko, A. Vora, and M. Miyashita, A Line in the Sand: A Wireless Sensor Ne",
  "content_length": 12298,
  "method": "requests",
  "crawl_time": "2025-12-01 14:53:00"
}