{
  "name": "Young-Woo Kwon 0001",
  "homepage": "http://sslab.knu.ac.kr",
  "status": "success",
  "content": "KNU Intelligent Software Systems Lab Intelligent Software Systems Lab Home People Research Publications Albumn Previous Next ê³¼íê¸°ì ì ë³´íµì ë¶ ì ëì°êµ¬ì¼í° ì§ìì¬ì ê³µíë¶ì¼ (ERC, Engineering Research Center) ì°¸ì¬ ì°êµ¬ì¤ ëêµ¬ê´ì­ì ëì§í¸ íì ê±°ì  R&BD íì ì¼í° ì°¸ì¬ ì°êµ¬ì¤ ê²½ë¶ëíêµ ì»´í¨í°íë¶ 4ë¨ê³ BK21 ì¬ì ì°¸ì¬ ì°êµ¬ì¤ Announcements * ë³¸ ì°êµ¬ì¤ìì í¨ê» ì°êµ¬í  ëíìì (ë°ì¬ê³¼ì , ìì¬ê³¼ì , ìë°ì¬ íµí©ê³¼ì )ì ëª¨ì§íê³  ìì¼ë ê´ì¬ ìë ì§ììë¤ì CV í¹ì ì´ë ¥ìë¥¼ ë³´ë´ì£¼ê¸° ë°ëëë¤. (I am actively looking for MS, PhD, MS/PhD students as well as Post Docs who are interested in distributed systems, big data anaytics, software engineering, etc. If you are interested in my research, please feel free to contact me with CV or Resume). * ë³¸ ì°êµ¬ì¤ììë ìí ì¤ì¸ ì°êµ¬ ê³¼ì ë¥¼ í¨ê» í  íë¶ì°êµ¬ì(3íë  ì´ì)ì ëª¨ì§íê³  ììµëë¤. ëª¨ì§ ë¶ì¼ë 1) IoT ì¥ì¹ ê°ë° ë° ì¤í, 2) ì¬ë ìë¦¼ ìì  ì± ê°ë°, 3) ê¸°í ì°êµ¬ì¤ìì íìë¡íë ìíí¸ì¨ì´ ê°ë° ì´ë©°, ì°¸ì¬ëì ë°ë¼ ì¸ê±´ë¹ë¥¼ ì§ê¸í©ëë¤. ê´ì¬ ìë ì§ììë ì´ë ¥ìë¥¼ ì´ë©ì¼ë¡ ì ì¶ ë°ëëë¤. Research Interests ì§ë¥ ìíí¸ì¨ì´ ìì¤í  ì°êµ¬ì¤ì ì°ë¦¬ ì¬íê° ì§ë©´í ì¬ë¬ ë³µì¡í ë¬¸ì ë¤ì í´ê²°íê¸° ìí íì ì ì¸ ìíí¸ì¨ì´ ë° ì»´í¨í° ìì¤í ì ì°êµ¬ ê°ë°íë ê²ì ëª©íë¡ í©ëë¤. ë³¸ ì°êµ¬ì¤ììë IoT, í´ë¼ì°ë, ë¹ ë°ì´í°, ì¸ê³µì§ë¥ ë±ì íì©í ìíí¸ì¨ì´ ìì¤í ì ë° ìë¹ì¤ë¥¼ ì§ì  ì¤ê³íê³  ê°ë°íë©° ììì¼ë¡ ì´ë£¨ì´ì§ë ê²ì ì¤íííê³  ììµëë¤. ë¶ì° ìì¤í , ë¹ ë°ì´í° ë¶ì ë° ì²ë¦¬, ìíí¸ì¨ì´ ê³µíì ê¸°ë°í ì°êµ¬ë¥¼ ìííë©° ìµê·¼ ì°êµ¬ììë 'ICTì ë¹ ë°ì´í°ì ê¸°ë°í ì¬ë ê°ì§ ë° ëì', 'ë³´ì ì·¨ì½ì  ë¶ì ë° íì§', 'ì£ì§ íê²½ììì ìë¹ì¤ ë¶ì° ê¸°ì ' ë±ì ë¤ë£¨ê³  ììµëë¤. News and Events May. 2025 Our work about Serverless Computing has been accepted to the IEEE Cloud 2025, Congratulations! Manish Apr. 2025 Two SCIE(Scientific Reports, IEEE Access) papers have been accepted and published. Great Job. Dr. Irshad! Mar. 2025 Welcome new PhD students (Daegwang and Jaegeun) Feb. 2025 Aming (PhD) Jiashun, Gahyeon, and Jageun (MS) successfully defended their MS thesis. Congratulations on their graduations. Nov. 2024 One paper about security vulnerability detection was accepted to IEEE TrustCom 2024, Congrats. Jiashun! Oct. 2024 One paper about cloud computing was accepted to Journal of KICS 2024, Congrats. Jinuk! Oct. 2024 Four papers about quantum computing, edge/cloud computing, and AI will be presented at 2024 KICS Fall Conference, Good jobs, Soonhye, Jinuk, Jihoon, Hyeongryul! Sept. 2024 One paper about edge computing was accepted to IEEE PRDC 2024, Congrats. Iliyas! Sept. 2024 New Ph.D, MS, BS students. Welcome aboard! Sunhye, Hyeongryul, Sanghee! July. 2024 One paper about disaster analysis was accepted to ASONAM 2024, Congrats. Seonhyeong! Jun. 2024 One paper about log anomaly detection was accepted to SRDS 2024, Congrats. Aming! Jun. 2024 Four papers were presented at the KICS Summer Conference, Great jobs! Seonhyeong, Jaegeun, Ilyas, and Jinuk. Apr. 2024 One paper about malware detection in Android was accepted to IFIP SEC 2024, Congrats. Dr. Khan! Jan. 2024 Professor Kwon will serve as a PC chair at MobiCASE 2024 which will be held in DC, US, in Dec. 2024. Jan. 2024 Welcome new MS students and undergraduate research interns (Ilyas Hadjou, Jihoon Choi, Jinwook Jung, Hyunjung Jung). Dec. 2023 Seonhyeong will present her work at ICAIIC 2024 in Osaka, Japan. Dec. 2023 Professor Kwon received \"íì°½ì¥\" from êµ­ê°ì ë³´ì, Dec. 2023. Dec. 2023 Professor Kwon and his team received \"ì°ìì\" at ABB ì°½ì ê²½ì§ëí Dec. 2023. Nov. 2023 One paper was accepted to ACM SAC 2024. Congratulations to Manish! Nov. 2023 Congratulations to Daekwang and Beomjun on their successful M.S. defense! Sept. 2023 Two papers were accepted to ACM ASONAM 2023 (Acceptace rate: 17.2%). Congratulations to Seonhyeong, Aming, and Irshad! Aug. 2023 Our paper was accepted to Multimedia Tools and Applications (SCIE)! Aug. 2023 Congratulations to Seung-Jun Han on filing his M.S. thesis Jun. 2023 Seonhyeong received the award íêµ­ íµì íí í´ëì°ì ë ¼ë¬¸ì Congratulations! Jun. 2023 New MS student JaeGeun Jang. Welcome to ISSL! Mar. 2023 New MS student Gahyeon Lee. Welcome to ISSL! Mar. 2023 New MS student Hyunmin Jung. Welcome to ISSL! Feb. 2023 One poster paper was accepted to CCGrid 2023. Congrats, Manish! Dec. 2022 One short paper was accepted to ACM SAC (ML Track) 2023. Congrats, Aming! Dec. 2022 New MS student Hao Jiashun. Welcome to ISSL! Dec. 2022 Seonhyeong received the award íêµ­ ë°©ì¬íí ë ¼ë¬¸ê²½ì§ëí (ì¥ë ¤ì) Congratulations! Dec. 2022 ISSLab presented 3 posters at IEEE BigData 2022. Nov. 2022 Sangjun received the best paper award at íêµ­ ITS íí íì ëí 2022. Congratulations! Aug. 2022 Congratulations to Dohan Kim and Yoola Choi on filing their M.S. thesis Mar. 2022 Welcome new graduate students, Daegwang, Beomjun (MS), ZIA (MS-PhD) Feb. 2022 Congratulations to Sangjun Kim on filing his M.S. thesis Oct 2021 Our CrowdQuake+ funded by KMA will be introduced at IEEE BigData 2021, Congratulations! Aming, Jangsoo, and Irshad. Aug 2021 Our four-year NDMI project's result was published at IEEE Access. Great job!, Seonhyeong! Jul. 2021 Yoola's first paper was acceted at IEIE Transactions on Smart Processing and Computing Jul. 2021 Our collaborative project with Virginia Tech was successfully completed with the acceped paper at IEEE SMDS 2021 (acceptance rate: 32.5%) May. 2021 Manish Pandey successfully defended his MS thesis and will continue his PhD study in our lab Mar. 2020 Our lab will join the Software Disaster Research Center (ERC) for 7 years!!! Mar. 2021 Launch of 4-year project funded by NRF Mar. 2021 Welcome new graduate students, Seonhyung Kim (PhD), Ziyi Guo, Yoola Choi, and Seungjun Han (MS) Sept. 2020 Welcome new PhD student, Wu Aming May. 2020 Irshad Khan received the gold medal at ACM Student Research Competition. His paper title is \"Collaborative Earthquake Detection and Response Using Smart Devices. Congratulations Irshad!!! May 2020 Our paper (funded by KMA) was acceted at KDD 2020. Mar. 2020 Welcome new grad students, Jangsoo Lee (PhD), Minseok Lee, and Wonkyu Lee (MS) Jan. 2020 and Dec. 2019 Two papers were accepted to SCIE journals (Electronics, Sensors) Oct. 2019 Launch of 5-year project funded by Pohang Techno Park Sep. 2019 Welcome new MS students, Manish Pandey and Yura Choi Jan. 2019 Launch of 3-year project funded by KMA (Korea Meteorological Administration) Jan. 2019 Our collaborative work (with U of Nebraska, Omaha) was accepted by Journal of Computer Science & Technology Nov. 2018 Jangsoo's first international conference paper was accepted by BigComp 2019. Congrats! Mar. 2020 Welcome a new PhD student, Irshad Khan! Jul. 2018 New funding from Korea Meteological Administration. Thanks for the support! Jun. 2018 Our collaborative work (with U of Nebraska, Omaha) was published at the Journal of Software: Evolution and Process. Jun. 2018 Two domestic papers were nominated for the best paper award at KCC 2018. Mar. 2017 I joined School of Computer Science and Engineering, Kyungpook National University.",
  "content_length": 7539,
  "method": "requests",
  "crawl_time": "2025-12-01 14:52:58"
}