{
  "name": "Young Min Kim 0001",
  "homepage": "https://3d.snu.ac.kr/members",
  "status": "success",
  "content": "3D Vision lab - Members Toggle navigation Home Members Publications Class&Workshop Research Gallery Professor Young Min Kim Associate Professor Email : youngmin.kim@snu.ac.kr 2006 B.S. Electrical Engineering, Seoul National University 2008 M.S. Electrical Engineering, Stanford University 2013 Ph.D. Electrical Engineering, Stanford University 2008 Visiting Researcher, MPI 2013-2015 Research Scientist, Korea Institute of Science and Technology 2015-2019 Senior Research Scientist, Korea Institute of Science and Technology 2016-2018 Visiting Researcher, University of Texas at Austin 2019-2023 Assistant Professor, Seoul National University 2023 Visiting Scholar, UCSD (Host : Hao Su) 2023- Associate Professor, Seoul National University Postdocs Junho Kim Email : 82magnolia@snu.ac.kr Research Interests: visual localization, 3D scene understanding Ph.D. Electrical and Computer Engineering, Seoul National University, 2025 B.S. Electrical and Computer Engineering, Seoul National University, 2020 Eunsun Lee Email : eunsunlee@snu.ac.kr Research Interests: 3D computer vision Ph.D. Electrical and Computer Engineering, Seoul National University, 2025 M.S. Electrical and Computer Engineering, University of California-Los Angeles, 2018 B.S. Electrical and Computer Engineering, University of Virginia, 2015 Junho Lee Email : twjhlee@snu.ac.kr Research Interests: robotic grasping, 3D reconstruction Ph.D. Electrical and Computer Engineering, Seoul National University, 2025 B.S. Electrical and Computer Engineering, Seoul National University, 2020 Ph.D Students Changwoon Choi Email : changwoon.choi00@gmail.com Research Interests: implicit neural representations B.S. Electrical and Computer Engineering, Seoul National University, 2020 Jinseok Bae Email : capoo4938@gmail.com Research Interests: computer animation, robotics M.S. Electrical and Computer Engineering, Seoul National University, 2022 B.S. Electrical and Computer Engineering, Seoul National University, 2020 B.S. Biosystems Engineering, Seoul National University, 2020 Mingi Lee Email : mingi1019@snu.ac.kr Research Interests: 3D shape generation B.S. Electrical and Computer Engineering, Seoul National University, 2021 Hojun Jang Email : j12040208@snu.ac.kr Research Interests: 3D human pose estimation B.S. Electrical and Computer Engineering, Seoul National University, 2021 Minkwan Kim Email : mkjjang3598@snu.ac.kr Research Interests: 3D computer vision, computational imaging B.S. Electrical and Computer Engineering, Seoul National University, 2021 Inwoo Hwang Email : inusu0818@snu.ac.kr Research Interests: computer animation B.S. Electrical and Computer Engineering, Seoul National University, 2022 Donggeun Lim Email : rms2836@snu.ac.kr Research Interests: 3D computer vision B.S. Electrical and Computer Engineering, Seoul National University, 2020 Hyeongjun Heo Email : heo0224@snu.ac.kr Research Interests: vision-based robot manipulation, implicit neural representations B.S. Electrical and Computer Engineering, Seoul National University, 2022 Gwangtak Bae Email : tak3452@gmail.com Research Interests: 3D computer vision B.S. Electrical Engineering, Korea Advanced Institute of Science and Technology, 2019 Seungbin Jeong Email : sb9155118@gmail.com Research Interests: computer graphics, 3D computer vision B.S. Statistics, Seoul National University, 2023 Sang Min Kim Email : tkdals9082@snu.ac.kr Research Interests: vision-based robot manipulation B.S. Electrical and Computer Engineering, Seoul National University, 2023 M.S Students Sungbin Mun Email : brian0429@snu.ac.kr Research Interests: vision-based reinforcement learning, 3D computer vision, robotics B.S. Mechanical Engineering, Korea University, 2024 B.S. Artificial Intelligence, Korea University, 2024 Younghwan Lee Email : frredy99@snu.ac.kr Research Interests: 3D computer vision, computer animation, robotics B.S. Mechanical Engineering, Seoul National University, 2024 Seunggu Kang Email : jrkang99@gmail.com Research Interests: 3D computer vision B.S. Mechanical Engineering, Hanyang University, 2025 Interns Seungmin Lee Email : rsual@snu.ac.kr Research Interests: computer graphics, 3D computer vision B.S. Computer Science and Engineering, Seoul National University, 2026 (Expected) Hyunsoo Lee Email : philip21@snu.ac.kr Research Interests: 3D computer vision B.S. Electrical and Computer Engineering, Seoul National University, 2027 (expected) Woongchan Cho Email : woongchan0317@snu.ac.kr Research Interests: 3D computer vision, Robotics B.S. Civil and Environmental Engineering, Seoul National University, 2027 (expected) Jinwoo Seo Email : jinuseo21@gmail.com Research Interests: vision-based robot manipulation B.S. Electrical and Computer Engineering, Seoul National University, 2027 (expected) JongBum Won Email : jim8697@snu.ac.kr Research Interests: 3D computer vision, augmented reality B.S. Civil and Environmental Engineering, Seoul National University, 2026 (expected) B.S. Business Administration in Entrepreneurship, Seoul National University, 2026 (expected) Seungyeon Woo Email : yeon0857@snu.ac.kr Research Interests: 3D computer vision, Robotics B.S. Mechanical Engineering, Seoul National University, 2027 (expected) Alumni Graduate Students Ph.D. Cheolhui Min (~2024.09) Now Staff Engineer, Samsung Global Technology Research M.S. Kyungjin Lee (~2020.02) Now Ph.D. Student, Seoul National University Hyeontae Son (~2021.08) Now Research Engineer, Naver Labs Juhyeon Kim (~2022.06) Now Ph.D. Student, Dartmouth College Cheongi Jeong (~2023.02) Now Research Engineer, Samsung Research Dongsu Zhang (~2022.02) Now Ph.D. Student, EPFL Undergraduate Students Jeonghwan Kim (~2021.02) Jaehyeok Bae (~2021.03) Gangin Park (~2021.04) Inbum Park (~2021.09) Sangwon Park (~2022.08) Hyeonwoo Kim (~2022.12) Jiwon Jeong (~2023.08) Jaeah Lee (~2024.01) Seonghun Oh (~2024.10) Seungjae Ahn (~2025.08) Visitors Clément Jambon (~2024.08) Now Ph.D. Student, Massachusetts Institute of Technology (MIT) Copyright 2024, 3D Vision Laboratory, Dept. of Electrical and Computer Engineering, Seoul National University. Contact: Room 916, Building 301, 1 Gwanak-ro, Gwanak-gu, Seoul, Republic of Korea",
  "content_length": 6163,
  "method": "requests",
  "crawl_time": "2025-12-01 14:52:53"
}