{
  "name": "Youngmoon Lee",
  "homepage": "https://sites.google.com/umich.edu/youngmoonlee/home",
  "status": "success",
  "content": "이영문 교수Search this siteEmbedded FilesSkip to main contentSkip to navigation이영문  Youngmoon Lee  Ph.D.  youngmoonlee@hanyang.ac.kr Robotics Department (Jointly with Applied AI)Hanyang University ERICA 5th Engineering 526(RAISE Lab) 514(Office) Google Scholar |  Linkedin | Github  | CV  I am an associate professor in the Robotics Department at Hanyang University and the founding director of the RAISE  Lab (Real-time AI Systems Engineering Laboratory). Robotics is HW, SW, and also UI. We tackle challenges in every aspect of Real-time AI Systems, i.e., Robots. Most of our projects are open-source available at https://github.com/RAISElab.  Interests: I am primarily a system's person interested in research problems in the area of real-time AI and ML, robotic sensing and learning, cyber-physical and embedded systems as well as mobile and cloud computing.Bio: I received Ph. D. in Computer Science and Engineering from the RTCL at the University of Michigan and B.S. in Electrical and Computer Engineering at Seoul National University.  I also served as a Korea International Cooperation Agent (KOICA) in Rwanda.News2025-11-06 SIAM is accepted by WACV'26Congratulations Niaz!2025-10-20 I was nominated as World Top 2% ScientistCongratulations RAISE Lab!2025-08-08 Humanoid '25 accepts 3 papers Congratulations all!2025-04-29 KDC has been accepted by IJCAI'25     Congratulations Niaz!2025-04-22 SHARE Robotics Education Center is awarded  THE Asia Award  Thanks to all! 2025-04-04 VisualCent has been accepted by FG'25Congratulations Niaz!2025-03-01  Zahra, Jaehwan joined the group Welcome to all!GroupGraduate StudentsSaif Ullah Gyurin KimZahra Batool JaffreyJaehwan ChoAlumniSaeed Ullah Ph.D. (Lecturer @ University of Derby)Hojun Choi  (Ph.D. @ University of Nebraska)Jeremy Yuhyun Kim (Research Engineer @ A Robot)Seunghwan Lee (Founder @  KnL Robotics)Donghyun Kwon (Co-Founder @  KnL Robotics)Jawad Khan Ph.D.(Assistant Professor @ Gachon University)Chanyeok Choi (CTO @ D.DDECK)Niaz Ahmad Ph.D.(Postdoc @ Toronto Metropolitan University)News-Archive2024-12-31  Recognition from Minister of Education for SHARE Robotics Center Thanks to all!2024-09-01 Niaz graduates and will join Toronto Metro Univ.Congratulations Dr. Niaz!2024-08-06 4 papers including HAPtics accepted by ICPR'24Congratulations Niaz!2024-08-03 HAPtics win Finalist Paper Award @ IJCAI'24 DLHARCongratulations Niaz!2024-05-20 Drone BMS accepted by ISLPED'24Congratulations Hojun!2024-05-09 HAPtics accepted by IJCAI'24 DL-HARCongratulations Niaz!2024-03-01 Chanyeok joins  D.DDECK as CTOCongratulations Chanyeok!2024-03-01 Dr. Jawad Khan joins Gachon University as Assistant ProfessorCongratulations Jawad!2024-01-21 RT-Swap accepted by RTAS'24 (CPSWeek'24)Congratulations Collaborators!2024-01-10 Snapbot accepted by HRI'24 Congratulations Chanyeok!2023-11-22 MOT-AS accepted by SAC'24Congratulations Collaborators!2023-09-29 Slack Management for Battery accepted by JSA'23Congratulations Collaborators!2023-09-26 SSK-DNN accepted by ICDM'23 IncrLearnCongratulations Jawad!2023-09-21 Awarded KSEE'23 Engineering Education AwardThanks all!2023-07-10 KDC accepted by RSS'23 Robot RepresentationsCongratulations Niaz!2023-06-23 Drone-AMR  system won undergraduate research  award at ICROS'23Congratulations Junghan!2023-06-14 Hojun graduates and joins University of Colorado, awarded Chancellor Scholarship.Congratulations Hojun!2023-03-24 Awarded Grant for Science Museum Exhibition R&DThanks NRF, MSIT!2023-03-09 SCA-HDNN accepted by IEEE Access Congratulations Jawad!2023-03-03 Invited Talk @ ETRI Memory Disaggregation2023-02-06~08 Organizing  Systems Society Conference Join the Club!2023-01-05 Drone BMS poster accepted by ASP-DAC'23 Congratulations Hojun!2023-01-01  Saif, Gyurin  joinedWelcome Saif, Gyurin!2022-11-11 SCA-HDNN poster accepted by BigData'22 Congratulations Jawad!2022-09-09 SSK-DNN accepted by COLING W-NUT'22 Congratulations Jawad!2022-06-03 Pose for Metaverse awarded  and presented at ICROS'22Congratulations Donghyun!2022-05-25 Awarded Grant for Basic Research Lab (BRL)Thanks NRF, MSIT!2022-04-12 Footprint funded through Tumblbug and Startup Accelerating PackageCongratulations Seunghwan!2022-04-05 Drone Battery Management accepted by DAC'22 Congratulations Hojun!2022-03-28 MultiPoseSeg accepted by ICPR'22 Montreal Congratulations Niaz!2022-03-15 Awarded Grant for Battery-Aware SystemsThanks NRF, MSIT!2022-02-18 N사 현직 개발자들의 취업 성공 스토리, Footprint Please Like and Follow!2022-02-08 Newcomer Talk at Computer System Society2022-01-19 Smart City and Hyper-personal Services published at IITP weekly trendCongratulations Donghyun![News Coverage]2022-01-18  DNN-SAM  (with DGIST, SSU, SKKU, Umich) accepted by RTAS'22Congratulations Collaborators!2022-01-01  Chanyeok  joinedWelcome Chanyeok!2021-12-24  Footprint won  Startup award (1st Place) from BK Smart City Program Congratulations Seunghwan!2021-12-11  Hydra (with Umich, Columbia) accepted by FAST'22Congratulations Collaborators!2021-12-01  PosePlusSeg was accepted by AAAI'22Congratulations Niaz!2021-11-24 Seunghwan's Footprint : Career Roadmap for Developers  won Startup Award Congratulations Seunghwan!2021-09-30 Saeed appointed as Lecturer@University of DerbyCongratulations Saeed!2021-09-13  Jawad's IHFSSA was accepted by IEEE Access,Congratulations Jawad!2021-08-13  Awarded Grant for Grad School Lab StartupThanks NRF, MOE!2021-05-01  Awarded Grant for Shared AI Robotics CenterThanks NRF, MOE!2021-04-01  DNN Split poster (Joint with DGIST, SSU, Umich) was accepted by DAC20212021-03-01 BaT invited to GetMobile2021-02-04 Thermal Utilization Bound presented in DATE20212021-01-01  Yuhyun Seunghwan, Donghyun, Hojun, Niaz,  joined2020-11-13 Therma Utilization Bound accepted by DATE20212020-11-01 Awarded Research Grant for 360VR 3D Scanner2020-10-08 DriverAuthentication accepted by UbiComp20212020-10-01  Jawad, Saeed (Post Docs) Joined. Welcome!2020-09-16 BatteryThermometer presented in UbiComp2020.2020-08-07 Awarded Grant for BK21 Smart CityThanks NRF, MOE!2020-06-17 Phone shutoffs (BPM) presented in MobiSys2020.2020-06-01 Awarded  Grant for Grand ICT Research CenterThanks IITP, MSIT!2020-05-20 Awarded Research Grant for Smart FactoryThanks KIAT, MOTIE!2020-05-01 BPM accepted by MobiSys20202020-03-20 Awarded Research Grant for Embedded AI ResearchThanks Hanyang University!2020-03-02 Joined Hanyang University2020-02-23 Our battery scheduling paper accepted by TPDS20202020-01-17 BaT accepted by UbiComp2020ResearchWhile AI becomes a winning paradigm in cyberspace, our goal is to realize state-of-the-art AI in physical space in real-time. I am interested in research problems in the area of real-time AI and ML, robotic sensing and applications, cyber-physical and embedded systems, as well as computer systems and networks. These research problems are often motivated by, and directly applicable to, real-world systems such as autonomous and electric cars, drones, robots,  smart homes and cities, as well as human health and well-being. Real-Time AI-Perception (WACV'26, Humanoid'25, IJCAI'25, FG'25, ICPR'24, ICDMW'23, AAAI'22, ICPR'22)-Robotics (Humanoid'25, HRI'24, IJCAIW'24, SAC'24, RSSW'23, RTAS'22)Cyber-Physical System -Battery Management System (ISLPED'24, DAC'22, MobiSys'20, UbiComp'20, ICCPS'19, RTSS'16) -Dynamic Thermal Management  (DATE '21, EMSOFT'19, EMSOFT'18, ISLPED'17)Systems -Resource Disaggregation (RTAS'24, FAST'22, NSDI'17, SIGCOMMW'17)  -Cyber-Physical and Robot Security (Humanoid'25, UbiComp'21) Teaching Robotic Intelligence (Spring 2023~)Robotic Vision System (Fall 2021~)Artificial Intelligence (Spring 2020~)Computer System (Spring 2020~2021)Digital Signal Processing (Fall 2020)GrantGrand ICT Research Center (그랜드ICT연구센터), IITP (MSIT) IITP-2025-RS-2020-II201741, 2020~2027CARE Center for AI Robotics Education (로봇직업교육센터), KIRIA(MOTIE) 2024~2028SHARE Intelligent Robotics Center (지능형로봇혁신융합대학), NRF (MOE) 2021~2027BK21 Grant for Physical AI (BK21교육연구단), NRF (MOE) 2025~2027Security Graduate Program (융합보안대학원), IITP(MSIT) ,RS-2024-00423071 2024~2027Real-Time Battery-of-Things (기초연구실), NRF (MSIT) 2022R1A4A3018824,  2022~2025Data-driven BMS for EVs (생애첫연구), NRF (MIST) 2022R1G1A1003531,  2022~2025Applied AI Graduate Program (인공지능융합혁신인재양성), IITP (MSIT) RS-2022-00155885,  2022~2025BK21 Grant for Smart City (BK21교육연구단), NRF (MOE) 2020~2024Robot Docent R&D (과학관전시서비스연구개발), NRF (MSIT) RS-2023-00230593,  2023~2023Lab Startup Program (실험실특화형창업선도대학) NRF(MOE) 2021~2022Smart Manufacturing Talent Program (스마트제조고급인력양성), KIAT(MOTIE) 2020~2021PublicationFull ListDBLP Google ScholarConference PapersSIAM: Synchronous Interaction Attention for Human Mesh RecoveryNiaz Ahmad, Saif Ullah, Youngmoon Lee, Guanghui WangIEEE/CVF Winter Conference on Applications of Computer Vision, Tucson, USA, 2026 (WACV 2026)Kinematic Heatmap for Pose Estimation in Dynamic Human MotionSaif Ullah, Gyurin Kim, Zahra Batool Jaffrey, Niaz Ahmad, Jawad Khan, Youngmoon LeeIEEE/RAS International Conference on Humanoid Robots, Seoul, Korea, 2025 (Humanoid 2025)Crowd-Aware Path Planning and Visualization for Predictable Human Robot InteractionMinseong Bae, Youngeun Choi, Youngseong Kim, Taeseong Ahn, Aron Lee, Junhwa Lee, Youngmoon LeeIEEE/RAS International Conference on Humanoid Robots, Seoul, Korea, 2025 (Humanoid 2025)Poisoning Attacks on Multi-Agent Reinforcement Learning SystemsChanyeok Choi, Jaehwan Cho, Youngmoon LeeIEEE/RAS International Conference on Humanoid Robots, Seoul, Korea, 2025 (Humanoid 2025)Keypoints as Dynamic Centroids for Unified Human Pose and SegmentationNiaz Ahmad, Jawad Khan, Kang G. Shin, Youngmoon Lee, Guanghui WangInternational Joint Conference on Artificial Intelligence, Montreal, Canada, 2025 (IJCAI 2025)VisualCent: Visual Human Analysis using Dynamic Centroid RepresentationNiaz Ahmad, Youngmoon Lee, Guanghui WangInternational Conference on Automatic Face and Gesture Recognition, Clearwater, USA, 2025 (FG 2025)HAPtics: Human Action Prediction in Live via Pose Kin",
  "content_length": 18887,
  "method": "requests",
  "crawl_time": "2025-12-01 14:53:00"
}