{
  "name": "Youngjoong Ko",
  "homepage": "https://nlp.skku.edu",
  "status": "success",
  "content": "Personal Homepage: Prof. Youngjoong Ko Home | Link Ko, Youngjoong Home Publications Projects Students Teaching Activities Demos/Talks About Me I'm a professor in Dept. of Computer Science and Engineering, Graduate School of AI, and Dept. of Applied Data Science at the Sungkyunkwan University from September 2019. Before I joined the faculty at Sungkyunkwan University, I worked at Dong-A University from September 2004 after completing my Ph.D in August 2003. I work at the intersection of natural language processing (NLP) and information retrieval (IR) based on Language Models, and I am interested in NLP (dialogue system, question/answering system, etc.), IR (generative IR, etc.), Generative AI (controllable text generation, etc.), and Text Mining (text classification/summarization, sentiment classification, etc.). Recently, I'm interested in how to develop and utilize sLM (small Language Model) and RAG (retrieval augmented generation) for my research areas. I'm leading the Natural Language Processing (NLP) Laboratory at College of Computing and Informatics of Sungkyunkwan University. I worked at the Computational Linguistics and Information Processing Laboratory (CLIP) at the University of Maryland, College Park as a visiting scholar from 2011 fall semester to 2012 spring semester. My collaborator was Prof. Doug Oard. News To prospective students, if you want to join our research group, please fill out the google form with curriculum vitae including your transcript as early as possible, so that you can have a short-term internship before applying to the master program. Videos for my talks \"ChatGPT란 무엇인가? [Part I and Part II]\" at 성대의 성대한 특강 and \"Neural Symbolic AI\" at SKKU AI Colloquium. Lab Tour of SKKU NLP Lab at AI Society Newsletter 2021 and SKKUZINE 2022. 2025/11/01 Congratulations on working as a program manager (PM) for NRF (한국연구재단). 2025/10/16 Park, Sungwan commences working at Rebellions Inc. Congratulations!! 2025/10/12 Congratulations on paper acceptance in Computer Speech & Language with Honghee Lee (IF=3.4). 2025/09/01 Congratulations on working as a technical advisory for NAVER. 2025/09/01 Welcome! our new graduate students (Taeklim Kim, Yewon Lee & Junseo Lee) 2025/09/01 Welcome! our new undergraduate students (Jeongwoo Kim, Joonwoo Kim, Soobin Kang, Jinseok Park, & Jung-Hyeon Choi) 2025/02/07 Cha, Hyunmuk commences working at Lotte Innovate Inc. Congratulations!! 2025/08/21 Congratulations on two papers acceptance in EMNLP 2025 with Seungmin Shin, Seongwan Park, Tealim Kim and Dooyoung Kim (BK Plus Computer Science IF=3). 2025/08/08 Congratulations on working as a strategic director for KAIA (한국인공지능학회). 2025/08/07 Congratulations on receiving Excellence Awards in Education Area (묘품-妙品) in Sungkyunkwan University Achievement Evaluation. 2025/08/01 Cho, Hyunsu commences working at Samsung Electronics Inc. Congratulations!! 2025/07/01 Congratulations on working as a technical advisory for Diquest. 2025/07/03 Congratulations on receiving Academic Award (학술상) from KIISE (한국정보과학회). 2025/07/01 Lee, Haeun commences working at HDC Lab. Congratulations!! 2025/05/20 Congratulations on paper acceptance in ACL 2025 findings with Hyunsu Cho and Dooyoung Kim (BK Plus Computer Science IF=4). 2024/04/14 Congratulations on paper acceptance in Expert Systems With Applications with Kyuri Choi (IF=7.5, top 10%). 2024/03/05 Congratulations on paper acceptance in Pattern Recognition Letters with Youngjae Chang (IF=3.9). 2025/03/01 Welcome! our new graduate students (Junhui Lee & Junho Han) 2025/03/01 Welcome! our new undergraduate students (Yewon Lee & Junseo Lee) 2025/02/01 Park, Jiyeol commences working at Samsung Electronics Inc. Congratulations!! 2025/02/07 Shin, Seungmin commences working at Lotte Innovate Inc. Congratulations!! Contact Information Ko, Youngjoong 86409, N Center, Dept. of Computer Science and Engineering, Graduate School of AI, and Dept. of Applied Data Science Sungkyunkwan University (Natural Science Campus), 2066,Seobu-ro,Jangan-gu,Suwon-si Gyeonggi-do, 16419, Korea youngjoong.ko at gmail.com Google Scholar Profile Visit the github site for open sources and class materials of SKKU NLP Lab. Design: www.yomena.de | CC:Attribution",
  "content_length": 4219,
  "method": "requests",
  "crawl_time": "2025-12-01 14:53:00"
}