{
  "name": "Young-Joo Suh",
  "homepage": "http://monet.postech.ac.kr/yjsuh",
  "status": "success",
  "content": "Home Page of YOUNG-JOO SUH Young-Joo Suh Professor Department of Computer Science and Engineering Pohang University of Science and Technology (POSTECH) 77 Cheongam-Ro, Nam-Gu Pohang, Gyeongbuk, 37673, Korea Phone: +82-54-279-2243 E-mail: Web: https://aiot.postech.ac.kr/yjsuh/ EDUCATION: Ph.D. (Sep. 1996) Electrical and Computer Engineering, Georgia Institute of Technology, Atlanta, Georgia, USA. M.S. (Feb. 1987) Electronics Engineering, Hanyang University, Seoul, Korea. B.S. (Feb. 1985) Electronics Engineering, Hanyang University, Seoul, Korea. EXPERIENCE: Professor (Mar. 2020 - present), Graduate School of Artificial Intelligence, POSTECH, Pohang, Korea. Professor / Associate Professor / Assistant Professor (Aug. 1998 - present), Department of Computer Science and Engineering, POSTECH, Pohang, Korea. Visiting Professor (Aug. 2013 - Aug. 2014), Department of Electrical and Computer Engineering, Duke University, Durham, North Carolina, USA. Visiting Professor (Feb. 2006 - Feb. 2007), Department of Electrical and Computer Engineering, University of Arizona, Tucson, Arizona, USA. Research Professor (Feb. 1997 - Jul. 1998), Department of Electrical Engineering and Computer Science, The University of Michigan, Ann Arbor, Michigan, USA. Researcher (Sep. 1996 - Feb. 1997), Computer Systems Research Laboratory, School of Electrical and Computer Engineering, Georgia Institute of Technology, Atlanta, Georgia, USA. Research Assistant (Sep. 1993 - Sep. 1996), School of Electrical and Computer Engineering, Georgia Institute of Technology, Atlanta, Georgia, USA. Assistant Professor (Feb. 1990 - Sep. 1993), Department of Computer Science and Engineering, Chung-Cheong College, Korea, Research Engineer (Mar. 1988 - Feb. 1990), Central Research Center, LG Electronics Inc., Seoul, Korea. Second Lieutenant (Aug. 1987 - Feb. 1988), Military service in Korean Army. RESEARCH INTERESTS: Deep Learning-based Human Activity Recognition (HAR), Gesture Detection Artificial Intelligence of Things (AIoT) Indoor Positioning System (IPS) Next Generation Network Systems Artificial Intelligence of Things Lab Homepage GRADUATE STUDENTS: PUBLICATIONS:",
  "content_length": 2152,
  "method": "requests",
  "crawl_time": "2025-12-01 14:52:59"
}