{
  "name": "Young Choon Lee",
  "homepage": "http://web.science.mq.edu.au/~yclee",
  "status": "success",
  "content": "Young Choon Lee Young Choon Lee (이영춘) Senior Lecturer Room: 209 young.lee@mq.edu.au About me | Research | Publications | Patents | Teaching | Professional activities | Misc About me I am a researcher and a senior lecturer in School of Computing at Macquarie University. My research focus is on scheduling and resource management in distributed systems. My current research interests include cloud data centre efficiency and sustainability, edge computing + cloud computing (Collaborative Distributed Computing) and data-intensive computing. I received my PhD from School of Computer Science (formerly, School of Information Technologies) at The University of Sydney, 2008. I started my Bachelor degree at Griffith University, Gold Coast, Australia and finished it with honour at  SIT, The University of Sydney, 2003. I was a receipient of Australian Research Council Discovery Early Career Researcher Award (ARC DECRA, 2014 - early 2017). Mailing address: Room. 209, Level 2 4 Research Park Drive School of Computing Macquarie University NSW 2109 Australia Research Research projects TCCT (The Carbon-Conscious Traveller): A cross-platform mobile app that combines navigation, carbon footprint calculation, and visualisation into a single platform to achieve greater awareness of sustainable travel choices, empowering individuals and organisations to reduce their carbon footprint. DEVA: Edge-based dash cam video analytics; multiple mobile devices are harnessed to do distributed real-time video analytics on the move ds-sim: A distributed systems simulator which is simple, language-independent, open-source and practical, w/ realistic failure/job modeling ds-viz: A visualisation tool for ds-sim SAMD (Single Application Multiple Device): Platform-level solution for running portions of mobile (collaboration) app on remote devices without prior installation CollaboRoid: Platform-level solution for sharing resources of multiple heterogeneous smart mobile devices CrowdWare: Distributed platform for collective/collaborative use of Crowd-Sourced Computing Resources inc. laptops, tablet PCs and smartphones. DEWE (Distributed Elastic Workflow Execution): Cloud-native workflow execution system (DEWE 1, DEWE 2 and DEWE 3) Research project offerings The following are projects currenlyt available for Master and PhD studies. However, I'm also interested in several other topics, such as the blockchain oracle problem, security and privacy of mobile apps and distributed video analytics with internet of things (IoT) devices. Sustainabile AI: Carbon-Efficient Computing Artificial intelligence (AI) has emerged as a cornerstone of modern innovation, yet the environmental costs of training large-scale models are staggering. This project directly addresses this sustainability challenge by developing a novel dual-objective framework to optimise AI training and inference across geo-distributed cloud data centres. Unlike current schedulers, which focus on either speed or carbon efficiency in isolation, our framework will dynamically allocate workloads based on real-time carbon intensity and renewable energy availability, minimising emissions without sacrificing performance. Efficient Resource Management for Hyperparameter Optimisation in Machine Learning (ML) Hyperparameter optimisation in ML is of great practical importance in efficiently controlling the learning process and in turn improving the performance of ML models. Finding an optimal set of hyperparameter is a time-consuming process often using an exhausive search method. This project aims to develop an efficient resource management technique for this problem using a parallel processing approach. Decentralised Data Analytics Rapid growth in the number of data sources such as sensors in self-driving cars and wearable gadgets is posing a serious challenge to the centralised cloud-based data analytics in use. This project aims to overcome this challenge by developing innovative techniques and algorithms that realise collaborative distributed systems as a novel underlying technology for decentralised data analytics. Edge computing: bridging the gap between IoT and Clouds Currently, dedicated devices need to be deployed on edge locations for dedicated applications provided by a single service provider. For example, Amazon Web Services (AWS) Greengrass extends AWS services to the end user's location. The IoT devices needs to be preconfigured for the edge equipment to use the edge equipment. The project aims to reduce the network bandwidth usage between IoT/mobile devices and cloud computing systems like Amazon EC2. Sustainable Resource Harnessing for Collaborative Distributed Computing Seamlessly interweaving increasingly capable and prevalent edge devices (such as smartphones and tablets) with reliable and powerful clouds is of great practical importance for ICT sustainability. This project aims to develop a framework for collaborative distributed computing with scalable and energy-aware scheduling and resource pricing solutions. Publications Book chapters [11] Z. Fu and Y. C. Lee, Edge Computing: A future trend for IoT and Big Data Processing, Big Data-Enabled Internet of Things, M. U. S. Khan, S. U. Khan and A. Y. Zomaya (eds.), ch. 20, November, 2019, IET. [10] P. Lu, Y. C. Lee, T. Ryan, V. Gramoli and A. Y. Zomaya, Local Resource Consumption Shaping: A Case for MapReduce, Big Data: Principles and Paradigms, R. Buyya, R. N. Calheiros and A. V. Dastjerdi (eds.), ch. 8, ISBN: 9780128053942, pp. 189–214, June 2016, Morgan Kaufmann. [9] Y. C. Lee, and A. Y. Zomaya, 2013, Immune System Support for Scheduling, Advances in Applied Self-Organizing Systems, 2nd edition, M. Prokopenko (ed.), pp. 11.295-319, Springer, London. [8] N. B. Rizvandi, A. Y. Zomaya, Y. C. Lee, A. J. Boloori and J. Taheri, Multiple Frequency Selection in DVFS-Enabled Processors to Minimize Energy Consumption, Energy Efficient Distributed Computing, A. Y. Zomaya and Y. C. Lee (eds.), ISBN 9780470908754, pp. 17.443-463, New Jersey, USA, August 2012. [7] W. Chen, Y. C. Lee and A. Y. Zomaya, Exploiting Heterogeneous Computing Systems for Energy Efficiency, Handbook of Energy-Aware and Green Computing, S. Ranka and I. Ahmad (eds.), ISBN 9781466501164,  pp. 35.817-834, Chapman & Hall/CRC Press, January 2012. [6] Y. C. Lee, D. T. M. Karunaratne, C. Wang and A. Y. Zomaya, Energy Efficiency Models for Resource Provisioning and Application Migration in Clouds, Cloud Computing: Methodology, Systems, and Applications, L. Wang, R. Ranjan, J. Chen, and B. Benatallah (eds.), ISBN 9781439856413, pp. 17.369-388, CRC Press, Boca Raton, Florida, USA, October 2011. [5] A. Beloglazov, R. Buyya, Y. C. Lee, and A. Y. Zomaya, 2011, A Taxonomy and Survey of Energy-Efficient Data Centers and Cloud Computing Systems, Advances in Computers, M. Zelkowitz (ed), vol. 82, pp. 47-111,ISBN: 978-0-12-385512-1, Elsevier, Amsterdam, The Netherlands. [4] Y. C. Lee, R. Subrata and A. Y. Zomaya, 2008, Efficient exploitation of grids for large-scale parallel applications, Concurrent and Parallel Computing: Theory, Implementation and Applications, A. S. Becker (ed), pp. 8.165-8.184, Nova Science Publishers, USA. [3] Y. C. Lee, and A. Y. Zomaya, 2008, Scheduling in grid environments, Handbook of parallel computing: models, algorithms and applications, S. Rajasekaran and J. Reif (eds), pp. 21.1-21.19, CRC Press, Boca Raton, Florida, USA. [2] Y. C. Lee, and A. Y. Zomaya, 2007, Immune system support for scheduling, Advances in Applied Self-Organizing Systems, M. Prokopenko (ed), pp. 247-270 (Chapter 11), Springer, London. [1] Y. C. Lee, and A. Y. Zomaya, 2005, Parallel computing, Electrical Engineering Handbook, R.C. Dorf (ed), pp. 17.9-17.21, CRC Press, Boca Raton, Florida, USA. Edited books [1] A. Y. Zomaya and Y. C. Lee, Energy Efficient Distributed Computing Systems, Wiley, ISBN 9780470908754, New Jersey, USA, August 2012. Journals [43] S. Lee, J. King, Y. C. Lee, H. Han, S. Kang, In-vehicle edge system for real-time dashcam video analysis. Internet Things 29: 101467, 2025. [42] T. Alrawashdeh, K. Almi'ani, Y. C. Lee, T. H. Rashidi, and Z. H. Mir, Provisioning Deterministic Finite Automata for QoS Monitoring in Blockchain Decentralized Applications, IEEE Access 12: 77379-77392, 2024. [41] F. Sharifi, S. Hessabi, and Y. C. Lee, Cluster-based cooperative fog caching for scalable coded videos of multiple content providers, Internet of Things 28: 101380, 2024. [40] K. Almi'ani, Y.C. Lee, T. Alrawashdeh and A. Pasdar, Graph-Based Profiling of Blockchain Oracles, IEEE Access, 11: 24995-25007, 2023. [39] K. Almiani, M. A. Alrub, Y.C. Lee, T.  H. Rashidi and A. Pasdar, A Blockchain-Based Auction Framework for Location-Aware Services, Algorithms, vol. 16, no. 7, 2023. [38] A. Pasdar and Y.C. Lee, Connect API with Blockchain: A Survey on Blockchain Oracle Implementation. ACM Computing Surveys, vol. 55, no. 10, pp 208:1-208:39, 2023. [37] T. Yang, Y. Hou, Y. C. Lee, H. Ji and A. Y. Zomaya, Power Control Framework for Green Data Centers, IEEE Transactions on Cloud Computing, vol. 10, no. 4, pp. 2876-2886, 2022. [36] Y. Kim, Y. Choi, Y. C. Lee, H. Han, S. Kang, E-Render: Enabling UHD-Quality Cloud Gaming Through Edge Rendering, IEEE Access 10: 72107-72119, 2022. [35] M. Hu, X. Luo, J. Chen, Y. C. Lee, Y. Zhou, D. Wu, Virtual reality: A survey of enabling technologies and its applications in IoT, Journal of Network and Computer Applications, vol. 178, pp. 102970, 2021. [34] A. Pasdar, Y. C. Lee, T. Hassanzadeh, K. Almi'ani, Resource Recommender for Cloud-Edge Engineering, Information, vol. 12. no. 6, pp. 224, 2021. [33] Q. Jiang, Y. C. Lee, A. Y. Zomaya, The Limit of Horizontal Scaling in Public Clouds, ACM Transactions on Modeling and Performance Evaluation of Computing Systems, vol. 5, no. 1, pp. 6:1 - 6:22, 2020. [32] T. Yang, Y. Hou, Y. C. Lee, H. Ji, A. Y. Zomaya, Power Control Framework For Green Data Centers, IEEE Transactions on Cloud Computing (TCC) (in press, accepted August 2020). ",
  "content_length": 44039,
  "method": "requests",
  "crawl_time": "2025-12-01 14:52:58"
}