{
  "name": "Yu-Bin Yang",
  "homepage": "https://cs.nju.edu.cn/yangyubin",
  "status": "success",
  "content": "杨育彬 　 博士 教授 博士生导师 办公室：南京大学仙林校区计算机楼908室 地　址：南京大学计算机科学与技术系 江苏省南京市栖霞区仙林大道163号，210023 E-Mail: yangyubin@nju.edu.cn Tel:+86-25-8968 6966　Fax:+86-25-8968 6966 [个人简介] [研究组简介] [教学与人才培养] [科研项目] [科研奖励] [学术交流] [毕业研究生及去向] [在读博士生] [在读硕士生] What's New 2016.10：研究生毛晓蛟获得南京大学研究生英才奖学金博士一等 2016. 9：研究生朱启海赴美国参加ICIP国际学术会议 2016. 7：研究生毛晓蛟赴西班牙参加NIPS国际学术会议 2015. 6：研究生毛晓蛟赴意大利参加ICME国际学术会议 2015. 6：研究生毛晓蛟赴上海参加ICMR国际学术会议 2013.10：研究生夏永敏获国家奖学金 个人简介 杨育彬　教育部“新世纪优秀人才”、江苏省“333高层次人才”(中青年科学技术带头人)、江苏省“六大人才高峰”第十批高层次人才、南京大学优秀中青年学科带头人、Springer国际期刊《Frontiers of Computer Science》青年编委；南京市“高层次留学归国人员”、IBM Innovation Award 获得者、华为全球创新研究计划项目获得者。长期专注于数字媒体理解、机器学习、数据挖掘等方向的研究。主持多项国家自然科学基金面上项目、江苏省自然科学基金重点项目、江苏省自然科学基金青年科技创新人才学术带头人项目；参与“973”、“863”计划项目、国家自然科学基金创新群体项目、国家自然科学基金重点项目、国家自然科学基金优秀国家重点实验室项目、科技部国际科技合作计划项目，以及澳大利亚、加拿大和香港多项基金研究项目。担任中国人工智能学会“机器学习”专委会、“知识工程与分布智能”专委会、“粗糙集与软计算”专委会委员、江苏省计算机学会人工智能专委会委员。担任国家自然科学基金重大研究计划项目通信评审专家、国家自然科学基金项目信息科学部和地球科学部通信评审专家、科技部国际科技合作计划项目通信评审专家。 ・对非结构化的三维模型数据进行结构化语义分析方面的研究成果获得IBM美国总公司及IBM T. J. Watson研究中心的好评，并因此被评为2007年度IBM Innovation Award获奖者。 ・2005年获得美国海因莱因基金会、中国宇航学会举办的“飞向未来―太空探索创新竞赛”三等奖,并获香港中文大学刘遵义校长亲笔嘉奖信。 [go top] 研究组简介 杨育彬教授领衔的VCU (Visual/Volume Computing & Understanding，视觉/大数据计算及理解)研究组隶属于南京大学计算机软件新技术国家重点实验室和南京大学计算机科学与技术系。 VCU研究组长期以来专注于基于人工智能、机器学习、数据挖掘技术的视觉媒体信息理解、大数据智能分析与挖掘等领域的方法研究及其应用。研究成果已发表于NIPS、ACM Multimedia、TMM等国际著名学术会议和期刊，并在国家电网、华为等大型企业应用实施。 欢迎各位有能力&有兴趣的同学加入VCU的大家庭！ We’ll see you then! :) [go top] 教学与人才培养 ・课程教学: 《人工智能》　　　本科生课程 《程序设计基础》　本科生课程 《数据库新技术》　研究生课程 [go top] 科研项目 ・国家重点基础研究发展计划（973计划）课题 ・教育部新世纪优秀人才支持计划项目 ・科技部国际科技合作计划项目 ・国家自然科学基金重点项目 ・国家自然科学基金面上项目 ・中央高校基本科研项目 ・江苏省自然科学基金重点项目 ・江苏省自然科学基金青年科技创新人才(学术带头人)项目 ・江苏省六大人才高峰项目 ・江苏省科技支撑计划社会发展项目 ・公安部“十二五”重点研究计划项目 ・南京市科技发展计划项目 ・IBM Innovation Award（IBM创新奖励基金）项目 ・人事部留学人员科技选优基金项目 ・南京大学人才引进基金项目 [go top] 科研奖励 [go top] 学术交流 ・学术报告：面向内容的三维模型管理与检索 南京大学计算机科学与技术系，2008年5月27日 ・学术报告：Streamed Data Mining Using Social Network Analysis 澳大利亚新南威尔士大学(UNSW@ADFA)信息技术与电子工程学院，2006年9月15日 ・特邀学术讲座：Applications of Data Mining Technique in Climate and Land Cover Study 香港中文大学地理与资源管理系, 2004年11月11日 ・特邀学术讲座：Spatial Data Mining 香港天文台与香港气象学会联合学术讲座, 2004年9月9日 ・Hong Kong Team Leader，港台学术研讨会:地理资讯管理及其应用 中国台湾, 8.9-8.14, 2004 [go top] 毕业研究生及去向 [go top] 在读博士生 朱启海 甘元柱 沈泽涵 牛中瀚 在读硕士生",
  "content_length": 2198,
  "method": "requests",
  "crawl_time": "2025-12-01 14:53:08"
}