{
  "name": "Yu-Chun Grace Yen",
  "homepage": "https://gracetfg2.github.io",
  "status": "success",
  "content": "Dr. Grace (Yu-Chun) Yen's Homepage Grace (Yu-Chun) Yen NSF Computer Innovation Fellow | Ph.D. in Computer Science | Curriculum Vitae | Research Portfolio I’m joining the Department of Computer Science at the National Yang-Ming Chiao-Tung University (former National Chiao-Tung University in Taiwan) as an assistant professor, starting Spring 2024. I am currently a postdoc researcher at University of California San Diego working with Professor Steven Dow. Prior to UCSD, I earned my PhD degree from the Department of Computer Science at the University of Illinois at Urbana-Champaign, where I worked with Professor Brian Bailey. Before joining UIUC, I hold a M.S. degree from National Taiwan University working with Professor Li-Chen Fu on Smart Home application. My research draws together theories and insights from computer science, psychology, human-centered design, and artificial intelligence. I independently directed a number of research projects: from creativity support tools, collective intelligence, educational technology, to human-AI creative collaboration. My post doc work explores how to repurpose online community into personalized learning environment. My post doc is generously supported by a NSF-based CI Fellowship. I have served as an Area Chair for ACM CHI'24, CSCW'23, Creativty & Cognition'22, the Web Chair for ACM Creativity & Cognition '24, and Registration Chair for ACM Creativity & Cognition '23'. I am looking for motivated undergraduate and graduate students to join my group. If you are interested in working with me, please contact me at yyen@ucsd.edu with your CV, transcripts, and what makes you want to work with me. Publication (Peer-reviewed) C.12 Jane E, Yu-Chun (Grace) Yen, Isa Pan, Grace Lin, Mingyi Lee, Hyoungwook Jin, and Steven Dow. Exploring Tradeoffs in the Timing of Design Feedbac. (In Submission to ACM CHI'24) J.3 Yu-Chun (Grace) Yen, Jane E, Isa Pan, Grace Lin, Mingyi Lee, Hyoungwook Jin, and Steven Dow. ProcessGallery: Illustrating Design Principles through Contrasting Pairs of Early and Late Iterations of Visual Designs. ACM Conference On Computer-Supported Cooperative Work And Social Computing.(CSCW'24 to appear) J.2 Patrick Crain, Jaewook Lee, Yu-Chun (Grace) Yen, Joy Kim, Alyssa Aiello, and Brian Bailey. 2023. Visualizing Topics and Opinions Helps Students Interpret Large Collections of Peer Feedback for Creative Projects. ACM Transaction on Computer-Human Interaction 30, 3, Article 49. https://doi.org/10.1145/3571817. (TOCHI '23) C.11 Grace Yu-Chun Yen and Steven Dow. Seeking Exemplars in the Wild: Exploring How Students Find Design Examples to Support Personalized Learning. Extended Abstract at ACM Learning at Scale (L@S'22) C.10 Chi-Hsien Yen, Haocong Cheng, Grace Yu-Chun Yen, Brian P. Bailey, and Yun Huang. Narratives + Diagrams: An Integrated Approach for Externalizing and Sharing People's Causal Beliefs. Proc. ACM Hum.-Comput. Interact, CSCW2, Article 444 (October 2021). (CSCW'21)) C.9 Yu-Chun Grace Yen, Joy O. Kim, and Brian P. Bailey. Decipher: An Interactive Visualization Tool for Interpreting Unstructured Design Feedback from Multiple Providers. ACM Conference on Human Factors in Computing Systems (CHI ‘20). [pdf] C.8 Chi-Hsien Yen, Yu-Chun Grace Yen, and Wai-Tat Fu. An Intelligent Assistant for Mediation Analysis in Visual Analytics. ACM Conference on Creativity and Cognition (IUI ‘19) [pdf] C.7 Yu-Chun Grace Yen, Steven P. Dow, Elizabeth Gerber and Brian P. Bailey. Listen to Others, Listen to Yourself: Combining Feedback Review and Reflection to Improve Iterative Design. ACM Conference on Creativity and Cognition (C&C) 2017 [pdf] C.6 Helen Wauck, Yu-Chun Grace Yen, Wai-Tat Fu, Steven P. Dow, Elizabeth Gerber and Brian P. Bailey. From in the Class or in the Wild? Peers Provide Better Design Feedback Than External Crowds. ACM Conference on Human Factors in Computing Systems (CHI) 2017[pdf] C.5 Yu-Chun Grace Yen. Enhancing the Usage of Crowd Feedback for Iterative Design. ACM Conference on Creativity and Cognition (C&C) 2017 (Doctoral Consortium) [pdf] C.4 Yu-Chun Grace Yen, Steven P. Dow, Elizabeth Gerber and Brian P. Bailey. Social Network, Web Forum, or Task Market?: Comparing Different Crowd Genres for Design Feedback Exchange. ACM Conference on Designing Interactive Systems (DIS) 2016[pdf] J.1 Chun-Feng Liao, Yu-Chun Grace Yen, Yu-Chiao Huang, Li-Chen Fu. An Empirical Study on Engineering a Real-World Smart Ward Using Pervasive Technologies. IEEE Systems Journal 2016 [pdf] C.3 Yu-Chiao Huang, Chun-Feng Liao, Yu-Chun Yen, Li-Jen Hou, Li-Chen Fu, Chia-Hui Chen, Chiung-Nien Chen. An Extensible Situation-Aware Caring System for Real-World Smart Wards. International Conference on Smart Homes and Health Telematics (ICOST) 2012[pdf] C.2 Yu-Chun Yen, Jiun-Yi Li, Ching-Hu Lu, Tsung-Han Yang and Li-Chen Fu. Human-Centric Situational Awareness in the Bedroom. International Conference on Smart Homes and Health Telematics (ICOST) 2011[pdf] C.1 Yu-Chun Yen, Ching Hu Lu, Yi Chung Cheng, Jing Siang Chen, Li Chen Fu. Towards an Evidence-Based and Context-Aware Elderly Caring System Using Persuasive Engagement. International Conference on Human-Computer Interaction (HCII) 2011[pdf] Master's Thesis T.1 Yu-Chun Yen. Human centric and Context aware Perva sive Healthcare System in the Hospital for Elderly People. 2011. National Taiwan University. [pdf] Patent P.1 Yu-Chun Yen, Li-Chen Fu, Tsung-Han Yang, Fang-Cheng Liu, Chun-Feng Liao.An information processing system based on multi-layer inference architecture. Taiwan Patent ID: I486914. June, 2015-May, 2032 [LINK] Education University of Illinois at Urbana-Champaign | Ph.D. in Computer Science Human-Computer Interaction (Interactive Computing) Dissertation Title | Turning feedback to actions through reflection, paraphrasing, and visualization. Committee | Dr. Brian P. Bailey (Advisor@UIUC), Dr. Karrie G. Karahalios (UIUC), Dr. Steven Dow (UCSD), Dr. Joy O. Kim (Adobe Research). Keywords crowdsourced feedback, creativity support tools, data visulization, feedback workflow. Methods contextual interview, survey, behavioral analysis, prototype testing, statistic analysis, qualitative coding. National Taiwan University | M.S in Computer Science Intelligent Robot and Automation Lab (Smart Home Group) Master's Thesis | Human-centric and situation-aware pervasive healthcare system in the hospital for elderly People. Committee | Dr. Li-Chun Fu (Advisor@NTU), Dr. Chiung-Nien Chen (NTU Medicine), Dr. Cheryl Chia-Hui Chen (NTU Nursing), Dr. Mu-Chun Su (NCU HCI). Keywords pervasive computing, activity recognition, healthcare, artificial intellegence, persuasive technology. Methods ethnography research, focus group, iterative prototyping, machine learning, interview. National Taiwan Normal University | B.S in Computer Science Computer Vision and Image Understanding Lab Senior Thesis | Vision-based Gymnastics Motion Recognition System. Advisor | Dr. Chiung-Yao Fang Projects (Selected) Decipher: An Interactive Visualization Tool for Interpreting Unstructured Design Feedback from Multiple Providers ACM CHI'20 In creative work such as design, writing, and engineer, intreprting feedback from diverse audiences is hard because the feedback can vary in focus, differ in structure, and contradict each other. In this work, we conducted a formative study identifying the common strategies and criteria that experts employ when interpreting feedback from multiple providers. Based on the findings, we created a new tool (Decipher) that enables designers to visualize and navigate a collection of feedback using its topic and sentiment structure. We found that Decipher helped users feel less overwhelmed during feedback interpretation tasks and better attend to critical issues and conflicting opinions compared to using a typical document-editing tool. screener survey interview think-aloud approach qualitative coding within-subjects experiments comparative survey one-sampled t-test Combining Feedback Review and Reflection to Improve Iterative Design ACM CC'17 For feedback to be effective, it requires the recipient to interpret, learn, and act on it. To help users better translate feedback into actions, we draw inspirations from learning and design by developing a lightweight reflection activity and testing its placement relative to feedback review for iterative design. We found that reflection after feedback review led to the largest increase in the revised design quality and without designers over-estimating the amount of improvement they made. Designers reported that the reflection activity helped them recall their design goals, question their choices, and plan and prioritize their revisions. This work offers deeper empirical understanding of how ordering reflection and feedback review affects designers’ performance and perceptions for acreative design task. We also offer implications for implementing a reflection activity in feedback platforms to encourage its adoption. online user study between-subjects experiments task analysis (logged data analysis) survey qualitative coding ANOVA + post-hoc tests Investigating How Crowd Incentives Affect Online Feedback Generation ACM DIS'16, ACM CHI'17 Increasingly, users seek feedback on their creative work from social networks, Web forums, and paid task markets which demand different amounts of social capital, financial resources, and time. However, it is unclear how the choice of the crowd platform affects feedback generation. In this study, we recruited designers to create visual designs for problems of their own choosing and revised the designs based on the feedback received from MTurk (financial), designers’ own social networks accessed via Facebook, Twitter, and email (social), and Reddit or other Web forums (enjoyment). We measured key attributes of the feedback including perceived quality, quantity, length, and valence; and categorized its content. Based on the results, we formulate an emergent framework for recommending w",
  "content_length": 14820,
  "method": "requests",
  "crawl_time": "2025-12-01 14:53:08"
}