{
  "name": "Yu-Lun (Alex) Liu",
  "homepage": "https://yulunalexliu.github.io",
  "status": "success",
  "content": "Yu-Lun Liu Yu-Lun (Alex) Liu | 劉育綸 I am an Assistant Professor in the Department of Computer Science at National Yang Ming Chiao Tung University. I work on image/video processing, computer vision, and computational photography, particularly on essential problems requiring machine learning with insights from geometry and domain-specific knowledge. Prior to joining NYCU, I was a Research Scientist Intern at Meta Reality Labs Research and a senior software engineer at MediaTek Inc. I received my PhD from NTU, CSIE in 2022, where I was a member of CMLab. I received the 教育部玉山青年學者, 國科會 2030 新秀學者, Google Research Scholar Award, 李國鼎青年研究獎, 資訊年輕學者卓越貢獻獎, and CVPR 2024 Outstanding Reviewer award. Dear prospective students: I am looking for undergraduate / master's / Ph.D. / postdoc students to join my group. If you are interested in working with me and want to conduct research in image processing, computer vision, and machine learning, don't hesitate to contact me directly with your CV and transcripts. Email  / CV  / Google Scholar  / Facebook  / Instagram  / Github  / YouTube For those who personally know me, that might be thinking: Who is this guy? Hover over to see how I usually look like before a paper submission deadline. Meet my cats: 虎皮捲 and 雞蛋糕! Timeline 2023 - Assistant Professor at NYCU Comp Photo Lab, Department of Computer Science 2022 Research Scientist Intern at Meta Worked with Prof. Jia-Bin Huang and Dr. Johannes Kopf Computational Photography Group Seattle, WA, USA 2017 - 2022 Senior Software Engineer at MediaTek Inc. Multimedia Technology Development (MTD) Division Intelligent Vision Processing (IVP) Department 2017 - 2022 NTU: PhD CMLab, CSIE Worked with Prof. Yung-Yu Chuang Thesis: Restoring and Enhancing Images and Videos by Combining Modeling and Learning 2014 - 2017 Software Engineer at MediaTek Inc. Multimedia Technology Development (MTD) Division Intelligent Vision Processing (IVP) Department 2012 - 2014 NCTU: MS CommLab, Institute of Electronics Worked with Prof. Hsueh-Ming Hang Thesis: Wide-Angle Virtual View Synthesis with Depth-Based Background Modeling 2008 - 2012 NCTU: BS Department of Electronics Engineering News Nov 2025: Four conference papers accepted to WACV 2026 Nov 2025: Invited Seminar at NTHU Sep 2025: One conference paper accepted to NeurIPS 2025 Aug 2025: One conference paper conditionally accepted to SIGGRAPH Asia 2025 Aug 2025: One conference paper accepted to CoRL 2025 July 2025: BS students 司徒立中, 吳定霖, and 徐和 won the 陽明交大資工系專題競賽佳作! July 2025: BS students 李宗諺 and 楊宗儒 won the 陽明交大資工系專題競賽優等! July 2025: Talk at MediaTek Inc. June 2025: Four conference papers accepted to ICCV 2025 June 2025: BS students 孫揚喆 and 吳定霖 are awarded the 國科會大專學生研究計畫! Mar 2025: Honored to receive the 中華民國資訊學會李國鼎青年研究獎! Feb 2025: Five conference papers accepted to CVPR 2025 Jan 2025: One conference paper accepted to ICLR 2025 Dec 2024: Honored to receive the 陽明交大資訊學院資訊年輕學者卓越貢獻獎! Nov 2024: MS student 鄭伯俞 won the 第 29 屆人工智慧與應用研討會 TAAI 2024 碩士論文佳作獎! Nov 2024: Two conference papers accepted to WACV 2025 Sep 2024: Three conference papers accepted to NeurIPS 2024 Sep 2024: Talk at NYCU Library Aug 2024: MS student 鄭伯俞 won the 中華民國影像處理與圖形識別學會碩士佳作論文獎! July 2024: BS student 李杰穎 won the 陽明交大資工系專題競賽佳作! July 2024: BS students 吳俊宏, 陳士弘, 陳凱昕, and 陳昱佑 won the 陽明交大資工系專題競賽優等! July 2024: One conference paper accepted to ECCV 2024 June 2024: One conference paper accepted to IROS 2024 June 2024: Excited and honored to have been selected as a 國科會 2030 新秀學者! June 2024: BS students 蘇智海 and 李杰穎 are awarded the 國科會大專學生研究計畫! May 2024: Honored to win a CVPR 2024 Outstanding Reviewer award! April 2024: Excited and honored to receive a Google Research Scholar Award! Mar 2024: Two conference papers conditionally accepted to SIGGRAPH 2024 Mar 2024: Invited Seminar at NTU Feb 2024: Two conference papers accepted to CVPR 2024 Feb 2024: Keynote at 2024 Fun AI Winter Camp Jan 2024: BS student 蘇智海 won the 陽明交大資工系專題競賽特優! Jan 2024: One conference paper accepted to ICLR 2024 Jan 2024: One Journal paper accepted to IJCV 2024 Dec 2023: One conference paper accepted to AAAI 2024 Aug 2023: Honored to receive Google's Research Grant! Aug 2023: Honored to receive the 中華民國影像處理與圖形識別學會博士優等論文獎! July 2023: Excited and honored to have been selected as a 教育部玉山青年學者! July 2023: Two conference papers accepted to ICCV 2023 May 2023: Talk at MediaTek Inc. April 2023: Invited Seminar at NTHU Mar 2023: Talk at the 5th AII Workshop Mar 2023: Invited Seminar at NYCU Mar 2023: Two conference papers accepted to CVPR 2023 Jan 2023: Talk at Academia Sinica Nov 2022: Invited Seminar at NTHU Research Group Postdoc 赵祯俊PhD, CUHK Research Assistants 陳霆軒BS, NCHU AMATHnow MS student @ USC 簡浩任MS, UCLA ECE 李沅罡MS, NTU GICE 楊承諭MS, NTHU CS 李家銘MS, NCKU DS PhD Students 黃怡川Institute ofComputer Science 黃正輝NTU CSIEwith Yung-Yu Chuang 端木竣偉Institute ofComputer Science 呂承祐UTS CSwith Chin-Teng Lin 蘇智海Institute ofComputer Science 林晉暘Institute of Computer Sciencewith Wei-Chen Chiu 范丞德Institute of Computer Sciencewith Yu-Chee Tseng 李杰穎Institute of Computer Sciencenow SWE @ Google 劉珆睿Institute of Computer Sciencenow MS student @ UIUC MS Students 陳捷文Institute ofComputer Science 許皓翔Institute of Computer Sciencewith Wen-Chieh Lin 張宸瑋Institute of AI Innovationwith Jiun-Long Huang 陳映寰Institute ofComputer Science 張欀齡Institute ofComputer Science 鄭淮薰Institute ofComputer Science 柯柏旭Institute of Computer Sciencewith Wei-Chen Chiu 王皓平Institute ofMultimedia 戚維凌Institute ofMultimedia 俞柏帆Institute ofComputer Science 黃靖恩Institute of Data Sciencewith Jun-Cheng Chen 張維程Institute ofData Science 司徒立中Institute ofComputer Science 吳定霖NTU GICEwith Yu-Chiang Frank Wang 張智堯Institute of Multimediawith Yu-Ting Wu 陳光齊Institute ofComputer Science 趙啟翔Institute ofData Science 何義翔NTU GINMwith Yung-Yu Chuang BS Students 胡智堯NTU MED 李明謙NYCU ARETEHP 孫揚喆NYCU MED 李宗諺NYCU CS 楊宗儒NYCU CS 蔡師睿NYCU CS 朱驛庭NYCU CS 徐和NYCU CS 翁晨昱NTHU PHYS 謝侑哲NYCU CS 蔡聿瑋NTU CSIE 鄭名翔NYCU ARETEHP 葉家蓁NYCU CS 林揚森NYCU ME & CS 蔡昀錚NYCU CSwith Yen-Yu Lin 邢捷Shanghai UniversityMATH 葉孟昀NYCU MS & CS 徐顥NYCU MS & CS 李佑軒NYCU CS 周廷威NYCU CS 陳芝瑄NYCU CS 曾士珍NYCU CS 楊睿軒NYCU CS 陳璽安NYCU CS 張盛瑋NYCU CSwith Wei-Chen Chiu 劉彥廷NYCU CSwith Wei-Chen Chiu 彭程NYCU CSwith Wei-Chen Chiu 曾煥宗NYCU CS 徐少晞NYCU CS 張芷瑜NYCU CS Alumni 鄭伯俞MS Spring 2023with Wei-Chen ChiuNext Qualcomm 陳俊瑋BS 2023Next MS StudentNYCU 林奕杰BS 2023-2024 羅宇呈BS 2023-2024 郭玠甫BS 2023-2024 葉柔昀BS 2023-2024 鄭又豪BS 2023-2024 丁祐承BS 2023-2024 謝明翰BS 2023-2024 施惟智BS 2023-2024 朱劭璿MS Spring 2024Next PhD StudentJohns Hopkins 吳秉宸MS Fall 2024 陳士弘BS 2023-2024Next MS studentNYCU 陳昱佑BS 2023-2024 陳凱昕BS 2023-2024Next MS studentNYCU 吳俊宏BS 2023-2024Next MS studentNYCU 葉長瀚RA 2023-2024Next MS studentUIUC 陳楊融BS 2023-2025Next MS studentColumbia University 吳中赫MS 2023-2025Next Qualcomm 林佑庭MS 2023-2025with Yen-Yu LinNext Google 黃亭幃MS 2023-2025with Yen-Yu Lin 嚴士函MS 2023-2025 Research All Papers Representative Image and Video Synthesis and Generation 3D from Multi-view and Sensors Low-level Vision Video: Low-level Analysis, Motion, and Tracking Computational Imaging Humans: Face, Body, Pose, Gesture, Movement Vision + Graphics Segmentation, Grouping and Shape Analysis Computer Vision for Robotics Embodied Vision: Active Agents, Simulation 3D from Single Images Medical and Biological Vision, Cell Microscopy Adversarial Attack and Defense Photogrammetry and Remote Sensing Physics-based Vision and Shape-from-X Autonomous Driving Vision, Language, and Reasoning Recognition: Categorization, Detection, Retrieval Representative Papers 2025 Your browser does not support the video tag. Skyfall-GS: Synthesizing Immersive 3D Urban Scenes from Satellite Imagery Jie-Ying Lee, Yi-Ruei Liu, Shr-Ruei Tsai, Wei-Cheng Chang, Chung-Ho Wu, Jiewen Chan, Zhenjun Zhao, Chieh Hubert Lin, Yu-Lun Liu arXiv, 2025 project page / arXiv This paper proposes Skyfall-GS, the first city-block scale 3D scene creation framework without costly 3D annotations, also featuring real-time, immersive 3D exploration, and tailor a curriculum-driven iterative refinement strategy to progressively enhance geometric completeness and photorealistic textures. FIPER: Factorized Features for Robust Image Super-Resolution and Compression Yang-Che Sun, Cheng Yu Yeo, Ernie Chu, Jun-Cheng Chen, Yu-Lun Liu NeurIPS, 2025 project page / arXiv / code [coming soon] This work replaces the representation of prior models from simple feature maps with Factorized Features to validate the potential for broad generalizability and further optimize the compression pipeline by leveraging the mergeable-basis property of the authors' Factorized Features, which consolidates shared structures on multi-frame compression. LightsOut: Diffusion-based Outpainting for Enhanced Lens Flare Removal Shr-Ruei Tsai, Wei-Cheng Chang, Jie-Ying Lee, Chih-Hai Su, Yu-Lun Liu ICCV, 2025 project page / arXiv / code / video / demo LightsOut, a diffusion-based outpainting framework tailored to enhance SIFR by reconstructing off-frame light sources by leveraging a multitask regression module and LoRA fine-tuned diffusion model to ensure realistic and physically consistent outpainting results. Your browser does not support the video tag. StealthAttack: Robust 3D Gaussian Splatting Poisoning via Density-Guided Illusions Bo-Hsu Ke, You-Zhe Xie, Yu-Lun Liu, Wei-Chen Chiu ICCV, 2025 project page / arXiv / code / results This work analyzes 3DGS robustness against image-level poisoning attacks and proposes a novel density-guided poisoning method that strategically injects Gaussian points into low-density regions identified via Kernel Density Estimation (KDE), embedding viewpoint-dependent illusory objects clearly visible from poisoned views while minimally affecting innocent views. Your browser does not support the video tag. LongSplat: Robust Unposed 3D Gaussian Splatting for Casual Long Videos Chin-Yang Lin, Cheng Sun, Fu-En Yang, Min-Hung Chen, Yen-Yu Lin, Yu-Lun Liu ICCV, 2025 project page / arXiv / code LongSplat is introduced, a robust unposed 3D Gaussian Splat",
  "content_length": 31662,
  "method": "requests",
  "crawl_time": "2025-12-01 14:53:10"
}