{
  "name": "Yu-Ru Lin",
  "homepage": "http://www.yurulin.com",
  "status": "success",
  "content": "Yu-Ru Lin Yu-Ru Lin about research publication teaching service lab cv Research & Academic Director Institute for Cyber Law, Policy and Security (Pitt Cyber) Professor Department of Informatics and Networked Systems | School of Computing and Information | University of Pittsburgh Secondary appointments: Political Science Department | Computer Science Department | Intelligent Systems Program (ISP) Office: 130 North Bellefield Ave., Pittsburgh, PA 15260 Phone: 412-624-9470 Fax: 412-624-5231 Email: yurulin (at) pitt.edu I am a professor at the School of Computing and Information, University of Pittsburgh. I am also the Research & Academic Director at the Institute for Cyber Law, Policy and Security (Pitt Cyber). I am interested in studying social and political networks as well as ways to understand network data through computation and visualization. My work has primarily centered on large-scale community dynamics, high-dimensional (rich-context) social information summarization, and representation. I have used large amounts of social media data, anonymized cellphone records, surveys, and other mixed methods to understand how groups of people react to social and political events and exogenous shocks such as natural disasters. I lead the PITT Computational Social Dynamics Lab (PICSO LAB). I am a computer scientist by training, and a computational social scientist working on questions like: \"how would a society be informed?\" \"how do people share information, ideas and opinions in various contexts?\" These questions have led me to explore analytical and computational techniques for mining heterogeneous, multi-relational, and semistructured data that can advance our understanding about structures in networked societies. I was a postdoctoral research fellow at the Institute for Quantitative Social Science, Harvard University and College of Computer and Information Science, Northeastern University. » Recruiting:   I am looking for highly motivated students who have strong interest in pursuing research careers in the areas of Data Science, Network Science, and Computational Social Science. See more information at PICSO LAB.",
  "content_length": 2149,
  "method": "requests",
  "crawl_time": "2025-12-01 14:53:12"
}