{
  "name": "Yu-Shen Liu",
  "homepage": "https://yushen-liu.github.io",
  "status": "success",
  "content": "Yu-Shen Liu - Tsinghua University Bio Participated Projects Teaching Awards Academic Activities Publications AI Conference Deadlines 中文版本 Yu-Shen Liu （刘玉身） Associate Professor School of Software, Tsinghua University, Beijing, P. R. China Contacts: E-mail:liuyushen@tsinghua.edu.cn E-mail:liuyushen00@gmail.com Tel:+86-10-62795455 HomePages: Tsinghua homepage, Google Scholar, DBLP, CSRanking Dr. Yu-Shen Liu is an Associate Professor in School of Software at Tsinghua University, China. He spent three years as a post-doctoral researcher in Purdue University from 2006 to 2009. He earned his PhD in the Department of Computer Science and Technology at Tsinghua University, China, in 2006. He received his BS in mathematics from Jilin University, China, in 2000. His current research interests include 3D computer vision, 3D reconstruction and generation, 3D foundation models, AI for industry, and building information modeling (BIM). He has served as Area Chair, senior PC and PC members for some top conferences, such as IJCAI, AAAI, ACM Multimedia, ICLR. He has published 60+ papers in top journals and conferences like TPAMI/TIP/CVPR/ICCV/ECCV/NeurIPS/ICML/AAAI/IJCAI/ACM MM, with a total of more than 5,600 citations on Google Scholar. He has undertaken 5 National Natural Science Foundation projects as PI, and 2 National Key R&D Program projects, and participated in the compilation of three national standards (ranked 3rd). His group has received the 2022 Outstanding Doctoral Dissertation Award of the Chinese Society of Graphics (CSG), the 2021 \"Outstanding Graphics Open Source Dataset\" Award of the Computer-Aided Design and Graphics Professional Committee of the Chinese Computer Society (CCF CAD&CG), the Highly Cited Research Award by Advanced Engineering Informatics (the Elsevier journal), the Best Student Presentation Award of ICCCBE 2016, and the Best Student Paper Award of CAD/Graphics 2005. One TPAMI paper was selected as an ESI highly cited paper, and he was listed in 2024 World's Top 2% Scientists released by Stanford University and Elsevier. His teaching achievements have won the Tsinghua University Excellent Courses, Tsinghua University Annual Teaching Excellence Award, Tsinghua University Outstanding Class Teacher First Prize (2 times), etc., and the graduate students guided by him have won the Beijing Outstanding Graduates, Tsinghua University Outstanding Graduates, and Tsinghua University Outstanding Dissertations for several times. Education 2000-2006: Tsinghua University, Ph.D. in Computer Science and Technology. 1996-2000: Jilin University, B.Sc. in Mathematics Experience 2009- present: School of Software at Tsinghua University, Beijing, China. 2006-2009: Purdue University, West Lafayette, IN, USA. Postdoctoral researcher in School of Mechanical Engineering Research Interests 3D Computer Vision, 3D Deep Learning 3D Representation and Recognition, 3D Geometry Processing and Semantic Understanding, 3D Reconstruction Building Information Modeling (BIM) Currently, I am looking for PhD students and Research Assistants to work on the top publications. Please feel free to contact me. Participated Fundings 1. NSF of China: Research on Semantic-Instance Segmentation and Shape Completion for 3D Point Clouds based on Feature Representation Learning (62072268), 2021.01-2024.12, PI. 2. National Key R&D Program of China (2020YFF0304100), 2020.10-2022.12, PI of sub-project. 3. National Key R&D Program of China (2018YFB0505403), 2018.05-2022.04, PI. 4. NSF of China: Studies on semantic retrieval for building information modeling (BIM) resources based on IFC (61472202), 2015.01-2018.12, PI. 5. NSF of China: Studies on shape matching for 3D articulated models based on metric geometry (61272229), 2013.01-2016.12, PI. 6. NSF of China: Study of non-rigid 3D shape retrieval (61003095), 2011.01-2013.12, PI. 7. National Technological Support Program for the 12th-Five-Year Plan of China (2012BAJ03B07), 2012.01-2015.09, main researcher. 8. NSF of China: China building information technology strategic research (U0970155), finished, main researcher. Teaching Instructor: \"Fundamental of Programming\", the undergraduate course, 2017-present Tsinghua University Excellent Course Award (2021-2024), 2021 - (Top 25%) Instructor: “Digital Geometry Processing”, the graduate course, 2016 - present Tsinghua University Annual Teaching Excellence Award 2018 - (Top 5%) Instructor: “Software Engineering (1)”, the undergraduate course, 2013 - 2016 Co-Instructor: “Business Process and Asset Management”, the graduate course, 2015 - present Co-Instructor: “Digital Media (2)”, the graduate course, 2019 Tsinghua University Excellent Class Advisor (First Prize), 2017 Awards Best Open Graphics Benchmark Award in the field of the CAD/Graphics area in 2021, which is selected by Technical Committee on Computer Aided Design and Computer Graphics (TCCADCG) affiliated with the China Computer Federation (CCF). In 2021, he led his team to win the ranked 3rd place in MVP Point Cloud Completion Challenge 2021 at ICCV 2021 - The 3rd Workshop on Sensing, Understanding and Synthesizing Humans. Highly Cited Research Award The paper, “The IFC-based path planning for 3D indoor spaces”, published in Advanced Engineering Informatics (the Elsevier journal) is awarded Highly Cited Research on December, 2016. This paper was published in 2013, which is one of the most highly cited papers during 2014, 2015 and up until June 2016 according to data from Scopus. Dr. Yu-Shen Liu is the corresponding author of this paper. [Project Page] [Paper] [Bib] Best Student Presentation Award, at the 16th International Conference on Computing in Civil and Building Engineering (ICCCBE2016), held on July 6-8, at 2016, Osaka, Japan. Dr. Yu-Shen Liu is the corresponding author of this paper, and Mr. Ge Gao is the first author. [Paper] Best Student Paper Award, at the Proceedings of the Ninth International Conference on Computer Aided Design and Computer Graphics (CAD-CG'05), 306–312, September, 2005, Hong Kong, China. Academic Activities Senior Program Committee member at IJCAI 2021, AAAI 2022 Program Committee member at ACM Multimedia 2020, ACM Multimedia 2019 Program Committee member at AAAI 2021, AAAI 2020 Program Committee member at LCLR 2021 Program Committee member at IJCAI 2020, IJCAI 2019 Program Committee member at WACV 2020, GDC 2019, CAD&CG 2019, ACM Multimedia Asia 2019 Program Committee of EG-ICE 2019(European Group for Intelligent Computing in Engineering) The editorial team of Construction Innovation: Information, Process, Management (CI), 2018 ~ present. http://www.emeraldgrouppublishing.com/products/journals/editorial_team.htm?id=CI Co-chairs of PLM Smart Manufacturing Workshop, 2018 Asian Conference on Design and Digital Engineering (ACDDE2018) The program committee of AUAPAF2018 (Asian Universities Alliance Postgraduate Academic Forum) Editorial Board Member on the international journal Smart Construction Research, 2017 ~ present Lead Guest Editor: Special Issue on Recent Advances on Building Information Modeling (BIM) The Scientific World Journal, 2013. (SCI, 2012 Impact factor: 1.730)   [Bib]http://www.hindawi.com/journals/tswj/si/465058/cfp/ Guest Editor: Special Issue on Advances in Conceptual Design Theories, Methodologies, and Applications. Advances in Mechanical Engineering, 2013. (SCI, 2012 Impact factor: 1.062) http://www.hindawi.com/journals/ame/si/293862/ The member on IFC Alignment 1.1 Expert Panel in buildingSMART The group of buildingSMART IFC Roads and Railway Standard. Reviewer for IEEE Transactions on Image Processing (TIP), CVPR, ICCV, IJCAI, AAAI, ACM Multimedia, ICME, Automation in Construction, Computer-Aided Design, ASME Journal of Mechanical Design, The Visual Computer, Computers & Graphics, International Journal of Precision Engineering and Manufacturing, Applied Stochastic Models in Business and Industry. Selected Publications (*: corresponding author, #: co-first author) 2026 Qing Li, Huifang Feng*, Kanle Shi, Yue Gao, Yi Fang, Yu-Shen Liu*, Zhizhong Han. PFF-Net: Patch Feature Fitting for Point Cloud Normal Estimation. IEEE Transactions on Visualization and Computer Graphics (TVCG), 2025, accepted. [ArXiv] [PDF] Peng Xiang, Liang Han, Hui Zhang*, Yu-Shen Liu*, Zhizhong Han. VGGS: VGGT-guided Gaussian Splatting for Efficient and Faithful Sparse-View Surface Reconstruction. The 40th Annual AAAI Conference on Artificial Intelligence (AAAI), 2026. 2025 Wenyuan Zhang#, Jimin Tang#, Weiqi Zhang, Yi Fang, Yu-Shen Liu*, Zhizhong Han. MaterialRefGS: Reflective Gaussian Splatting with Multi-view Consistent Material Inference. Neural Information Processing Systems (NeurIPS), 2025. [Project Page] [ArXiv] [PDF] Junsheng Zhou#, Xingyu Shi#, Haichuan Song*, Yi Fang, Yu-Shen Liu*, Zhizhong Han. U-CAN: Unsupervised Point Cloud Denoising with Consistency-Aware Noise2Noise Matching. Neural Information Processing Systems (NeurIPS), 2025. [Project Page] [ArXiv] Qing Li, Huifang Feng, Xun Gong, Yu-Shen Liu. VA-GS: Enhancing the Geometric Representation of Gaussian Splatting via View Alignment. Neural Information Processing Systems (NeurIPS), 2025. [ArXiv] [PDF] [Github] Chao Chen, Yu-Shen Liu*, Zhizhong Han. NeuralTPS: Learning Signed Distance Functions without Priors from Single Sparse Point Clouds. IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI), 2025, 47(1): 565-582. [PDF] [Github] Shengtao Li, Yudong Liu, Ge Gao*, Ming Gu, Yu-Shen Liu. I-Filtering: Implicit Filtering for Learning Neural Distance Functions from 3D Point Clouds. IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI), 2025. [Project Page] [PDF] [Github] Liang Han, Xu Zhang, Haichuan Song*, Kanle Shi, Yu-Shen Liu*, Zhizhong Han. SparseRecon: Neural Implicit Surface Reconstruction from Sparse Views with Feature and Depth Consistencies. Proceedings of the IEEE/CVF International Conference on Computer Vision (ICCV), 2025. [Project Page] [ArXiv] [PDF] Weiqi Zhang#, Junsheng Zho",
  "content_length": 45803,
  "method": "requests",
  "crawl_time": "2025-12-01 14:53:11"
}