{
  "name": "Yu Charlie Hu",
  "homepage": "https://engineering.purdue.edu/~ychu",
  "status": "success",
  "content": "Y. Charlie Hu Y. Charlie Hu Michael and Katherine Birck Professor of Electrical and Computer Engineering Professor of Computer Science (by courtesy) Systems and Networking Group PurNET Lab Purdue University (See also the official home page) Address: Purdue University, Elmore Family School of ECE, EE Building, 465 Northwestern Ave., West Lafayette, Indiana 47907-2035 Phone: 765-494-9143 Links: Google Scholar, Press, Awards, Software Release, Talks, 15 Rep. Papers, Ph.D. Graduates, Publications (by date by type), Patents News: Students: I am looking for 1 PhD student with strong system building skills to join our energy-efficient AI systems/edge AI systems research starting 2026. TraffGen: We released the 1st Cellular network control-plane traffic generator. Y. Charlie Hu's research interests are in Mobile Systems, Distributed Systems, Operating Systems, and Computer Networks. He is an IEEE Fellow and an ACM Distinguished Scientist. He received his Ph.D. in Computer Science from Harvard in 1997. He is a recipient of the Honda Initiation Grant Award, NSF CAREER Award, Purdue University College of Engineering Early Career Research Award, Purdue University Faculty Scholar, Purdue PRF Innovator Hall of Fame, and Purdue Engineering Most Impactful Faculty Inventors of 2019 and 2020. He has served as a General Co-Chair of ACM SIGCOMM 2014, and Program Committee Co-Chair of ACM MobiCom 2016, ACM SIGOPS EuroSys 2018, and IEEE ICNP 2021. Since 2010, his research group has conducted ground-breaking work on energy profiling and energy debugging on smartphones which has been widely covered by over 500 news media such as ABC News, BBC News, NBC News, Times of India, MIT Tech Review, and Scientific American. Many of the technologies have been adopted by the mobile industry and are helping to extend the battery life of hundreds of millions of smartphones. His pioneering work on smartphone energy management has been recognized with ACM SIGOPS EuroSys 2012 Best Student Paper Award, ACM MobiCom 2022 Best Community Paper Award, 2022 ACM SIGOPS EuroSys Test-of-Time Papar Award, and 2023 ACM SIGMOBILE Test-of-Time Papar Award, as well as Industry awards including Google Research Award and Qualcomm Faculty Award. Selected Publications Edge AI Systems, AR/VR, LLM Systems PPIPE: Efficient Video Analytics Serving on Heterogeneous GPU Clusters via Pool-Based Pipeline Parallelism (USENIX ATC 2025) ARISE: High-Capacity AR Offloading Inference Serving via Proactive Scheduling (MobiSys 2024) AccuMO: Accuracy-Centric Multitask Offloading in Edge-Assisted Mobile Augmented Reality (MobiCom 2023) BystandAR: Protecting Bystander Visual Data in Augmented Reality Systems (MobiSys 2023) Do We Need Sophisticated System Design for Edge-assisted Augmented Reality? (EdgeSys 2022, Best Paper Award) Enhancing Video Analytics Accuracy via Real-time Automated Camera Parameter Tuning (SenSys 2022) Do Larger (More Accurate) DNN Models Help in Edge-Assisted AR? (SIGCOMM NAI 2021) Coterie: Exploiting Frame Similarity to Enable High-Quality Multiplayer VR on Commodity Mobile Devices (ASPLOS 2020) Furion: Engineering High-Quality Immersive Virtual Reality on Today's Mobile Devices (MobiCom 2017) (350 cites) 5G Networks Exploring the 5G Digital Divide in the Non-Contiguous US: LEO Satellites to the Rescue? (SIGMETRICS 2026) A First Large-Scale Study of Operational 5G Standalone Networks (CoNEXT 2025) Replication: \"Performance of Cellular Networks on the Wheels\" (IMC 2025) 5G Metamorphosis: A Longitudinal Study of 5G Performance from the Beginning (IMC 2025) High-Fidelity Cellular Network Control-Plane Traffic Generation without Domain Knowledge (IMC 2024) Modeling and Generating Control-Plane Traffic for Cellular Networks (IMC 2023, Best Paper Award Runner-up) Performance of Cellular Networks on the Wheels (IMC 2023) Mobility Support in Cellular Networks: A Measurement Study on Its Configurations and Implications (IMC 2018) Energy Profiling, Debugging, and Analytics: The Foundation of AEM (App Energy Management) Experience: Developing a Usable Battery Testing and Diagnostic Tool for the Mobile Industry (MobiCom 2021, Best Community Paper Award) Proactive Energy-Aware Adaptive Video Streaming on Mobile Devices (USENIX ATC 2021) How much battery does dark mode save? An Accurate OLED Display Power Profiler for Modern Smartphones (MobiSys 2021) (press) Why is my app draining more battery? Energy Optimization via Diffing Similar Apps (OSDI 2018) A Fine-grained Event-based Modem Power Model for Enabling In-depth Modem Energy Drain Analysis (Sigmetrics 2018) GfxDoctor: A Holistic Graphics Energy Profiler for Mobile Devices (EuroSys 2017) Unsafe Time Handling in Smartphones (USENIX ATC 2016) Smartphone Background Activities in the Wild: Origin, Analysis and Optimization (MobiCom 2015) (read BBC and Internet-wide media coverage 100 cites) Smartphone Energy Drain in the Wild: Analysis and Implications (Sigmetrics 2015) (Podcast by Scientific American) (150 cites) On Death, Taxes, and Sleep Disorder Bugs in Smartphones (HotPower 2013) How Much Energy Can We Save from Prefetching Ads? Energy Drain Analysis of Top 100 Apps (HotPower 2013) Hypnos: Understanding and Treating Sleep Conflicts in Smartphones (EuroSys 2013) Characterizing and Modeling the Impact of Wireless Signal Strength on Smartphone Battery Drain (Sigmetrics 2013) (280) What is keeping my phone awake? Characterizing and Detecting No-Sleep Energy Bugs in Smartphone Apps (MobiSys 2012) (380 cites) Where is the energy spent inside my app? Fine Grained Energy Accounting on Smartphones with Eprof (EuroSys 2012, Best Student Paper Award, 2022 ACM SIGOPS EuroSys Test-of-Time Paper Award, 2023 ACM SIGMOBILE Test-of-Time Paper Award) (900 cites) Fine-Grained Power Modeling for Smartphones Using System Call Tracing (EuroSys 2011) (500 cites) Bootstrapping Energy Debugging on Smartphones: A First Look at Energy Bugs in Mobile Devices (HotNets 2011) (300 cites) Data Center Networking, Cloud Computing A Case for Task Sampling based Learning for Cluster Job Scheduling (NSDI 2022) Your Coflow has Many Flows: Sampling Them for Fun and Speed (USENIX ATC 2019) Cloud-scale Load Balancer - Episode III: Yoda: A Highly Available Layer-7 Load Balancer (EuroSys 2016) Cloud-scale Load Balancer - Episode II: Unlocking the Power of Locality and End-point Flexibility in Cloud Scale Load Balancer (USENIX ATC 2015) Cloud-scale Load Balancer - Episode I: Duet: Cloud Scale Load Balancing with Hardware and Software (SIGCOMM 2014) (250 cites) On the impact of packet spraying in data center networks (INFOCOM 2013) (370 cites) The Only Constant is Change: Incorporating Time Varying Network Reservations in Data Centers (SIGCOMM 2012) (380 cites) The TCP Outcast Problem: Exposing Unfairness in Data Center Networks (NSDI 2012) (100 cites) On the Efficacy of Fine-Grained Traffic Splitting Protocols in Data Center Networks (Sigmetrics 2012 Ext. Abs.) Latency Inflation with MPLS-based Traffic Engineering (IMC 2011) Optimizing Cost and Performance in Online Service Provider Networks (NSDI 2010) (170 cites) Operating Systems / Buffer Cache Management The Performance Impact of Kernel Prefetching on Buffer Cache Replacement Algorithms (SIGMETRICS 2005, IEEE TC 2007, Software Release) (175 cites) Program Counter Based Pattern Classification in Buffer Caching (OSDI 2004) (150 cites in Google Scholar) Program Counter Based Prediction Techniques for Dynamic Power Management (HPCA 2004, IEEE TC 2006) Wireless Networking Pacifier: High-Throughput, Reliable Multicast without \"Crying Babies\" in Wireless Mesh Networks. (ToN 2012, Software Release) (130 cites) CCACK: Efficient Network Coding Based Opportunistic Routing through Cumulative Coded Acknowledgments (ToN 2011) (240 cites) Context Based Routing: Technique, Applications and Experience (NSDI 2008) How to evaluate exotic wireless routing protocols? (HotNets 2008) Computer Networks: BGP Hijacking iSPY: Detecting IP Prefix Hijacking on My Own (SIGCOMM 2008, ToN 2010) (240 cites in Google Scholar) Practical Defenses Against BGP Prefix Hijacking (CoNEXT 2007) (120 cites) Understanding Network Delay Changes Caused by Routing Events (SIGMETRICS 2007) (120 cites) On the Impact of Research Network Based Testbeds on Wide-area Experiments (IMC 2006) Exploiting the Synergy between Peer-to-Peer and Mobile Ad Hoc Networks (HotOS 2003) (170 cites in Google Scholar) Runtime Support for Distributed Sharing in Safe Languages (ACM TOCS 2003) Selected Recent Projects: \"NeTS: Medium: Black-box Optimization of White-box Networks: Online Learning for Autonomous Resource Management in NextG Wireless Networks.\" NSF, 2023-2026. Project website. NSF-Intel \"SPLICE: Secure Predictive Low-Latency Information Centric Edge for Next Generation Wireless Networks.\" National Science Foundation (NSF) and Intel, 2017-2020. Project website. Smartphone Systems and Networking Data Center Networking Software Releases and Datasets TraffGen: 1st Cellular network control-plane traffic generator (see our IMC 2023 paper) AccuSim: Accurate Buffer Cache Simulator iSPY: Detecting IP Prefix Hijacking on My Own (Zheng's itraceroute) Pacifier: High-througput, reliable multicast for Mesh Networks Cellular dataset under driving from our IMC 2023 paper. Uplink 5G mmWave dataset from our SIGCOMM 5G-MeMU 2022 paper. Multi-user AR over 5G dataset from our PAM 2022 paper. 60 GHz throuphput prediction dataset from our PAM 2021 paper. (Best Dataset Award) Funding Research in our group has been supported by National Science Foundation Semiconductor Research Corporation Purdue Research Foundation Honda R&D Americas Cisco Systems Intel Corp. Narus Inc. Google Research Award Qualcomm Technologies Charter Communications NEC Labs America AT&T Labs Ph.D and M.S. Students Zongpu Zhang (Visiting Scholar, SJTU) Omar Basit Yunzhao Liu Zeeshan Hussain Sixiang Zhou Siyuan Xu (co-advised with Prof. Andrew Liu) HoSun Choi (MS) Note to applicants Past Postdoc Dimitrios Koutsonikolas Ph.",
  "content_length": 14288,
  "method": "requests",
  "crawl_time": "2025-12-01 14:53:02"
}