{
  "name": "Yu Cheng 0002",
  "homepage": "http://cs.brown.edu/people/ycheng79",
  "status": "success",
  "content": "Yu Cheng I am an Assistant Professor in the Department of Computer Science at Brown University. I received my Ph.D. from the University of Southern California, advised by Shang-Hua Teng. I was a postdoc at Duke University, a visiting member at the Institute for Advanced Study, and an Assistant Professor at the University of Illinois Chicago. My Research: My main research interests include machine learning, optimization, and game theory. My recent work focuses on the design and analysis of scalable and provably robust algorithms for machine learning, especially in the areas of high-dimensional robust statistics, non-convex optimization, and learning with strategic agents. Email: yu_cheng AT brown.edu Office: CIT 413, 115 Waterman St, Providence, RI 02906. My CV and papers (by date or by topic). Teaching Fall 2025: CSCI0500: Data Structures, Algorithms, and Intractability: An Introduction. Spring 2025: CSCI1520: Algorithmic Aspects of Machine Learning. Fall 2024: CSCI2952Q: Robust Algorithms for Machine Learning. Spring 2024: CSCI1952Q: Algorithmic Aspects of Machine Learning. Fall 2023: CSCI2952Q: Robust Algorithms for Machine Learning. Spring 2023: CSCI1952Q: Algorithmic Aspects of Machine Learning. Fall 2022: CSCI2952Q: Robust Algorithms for Machine Learning. Fall 2021: MCS 401: Computer Algorithms I. Fall 2021: MCS 425: Codes and Cryptography. Fall 2020: MCS 401: Computer Algorithms I. Fall 2020: MCS 425: Codes and Cryptography. Spring 2020: MCS 425: Codes and Cryptography. Spring 2020: MCS 590: Spectral Graph Theory. Research Group Current Ph.D. Students: Binhao Chen Former Ph.D. Students: Xing Gao (co-advised with Lev Reyzin) Former Undergraduate Students: Tianle Jiang Jay Sarva Haichen Dong Honghao Lin Publications Aggregating Quantitative Relative Judgments: From Social Choice to Ranking Prediction. (arXiv) Yixuan Even Xu, Hanrui Zhang, Yu Cheng, Vincent Conitzer. NeurIPS 2024. Tight Lower Bounds for Directed Cut Sparsification and Distributed Min-Cut. (arXiv) Yu Cheng, Max Li, Honghao Lin, Zi-Yi Tai, David P. Woodruff, Jason Zhang. PODS 2024. Robust Matrix Sensing in the Semi-Random Model. Xing Gao, Yu Cheng. NeurIPS 2023. Robust Second-Order Nonconvex Optimization and Its Application to Low Rank Matrix Sensing. (arXiv) Shuyao Li, Yu Cheng, Ilias Diakonikolas, Jelena Diakonikolas, Rong Ge, Stephen J. Wright. NeurIPS 2023. Hiding Data Helps: On the Benefits of Masking for Sparse Coding. (arXiv) Muthu Chidambaram, Chenwei Wu, Yu Cheng, Rong Ge. ICML 2023. Efficiently Solving Turn-Taking Stochastic Games with Extensive-Form Correlation. (arXiv) Hanrui Zhang, Yu Cheng, Vincent Conitzer. EC 2023. Outlier-Robust Sparse Estimation via Non-Convex Optimization. (arXiv, slides) Yu Cheng, Ilias Diakonikolas, Rong Ge, Shivam Gupta, Daniel M. Kane, Mahdi Soltanolkotabi. NeurIPS 2022. Efficient Algorithms for Planning with Participation Constraints. (arXiv) Hanrui Zhang, Yu Cheng, Vincent Conitzer. EC 2022. Planning with Participation Constraints. (pdf) Hanrui Zhang, Yu Cheng, Vincent Conitzer. AAAI 2022. Sparsification of Directed Graphs via Cut Balance. (arXiv) Ruoxu Cen, Yu Cheng, Debmalya Panigrahi, Kevin Sun. ICALP 2021. Robust Learning of Fixed-Structure Bayesian Networks in Nearly-Linear Time. (arXiv) Yu Cheng, Honghao Lin. ICLR 2021. Fair for All: Best-effort Fairness Guarantees for Classification. (arXiv) Anilesh K. Krishnaswamy, Zhihao Jiang, Kangning Wang, Yu Cheng, Kamesh Munagala. AISTATS 2021. Classification with Few Tests through Self-Selection. (pdf) Hanrui Zhang, Yu Cheng, Vincent Conitzer. AAAI 2021. Automated Mechanism Design for Classification with Partial Verification. (arXiv) Hanrui Zhang, Yu Cheng, Vincent Conitzer. AAAI 2021. High-Dimensional Robust Mean Estimation via Gradient Descent. (arXiv, slides) Yu Cheng, Ilias Diakonikolas, Rong Ge, Mahdi Soltanolkotabi. ICML 2020. Distinguishing Distributions When Samples Are Strategically Transformed. (pdf) Hanrui Zhang, Yu Cheng, Vincent Conitzer. NeurIPS 2019. Group Fairness in Committee Selection. (arXiv) Yu Cheng, Zhihao Jiang, Kamesh Munagala, Kangning Wang. EC 2019. Faster Algorithms for High-Dimensional Robust Covariance Estimation. (arXiv, slides, talk video) Yu Cheng, Ilias Diakonikolas, Rong Ge, David P. Woodruff. COLT 2019. When Samples Are Strategically Selected. (pdf) Hanrui Zhang, Yu Cheng, Vincent Conitzer. ICML 2019. A Better Algorithm for Societal Tradeoffs. (pdf) Hanrui Zhang, Yu Cheng, Vincent Conitzer. AAAI 2019. High-Dimensional Robust Mean Estimation in Nearly-Linear Time. (arXiv, slides) Yu Cheng, Ilias Diakonikolas, Rong Ge. SODA 2019. A Simple Mechanism for a Budget-Constrained Buyer. (arXiv) Yu Cheng, Nick Gravin, Kamesh Munagala, Kangning Wang. WINE 2018 (Best Paper Award). Robust Learning of Fixed–Structure Bayesian Networks. (arXiv) Yu Cheng, Ilias Diakonikolas, Daniel M. Kane, Alistair Stewart. NeurIPS 2018. Non-Convex Matrix Completion Against a Semi-Random Adversary. (arXiv, slides, talk video) Yu Cheng, Rong Ge. COLT 2018. A Deterministic Protocol for Sequential Asymptotic Learning. (arXiv) Yu Cheng, Wade Hann-Caruthers, Omer Tamuz. ISIT 2018. On the Distortion of Voting with Multiple Representative Candidates. (arXiv, slides) Yu Cheng, Shaddin Dughmi, David Kempe. AAAI 2018. Computational Aspects of Optimal Information Revelation. (pdf, slides, talk video) Yu Cheng. Ph.D. Thesis. University of Southern California, 2017. Of the People: Voting Is More Effective with Representative Candidates. (arXiv, slides, talk video) Yu Cheng, Shaddin Dughmi, David Kempe. EC 2017. Well-Supported versus Approximate Nash Equilibria: Query Complexity of Large Games. (arXiv, slides, talk video) Xi Chen, Yu Cheng, Bo Tang. ITCS 2017. Playing Anonymous Games using Simple Strategies. (arXiv, slides) Yu Cheng, Ilias Diakonikolas, Alistair Stewart. SODA 2017. On the Recursive Teaching Dimension of VC Classes. (ECCC, talk video) Xi Chen, Yu Cheng, Bo Tang. NIPS 2016. Hardness Results for Signaling in Bayesian Zero-Sum and Network Routing Games. (arXiv, slides) Umang Bhaskar, Yu Cheng, Young Kun Ko, Chaitanya Swamy. EC 2016. Mixture Selection, Mechanism Design, and Signaling (arXiv, slides, talk video) Yu Cheng, Ho Yee Cheung, Shaddin Dughmi, Ehsan Emamjomeh-Zadeh, Li Han, Shang-Hua Teng. FOCS 2015. Efficient Sampling for Gaussian Graphical Models via Spectral Sparsification (arXiv Part I and Part II, slides) Dehua Cheng, Yu Cheng, Yan Liu, Richard Peng, Shang-Hua Teng. COLT 2015.",
  "content_length": 6471,
  "method": "requests",
  "crawl_time": "2025-12-01 14:53:05"
}