{
  "name": "Yu David Liu",
  "homepage": "http://www.cs.binghamton.edu/~davidl",
  "status": "success",
  "content": "Yu David Liu Yu David Liu Professor School of Computing State University of New York at Binghamton Email: davidL at binghamton.edu Office: Q3 Engineering Building 2021 My research interest is software systems. I am particularly drawn to solutions that streamline the interface between the application and the underlying system, and address cross-cutting concerns such as reliability, energy efficiency, performance, and security. These solutions may result from novel designs of runtime systems, compilers, programming languages, and software frameworks. I received my Ph.D. from the Johns Hopkins University, advised by Scott Smith. I was a recipient of the NSF CAREER Award in 2010, the Google Faculty Research Award in 2011, the Outstanding Research Achievement Award from the Department of Computer Science at SUNY Binghamton in 2018, and from Watson School of Engineering and Applied Science in 2019. My research is currently supported by the National Science Foundation, currently through awards 2053391 and 2215016. In Fall 2022, I was a Fulbright Scholar awardee, visiting University of Maribor, Slovenia. Current Projects (credit: M. Cohen) Sustainability-Aware and Energy-Aware Computing From data centers to smart phones, sustainability and energy efficiency are critical design considerations of modern computing. Read about Vesta (PLDI'24), Smaragdine (ICSE'24), Vincent (ECOOP'22), Eflect (ICSE'22), Chappie (FSE'20) and Ent (PLDI'17). (credit: hypepotamus.com) Optimizing Data-Intensive Software Data analytics applications are on the rise. Correct and efficient optimization is critical for their design. Read about Pitstop (OOPSLA'24) and DON Calculus (OOPSLA'22). (credit: binghamton.edu) Unmanned Aerial Vehicles UAVs are an emerging computing platform increasingly becoming common in our society. Read about safety-critical concerns in open-source UAV auto-pilots (ICSE'21), Java-based UAV autopilot JCopter (IROS'21), and compiler-based regulation enforcement (ICRA'24). (credit: pixabay.com) Thwarting Side-Channel Attacks Side channels pose a new threat to future software/hardware systems. Read about Composable Cachelets (USENIX Security'22), TEE-SHirT (NDSS'24), and SCC (USENIX Security'25). Recent Work Kerem Arikan, Huaxin Tang, Williams Zhang Cen, Yu David Liu, Nael Abu-Ghazaleh, Dmitry Ponomarev, Secure Caches for Compartmentalized Software, USENIX Security, 2025. Jeffrey Eymer, Philip Dexter, Joseph Raskind, Yu David Liu, A Runtime System for Interruptible Query Processing -- When Incremental Computing Meets Fine-Grained Parallelism, OOPSLA, 2024. Joseph Raskind, Timur Babakol, Khaled Mahmoud, Yu David Liu, Vesta: Power Modeling with Language Runtime Events, PLDI, 2024. Sofiya Semenova, Steven Ko, Yu David Liu, Lukasz Ziarek, Karthik Dantu, A Comprehensive Study of Systems Challenges in Visual Simultaneous Localization and Mapping Systems, ACM Transactions Embedded Computing Systems (TECS), 2024 Huaxin Tang, John Henry Burns, Alexander Strong, Yu David Liu, A Compiler Framework for Proactive UAV Regulation Enforcement, ICRA, 2024. Syed Rafiul Hussain, Patrick McDaniel, Anshul Gandhi, Kanad Ghose, Kartik Gopalan, Dongyoon Lee, Yu David Liu, Zhenhua Liu, Shuai Mu, Erez Zadok, Verifiable Sustainability in Data Centers, IEEE Security and Privacy Magazine, 2024. Tomaz Kosar, Dragana Ostojic, Yu David Liu, Marjan Mernik, Computer Science Education in ChatGPT Era: Experiences from an Experiment in a Programming Course for Novice Programmers, Mathematics (MDPI), 2024 Timur Babakol, Yu David Liu, Tensor-Aware Energy Accounting, ICSE, 2024. Kerem Arikan, Abraham Farrell, Williams Zhang Cen, Jack McMahon, Barry Williams, Yu David Liu, Nael Abu-Ghazaleh, Dmitry Ponomarev, TEE-SHirT: Scalable Leakage-Free Cache Hierarchies for TEEs, NDSS, 2024. Anshul Gandhi, Dongyoon Lee, Zhenhua Liu, Shuai Mu, Erez Zadok, Kanad Ghose, Kartik Gopalan, Yu David Liu, Syed Rafiul Hussain, Patrick Mcdaniel, Metrics for Sustainability in Data Centers, (journal version), EIR, 2023. Kenan Liu, Khaled Mahmoud, Joonhwan Yoo, Yu David Liu, Vincent: Green Hot Methods in the JVM (journal version), SCP, 2023. Philip Dexter, Yu David Liu, Kenneth Chiu, The Essence of Online Data Processing, OOPSLA, 2022. Anshul Gandhi, Kanad Ghose, Kartik Gopalan, Syed Rafiul Hussain, Dongyoon Lee, Yu David Liu, Zhenhua Liu, Patrick McDaniel, Shuai Mu, Erez Zadok, Metrics for Sustainability in Data Centers, HotCarbon, 2022. Kenan Liu, Khaled Mahmoud, Joonhwan Yoo, Yu David Liu, Vincent: Green Hot Methods in the JVM, ECOOP, 2022. Daniel Townley, Kerem Arikan, Yu David Liu, Dmitry Ponomarev, Oguz Ergin, Composable Cachelets: Protecting Enclaves from Cache Side-Channel Attacks, USENIX Security, 2022. Timur Babakol, Anthony Canino, Yu David Liu, Eflect: Porting Energy-Aware Applications to Shared Environments, ICSE, 2022. Sofiya Semenova, Steven Y. Ko, Yu David Liu, Lukas Ziarek, Karthik Dantu, A Quantitative Analysis of System Bottlenecks in Visual SLAM, HotMobile, 2022. Adam Czerniejewski, John Henry Burns, Farshad Ghanei, Karthik Dantu, Yu David Liu, Lukasz Ziarek, \" JCopter: Reliable UAV Software through Managed Languages,\" International Conference on Intelligent Robots and Systems (IROS), 2021. Xiaozhou Liang, John Henry Burns, Joseph Sanchez, Karthik Dantu, Lukasz Ziarek, Yu David Liu, \"Understanding Bounding Functions in Safety-Critical UAV Software,\" ICSE, 2021. Earlier... Team Kerem Arikan (Ph.D.), co-advised with Dmitry Ponomarev Congratulations to Dr. Timur Babakol, who won the prestigious Distinguished Dissertation Award at SUNY Binghamton in 2025. Timur defended his PhD dissertation, Application-Level Energy Accounting, in November 2024. Vincent Jui Hsin Lee (B.S.) Joseph Raskind (Ph.D.) Huaxin Tang (Ph.D.) Joonhwan Yoo (B.S.) Alumni Teaching CS680G: Sustainable Computing (Spring 2025) CS471: Programming Languages (Spring 2025) Events Associate Editor, ICRA 2025 PC Member, ASPLOS 2025 PC Member, Programming 2025 Associate Editor, J. Computer Languages Past Events Fun Alan Turing is a \"great-grand-uncle'' of mine on the academic genealogy tree.",
  "content_length": 6100,
  "method": "requests",
  "crawl_time": "2025-12-01 14:53:04"
}