{
  "name": "Yu Feng 0007",
  "homepage": "https://yufenguofr.github.io",
  "status": "success",
  "content": "Yu Feng @ SJTU SEIEE, Building 3, Room 3-301B Email: y-feng at sjtu dot edu dot cn I am a tenure-track assistant professor in the John Hopcroft Center for Computer Science at Shanghai Jiao Tong University. I am also a member of the Emerging Parallel Computing Center. Before joining SJTU, I obtained my Ph.D. in Computer Science from University of Rochester. During my Ph.D., I worked with Prof. Yuhao Zhu. My main research interest is about efficient and high-performance Visual Computing. This topic is not only about how machines perceive visual information, but also how machines present visual information to us! My current interests include but are not limited to, designing software/hardware pipelines for neural rendering and hardware acceleration for large vision-language models. Please do NOT randomly shoot me an email. I only consider PhD/Master/Postdoc applicants with a background in computer architecture or system. Please kindly ask deepseek or chatGPT what computer architecture is about before reaching out. news Sep 19, 2025 Three papers accepted to HPCA. Sep 19, 2025 One paper accepted to NeurIPS. Sep 11, 2025 Two papers accepted to TACO. Jul 01, 2025 One paper accepted to ICCAD. May 17, 2025 Invited to serve as a PC member of HPCA. May 08, 2025 One paper accepted to TACO. May 01, 2025 One paper accepted to ICML. Apr 01, 2025 Our paper, MetaSapiens, received the Best Paper award on ASPLOS’25! Mar 22, 2025 One paper accepted to ISCA. Feb 15, 2025 Two papers accepted to DAC. selected publications ISCA Lumina: Real-Time Neural Rendering by Exploiting Computational Redundancy Yu Feng, Weikai Lin , Yuge Cheng , Zihan Liu , Jingwen Leng# , Minyi Guo# , Chen Chen , Shixuan Sun , and Yuhao Zhu In Proceedings of the 52nd Annual International Symposium on Computer Architecture , 2025 arXiv Code ASPLOS StreamGrid: Streaming Point Cloud Analytics via Compulsory Splitting and Deterministic Termination Yu Feng*# , Zheng Liu* , Weikai Lin* , Zihan Liu , Jingwen Leng# , Minyi Guo , Zhezhi He , Jieru Zhao , and Yuhao Zhu In Proceedings of the 30th ACM International Conference on Architectural Support for Programming Languages and Operating Systems , 2025 arXiv ASPLOS MetaSapiens: Real-Time Neural Rendering with Efficiency-Aware Pruning and Accelerated Foveated Rendering Weikai Lin* , Yu Feng*, and Yuhao Zhu In Proceedings of the 30th ACM International Conference on Architectural Support for Programming Languages and Operating Systems , 2025 arXiv TACO Potamoi: Accelerating Neural Rendering via a Unified Streaming Architecture Yu Feng*, Weikai Lin* , Zihao Liu , Jingwen Leng , Minyi Guo , Han Zhao , Xiaofeng Hou , Jieru Zhao , and Yuhao Zhu In ACM Transactions on Architecture and Code Optimization , 2024 arXiv ISCA Cicero: Real-Time Neural Rendering by Radiance Warping and Memory Optimizations Yu Feng, Zihan Liu , Jingwen Leng , Minyi Guo , and Yuhao Zhu In Proceedings of the 51st Annual International Symposium on Computer Architecture , 2024 arXiv Video Code ISCA BlissCam: Boosting Eye Tracking Efficiency with Learned In-Sensor Sparse Sampling Yu Feng*, Tianrui Ma* , Yuhao Zhu , and Xuan Zhang In Proceedings of the 51th Annual International Symposium on Computer Architecture , 2024 arXiv Code ISCA CamJ: Enabling System-level Energy Modeling and Architectural Exploration for In-sensor Visual Computing Tianrui Ma* , Yu Feng*, Xuan Zhang , and Yuhao Zhu In Proceedings of the 50th Annual International Symposium on Computer Architecture , 2023 arXiv Supp Code Website ISCA Crescent: Taming Memory Irregularities for Accelerating Deep Point Cloud Analytics Yu Feng, Gunnar Hammonds , Yiming Gan , and Yuhao Zhu In Proceedings of the 49th Annual International Symposium on Computer Architecture , 2022 arXiv IEEE VR Real-Time Gaze Tracking with Event-Driven Eye Segmentation Yu Feng, Nathan Goulding-Hotta , Asif Khan , Hans Reyserhove , and Yuhao Zhu In 2022 IEEE Conference on Virtual Reality and 3D User Interfaces (VR) , 2022 arXiv Supp Video Code MICRO Mesorasi: Architecture Support for Point Cloud Analytics via Delayed-Aggregation Yu Feng*, Boyuan Tian* , Tiancheng Xu* , Paul Whatmough , and Yuhao Zhu In 2020 53rd Annual IEEE/ACM International Symposium on Microarchitecture (MICRO) , 2020 arXiv Video Code Slides Website MICRO Asv: Accelerated Stereo Vision System Yu Feng, Paul Whatmough , and Yuhao Zhu In Proceedings of the 52nd Annual IEEE/ACM International Symposium on Microarchitecture , 2019 arXiv Code Slides ISCA Pes: Proactive Event Scheduling for Responsive and Energy-Efficient Mobile Web Computing Yu Feng, and Yuhao Zhu In Proceedings of the 46th International Symposium on Computer Architecture , 2019 arXiv Video Slides Send me an email if you want to get in touch with me.",
  "content_length": 4746,
  "method": "requests",
  "crawl_time": "2025-12-01 14:53:03"
}