{
  "name": "Yu Huang 0015",
  "homepage": "https://yuhuang-lab.github.io",
  "status": "success",
  "content": "Yu Huang Yu HuangPronoun: she/her/hersAssistant ProfessorDepartment of Computer ScienceInstitute for Software Integrated SystemsThe Frist Center for Autism and InnovationVanderbilt Lab for Immersive AI Translation (VALIANT)Vanderbilt LIVE Learning Innovation IncubatorVanderbilt University Follow Sony 4108 Email Twitter Google ScholarAbout meI am an assistant professor of Computer Science at Vanderbilt University, and have a secondary appointment of assistant professor in the Department of Teaching and Learning at the Peabody College of Education. I am also affiliated with the Institute for Software Integrated Systems, the Frist Austism Center, the Vanderbilt Lab for Immersive AI Translation (VALIANT) and the LIVE Learning Innovation Incubator at Vanderbilt.I lead the research of the MIND Lab – the Mixed INtelligence Development for programming lab. Our research focuses on understanding and combining human cognition and machine intelligence to improve the effectiveness and efficiency in the software development process. Occasionaly I also work on other fun projects with my students.Our research has been supported by NSF, GitHub, ARPA-H, and Vanderbilt Immersion. Our work has been mainly published in top venues in Software Engineering (e.g., ICSE, FSE, ASE, TSE, TOSEM), also in Systems, HCI and Psychology (e.g., UbiComp, ASPLOS, CSCW, JMIR). We have received four ACM SIGSOFT Distinguished Paper Awards (ICSE 2019, FSE 2023, ICSE 2024, ASE 2025). I am honored to receive the 2025 ICPC Vaclav Rajlich Early Career Achievement Award.I received my PhD in Computer Science and Engineering at the University of Michigan in 2021. My advisor was Prof. Westley Weimer. I received my MS in Computer Engineering at University of Virginia in 2015 and my BS in Aerospace Engineering from Harbin Institute of Technology in China in 2011.ResearchMy group focuses on human factors and human-centered AI for software engineering, including human cognition, AI for software engineering, sustainability for open source software, and computer science education. Our work aims to bridge the divide between human cognition and automated models for programming. Our work spans software, hardware, AI, medical imaging (fMRI and fNIRS), eye tracking, and mobile sensing, collaborating with researchers from Security, Education, Psychology and Neuroscience. We also work on social aspects in the software engineering community.All (but not limited to) the following questions are of interest in my group and I look forward to hearing crazy ideas from students!How do programming experts become experts?How do programmers comprehend and write code? How do they really think in programming tasks?How and why do programmers make mistakes in programming?How can we learn from human cognition and expertise to improve automated models in programming? How can we improve participation and diversity in programming?If you are interested in joining my lab, please check the information on Advising & Research Opportunities.NewsNov 2025 Congratulations to our undergrad researcher, Samantha McLoughlin, and PhD student, Zach Karas, for their ASE paper receiving the ACM SIGSOFT Distinguished Paper award!Aug 2025 Congratulations to Yueke, for his paper being accepted to ASE 2025 NIER! Cool idea of using ACT-R for code reading!Aug 2025 Congratulations to our undergrad researcher, Samantha McLoughlin, and PhD student, Zach Karas, for their paper being accepted to ASE 2025!May 2025 Congratulations to Yifan receiving the C. F. Chen Best Paper award in Department of Computer Science!April 2025 Thank you, ICPC, for the Vaclav Rajlich Early Career Achievement Award!Jan 2025 Our group got two papers accepted to ICSE 2025 Journal First Track! Congratulations to Zach Karas (for his TOSEM paper) and Anda Liang (for his TSE paper)!Jan 2025 Congratulations to our Undergrad Researcher, Yuwei Yang, for receiving the 2024-2025 CRA Outstanding Undergraduate Research Award Honorable Mention!Jan 2025 Congratulations to our undergrad researcher Manish Acharya and graduate student Yifan Zhang for their paper being accepted to ICPC 2025 ERA track!Oct 2024 Our group got two papers accepted to ICSE 2025! Congratulations to Zach Karas and Yueke Zhang leading their ICSE 25 submissions!July 2024 Congratulations to Anda Liang for his paper being accepted to TSE!June 2024 Congratulations to Zihan Fang for her paper being accepted to CSCW 2024!May 2024 Congratulations to Zach Karas for his paper being accepted to TOSEM!May 2024 Congratulations to our undegraduate researchers, Anda Liang, Eric Li, Haonan Hou, Danielle Page and Ellie Li, graduating from Vanderbilt!May 2024 Congratulations to Zach passing his prelim!May 2024 Congratulations to Eric receiving the Dean’s Award of the Banner Bearer of the Class of 2024!May 2024 Congratulations to Zihan receiving the C. F. Chen Best Paper award in Department of Computer Science!Apr 2024 We got the best presentation award for our paper at GI2024, co-located with ICSE!Mar 2024 Congratulations to our undergrad researcher, Haonan, for his paper being accepted to AAAI-ICWSM!Mar 2024 Our work is featured on Vanderbilt School of Engineering news!Feb 2024 Congratulations to our undergrad researcher, Yimeng, for her paper receiving the ACM SIGSOFT Distinguished Paper Award at ICSE 24!MORE...Dec 2023 Congratulations to Yifan for his paper accepted to FSE 2024!Dec 2023 Congratulations to Zihan for receiving the Richard Bennett/Dorothy Danforth Compton Prize scholarship!!Dec 2023 We received the Provost’s Faculty Immersion Vanderbilt Grant to support our research on Human Attention Centered AI for Computer Programming Learning! Thank you, Vanderbilt Immersion!Dec 2023 Congratulations to Garrett and Hanlin for their paper accepted to ICSE-SEET 2024!Nov 2023 Congratulations to Zihan for her paper receiving the SIGSOFT Distinguished Paper Award at FSE 2023!Nov 2023 Congratulations to Zach for receiving an internship offer from Leidos!Oct 2023 Congratulations to Yimeng for her paper accepted to ICSE 2024!July 2023 Congratulations to Yueke for his paper accepted to ESEM 2023!July 2023 Congratulations to Zihan for her paper accepted to FSE 2023!Apr 2023 Congratulations to Haonan Hou for receiving the VUSRP research scholarship! We will investigate the reliability of ChatGPT on intimate relationship problems!Feb 2023 Congratulations to Yifan Zhang for receiving the internship offer from TikTok Research!Aug 2022 Congratulations to Yifan for his doctoral proposal accepted to ASE 2022 Doctoral Symposium!July 2022 We received a 4-year NSF grant to study human-like AI models for source code that leverages developers’ behaviors to empower AI tools for software engineering activities. This project is in collaboration with the groups of Prof. Collin McMillan and Prof. Toby Li at Notre Dame.June 2022 We received a grant from the GitHub Tech for Social Good and GitHub Policy teams to support our research on investigating global standard usage metrics! Thank you, GitHub!",
  "content_length": 7015,
  "method": "requests",
  "crawl_time": "2025-12-01 14:53:03"
}