{
  "name": "Yu Huang 0002",
  "homepage": "https://cs.nju.edu.cn/yuhuang",
  "status": "success",
  "content": "Homepage of Yu Huang Dr. Yu Huang Professor, Ph.D. Supervisor State Key Laboratory for Novel Software Technology, Nanjing University School of Computer Science, Nanjing University Postal address: School of Computer Science, Nanjing University 163 Xianlin Street, Qixia District, Nanjing, Jiangsu Province, China, 210023 Office: Room 805, Computer Science and Technology Building Email: Short biography In July 2007, I joined the State Key Laboratory for Novel Software Technology, Nanjing University. I am a faculty member of the Institute of Computer Software and the School of Computer Science, Nanjing University. I worked as an assistant professor from 2007 to 2009, and as an associate professor from 2010 to 2016. I was promoted professor in 2017. I got my Ph.D. in computer science from the University of Science and Technology of China (USTC) in Jun. 2007. My supervisor is Prof. Yulin Feng. I got my bachelor's degree in computer science from USTC in Jun. 2002. Before entering USTC, I studied in the Suzhou Middle School, Suzhou China, from Sep.1995 to Jun.1997. I studied in the Technology Center of Software Engineering, Institute of Software, Chinese Academy of Sciences (TCSE, ISCAS), as a co-educated Ph.D. student of both USTC and TCSE ISCAS from Sep. 2003 to Jul. 2007. From Sep. 2005 to Sep. 2006, I studied in the Department of Computing, Hong Kong Polytechnic University, as a visiting student. Research interests Distributed algorithms Distributed systems Formal specification and verification System software correctness and reliability To potential students I am recruiting well motivated and dedicated Ph.D. / master students to do research in above-mentioned areas. Undergraduate students are also encouraged to contact me, to work on related topics. Selected publications Ruize Tang, Minghua Wang, Xudong Sun, Lin Huang, Yu Huang, Xiaoxing Ma Converos: Practical Model Checking for Verifying Rust OS Kernel Concurrency in proc. of the 2025 USENIX Annual Technical Conference, Jul. 2025. Lingzhi Ouyang, Xudong Sun, Ruize Tang, Yu Huang, Madhav Jivrajani, Xiaoxing Ma, Tianyin Xu Multi-Grained Specifications for Distributed System Model Checking and Verification in proc. of the 20th European Conference on Computer Systems (EuroSys), Mar. 2025. [Extended tech report version] [GitHub repo] [Our spec merged in ZooKeeper repo] [Covered by Metadata (by Murat Demirbas)] Ruize Tang, Xudong Sun, Yu Huang, Yuyang Wei, Lingzhi Ouyang, Xiaoxing Ma SandTable: Scalable Distributed System Model Checking with Specification-level State Exploration in proc. of the 19th European Conference on Computer Systems (EuroSys), Apr. 2024. [GitHub repo] Xiaosong Gu, Wei Cao, Yicong Zhu, Xuan Song, Yu Huang, Xiaoxing Ma Compositional Model Checking of Consensus Protocols Specified in TLA+ via Interaction-Preserving Abstraction Best Paper Award, in proc. of the 41st International Symposium on Reliable Distributed Systems (SRDS), Sep. 2022. [Extended tech report version] Yu Huang (with Kaile Huang and Hengfeng Wei) Fine-grained Analysis on Fast Implementations of Distributed Multi-writer Atomic Registers in proc. of the ACM Symposium on Principles of Distributed Computing (PODC), Aug. 2020. [Extended tech report version] [Video of presentation] My DBLP My Google Scholar Profile Projects Model checkig-driven explorative testing for distributed cloud storage systems, NSFC (general program), 2024.1. Deep bug detection for distributed systems, CCF-Huawei Populus Grove Fund, 2023.11. Lightweight formal methods for distributed system design, Cooperation Fund of Huawei-Nanjing University Next Generation Programming Innovation Lab, 2022.4. Design and verification of RDMA and NVM Accelerated ParallelRaft, Alibaba AIR, 2021.1. Awards and Recognition Award for Distinguished Computer Science Major Teachers in Universities. Hengfeng Wei, Ph.D Dissertation Award, China Computer Federation (CCF), 2017. Yiling Yang, Ph.D Dissertation Award, China Computer Federation (CCF), 2016. \"Climb the Summit\" Program, Level B, Nanjing University, 2014. Yiling Yang, \"Distinguished New Research Scholar\" award for PhD students, Ministry of Education of China, 2012. First Class Award for Techniques and Inventions, Ministry of Education of China, as the 9th (out of 10) team member of the project \"Key Techniques, Platforms and Applications of Internetware\", 2011. Links My website (in Chinese) Last updated: 08/10/2025.",
  "content_length": 4425,
  "method": "requests",
  "crawl_time": "2025-12-01 14:53:03"
}