{
  "name": "Yu Kong Golisano",
  "homepage": "https://www.egr.msu.edu/~yukong",
  "status": "success",
  "content": "Yu Kong Office: EB 3573 Email: yukong@msu.edu Dr. Yu Kong is an Assistant Professor of the Department of Computer Science and Engineering, Michigan State University. He is now directing the ACTION Lab. He serves Pattern Recognition and IEEE Transactions on Multimedia as an Associate Editor. He also serves CVPR, ICCV, IJCAI, AAAI, Multimedia, FG, etc., as an Area Chair. He is an IEEE Senior Member. Dr. Kong is interested in video understanding, video generation, vision-language modeling, world models, open world vision, and their applications in Embodied AI and Biometrics. Openings: We have openings for Fall 2026 for Ph.D. students, Visiting Scholars, and Research Assistants. You can either 1) fill in the external contact form (preferred) or 2) send your application package to actionlab@msu.edu. I will review applications periodically. Due to large volume of applications, I am not able to track and respond to every applicant. How to apply? news Nov 10, 2025 One paper about Egocentric Video Generation has been accepted by WACV 2026. Congratulations to Yujiang! Sep 25, 2025 Our project on Neuro-Symbolic Video Understanding ($50K) is selected for funding by Jenison Fund. Sep 18, 2025 We have one paper accepted by NeurIPS 2025. Congratulations to Yifan! Aug 16, 2025 I will be serving CVPR 2026 as an Area Chair. Jun 25, 2025 We have one paper accepted by ICCV 2025. Congratulations to Yifan! Mar 31, 2025 We have one paper accepted by CVPR 2025 Workshop on Efficient Large Vision Models. Congratulations to Yifan! Feb 26, 2025 We have one paper accepted by CVPR 2025. Congratulations to Zhanbo on his first CVPR paper at ACTION Lab! Dec 02, 2024 I will be serving ICCV 2025 as an Area Chair. Oct 28, 2024 We have one paper accepted by WACV 2025. Congrats to all the authors! Sep 17, 2024 ACTION Lab members were attending Midwest Computer Vision Workshop at Indiana University Bloomington. [Photo] latest posts May 12, 2025 Ego-centric Video Understanding May 08, 2025 Industrial Embodied Question-Answering May 01, 2025 Visual Understanding in the Open World",
  "content_length": 2075,
  "method": "requests",
  "crawl_time": "2025-12-01 14:53:05"
}