{
  "name": "Yu Li 0006",
  "homepage": "https://liyu95.com",
  "status": "success",
  "content": "Yu Li Yu Li (李煜) Assistant Professor Department of Computer Science and Engineering (CSE) The Chinese University of Hong Kong (CUHK) The CUHK Shenzhen Research Institute (SZRI) (by courtesy) Email: liyuATcse.cuhk.edu.hk, liyu4017ATgmail.com [For reference letter requesting] (To be sustainable, I am trying to force myself not to reply to emails other than 9am to 6pm, Mon to Fri) [Research summary in one slide] [Google Scholar] [Group GitHub] [Linkedin] [ORCID: 0000-0002-3664-6722] Opening: Intern, PhD/Mphil students (Students with non-CS majors are very welcomed), Postdoc (HKD 540K per year). Recent news July 2025, humbled for being awarded to the Vice-Chancellor's Exemplary Teaching Award 2024 CUHK. Thanks to all the students, TAs, and colleagues for helping me to improve the teaching quality! During teaching, I learned much more than my students. The best way to learn is to teach. May 2025, humbled for being selected to the MIT Technology Review, Innovators Under 35 (TR35) China, 2024. Thanks to the recognition on the works from our group in the recent three years! Mar 2025, thanks to Nature, Science, and MIT Technology Review for highlighting our works! RhoFold+ and RhoDesign are featured by Nature technology features and Science Expert Voices. MIT Technology Review reported the works from our group. Humble to be listed as Asia-Pacific Leaders Under 30 during APEC-2024. Nov 2024, thanks to Nature Biotechnology and Nature Methods for highlighting our works! DHR is featured by Research Briefing in Nature Biotechnology and Research Highlights in Nature Methods. RhoFold+ is featured by Research Briefing in Nature Methods. [Past news] Short Bio Yu joined the CSE department at CUHK in December 2020 as an assistant professor, leading the Artificial Intelligence in Healthcare (AIH) group. He develops new machine learning methods to resolve the computational problems in biology and healthcare, which leads to works published in top venues, such as Nature Biotechnology and Nature Methods, and featured by Nature technology features and Science Expert Voices. He was selected to MIT Technology Review, Innovators Under 35 (TR35) China, 2024, Forbes 30 Under 30 Asia list – Class of 2022, Healthcare & Science, and awarded Vice-Chancellor's Exemplary Teaching Award 2024 CUHK. He obtained Ph.D. in Computer Science from KAUST in October 2020 (KAUST news), and Master degree in Computer Science from KAUST in December 2016. He got Bachelor degree (honored) in Biosciences from the BEI Shizhang Elite Class at USTC in 2015. He was born on April 1st, 1995 in China. [Quick facts about him] Research interests I am working at the intersection between machine learning, healthcare and bioinformatics, developing new machine learning methods to resolve the computational problems in biology and healthcare, especially the structured learning problems. My long-term goal is to improve the healthcare system, benefiting society directly by improving people's health and wellness. [All publications] [Selected publications] [Research summary in one slide] [Ph.D. thesis, Defense slides] [Job talk: bilibili, YouTube] Recent experiences Summer, 2024: Visiting Assistant Professor at MIT, Boston, USA Advisor: James Collins Summer, 2023: Visiting Assistant Professor at MIT, Boston, USA Advisor: James Collins [More...] Academic services [Full list] Reviewer for Nature Biotechnology, Nature Methods, Nature Computational Science, Nature Communications et al. Serve as PC member periodically for ICLR, NeurIPS, AAAI, et al. Selected recent awards [Full list] MIT Technology Review, Innovators Under 35 (TR35) China, 2024 Vice-Chancellor's Exemplary Teaching Award 2024 CUHK Asia-Pacific Leaders Under 30, 2024 Forbes 30 Under 30 Asia list – Class of 2022 KAUST Alumni Change Makers Awards, 2022, KAUST Certificate of Honor Rank (5% out of all graduates in 2015 at USTC), 2015, USTC",
  "content_length": 3894,
  "method": "requests",
  "crawl_time": "2025-12-01 14:53:04"
}