{
  "name": "Yu Sun 0004",
  "homepage": "http://www.cse.usf.edu/~yusun",
  "status": "success",
  "content": "Yu Sun, Robotics, Professor, Department of Computer Science and Engineering, University of South Florida (USF) Yu Sunyusun AT CSE . USF.edu Homepage Research Teaching Service Outreach Contact Me News & Updates 2029.9.10 My team has received a UG3 grant from NIH HEAL Initiative for project \"Developing AI-Driven Pain Intensity and Pain Sensitization Biomarker Signatures to Optimize Neonatal Pain Management\" More 2024.7.10 My team has received a CREATE grant to establish the Center for Innovation, Technology, and Aging (CITA) More Welcome to my homepage! My Blog Bio: (Short CV, Comprehensive CV) I am a Professor in the Department of Computer Science and Engineering, and the Director of the Center for Innovation, Technology, and Aging at the University of South Florida (Assistant Professor 2009-2015, Associate Professor 2015-2020, Associate Chair of Graduate Affairs 2018-2020). I was a Visiting Associate Professor at Stanford University from 2016 to 2017. I received his Ph.D. degree in Computer Science from the University of Utah in 2007. Then I had his Postdoctoral training at Mitsubishi Electric Research Laboratories (MERL), Cambridge, MA (2007-2008) and the University of Utah (2008-2009). My research interests include robotics, deep learning, haptics, computer vision, human computer interaction (HCI), and medical applications. If you are interested in working with me on some cool projects, please contact me. I teach Intro to AI, Deep Learning and Robotics courses at both undergraduate and graduate levels. I initiated the IEEE RAS Technical Committee on Robotic Hands, Grasping, and Manipulation and served as its first co-Chair. I have also served on several editorial boards as an Associate Editor and Senior Editor, including IEEE Transactions on Robotics, IEEE Robotics and Automation Letters (RA-L), ICRA, and IROS.",
  "content_length": 1844,
  "method": "requests",
  "crawl_time": "2025-12-01 14:53:10"
}