{
  "name": "Yu Sun 0001",
  "homepage": "https://sun.mie.utoronto.ca/bio",
  "status": "success",
  "content": "Biography | Professor Yu Sun Skip to content Yu Sun is a Member of all the three national academies of Canada: Canadian Academy of Engineering (CAE – 2014 class); The Academy of Science of Royal Society of Canada (RSC – 2019 class), and Canadian Academy of Health Sciences (CAHS – 2023 class). He is also an International Member of the Chinese Academy of Engineering  (CAE – 2021 class). He is a Professor in the Dept. of Mechanical and Industrial Engineering and is jointly appointed in the Institute of Biomedical Engineering, the Dept. of Electrical and Computer Engineering, and the Dept. of Computer Science at the University of Toronto (UofT). He is a McLean Senior Faculty Fellow and a member of the President’s Impact Academy at UofT, and a Tier I Canada Research Chair. Sun was the founding Director of UofT Robotics Institute that has over 20 faculty members from mechanical engineering, aerospace engineering, electrical engineering, biomedical engineering, computer science, and affiliated hospitals. The Robotics Institute is located on the fifth floor of the Myhal Centre. As the Faculty Director, Sun directed the University Nanofabrication Centre during 01/2012-12/2013. The Center hosts 50 million dollar equipment and has a group of technical and administrative staff, providing open access to UofT users from across faculties and to external users from both academia and industry. Sun joined UofT in July 2004 and was promoted through the ranks of associate professor and full professor in 2009 and 2012. In 2014, he was elected into the Canadian Academy of Engineering (CAE); in 2019, he was elected into the Royal Society of Canada (RSC); in 2021, he was elected into the Chinese Academy of Engineering (CAE); and in 2023, he was elected into the Canadian Academy of Health Sciences (CAHS). In 1996, Sun obtained his Bachelor’s degree from Dalian University of Technology that awarded him an Alumni Achievement Award in 2014. He obtained an M.S. degree from the Institute of Automation, Chinese Academy of Sciences (Beijing) in 1999. Sun was on the University’s basketball team (1992-1994) at Dalian University of Technology. While Sun was in Beijing, he was among the 18 professional TOEFL and GRE lecturers at the Beijing New Oriental School (1998-1999). In 2001, Sun received an M.S. degree in Electrical Engineering from the Univ. of Minnesota, Minneapolis. He received his Ph.D. degree in Mechanical Engineering from the Univ. of Minnesota in 2003, under Prof. Bradley J. Nelson. Prior to joining the faculty of Toronto in July 2004, Sun did his postdoctoral research at the Swiss Federal Institute of Technology (ETH-Zürich). Sun established in 2004 and directs the Advanced Micro and Nanosystems Laboratory at UofT. Leveraging his experience in micro-nanorobotics and cleanroom micro-nanofabrication, his team has strong expertise in (1) developing micro-nanomanipulation techniques and intelligent micro-nanorobotic systems; (2) designing novel micro-nano devices and developing new micro-nanofabrication processes. The research group manipulates, characterizes, and senses biological tissues, cells, molecules, and nanomaterials for both fundamental studies (e.g., molecule screen and genetics) and clinical/industrial applications (e.g., robotic cell surgery and precision instrumentation for industrial automation). Here is a 1-min video introducing the group’s research. Awards and Honors: IEEE NTC Pioneer Award in Nanotechnology, 2025 Fellow, Canadian Academy of Health Sciences (CAHS), 2023 President’s Impact Award, 2023 IEEE A.G.L. McNaughton Medal, 2023 IEEE EMBS Technical Achievement Award, 2022 Foreign Member, Chinese Academy of Engineering, 2021 CSME Mechatronics Medal (one medal given every two years), 2021 UofT’s Connaught Innovation Award, 2021 NSERC Synergy Award for Innovation (four awards annually in Canada), 2021 First Prize Video Award for Technical Achievement by ASRM (American Society for Reproductive Medicine), 2020 Outstanding Editor Award by Microsystems & Nanoengineering (Springer Nature), 2020 UofT’s Connaught Innovation Award, 2020 Fellow, American Institute for Medical and Biological Engineering (AIMBE), 2020 Michael R. Freeman Innovation Award by Heart and Stroke/Richard Lewar Centre of Excellence in Cardiovascular Research (HSRLCE), 2019 Fellow, Academy of Science of Royal Society of Canada (RSC), 2019 Fellow, US National Academy of Inventors (NAI), 2018 IEEE C.C. Gotlieb Computer Award, 2018 UofT’s Connaught Innovation Award, 2018 Tier I Canada Research Chair, 2017 Fellow, American Association for the Advancement of Science (AAAS), 2016 UofT’s Connaught Innovation Award, 2016 Alumni Achievement Award, Dalian University of Technology, 2015 Fellow, Institute of Electrical and Electronics Engineers (IEEE, through the Robotics and Automation Society), 2015 MIE Teaching Award, University of Toronto, 2014 Fellow, Canadian Academy of Engineering (CAE), 2014 UofT’s Connaught Innovation Award, 2014 NSERC E.W.R. Steacie Memorial Fellowship (the fellowship was awarded to 6 researchers selected from across all fields of natural sciences and engineering, across Canada), 2013 Fellow, American Society of Mechanical Engineers (ASME), 2013 Fellow, Engineering Institute of Canada (EIC), 2013 UofT’s Connaught Innovation Award, 2013 UofT’s Connaught Innovation Award, 2012 UofT’s Inventor of the Year Award (First Prize), 2011 UofT’s Connaught Innovation Award, 2011 IEEE Robotics and Automation Society Academic Early Career Award “for contributions to enabling microrobotic and MEMS technologies for automated cell manipulation and characterization in cell biology and clinical applications”, 2010 UofT’s McLean Award (one throughout the university), 2009 First Prize for Technical Achievement by the American Society for Reproductive Medicine (ASRM), 2009 Fellow, Canadian Society of Mechanical Engineers (CSME), 2009 Ontario MRI Innovations Award, 2008 Ontario Premier’s Early Researcher Award, 2006 Univ. of Minnesota Best Dissertation finalist, 2003 Univ. of Minnesota Dissertation Fellowship (one of the two fellowships awarded to the ME department), 2002 Elite Fellowship from the Chinese Academy of Sciences, 1999 Best Paper Award from the Chinese Academy of Sciences, 1998 Top Ten University Student Award in Liaoning Province (highest provincial honor), 1996 Fellowship to visit Hiroshima University in Japan, 1995 Best Paper Awards: Best Paper Award in Theoretical Computer and Information Sciences, International Congress of Basic Science (ICBS2023) Microsystems & Nanoengineering “Outstanding Paper Award”, 2022 Microsystems & Nanoengineering “Outstanding Paper Award”, 2020 Best Paper Award in Automation at the IEEE International Conference on Robotics and Automation (ICRA2019) Best Application Paper Award at the International Conference on Manipulation, Automation and Robotics at Small Scales (MARSS2018) IEEE Trans. Automation Science and Engineering Best New Application Paper Award (T-ASE2018) Best Paper in Robotics Award at the IEEE International Conference on Information and Automation (ICIA2016) CBS (Canadian Biomaterials Society) Best Abstract Award, 2016 Best Student Paper Award at the IEEE 2014 International Conference on Robotics and Automation (ICRA2014) Best Automation Paper Award at the IEEE 2011 International Conference on Robotics and Automation (ICRA2011) Best Application Paper Award at the 2011 International Conference on Manipulation, Manufacturing, and Measurements on the Nano Scale (3M-Nano2011) Best Paper Award in Clinical Research at the Canadian Fertility and Andrology Society (CFAS’09) 2009 Annual Conference Best Conference Paper Award at the IEEE 2007 International Conference on Automation Science and Engineering (CASE2007) Best paper finalists IEEE ICRA2025 Best Conference Paper Award IEEE ICRA2025 Best Medical Robotics Paper Award IEEE Trans. Mechatronics 2024 Best Paper Award IEEE Trans. Mechatronics 2023 Best Paper Award IEEE Robotics and Automation Letters 2020 Best Paper Award IEEE ICRA2014 Best Medical Robotics Paper Award IEEE ICRA2014 Best Manipulation Paper Award IEEE ICRA2010 Best Manipulation Paper Award IEEE IROS2006 Best Conference Paper Award IEEE IROS2005 Best Conference Paper Award IEEE ICMA2006 Best Student Paper Award IEEE ICRA2007 Best Student Paper Award Professional Activities: Editorship: Editor-in-Chief, IEEE Trans. Automation Science and Engineering, 2021 – present Editorial board member, Science Robotics, 2023 – present Senior Editor, IEEE Trans. Automation Science and Engineering, 2013 – 2020 Senior Editor, IEEE Robotics and Automation Letters, 2015 – 2019 Editor, Sensors & Actuators A: Physical, 2018 – 2021 Editor, Engineering (Elsevier), 2020-present Editorial board member, Scientific Reports, 2015 – present Editorial board member, Microsystems & Nanoengineering, 2014 – present Editorial board member, J. Micromechanics Microengineering, 2013 – 2021 Editor for IEEE International Conf. on Robotics and Automation (IEEE ICRA’2013-2015) Associate Editor, IEEE Trans. Robotics, 2010 – 2013 Technical Editor, IEEE Trans. Mechatronics, 2009 – 2013 Associate Editor, IEEE Trans. Automation Science and Engineering, 2007 – 2013 Licensed Professional Engineer (PEng) Fellow, Canadian Academy of Health Sciences (CAHS) Fellow, American Institute for Medical and Biological Engineering (AIMBE) Fellow, Royal Society of Canada (RSC) Fellow, National Academy of Inventors (NAI) Fellow, Institute of Electrical and Electronics Engineers (IEEE) Fellow, Canadian Academy of Engineering (CAE) Fellow, Engineering Institute of Canada (EIC) Fellow, American Society of Mechanical Engineers (ASME) Fellow, Canadian Society for Mechanical Engineering (CSME) Fellow, American Association for the Advancement of Science (AAAS) Program chair for the 2010 IEEE Int. Conf. on Automation Science and Engineering (CASE’2010) Member on the Executive Program Sub-Committee for the 2011 International Conf. on Solid-State Sensors, Actuators and",
  "content_length": 10834,
  "method": "requests",
  "crawl_time": "2025-12-01 14:53:06"
}