{
  "name": "Yu Wang 0093",
  "homepage": "https://itwoi.github.io",
  "status": "success",
  "content": "Yu Wang Search Yu WANG Assistant Researcher Nanjing University Biography I’m an assistant researcher at the Software Engineering Group (SEG) at Nanjing University. My research interests lie in software testing and program language, including static and dynamic analysis. Recently, I focus on improving the performance of program analysis by machine learning. I am currently recruiting PhD, Master’s, and undergraduate students. If you’re interested, please feel free to reach out to me via email. Interests Software Engineering Programming Language Artificial Intelligence Education PhD in Computer Science, 2014.09 - 2021.03 Nanjing University Visiting Scholar, 2017.10 - 2018.10 University of California, Davis Visiting Scholar, 2017.02 - 2017.09 Hong Kong University of Science and Technology BSc in Software Engineering, 2010.09 - 2014.06 University of Electronic Science and Technology of China Featured Publications Checkout all publications. Qian Chen, Chenqi Cui, Fengjuan Gao, Yu Wang, Ke Wang, Linzhang Wang June, 2025 PLDI Solving Floating-Point Constraints with Continuous Optimization Cite DOI URL Jiayi Wang, Yu Wang, Ke Wang, Linzhang Wang March, 2025 TOSEM SILVA: A Scalable Incremental Layered Sparse Value-Flow Analysis Cite DOI URL Qian Chen, Chenyang Yu, Ruyan Liu, Chi Zhang, Yu Wang, Ke Wang, Ting Su, Linzhang Wang April, 2024 OOPSLA Evaluating the Effectiveness of Deep Learning Models for Foundational Program Analysis Tasks Cite DOI URL Yu Wang, Ke Wang, Linzhang Wang October, 2023 Proc. ACM Program. Lang. An Explanation Method for Models of Code Cite DOI URL Yu Wang, Ke Wang, Fengjuan Gao, Linzhang Wang November, 2020 Proceedings of the ACM on Programming Languages Learning semantic program embeddings with graph interval neural network in Proceedings of the ACM SIGPLAN Conference on Object-Oriented Programming Systems, Languages, and Applications 2020 (OOPSLA 20) Distinguished Paper award Cite DOI Distinguished Paper award Teaching “Basic Programming in C++”, Lecturer, 2021.9 - 2023.6 “Advanced Programming in C++”, Lecturer, 2022.2 - Now “Software Engineering”, Lecturer, 2023.9 - Now Service Journal Reviewer Journal of Software Chinese Journal of Computers Automated Software Engineering IEEE Transactions on Software Engineering ACM Transactions on Software Engineering and Methodology Conference Reviewer PLDI Artifact Evaluation 2023/2024 ChinaSoft 2021/2024 Other Service Internetware 2023 web chair Organizing committee member of CCF Compiler Technology Workshop 2022 Fundings Participator of National Foundation National Natural Science Foundation of China, Project No. 62032010, 2021.01-2025.12. (基于模糊测试的物联网设备固件漏洞检测技术研究) National Key R&D Program, No. 2017YFA0700604, 2017.10-2023.12. (智能制造软件形式化验证和性能优化技术) National Key R&D Program, No. 2016YFB1000802, 2016.07-2019.12. (复杂软件测试验证智能化关键技术与支撑环境) National Natural Science Foundation of China, No. 61472179, 2015.1-2018.12 (模型驱动的移动应用测试方法) Principle Investigator Huawei Project, 2021.10-2022.9. (可扩展的静态分析框架) CCF-Huawei Innovation Research Award on Systems Software, 2021.10-2022.9. (基于不一致性的鸿蒙操作系统安全缺陷预测) 2020 Shanghai Industrial Control System Security Innovation Functional Platform Open Project, 2021.3-2022.2. (深度学习模型可解释性技术研究) 2019 Nanjing University Outstanding Doctoral Students Innovation Ability Enhancement Program B, 2019.6-2020.5. (数据竞争的智能化检测方法) Participator of Technical R&D Projects Huawei Project, 2021.11-2022.10. (代码分析平台与深度检测技术) Huawei Project, 2021.8-2022.7. (新指令自动发掘技术研究) Huawei Project, 2019.12-2020.11. (代码分析平台与缺陷自动修复技术) Huawei Project, 2019.12-2020.11. (安全与功能类问题检测技术) Huawei Project, 2019.12-2020.11. (性能问题检测技术) Huawei Project, 2015.9-2016.8. (代码静态检查技术) Contact yuwang_cs(AT)nju.edu.cn No. 163 Xianlin Road, Nanjing, Jiangsu 210023 Enter Building Computer Science and Technology and take the elevator to Office 619 on Floor 6 Cite × Copy Download",
  "content_length": 3856,
  "method": "requests",
  "crawl_time": "2025-12-01 14:53:06"
}