{
  "name": "Yu Wang 0003",
  "homepage": "https://cis.temple.edu/~yu",
  "status": "success",
  "content": "Yu Wang Yu Wang Professor and Chair, FIEEE, DMACM Wireless and Advanced Networking Group (WANG Lab) and Center for Networked Computing Department of Computer and Information Sciences Temple University Science Education and Research Center (SERC) 304A 1925 N. 12th Street Philadelphia, Pennsylvania 19122, USA +1-215-204-4187 (office) wangyu at temple dot edu Office Hour: 2-3pm on Monday/Wednesday or by email appointment Brief CV / Short Bio / Academic Ancestors \"There is nothing more practical than a good theory\" - Kurt Lewin (1952) News 2025-8-1 Congratulations to Bivor for starting as an Assistant Professor in the Department of Computer & Information Sciences at Towson University! 2024-12-5 Congratulations to Jiyao for winning the 2024 Award for Outstanding Research by a Graduate Student of the College of Science and Technology! 2024-6-17 Our VANET routing survey (2007) won the IEEE Vehicular Technology Society Best Magazine Paper Award! 2024-4-1 Congratulations to Jiyao for for winning the CIS Outstanding Graduate Research Assistant Award! 2023-8-1 Congratulations to Xinliang for starting as an assistant professor at Shenzhen Institute of Advanced Technology, Chinese Academy of Sciences, China! 2023-8-1 Congratulations to Jiyao for accepting an internship offer from the Toyato Info Tech Labs! 2023-4-20 Congratulations to Xinliang for successfully defensing his dissertation and winning the Scott Hibbs Future of Computing Award this year! Research My research is broadly related to networking, sensing and computing. Research Interests: Wireless Networks, Smart Sensing, Distributed Computing, Security and Privacy Publications: check Google Scholar Profile and DBLP Current Students: Jiyao Liu, Ph.D. Student Xuanzhang Liu, Ph.D. Student Graduated PhD Students: Cheng Bo, now at Google. Siyuan Chen, now at California DOJ. Minsu Huang, now at Uber. Fan Li, now Full Professor at Beijing Institute of Technology. Hanshang Li, now at Meta. Ting Li, now Assistant Professor at Oxford College of Emory University. A B M Mohaimenur (Bivor) Rahman, now Assistant Professor at Towson University Xinliang (Bruce) Wei, now Assistant Professor at Shenzhen Institutes of Advanced Technology, Chinese Academy of Sciences, China Ying Zhu, now at Google. We are grateful for funding from: National Science Foundation Department of Transportation Microsoft Oak Ridge Associated Universities Teaching CIS 3223 Data Structures and Algorithms, Spring 2021 CIS 3319 Wireless Network and Security, Fall 2020/2021/2022/2023/2024/2025 CIS 5639 Wireless Network and Communication, Spring 2020/2022/2024 CIS 5637 Network and Information Security, Spring 2023 Service Editor: IEEE TCC (2021-), IEEE TPDS (2013-2016), IJAHUC (2006-2017), IJDSN (2013-2016), KSII TIIS (2012-2016), TST (2012-), BDMA (2017-), etc. Conference Organizer: General Co-Chair, IEEE IPCCC 2025, IEEE MASS 2025, SOFC 2024, WICN 2024, BigCom 2021, IEEE IPCCC 2019, CASPer 2019, BigCom 2016; Program Co-Chair, IEEE IPCCC 2024, IEEE MASS 2023, WICN 2023, IEEE CPSCom 2016, BigCom 2015, IEEE IPCCC 2011; Track Co-Chair, ICCCN 2018; EDAS Chair, ACM MobiHoc 2014; Finance Chair, ACM Mobihoc 2023/2012, etc. Conference TPC: IEEE InfoCom 2008-25, ACM MobiHoc 2014, WWW 2018, IEEE ICDCS 2015, IEEE IPDPS 2016/2020, IEEE ICC 2019-23/25, etc. Reviewer/Panelist: US NSF, US NASA, US DOE, NSERC (Canada), RGC (Hong Kong), SNSF (Switzerland), CONICYT (Chile), AAAS, etc. Society: Chair, IEEE ComSoc Charlotte Chapter (2012-14,18-19), Member, IEEE CS Fellows Evaluation Committee (2019, 2020), etc. CIS PhD Program: Program Requirements and Milestones (before Fall 2023) (QE form) Program Requirements and Milestones (since Fall 2023) (QE form) Award IEEE Benjamin Franklin Key Award (2024) ACM Distinguished Member (2020) Fellow of IEEE (2018) Best Paper Award: IEEE VTS Best Magazine Paper (2024), Tsinghua Science of Technology (2015), IEEE IPCCC (2013), IEEE MASS (2013), IEEE HICSS-35 (2002) Best Paper RunnerUp Award / Best Paper Candidate: IEEE DSC (2019), IEEE MASS (2011) Best Poster Award: ACM Mobicom (2016) Outstanding Faculty Research Award (2008) & Excellence in Graduate Teaching Award (2012), College of Computing and Informatics at UNC Charlotte Ralph E. Powe Junior Faculty Enhancement Awards, Oak Ridge Associated Universities (2006) Misc. Research: CISE/Research.gov, CRA, IEEEXplore, ACMDL, SCI, EDAS, CCF Ranking, CORE Ranking, CS Ranking, Research.com, LaTexSyb, Dict, You & Your Research (Richard Hamming), PhD Research: Elements of Excellence (Ness Shroff), Mathematical Writing (Donald E. Knuth, Tracy Larrabee, and Paul M. Roberts), The Science of Scientific Writing (George D. Gopen and Judith A. Swan), The Elements of Style (Strunk and White) Temple: Schedule, Zoom, TUportal, Canvas",
  "content_length": 4769,
  "method": "requests",
  "crawl_time": "2025-12-01 14:53:07"
}