{
  "name": "Yu Wu 0011",
  "homepage": "https://yu-wu.net",
  "status": "success",
  "content": "Yu Wu's Homepage Yu Wu Professor Wuhan University Biography I am Yu Wu (武宇), a Full Professor at School of Computer Science, Wuhan University. Before that I was a postdoc at Visual AI Lab, Princeton University from 2021 to 2022. I received my Ph.D. at the ReLER Lab, University of Technology Sydney, advised by Prof.Yi Yang. I received the B.Eng degree in Mechanical Engineering from Shanghai Jiao Tong University. Here are my Google Scholar and CV. Looking for highly-motivated Postdoc/Ph.D. students for 2023! Feel free to drop me an email with your CV. 中文网站 News 2023.02: Served as the NeurIPS 2023 Area Chair. 2022.06: Served as the CVPR 2023 Workshop Chair and Area Chair. 2021.09: We are organizing the Video Scene Parsing in the Wild workshop at ICCV 21. 2021.06: Ranked 1st in Large-scale Video Object Segmentation Challenge @CVPR21. 2021.06: I was selected for CVPR 2021 Doctoral Consortium. 2020.10: I was awarded the Google PhD Fellowship. 2020.06: We won the 1st place in the EPIC-Kitchens Action Recognition Challenge @ CVPR20 for the second year. Our report can be find here. 2019.06: We ranked 1st in the EPIC-Kitchens Action Recognition Challenge @ CVPR19. Publications Enabling Detailed Action Recognition Evaluation Through Video Dataset Augmentation Jihoon Chung, Yu Wu, Olga Russakovsky NeurIPS, 2022 PDF Code SiRi: A Simple Selective Retraining Mechanism for Transformer-based Visual Grounding Mengxue Qu, Yu Wu, Wu Liu, Qiqi Gong, Xiaodan Liang, Olga Russakovsky, Yao Zhao, Yunchao Wei ECCV, 2022 PDF Multi-query Video Retrieval Zeyu Wang, Yu Wu, Karthik Narasimhan, Olga Russakovsky ECCV, 2022 PDF Quantized GAN for Complex Music Generation from Dance Videos Ye Zhu, Kyle Olszewski, Yu Wu, Panos Achlioptas, Menglei Chai, Yan Yan, Sergey Tulyakov ECCV, 2022 PDF Learning to Learn by Jointly Optimizing Neural Architecture and Weights Yadong Ding, Yu Wu, Chengyue Huang, Siliang Tang, Yi Yang, Longhui Wei, Yueting Zhuang, Qi Tian CVPR, 2022 PDF Code Large-scale Video Panoptic Segmentation in the Wild: A Benchmark Jiaxu Miao, Xiaohan Wang, Yu Wu, Wei Li, Xu Zhang, Yunchao Wei, Yi Yang CVPR, 2022 PDF Code Dataset Supplement Switchable Novel Object Captioner Yu Wu, Lu Jiang, Yi Yang IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI), 2022 PDF Bibtex Saying the Unseen: Video Descriptions via Dialog Agents Ye Zhu, Yu Wu, Yi Yang, Yan Yan IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI), 2021 PDF Code Exploring Heterogeneous Clues for Weakly-Supervised Audio-Visual Video Parsing Yu Wu, Yi Yang CVPR, 2021 PDF Code Bibtex VSPW: A Large-scale Dataset for Video Scene Parsing in the Wild Jiaxu Miao, Yunchao Wei, Yu Wu, Chen Liang, Guangrui Li, Yi Yang CVPR, 2021 PDF Code Dataset Video Bibtex Learning to Anticipate Egocentric Actions by Imagination Yu Wu, Linchao Zhu, Xiaohan Wang, Yi Yang, Fei Wu IEEE Transactions on Image Processing (TIP), 2021 PDF Bibtex Progressive Transfer Learning for Face Anti-Spoofing Ruijie Quan, Yu Wu, Xin Yu, Yi Yang IEEE Transactions on Image Processing (TIP), 2021 PDF Identifying Visible Parts via Pose Estimation for Occluded Person Re-Identification Jiaxu Miao, Yu Wu, Yi Yang IEEE Transactions on Neural Networks and Learning Systems (TNNLS), 2021 PDF Bibtex Learning Audio-Visual Correlations from Variational Cross-Modal Generation Ye Zhu, Yu Wu, Hugo Latapie, Yi Yang, Yan Yan ICASSP, 2021 PDF Learning with Noisy Labels via Self-Reweighting from Class Centroids Fan Ma, Yu Wu, Xin Yu, Yi Yang IEEE Transactions on Neural Networks and Learning Systems (TNNLS), 2021 PDF Bibtex Holistic LSTM for Pedestrian Trajectory Prediction Ruijie Quan, Linchao Zhu, Yu Wu, Yi Yang IEEE Transactions on Image Processing (TIP), 2021 PDF Describing Unseen Videos via Multi-Modal Cooperative Dialog Agents Ye Zhu, Yu Wu, Yi Yang, Yan Yan ECCV, 2020 PDF Code Symbiotic Attention for Egocentric Action Recognition with Object-centric Alignment Xiaohan Wang, Linchao Zhu, Yu Wu, Yi Yang IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI), 2020 PDF Gated Channel Transformation for Visual Recognition Zongxin Yang, Linchao Zhu, Yu Wu, Yi Yang CVPR, 2020 PDF Code Unsupervised Person Re-identification via Softened Similarity Learning Yutian Lin, Lingxi Xie, Yu Wu, Chenggang Yan, Qi Tian CVPR, 2020 PDF Imitative Non-Autoregressive Modeling for Trajectory Forecasting and Imputation Mengshi Qi, Jie Qin, Yu Wu, Yi Yang CVPR, 2020 PDF Video Unsupervised Person Re-identification via Cross-camera Similarity Exploration Yutian Lin, Yu Wu, Chenggang Yan, Mingliang Xu, Yi Yang IEEE Transactions on Image Processing (TIP), 2020 PDF Bibtex Revisiting EmbodiedQA: A Simple Baseline and Beyond Yu Wu, Lu Jiang, Yi Yang IEEE Transactions on Image Processing (TIP), 2020 PDF Bibtex Symbiotic Attention with Privileged Information for Egocentric Action Recognition Xiaohan Wang, Yu Wu, Linchao Zhu, Yi Yang AAAI (Oral), 2020 PDF Cascaded Revision Network for Novel Object Captioning Qianyu Feng, Yu Wu, Hehe Fan, Chenggang Yan, Mingliang Xu, Yi Yang IEEE Transactions on Circuits and Systems for Video Technology (TCSVT), 2020 PDF Code Dual Attention Matching for Audio-Visual Event Localization Yu Wu, Linchao Zhu, Yan Yan, Yi Yang ICCV (Oral), 2019 PDF Bibtex Pose-Guided Feature Alignment for Occluded Person Re-identification Jiaxu Miao, Yu Wu, Ping Liu, Yuhang Ding, Yi Yang ICCV, 2019 PDF Code Dataset Auto-ReID: Searching for a Part-aware ConvNet for Person Re-Identification Ruijie Quan, Xuanyi Dong, Yu Wu, Linchao Zhu, Yi Yang ICCV, 2019 PDF Baidu-UTS Submission to the EPIC-Kitchens Action Recognition Challenge 2019 Xiaohan Wang, Yu Wu, Linchao Zhu, Yi Yang We achieved the 1st place in the EPIC-Kitchens Action Recognition Challenge @ CVPR19. This is our report in the CVPR Workshop, 2019 PDF Official Site Improving Person Re-identification by Attribute and Identity Learning Yutian Lin, Liang Zheng, Zhedong Zheng, Yu Wu, Zhilan Hu, Chenggang Yan, Yi Yang Pattern Recognition, 2019 PDF Code Dataset Bibtex Progressive Learning for Person Re-Identification with One Example Yu Wu, Yutian Lin, Xuanyi Dong, Yan Yan, Wei Bian, Yi Yang IEEE Transactions on Image Processing (TIP), 2019 PDF Code Dataset Bibtex IEEE Decoupled Novel Object Captioner Yu Wu, Linchao Zhu, Lu Jiang, Yi Yang ACM-MM,2018 PDF Code Bibtex Exploit the Unknown Gradually: One-Shot Video-Based Person Re-Identification by Stepwise Learning Yu Wu, Yutian Lin, Xuanyi Dong, Yan Yan, Wanli Ouyang, Yi Yang CVPR, 2018 PDF Code Dataset Bibtex Contact wuyucs@whu.edu.cn School of Computer Science D507, Wuhan University, Wuhan, 430000, China × Cite Copy Download",
  "content_length": 6639,
  "method": "requests",
  "crawl_time": "2025-12-01 14:53:06"
}