{
  "name": "Yu Yin 0001",
  "homepage": "https://yin-yu.github.io",
  "status": "success",
  "content": "Yu Yin's Homepage Welcome to Yu Yin's Homepage Biography Education Publications Activities Awards Yu Yin (印宇) PI and Lab Director of VULab Assistant Professor, Department of CDS Case Western Reserve University, Cleveland, USA Email (yu.yin[at]case.edu) GitHub Linkedin What's New [2025.11] Check out our newly released Awesome-Spatial-VLMs github repo, a community-maintained companion resource to our survey paper: Spatial Intelligence in Vision-Language Models: A Comprehensive Survey ! [2025.11] 1 papers accepted by AAAI 2026! [2025.09] We have 3 papers accepted by NeurIPS 2025! [2025.08] 3 papers accepted by EMNLP 2025 (1 main track + 2 findings). [2025.05] 1 paper accepted by ACL 2025. [2025.05] We will organize The 12th IEEE International Workshop on Analysis and Modeling of Faces and Gestures (AMFG) at ICCV 2025. [2025.02] Our paper \"Blur-Aware Reconstruction of Dynamic Scenes via Gaussian Splatting\" is accepted by CVPR 2025. Congratulations to Yiren! [2024.12] 1 paper accepted by AAAI 2025. [2024.11] Our paper on multi-agent argument generation has been accepted by COLING 2025. [2024.09] Our paper Cracking the Code of Juxtaposition has been accepted by NeurIPS 2024 as an Oral! [2024.09] We have 1 paper accepted by EMNLP 2024. [2024.08] I recieved the Teaching Award from the Department of Computer and Data Sciences at CWRU. [2024.07] One paper on 3D scene editing has been accepted by ACM MM 2024. [2024.07] Our paper on argument generation has been accepted by INLG 2024 (Oral). [2023.09] Our paper on deepfake detection has been accepted by ICDM 2023. [2023.05] I will be joining the Department of Computer and Data Science at Case Western Reserve University (CWRU) as a Tenure-Track Assistant Professor from Fall 2023! [2023.04] We will organize The 11th IEEE International Workshop on Analysis and Modeling of Faces and Gestures (AMFG) at ICCV 2023. [2023.04] I received the Dissertation Completion Fellowship from Northeastern University. [2023.02] One paper on 3D face animation (\"NeRFInvertor\") has been accepted by CVPR 2023. [...] More Openings: I am continuously looking for highly-motivated Master students and Interns to work on computer vision and machine learning (e.g., 3D vision, VLM, VLA, generative models). Please send me your CV if interested. × More Previous News [2022.12] Two papers accepted by IEEE Trans. on Image Processing (TIP)! [2022.07] One paper accepted by ACM MM 2022! [2022.03] One paper has been accepted by ACM ICMR 2022. [2022.02] This summer, I will be interning at Microsoft again, working on NeRF models for face animation! [2021.12] Our paper has been accepted by SDM 2022. [2021.07] One paper has been accepted by ACM MM 2021 . [2021.02] I will be joining Microsoft this summer as a research intern focusing on image editing! [2020.12] Our paper has been accepted by SDM 2021. [2020.05] Our paper has been accepted by ICDM 2020. [2020.01] I will be working as a research intern in Zillow's CV group, focusing on floorplan generation to benefit 3D vitual home tours! [2020.03] We release the code for DA-GAN (accepted by FG 2020) at Github_DA-GAN. [2020.03] Our paper has been accepted by FG 2020. [2019.12] We release the code for JASRNet (accepted by AAAI 2020) at Github_JASRNet. [2019.11] Our paper has been accepted by AAAI 2020. [2019.08] Our paper is accepted by Expert Systems With Applications (IF: 4.292). [2019.02] Our paper is accepted by IEEE Journal of Translational Engineering in Healthand Medicine (JTEHM). [2018.10] Our paper is accepted by IEEE Journal of Translational Engineering in Healthand Medicine (JTEHM). [2018.06] Our paper is accepted by IJCAI Workshop 2018. [2017.10] Our paper is accepted by IEEE-NIH Special Topics Conference on Healthcare Innovations and Point-of-Care Technologies (HI-POCT'17). Biography I am a tenure-track assistant professor in the Department of Computer & Data Science at Case Western Reserve University. Before that I received my PH.D. degree in Computer Engineering from Northeastern University in Aug. 2023. During this time, I was under the guidance and supervision of Prof. Yun (Raymond) Fu in the SMILE Lab. I received my master degree in Electrical & Computer Engineering from Northeastern University in Dec. 2018, and B.E degree from School of Electronic Engineering, Wuhan University of Technology, China, in Jul. 2016. From Fall 2016, I was a member of the Augmented Cogniton (AClab), under the supervision of Prof. Sarah Ostadabbas. My research interest broadly includes visual synthesis and understanding, multi-modality fusion, and transfer learning. My recent research topics lie in unified representation learning, 3d modeling and animation, and a wide range of computer vision applications, including image synthesis, 3D novel-view synthesis, face restoration, forensics detection, 3D model generation and rendering, etc. Education 01/2019 - 08/2023: Ph.D. in Computer Engineering, Northeastern University, Boston, USA 09/2016 - 12/2018: M.S. in Electrical and Computer Engineering, Northeastern University, Boston, USA 09/2012 - 07/2016: B.E. in Electrical and Information Engineering, Wuhan University of Technology, Wuhan, China Teaching Deep Generative Models course (CSDS 570), Case Western Reserve University, USA, 2025 Spring Computer Vision course (CSDS 465), Case Western Reserve University, USA, 2024 Spring & Fall, 2025 Fall Special Topics on Generative Models course (CSDS 600), Case Western Reserve University, USA, 2023 Fall Data Visualization course (EECE 5642), Northeastern University, USA, 2021 Spring Patents Yun Fu, Yu Yin, “Frontal Face Synthesis from Low-Resolution Images.” U.S. Patent Application No. 17/156,204. Yu Yin, Will A. Hutchcroft, Ivaylo Boyadzhiev, Sing Bing Kang, Yujie Li, Pierre Moulon, “Automated Identification And Use Of Building Floor Plan Information.” U.S. Patent Application No. 17/472,527. Awards Teaching Award, Department of Computer and Data Sciences, Case Western Reserve University, USA, 2024 PhD Spotlight, Northeastern University, USA, 2023 Women Who Empower Innovator Awards semi-finalists, Northeastern University, USA, 2023 Dissertation Fellowship, Northeastern University, USA, 2023 NSF I-Corps Grant, 2022 PhD Network Grant, Northeastern University, USA, 2019, 2023 Conference Travel Grant: AAAI'20, SIG MM'22, CVPR'23 Excellent Bachelor Thesis of Wuhan University of Technology, 2016 Scholarship of Wuhan University of Technology, 2013, 2014, 2015 Activities Program Chair: ICCV-AMFG (2025) ICCV-AMFG (2023) CVPR-AMFG (2021) FG-RFIW (2020) Journal Reviewer IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI) IEEE Transactions on Image Processing (TIP) IEEE Transactions on Neural Networks and Learning Systems (TNNLS) IEEE Transactions on Cybernetics (TCyber) IEEE Transactions on Circuits and Systems for Video Technology (TCSVT) IEEE Internet of Things (IoT) Information Sciences (Elsevier) Program Committee Member CVPR (2020-2025) ECCV / ICCV (2020-2025) NeurIPS (2024-2025) ICLR (2024-2025) ICML (2024-2025) ACL Rolling Review (ARR) (2024-2025) IJCAI (2019-2025) AAAI (2021-2026) ACM MM (2023-2025) Publications Preprints [Awesome-Spatial-VLMs] Spatial Intelligence in Vision-Language Models: A Comprehensive Survey Disheng Liu, Tuo Liang, Zhe Hu, Jierui Peng, Yiren Lu, Yi Xu, Yun Fu, Yu Yin Counterfactual Visual Explanation via Causally-Guided Adversarial Steering ResSVD: Residual Compensated SVD for Large Language Model Compression When 'YES' Meets 'BUT': Can Large Models Comprehend Contradictory Humor Through Comparative Reasoning? Causal3D: A Comprehensive Benchmark for Causal Learning from Visual Data Conferences & Journals 2025 Segment then Splat: A Unified Approach for 3D Open-Vocabulary Segmentation based on Gaussian Splatting Conference on Neural Information Processing Systems (NeurIPS), 2025 Yiren Lu, Yunlai Zhou, Yiran Qiao, Chaoda Song, Tuo Liang, Jing Ma, Huan Wang, Yu Yin Praxis-VLM: Vision-Grounded Decision Making via Text-Driven Reinforcement Learning Conference on Neural Information Processing Systems (NeurIPS), 2025 Zhe Hu, Jing Li, Zhongzhu Pu, Hou Pong Chan, Yu Yin Fix False Transparency by Noise Guided Splatting Conference on Neural Information Processing Systems (NeurIPS), 2025 Aly El Hakie, Yiren Lu, Yu Yin, Michael W. Jenkins, Yehe Liu BARD-GS: Blur-Aware Reconstruction of Dynamic Scenes via Gaussian Splatting Computer Vision and Pattern Recognition Conference (CVPR), 2025 Yiren Lu, Yunlai Zhou, Disheng Liu, Tuo Liang, Yu Yin Certified Causal Defense with Generalizable Robustness The Association for the Advancement of Artificial Intelligence (AAAI), 2025 Yiran Qiao, Yu Yin, Chen Chen, Jing Ma Debate-to-Write: A Persona-Driven Multi-Agent Framework for Diverse Argument Generation International Conference on Computational Linguistics (COLING), 2025 Zhe Hu, Hou Pong Chan, Jing Li, and Yu Yin Cautious Next Token Prediction Findings of the Association for Computational Linguistics (ACL), 2025 Yizhou Wang, Lingzhi Zhang, Yue Bai, Mang Tik Chiu, Zhengmian Hu, Mingyuan Zhang, Qihua Dong, Yu Yin, Sohrab Amirghodsi, Yun Fu Quantized but Deceptive? A Multi-Dimensional Truthfulness Evaluation of Quantized LLMs Conference on Empirical Methods in Natural Language Processing (EMNLP), 2025 (Main track) Yao Fu, Xianxuan Long, Runchao Li, Haotian Yu, Mu Sheng, Xiaotian Han, Yu Yin, Pan Li Pruning Weights but Not Truth: Safeguarding Truthfulness While Pruning LLMs Conference on Empirical Methods in Natural Language Processing (EMNLP), 2025 (Findings track) Yao Fu, Runchao Li, Xianxuan Long, Haotian Yu, Xiaotian Han, Yu Yin, Pan Li Towards Open-set Face Anti-spoofing with Unseen Attack Synthesis IEEE 19th International Conference on Automatic Face and Gesture Recognition (FG), 2025 Chang Liu, Yitian Zhang, Yu Yin, Yun Fu 2024 & before Cracking the Code of Juxtaposition: Can AI Models Understand the Humorous Contradictions Zhe Hu*, Tuo Liang*, Jing Li, Yiren Lu, Yunlai Zhou, Yiran Qiao, Jing Ma, and Yu Yin (*co-first author",
  "content_length": 45617,
  "method": "requests",
  "crawl_time": "2025-12-01 14:53:06"
}