{
  "name": "Yu Zhang 0006",
  "homepage": "http://cse.sustech.edu.cn/faculty/~zhangy",
  "status": "success",
  "content": "Yu Zhang's Homepage I obtained my bachelor and master degrees from Nanjing University and PhD degree from Hong Kong University of Science and Technology (HKUST). Prior to joining Southern University of Science and Technology (SUSTech), I have worked in HKUST and Hong Kong Baptist University (HKBU) for about eight years. My current research interests include artificial intelligence, machine learning, pattern recognition, and data mining. I am especially interested in multi-task learning, transfer learning, meta learning, deep learning, and semi-supervised learning. Books Qiang Yang, Yu Zhang, Wenyuan Dai, and Sinno Jialin Pan. Transfer Learning. Cambridge University Press, ISBN 9781107016903, 2020. (A Chinese Translation has been published by China Machine Press with ISBN 9787111661283.) (Choice Outstanding Academic Title 2020, Choice Reviews) Refereed Journal Papers Pengxin Guo, Pengrong Jin, Ziyue Li, Lei Bai, and Yu Zhang. Online Test-Time Adaptation of Spatial-Temporal Traffic Flow Forecasting. To appear in IEEE Transactions on Intelligent Transportation Systems (TITS). Yang Chen, Shuai Fu, and Yu Zhang. MoPD: Mixture-of-Prompts Distillation for Vision-Language Models. To appear in IEEE Transactions on Multimedia (TMM). Yuepeng Jiang, Yunhao Gou, Wenbo Zhang, Xuehao Wang, Yu Zhang, and Qiang Yang. Mitigating Scale Imbalance and Conflicting Gradients in Deep Multi-Task Learning. To appear in Frontiers of Computer Science (FCS). Yulong Zhang, Shuhao Chen, Weisen Jiang, Yu Zhang, Jiangang Lu, and James T. Kwok. Domain-Guided Conditional Diffusion Model for Unsupervised Domain Adaptation. Neural Networks (NN), 184: 107031, 2025. Jinjing Zhu, Feiyang Ye, Qiao Xiao, Pengxin Guo, Yu Zhang, and Qiang Yang. A Versatile Framework for Unsupervised Domain Adaptation based on Instance Weighting. IEEE Transactions on Image Processing (TIP), 33: 6633-6646, 2024. Feiyang Ye, Baijiong Lin, Zhixiong Yue, Yu Zhang, and Ivor Tsang. Multi-Objective Meta-Learning. Artificial Intelligence (AIJ), 335: 104184, 2024. Shijie Chen, Yu Zhang, and Qiang Yang. Multi-Task Learning in Natural Language Processing: An Overview. ACM Computing Surveys (CSUR), 56(12): 295, 2024. Youzhi Qu, Kai Fu, Linjing Wang, Yu Zhang, Haiyan Wu, and Quanying Liu. Hypergraph-based Multi-Task Feature Selection with Temporally-Constrained Group Sparsity Learning on fMRI. Mathematics, 12(11): 1733, 2024. Qiao Xiao, Yu Zhang, and Qiang Yang. Selective Random Walk for Transfer Learning in Heterogeneous Label Spaces. IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI), 46(6): 4476-4488, 2024. Baijiong Lin and Yu Zhang. LibMTL: A Python Library for Multi-Task Learning. Journal of Machine Learning Research (JMLR), 24: 1-7, 2023. Yi Zhang, Yu Zhang, and Wei Wang. Learning Linear and Nonlinear Low-Rank Structure in Multi-Task Learning. IEEE Transactions on Knowledge and Data Engineering (TKDE), 35(8): 8157-8170, 2023. Shujun Yang, Yu Zhang, Yao Ding, and Danfeng Hong. Superpixelwise Low-rank Approximation based Partial Label Learning for Hyperspectral Image Classification. IEEE Geoscience and Remote Sensing Letters (GRSL), 20:5504905, 2023. Yuan Yao, Xutao Li, Yu Zhang, and Yunming Ye. Multi-Source Heterogeneous Domain Adaptation with Conditional Weighting Adversarial Network. IEEE Transactions on Neural Networks and Learning Systems (TNNLS), 34(4): 2079-2092, 2023. (A technical report is available at arXiv.) Yu Zhang and Qiang Yang. A Survey on Multi-Task Learning. IEEE Transactions on Knowledge and Data Engineering (TKDE), 34(12): 5586–5609, 2022. (A technical report is available at arXiv.) Baijiong Lin, Feiyang Ye, Yu Zhang, and Ivor W. Tsang. Reasonable Effectiveness of Random Weighting: A Litmus Test for Multi-Task Learning. Transactions on Machine Learning Research (TMLR), 2022. Shujun Yang, Yu Zhang, Yuheng Jia, and Weijia Zhang. Local Low-Rank Approximation With Superpixel-Guided Locality Preserving Graph for Hyperspectral Image Classification. IEEE Journal of Selected Topics in Applied Earth Observations and Remote Sensing (JSTARS), 15: 7741-7754, 2022. (Code) Shuangyin Li, Weiwei Chen, Yu Zhang, Gansen Zhao, Rong Pan, Zhenhua Huang, and Yong Tang. A Context-Enhanced Sentence Representation Learning Method for Close Domains with Topic Modeling. Information Sciences, 607(August): 186–210, 2022. Shuangyin Li, Yu Zhang, and Rong Pan. Bi-Directional Recurrent Attentional Topic Model. ACM Transactions on Knowledge Discovery from Data (TKDD), 14(6): article 74, 2020. Yuan Yao, Yu Zhang, Xutao Li, and Yunming Ye. Discriminative Distribution Alignment: A Unified Framework for Heterogeneous Domain Adaptation. Pattern Recognition (PR), 101: article 107165, 2020. Yuan Yao, Xutao Li, Yunming Ye, Feng Liu, Michael K. Ng, Zhichao Huang, and Yu Zhang. Low-Resolution Image Categorization via Heterogeneous Domain Adaptation. Knowledge-Based Systems (KBS), 163(1): 656–665, 2019. Yu Zhang and Qiang Yang. An Overview of Multi-Task Learning. National Science Review (NSR), 5(1): 30–43, 2018. (A Chinese translation can be found here.) (Best Paper Award) Qing Bao, William K. Cheung, Yu Zhang, and Jiming Liu. A Component-based Diffusion Model with Structural Diversity for Social Networks. IEEE Transactions on Cybernetics (TCYB), 47(4): 1078-1089, 2017. Yu Zhang, William K. Cheung, and Jiming Liu. A Unified Framework for Epidemic Prediction based on Poisson Regression. IEEE Transactions on Knowledge and Data Engineering (TKDE), 27(11): 2878-2892, 2015. (Link) Deming Zhai, Yu Zhang, Dit-Yan Yeung, Hong Chang, Xilin Chen, and Wen Gao. Instance-Specific Canonical Correlation Analysis. Neurocomputing, 155(1): 205-218, 2015. Yu Zhang and Dit-Yan Yeung. A Regularization Approach to Learning Task Relationships in Multitask Learning. ACM Transactions on Knowledge Discovery from Data (TKDD), 8(3): article 12, 2014. (Link) Yu Zhang and Dit-Yan Yeung. Multilabel Relationship Learning. ACM Transactions on Knowledge Discovery from Data (TKDD), 7(2): article 7, 2013. (Link) Yu Zhang and Dit-Yan Yeung. Transfer Metric Learning with Semi-Supervised Extension. ACM Transactions on Intelligent Systems and Technology (TIST), 3(3): article 54, 2012. (Link) Yu Zhang and Dit-Yan Yeung. Semisupervised Generalized Discriminant Analysis. IEEE Transactions on Neural Network (TNN), 22(8): 1207-1217, 2011. (Link) Yu Zhang and Zhi-Hua Zhou. A New Age Estimation Method based on Ensemble Learning. ACTA AUTOMATICA SINICA, 34(8): 997-1000, 2008. (in Chinese) Yu Zhang and Zhi-Hua Zhou. Research on Facial Features that Impact Gender Classification. Journal of Jiangsu Polytechnic University, 17: 9–12, 2005. (in Chinese) (Best Paper Award by Jiangsu Province Computer Society 2005) Refereed Conference Papers Hao Zhang, Zhan Zhuang, Xuehao Wang, Xiaodong Yang, and Yu Zhang. MoPFormer: Motion-Primitive Transformer for Wearable-Sensor Activity Recognition. In: Proceedings of the Thirty-Ninth Annual Conference on Neural Information Processing Systems (NeurIPS), San Diego, USA, 2025. Yanbin Wei, Xuehao Wang, Zhan Zhuang, Yang Chen, Shuhao Chen, Yulong Zhang, James Kwok, and Yu Zhang. Open the Eyes of MPNN: Vision Enhances MPNN in Link Prediction. In: Proceedings of the Forty-Second International Conference on Machine Learning (ICML), Vancouver, Canada, 2025. Zhan Zhuang, Xiequn Wang, Wei Li, Yulong Zhang, Qiushi Huang, Shuhao Chen, Xuehao Wang, Yanbin Wei, Yuhe Nie, Kede Ma, Yu Zhang, and Ying Wei. Come Together, But Not Right Now: A Simple Strategy to Boost Low-Rank Adaptation. In: Proceedings of the Forty-Second International Conference on Machine Learning (ICML), Vancouver, Canada, 2025. Xiequn Wang, Zhan Zhuang, and Yu Zhang. PLAN: Proactive Low-Rank Allocation for Continual Learning. In: Proceedings of the International Conference on Computer Vision (ICCV), Honolulu, USA, 2025. Qiushi Huang, Tom Ko, Zhan Zhuang, Lilian Tang, and Yu Zhang. HiRA: Parameter-Efficient Hadamard High-Rank Adaptation for Large Language Models. In: Proceedings of the Thirteenth International Conference on Learning Representations (ICLR), Singapore, 2025. (Oral presentation) Qiushi Huang, Tom Ko, Lilian Tang, and Yu Zhang. ComLoRA: A Competitive Learning Approach for Enhancing LoRA. In: Proceedings of the Thirteenth International Conference on Learning Representations (ICLR), Singapore, 2025. Xuehao Wang, Zhan Zhuang, Feiyang Ye, and Yu Zhang. MTSAM: Multi-Task Fine-Tuning for Segment Anything Model. In: Proceedings of the Thirteenth International Conference on Learning Representations (ICLR), Singapore, 2025. Xuehao Wang, Liyuan Wang, Binghuai Lin, and Yu Zhang. HeadMap: Locating and Enhancing Knowledge Circuits in LLMs. In: Proceedings of the Thirteenth International Conference on Learning Representations (ICLR), Singapore, 2025. Feiyang Ye, Yueming Lyu, Xuehao Wang, Masashi Sugiyama, Yu Zhang, and Ivor Tsang. Sharpness-Aware Black-Box Optimization. In: Proceedings of the Thirteenth International Conference on Learning Representations (ICLR), Singapore, 2025. Kai Chen, Yunhao Gou, Runhui Huang, Zhili Liu, Daxin Tan, Jing Xu, Chunwei Wang, Yi Zhu, Yihan Zeng, Kuo Yang, Dingdong WANG, Kun Xiang, Haoyuan Li, Haoli Bai, Jianhua Han, Xiao-Hui Li, Weike Jin, Nian Xie, Yu Zhang, James Kwok, Hengshuang Zhao, Xiaodan Liang, Dit-Yan Yeung, Xiao Chen, Zhenguo Li, Wei Zhang, Qun Liu, Lanqing Hong, Lu Hou, and Hang Xu. EMOVA: Empowering Language Models to See, Hear and Speak with Vivid Emotions. In: Proceedings of The IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR), Nashville TN, USA, 2025. Zhili Liu, Yunhao Gou, Kai Chen, Lanqing Hong, Jiahui Gao, Fei Mi, Yu Zhang, Zhenguo Li, Xin Jiang, Qun Liu, and James T. Kwok. Mixture of insighTful Experts (MoTE): The Synergy of Reasoning Chains and Expert Mixtures in Self-Alignment. In: Proceedings of the Sixty-Third Annual Meeting of the Association for Computational Linguistics (ACL), Vienna, Austria, 2025. Zhan Zhuang, Yulong Zhang, Xuehao Wang, Jiangang Lu, Ying We",
  "content_length": 40818,
  "method": "requests",
  "crawl_time": "2025-12-01 14:53:07"
}