{
  "name": "Yu Zang",
  "homepage": "https://asc.xmu.edu.cn/t/zangyu",
  "status": "success",
  "content": "臧彧副教授，博士生导师详情 首页Home 科研团队Team 研究方向Research 论文Paper 开源仓库Repository 新闻资讯News 招生/招聘Recruit 学术资源Resources 毕业生风采Graduate 缤纷生活Life - 欢迎登录 - 登 录 科研团队 臧彧 副教授，博士生导师zangyu7@126.com 厦门大学信息学院计算机系副教授、硕士生导师。普林斯顿大学访问学者，西安交通大学大学计算机科学博士。研究兴趣：三维点云处理、人工智能、遥感信息AI 处理。主持2项国家自然科学基金和10余项省部级或军工项目。在IEEE TVCG、TOG、TGRS、ISPRS等CCF A类期刊发表论文30余篇（JCR一区/二区10余篇），授权发明专利9项（含专利权转让1项）、公开发明专利7项。获2018年福建省科技进步一等奖（排名6/10）、2018“创青春”浙大双创杯全国大学生创业大赛国际名校邀请赛铜奖（第一指导教师）。IEEE会员，中国计算机学会CCF高级会员，CCF三维视觉专委会执行委员、2021中国三维视觉大会组委会委员、担任期刊会议审稿人：IEEE TGRS, ISPRS JPRS, IEEE TVCG, IEEE TOG、CVPR, AAAI , IJCAI, etc. 研究方向 Research 遥感信息处理 — 智能地物检测 采用基于深度学习的多尺度融合检测技术，实现遥感影像中变化特征及建筑、道路、河流等多种目标的智能解译。充分利用卫星、无人机、地面物联网设备搭载的多类型传感器，配合先验知识或业务规则，引入AI技术，实现针对多类型地物要素的自动分类和变化检测 三维点云处理 — 城市微环境感知与预测 挖掘分析遥感图像中丰富的时序和空间信息，应用于城市地表信息特征提取。同时结合城市大气数据、监测站等多源数据，配合深度学习方法，对城市微环境做到高精度的模拟。 发表的数据集 Datasets 部分论文列表 Selected Publications 清空 排序： 最新优先（降序） 最早优先（升序） 2022 Donghang Wu, Weiquan Liu, Bowen Fang, Linwei Chen, Yu Zang, Lei Zhao, Shenlong Wang, Cheng Wang, Jose Marcato Junior, Jonathan Li Intracity Temperature Estimation by Physics Informed Neural Network Using Modeled Forcing Meteorology and Multi-Spectral Satellite Imagery IEEE Transactions on Geoscience and Remote Sensing PDF bibtex @ARTICLE{9865982, author={Wu, Donghang and Liu, Weiquan and Fang, Bowen and Chen, Linwei and Zang, Yu and Zhao, Lei and Wang, Shenlong and Wang, Cheng and Marcato, Jos&#x00E9; and Li, Jonathan}, journal={IEEE Transactions on Geoscience and Remote Sensing}, title={Intracity Temperature Estimation by Physics Informed Neural Network Using Modeled Forcing Meteorology and Multi-Spectral Satellite Imagery}, year={2022}, volume={}, number={}, pages={1-1}, doi={10.1109/TGRS.2022.3201284}} Weiquan Liu, Hanyun Guo, Weini Zhang, Yu Zang*, Cheng Wang, Jonathan Li TopoSeg: Topology-aware Segmentation for Point Clouds International Joint Conferences on Artificial Intelligence Organization (IJCAI) PDF bibtex @inproceedings{ijcai2022-168, title = {TopoSeg: Topology-aware Segmentation for Point Clouds}, author = {Liu, Weiquan and Guo, Hanyun and Zhang, Weini and Zang, Yu and Wang, Cheng and Li, Jonathan}, booktitle = {Proceedings of the Thirty-First International Joint Conference on Artificial Intelligence, {IJCAI-22}}, publisher = {International Joint Conferences on Artificial Intelligence Organization}, editor = {Lud De Raedt}, pages = {1201--1208}, year = {2022}, month = {7}, note = {Main Track} doi = {10.24963/ijcai.2022/168}, url = {https://doi.org/10.24963/ijcai.2022/168}, } Muhammad Kamran Afzal a , Jibril Muhammad Adam , H.M. Rehan Afzal , Yu Zang*, Saifullahi Aminu Bello, Cheng Wang, Jonathan Li Discriminative feature abstraction by deep L2 hypersphere embedding for 3D mesh CNNs Information Sciences bibtex @article{Discriminative, title={Discriminative feature abstraction by deep L2 hypersphere embedding for 3D mesh CNNs}, author={ Muhammad Kamran Afzal a , Jibril Muhammad Adam , H.M. Rehan Afzal , Yu Zang*, Saifullahi Aminu Bello, Cheng Wang, Jonathan Li}, journal={Information Sciences}, year={2022}, } 2021 Linwei Chen, Bowen Fang, Lei Zhao, Yu Zang* , et al. DeepUrbanDownscale: A physics informed deep learning framework for high-resolution urban surface temperature estimation via 3D point clouds International Journal of Applied Earth Observation and Geoinformation bibtex @article{0DeepUrbanDownscale, title={DeepUrbanDownscale: A physics informed deep learning framework for high-resolution urban surface temperature estimation via 3D point clouds - ScienceDirect}, author={ Lc, A and Bf, C and Lei, Z. C. and Yu, Z. A. and Wl, A and Yc, A and Cheng, W. A. and Jla, B }, journal={International Journal of Applied Earth Observation and Geoinformation}, volume={106}, } 2020 Y. Zhang, K. Huo, Z. Liu, Y. Zang*, C. Wang et al PGNet: A Part-based Generative Network for 3D Object Reconstruction Knowledge based System bibtex null W. Zhang, L. Chen, Z. Xiong, Y. Zang* et al. Large-scale point cloud contour extraction via 3D guided multi-conditional generative adversarial network ISPRS Journal of Photogrammetry and Remote Sensing bibtex null 2019 Y. Zhang, Z. Xiong, Y. Zang*, et al. Topology-aware road network extraction via multi-supervised generative adversarial networks Remote Sensing bibtex null 2018 L. Luo, Y. Zang*, X. Wang, et al Estimating Road Widths From Remote Sensing Images Remote Sensing Letters bibtex @article{luo2018estimating, title={Estimating Road Widths From Remote Sensing Images}, author={Luo, Lun and Zang, Yu and Wang, Xiaofang and Wang, Cheng and Li, Jonathan and Wu, Sheng and Liu, Yuelei}, journal={Remote Sensing Letters}, volume={9}, number={9}, pages={819--828}, year={2018}, publisher={Taylor \\& Francis} } 2017 Ding, L. and Huang, H. and Zang, Y* Image Quality Assessment Using Directional Anisotropy Structure Measurement IEEE Transactions on Image Processing bibtex @article{2017Image, title={Image Quality Assessment Using Directional Anisotropy Structure Measurement}, author={ Ding, L. and Huang, H. and Zang, Y. }, journal={IEEE Transactions on Image Processing}, volume={26}, number={4}, pages={1799-1809}, year={2017}, } Y. Zang*, C. Wang, Y. Yu, L. Luo, Y. Ke, J. Li. Joint Enhancing Filtering for Road Network Extraction IEEE Transactions on Geoscience and Remote Sensing bibtex null 2016 Y. Zang, C. Wang*, L. Cao, Y. Yu, J. Li. Road Network Extraction via Aperiodic Directional Structure Measurement IEEE Transactions on Geoscience and Remote Sensing bibtex null 2015 Y. Zang, H. Huang*, L. Zhang. Guided Adaptive Image Smoothing via Directional Anisotropic Structure Measurement IEEE Transactions on Visualization and Computer Graphics bibtex null 2014 Zang Y , Huang H* , Zhang L Efficient Structure-Aware Image Smoothingby Local Extrema on Space-Filling Curve IEEE Transactions on Visualization & Computer Graphics bibtex @article{2014Efficient, title={Efficient Structure-Aware Image Smoothingby Local Extrema on Space-Filling Curve}, author={ Zang, Yu and Huang, Hua and Zhang, Lei }, journal={IEEE Transactions on Visualization & Computer Graphics}, volume={20}, number={9}, pages={1253-1265}, year={2014}, } 2009 H. Huang, Y. Zang*, Paul L. Rosin, Chun Qi Edge-Aware Level Set Diffusion and Bilateral Filtering Reconstruction for Image Magnification Journal of Computer Science and Technology bibtex @article{huang2009edge, title={Edge-aware level set diffusion and bilateral filtering reconstruction for image magnification}, author={Huang, Hua and Zang, Yu and Rosin, Paul L and Qi, Chun}, journal={Journal of Computer Science and Technology}, volume={24}, number={4}, pages={734--744}, year={2009}, publisher={Springer} } 联系我们 沈思淇老师 siqishen@xmu.edu.cn 友情链接 福建省智慧城市感知与计算重点实验室 厦门大学信息学院网页 厦门大学 DBNET mi3dmap © 2020 厦门大学信息学院 版权所有",
  "content_length": 6725,
  "method": "requests",
  "crawl_time": "2025-12-01 14:53:07"
}