{
  "name": "Yu Zhou 0027",
  "homepage": "https://yzhouszu.github.io",
  "status": "success",
  "content": "Welcome to Dr.Yu Zhou's homepage Yu Zhou (周宇) Email: yu.zhou [AT] szu [dot] edu [dot] cn Contact: RM 411-1, Computer Science Building, South Campus, Shenzhen University, Nanshan District, Shenzhen, China I am an assistant professor at Research Institute for Future Media Computing, College of Computer Science and Software Engineering, Shenzhen University. Before Joining Shenzhen University, from Feb 2017 to June 2017, I was a postdoctoral research fellow of Video Technology Research Centre directed by Prof. Sam Kwong in Department of Computer Science at City University of Hong Kong. I completed my Ph.D. in Deparment of Computer Science at City University of Hong Kong, working with Prof. Sam Kwong. Prior to that, I completed my master's degree in Electrical Engineering at Xidian University, supervised by Prof. Licheng Jiao and Prof. Shuyuan Yang in the School of Electrical Engineering, where I was a postgraduate student in Key Laboratory of Intelligent Perception and Image Understanding of Minstry of Education . I received my bachelor's degree in Electrical Engineering at Xidian University. Education Ph.D., Computer Science, City University of Hong Kong, Feb 2017 M.S., Electrical Engineering, Xidian University, March 2012 B.S., Electrical Engineering, Xidian University, Jun 2009 Research Intelligent multimedia information processing Computational intelligence Experience Assistant professor, Shenzhen University, Sept 2017 – present Postdoctoral research fellow, City University of Hong Kong, Feb 2017 – July 2017 Project Engineer, City University of Hong Kong Shenzhen Research Institute, Nov 2016 – Jan 2017 Algorithm Engineer, Research Institute of Navigation Technology, April 2012 – July 2013 Papers Peer-reviewed Journal Articles Nonnegtive Matrix Factorization with Mixed Hypergraph Regularization for Community Detection Wenhui Wu, Sam Kwong, Yu Zhou, Yuheng Jia, Wei Gao, Information Sciences, vol. 435, pp. 263-281, 2018. Collaborative Block Compressed Sensing Reconstruction with Dual-Domain Sparse Representation Yu Zhou, Hainan Guo, Information Sciences, accepted, 2018. Quaternion Representation Based Visual Saliency for Stereoscopic Image Quality Assessment Xu Wang, Lin Ma, Sam Kwong, Yu Zhou, Signal Processing, vol. 145, 2017. An Adaptive Coevolutionary Mmetic Algorithm for Examination timetabling Problems Yu Lei, Maoguo Gong, Licheng Jiao, Jiao Shi, Yu Zhou, International Journal of Bio-inspired Computation, vol. 10, Issue 4, pp. 248-257, 2017. A Two-phase Evolutionary Approach for Compressive Sensing Reconstruction Yu Zhou, Sam Kwong, Hainan Guo, Xiao Zhang, Qingfu Zhang, IEEE Transactions on Cybernetics, vol. 47, no. 9, pp.2651-2663, 2017. Problem Specific MOEA/D for Barrier Coverage With Wireless Sensors Xiao Zhang, Yu Zhou*, Qingfu Zhang, Victor Lee, Minming Li, IEEE Transactions on Cybernetics, vol 47, no. 11, pp. 3854-3865, 2017. Matching-Based Selection With Incomplete Lists for Decomposition Multiobjective Optimization Mengyuan Wu, Ke Li, Sam Kwong, Yu Zhou, Qingfu Zhang, IEEE Transactions on Evolutionary Computation, vol 21, no. 4, pp. 554-568, 2017. A Phase Congruency based Patch Evaluation for Complexity Reduction in Multi-dictionary Based Single-Image Superresolution Reconstruction Yu Zhou, Sam Kwong, Wei Gao, Xu Wang, Information Sciences, vol 367, Issue C, pp. 337-353, 2016. Bilevel Optimization of Block Compressed Sensing with Perceptually Nonlocal Similarity Yu Zhou, Sam Kwong, Hainan Guo, Wei Gao, Xu Wang, Information Sciences, vol 360, pp. 1-20, 2016. SSIM-Based Game Theory Approach for Rate-Distortion Optimized Intra Frame CTU-Level Bit Allocation Wei Gao, Sam Kwong, Yu Zhou, Hui Yuan, IEEE Transactions on Multimedia, vol 18, no. 6, pp. 988-999, 2016. Using Simulation and Optimization to Characterize Durations of Emergency Department Service Times with Incomplete Data Hainan Guo, David Goldsman, Kwok-leung Tsui, Yu Zhou, Shui-Yee Wong, International Journal of Production Research, vol 54, no. 21, pp. 6494-6511, 2016. Peer-reviewed Conference Papers Cooperative coevolutionary multiobjective genetic programming for microarray data classification Yang Qing, Chi Ma, Yu Zhou, Xiao Zhang and Haowen Xia, Proceedings of the Genetic and Evolutionary Computation Conference (GECCO), Lille, France, 2021. Low-sampling Imagery Data Recovery by Deep Learning Inference and Iterative Approach Jiping Lin, Yu Zhou and Junhao Kang, International Conference on Knowledge Science, Engineering and Management (KSEM), Athens, Greece, 2019. An Improved Discretization-based Feature Selection via Particle Swarm Optimization Jiping Lin, Yu Zhou and Junhao Kang, International Conference on Knowledge Science, Engineering and Management (KSEM), Athens, Greece, 2019. Feature Selection of High Dimensional Data by Adaptive Potential Particle Swarm Optimization Xingyue Huang, Yizhou Chi, Yu Zhou, IEEE Congress on Evolutionay Computation (CEC), Wellington, New Zealand, 2019. Single Image Superresolution by Multiple Geometrical Regressors Yu Zhou, Sam Kwong, Junhui Hou, Asia-Pacific Signal and Information Processing Association Annual Summit and Conference, Kuala Lumpur, Malaysia, 2017. Adaptive Patch-based Sparsity Estimation for Image via MOEA/D Yu Zhou, Sam Kwong, Qingfu Zhang, Mengyuan Wu, IEEE Congress on Evolutionay Computation (CEC), Vancouver, Canada, 2016. Multiobjecitve Optimization of Barrier Coverage with Wireless Sensors Xiao Zhang, Yu Zhou, Qingfu Zhang, Victor Lee, Minming Li, Evolutionary Multi-Criterion Optimization (EMO), Guimarães, Portugal, 2015. Smooth View Quality Oriented Bit Allocation Optimization for 3D Video Coding Xu Wang, Sam Kwong, Wei Gao, Yu Zhou, IEEE International Conference on Systems, Man and Cybernetics (SMC), Hong Kong, 2015. PhD Thesis Modeling and Optimization in Compressed Sensing and Sparse Coding Applications [PDF] Yu Zhou, Department of Computer Science, City University of Hong Kong, 2017 Teaching Instructor, CS 1300860075 Introduction to Computer Science , Shenzhen University, Fall 2018, 2017 Instructor, CS 1502850001 Internet Programming , Shenzhen University, Spring, 2018 Teaching Assistant, CS 2204 Fundamentals of Internet Applications by Dr. MT Chan, City University of Hong Kong, Fall 2016, Spring 2016, Spring 2015, Fall 2014 and Spring 2014 Teaching Assistant, CS 2310 Computer Programming by Dr. Ricky Chan, City University of Hong Kong, Fall 2015 Academic activities I have given a talk or particapted in the following international conferences: Asia-Pacific Signal and Information Processing Association Annual Summit and Conference (APSIPA ASC) 2017, Kuala Lumpur, Malaysia, 2017. IEEE Congress on Evolutionary Computation (CEC), Vancouver, Canada, 2016. International Conference on Wavelet Analysis and Pattern Recognition (ICWAPR), Guangzhou, China, 2015 IEEE Conference on Systems, Man, and Cybernetics (SMC), Hong Kong, 2015. I also serve as a reviewer for the following international Journals: IEEE Transactions on Evolutionary Computation IEEE Transactions on Cybernetics IEEE Transactions on Industrial Informatics IEEE Transactions on Emerging Topics in Computational Intelligence Information Sciences European Journal of Operational Research Applied Soft Computing Soft Computing The Visual Computer Awards Outstanding reviewer award (European Journal of Operational Research, ELSEVIER) 2017 Student supervision Jiping Lin (postgraduate student, since Sept 2017): feature selection and image processing Junhao Kang (postgraduate student, since Sept 2018): feature selection and computational intelligence Research projects Some project webpages are still under construction. Visitor Stats.",
  "content_length": 7650,
  "method": "requests",
  "crawl_time": "2025-12-01 14:53:08"
}