{
  "name": "Yuan Zhang 0009",
  "homepage": "https://yuanxzhang.github.io",
  "status": "success",
  "content": "Yuan Zhang Yuan Zhang I am a Professor in the School of Computer Science of Fudan University. I co-direct the System Software and Security Laboratory of Fudan University. I am also the co-founder and the coach of a great CTF Team in Fudan University, named Whitzard. We took part in many great world-wide CTF competitions and won good places. I aim to do relevant and reasonable system research. My research interests span all areas in system security especially on widely-deployed and critical targets, while currently focusing on open-source software, kernels, Android/Web platforms, firmware, LLM-based agents and ADS. My research covers a wide range of topics, including vulnerability discovery/exploitation/mitigation, malware/attack detection, privacy protection. To address these problems, we usually use multi-disciplined techniques such as Program Analysis, LLM, Machine/Deep Learning. To prospective students/post-doctors: If you are interested in our research, please feel free to reach out. Email: yuanxzhang [AT] fudan.edu.cn Office (Jiangwan Campus): Room D6011, NO.2 Interdisciplinary Building, NO.2005 Songhu Road, Yangpu District, Shanghai News [Oct, 2025] Our work on black-box access control vulnerability detection received Distinguished Paper Award at ACM CCS 2025! [Sept, 2025] Two papers accepted by ASE 2025. Congrats Zhangyue & Haoran! [Sept, 2025] One paper accepted by IEEE TIFS. Congrats Youkun! [Sept, 2025] One paper accepted by IEEE TSE. Congrats Youkun! [Aug, 2025] Our work on detecting and exploiting link following vulnerabilities received Honorable Mention Award at USENIX Security 2025! [Aug, 2025] Three papers accepted by ASE 2025. Congrats Zhuoxiang, Peng & Bofei! [Aug, 2025] One paper accepted by SaTS 2025. Congrats Pei! [Aug, 2025] One paper accepted by OOPSLA 2025. Congrats Jiarun! [Aug, 2025] One paper accepted by ACM CCS 2025. Congrats Qiyi! [July, 2025] One paper accepted by NDSS 2026. Congrats Runhao! [June, 2025] Three papers accepted by USENIX Security 2025. Congrats Youkun, Bocheng & Fengyu! [May, 2025] One paper accepted by IEEE TIFS. Congrats Lin! [May, 2025] Our vulnerability detection work on microservice-structured web apps received Distinguished Paper Award at IEEE S&P 2025! [April, 2025] One paper accepted by FSE 2025. Congrats Zhengmin! [March, 2025] One paper accepted by ACM CCS 2025. Congrats Fengyu! [March, 2025] Two papers accepted by IEEE S&P 2025. Congrats Fengyu & Haoyu! [Jan, 2025] Four papers accepted by USENIX Security 2025. Congrats Zihan, Xinyou, Keke & Peng! [Jan, 2025] One paper accepted by WWW 2025. Congrats Wuyuao Mai! Background 2022.12~now, Fudan University, School of Computer Science, Professor 2017.12~2022.11, Fudan University, School of Computer Science, Associate Professor 2014.07~2017.11, Fudan University, School of Computer Science, Assistant Professor 2009.09~2014.06, Fudan University, School of Computer Science, Ph.D 2005.09~2009.06, Nanjing University, Software Institute, B.Eng Publications FirmCross: Detecting Taint-style Vulnerabilities in Modern C-Lua Hybrid Web Services of Linux-based Firmware. Runhao Liu, Jiarun Dai, Haoyu Xiao, Yuan Zhang, Yeqi Mou, Lukai Xu, Bo Yu, Baosheng Wang, Min Yang. In Proceedings of the 33rd Network and Distributed System Security Symposium (NDSS), San Diego, CA, USA, Feb 23-27, 2026. (to appear) Security Debt in LLM Agent Applications: A Measurement Study of Vulnerabilities and Mitigation Trade-offs. Zhuoxiang Shen, Jiarun Dai, Yuan Zhang, Min Yang. In Proceedings of the 40th IEEE/ACM International Conference on Automated Software Engineering (ASE), Seoul, South Korea, November 16-20, 2025. (to appear) Algernon: A Flag-Guided Hybrid Fuzzer for Unlocking Hidden Program Paths. Peng Deng, Lei Zhang, Jingqi Long, Wenzheng Hong, Zhemin Yang, Yuan Zhang, Donglai Zhu, Min Yang. In Proceedings of the 40th IEEE/ACM International Conference on Automated Software Engineering (ASE), Seoul, South Korea, November 16-20, 2025. (to appear) LLMPort: Cross-file Patch Porting via Task Decomposition and Self-correction. Bofei Chen, Lei Zhang, Peng Deng, Nan Wang, Haoyu Xu, Mingda Guo, Yuan Zhang, Min Yang. In Proceedings of the 40th IEEE/ACM International Conference on Automated Software Engineering (ASE), Seoul, South Korea, November 16-20, 2025. (to appear) DeepExploitor: LLM-Enhanced Automated Exploitation of DeepLink Attack in Hybrid Apps. Zhangyue Zhang, Lei Zhang, Zhibo Zhang, Yongheng Liu, Zhemin Yang, Yuan Zhang, Min Yang. In Proceedings of the 40th IEEE/ACM International Conference on Automated Software Engineering (ASE), Seoul, South Korea, November 16-20, 2025. (to appear) Exploring Static Taint Analysis in LLMs: A Dynamic Benchmarking Framework for Measurement and Enhancement. Haoran Zhao, Lei Zhang, Keke Lian, Fute Sun, Bofei Chen, Yongheng Liu, Zhiyu Wu, Yuan Zhang, Min Yang. In Proceedings of the 40th IEEE/ACM International Conference on Automated Software Engineering (ASE), Seoul, South Korea, November 16-20, 2025. (to appear) ApkDiffer: Accurate and Scalable Cross-Version Diffing Analysis for Android Applications. Jiarun Dai, Mingyuan Luo, Yuan Zhang, Min Yang, Minghui Yang. In Proceedings of the International Conference on Object-Oriented Programming Systems, Languages, and Application (OOPSLA/SPLASH), Singapore, October 12-18, 2025. [Paper] Fast Play, Fast Profit: Unveiling the Prevalence of Aggressive Ad Behaviors in Mini-Game. Pei Chen, Geng Hong, Yicheng Qin, Huazhe Wang, Mengying Wu, Yuan Zhang, Min Yang, Ziru Zhao, Yuanpeng Zhu, Tao Su. In Proceedings of the 3rd ACM Workshop on Secure and Trustworthy Superapps (SaTS), co-located with ACM CCS, Taipei, Taiwan, China, October 13, 2025. [Paper] Be Aware of What You Let Pass: Demystifying URL-based Authentication Bypass Vulnerability in Java Web Applications. Qiyi Zhang, Fengyu Liu, Zihan Lin, Yuan Zhang. In Proceedings of the 32nd ACM Conference on Computer and Communications Security (CCS), Taipei, Taiwan, China, October 13-17, 2025. [Paper] [Full Version] BACScan: Automatic Black-Box Detection of Broken-Access-Control Vulnerabilities in Web Applications. Fengyu Liu, Yuan Zhang, Enhao Li, Wei Meng, Youkun Shi, Qianheng Wang, Chenlin Wang, Zihan Lin, Min Yang. In Proceedings of the 32nd ACM Conference on Computer and Communications Security (CCS), Taipei, Taiwan, China, October 13-17, 2025.[Distinguished Paper Award] [Paper] Make Agent Defeat Agent: Automatic Detection of Taint-Style Vulnerabilities in LLM-based Agents. Fengyu Liu, Yuan Zhang, Jiaqi Luo, Jiarun Dai, Tian Chen, Letian Yuan, Zhengmin Yu, Youkun Shi, Ke Li, Chengyuan Zhou, Hao Chen, Min Yang. In Proceedings of the 34th USENIX Security Symposium (USENIX Security), Seattle, WA, USA, August 13-15, 2025. [Paper] XSSky: Detecting XSS Vulnerabilities through Local Path-Persistent Fuzzing. Youkun Shi, Yuan Zhang, Tianhao Bai, Feng Xue, Jiarun Dai, Fengyu Liu, Lei Zhang, Xiapu Luo, Min Yang. In Proceedings of the 34th USENIX Security Symposium (USENIX Security), Seattle, WA, USA, August 13-15, 2025. [Paper] Pig in a Poke: Automatically Detecting and Exploiting Link Following Vulnerabilities in Windows File Operations. Bocheng Xiang, Yuan Zhang, Fengyu Liu, Hao Huang, Zihan Lin, Min Yang. In Proceedings of the 34th USENIX Security Symposium (USENIX Security), Seattle, WA, USA, August 13-15, 2025. [Honorable Mention Award] [Paper] Effective Directed Fuzzing with Hierarchical Scheduling for Web Vulnerability Detection. Zihan Lin, Yuan Zhang, Jiarun Dai, Xinyou Huang, Bocheng Xiang, Guangliang Yang, Letian Yuan, Lei Zhang, Fengyu Liu, Tian Chen, Min Yang. In Proceedings of the 34th USENIX Security Symposium (USENIX Security), Seattle, WA, USA, August 13-15, 2025. [Paper] Towards Automatic Detection and Exploitation of Java Web Application Vulnerabilities via Concolic Execution guided by Cross-thread Object Manipulation. Xinyou Huang, Lei Zhang, Yongheng Liu, Peng Deng, Yinzhi Cao, Yuan Zhang, Min Yang. In Proceedings of the 34th USENIX Security Symposium (USENIX Security), Seattle, WA, USA, August 13-15, 2025. [Paper] Careless Retention and Management: Understanding and Detecting Data Retention Denial-of-Service Vulnerabilities in Java Web Containers. Keke Lian, Lei Zhang, Haoran Zhao, Yinzhi Cao, Yongheng Liu, Fute Sun, Yuan Zhang, Min Yang. In Proceedings of the 34th USENIX Security Symposium (USENIX Security), Seattle, WA, USA, August 13-15, 2025. [Paper] ChainFuzz: Exploiting Upstream Vulnerabilities in Open-Source Supply Chains. Peng Deng, Lei Zhang, Yuchuan Meng, Zhemin Yang, Yuan Zhang, Min Yang. In Proceedings of the 34th USENIX Security Symposium (USENIX Security), Seattle, WA, USA, August 13-15, 2025. [Paper] CXXCrafter: An LLM-Based Agent for Automated C/C++ Open Source Software Building. Zhengmin Yu, Yuan Zhang, Ming Wen, Yinan Nie, Wenhui Zhang, Min Yang. In Proceedings of ACM International Conference on the Foundations of Software Engineering (FSE), Trondheim, Norway, June 23-27 2025. [Paper] HouseFuzz: Service-Aware Grey-Box Fuzzing for Vulnerability Detection in Linux-Based Firmware. Haoyu Xiao, Ziqi Wei, Jiarun Dai, Bowen Li, Yuan Zhang, Min Yang. In Proceedings of the 46th IEEE Symposium on Security and Privacy (S&P), San Francisco, CA, USA, May 12-15, 2025. [Paper] Detecting Taint-Style Vulnerabilities in Microservice-Structured Web Applications. Fengyu Liu, Yuan Zhang, Tian Chen, Youkun Shi, Guangliang Yang, Zihan Lin, Min Yang, Junyao He, Qi Li. In Proceedings of the 46th IEEE Symposium on Security and Privacy (S&P), San Francisco, CA, USA, May 12-15, 2025. [Distinguished Paper Award] [Paper] MOCGuard: Automatically Detecting Missing-Owner-Check Vulnerabilities in Java Web Applications. Fengyu Liu, Youkun Shi, Yuan Zhang, Guangliang Yang, Enhao Li, Min Yang. In Proceedings of the 46th IEEE Symposium on Security and Privacy (S&P), San Francisco, CA, USA, May 12-15, 2025. [Paper] EPScan: Automated Detection of Excessive RBAC Permissions in Kubernetes Applications. Yue Gu, Xin Tan, Yuan Zhang, Siyan G",
  "content_length": 29252,
  "method": "requests",
  "crawl_time": "2025-12-01 14:53:20"
}