{
  "name": "Yuan Tian 0001",
  "homepage": "https://www.ytian.info",
  "status": "success",
  "content": "Home | yuantian top of pageWelcome!Yuan Tian  田园​ Yuan (pronounced similar to you-en ) Associate Professor Electrical and Computer Engineering Computer Science Institute for Technology, Law & Policy University of California, Los Angeles Email: yuant@ucla.edu ​ I'm an Associate Professor at the University of California, Los Angeles. My research focuses on developing novel technologies for the security, privacy, and safety of modern and emerging systems. I analyze and model systems, drawing on program analysis, protocol analysis, machine learning, and human factors to understand the risks and develop systems that are secure and privacy-preserving. My work has been published in top-tier security conferences (such as Oakland, CCS, Usenix Security, and NDSS), and top-tier machine learning conferences (such as ICML, NeurIPS, and ACL). My work has generated real-world impact as countermeasures and design changes directly resulting from my research have been integrated into platforms (such as Android, Chrome, Firefox, and iOS), and also impacted the security recommendations of standard organizations such as Internet Engineering Task Force (IETF). I'm fortunate to have received a couple of awards for my research, such as the Google Research Scholar Award, Okawa Foundation Award, NSF CAREER Award, NSF CRII award, Facebook Research Award, and Amazon AI Faculty Fellowship. Before joining UCLA, I was an Assistant Professor at the University of Virginia. I received my PhD at Carnegie Mellon University in 2017. I am fortunate to be advised by Professor Patrick Tague. I interned at Microsoft Research (with Dr. Cormac Herley and Dr. Stuart Schechter), Facebook (with the Security Infrastructure team), and Samsung Research (with Dr. Peng Ning). We are looking for motivated students! Please don't hesitate to email me if you are interested in my research. I'm looking for passionate and smart students to drive my projects. In particular, I'm looking for multiple PhD students for Fall 2025 in systems security, machine learning security, and applied crypto. We also seek undergraduate/master research assistants and research interns for these topics. News ​​ Welcome Peiran, Zhiyuan, and Zihang to the lab! Our paper “Breaking the Illusion: Automated Reasoning of GDPR Consent Violations” will appear in the 47th IEEE Symposium on Security and Privacy(Oakland) 2026 Our paper “From Perception to Protection: A Developer-Centered Study of Security and Privacy Threats in Extended Reality (XR)” has been accepted to appear in the 33rd Network and Distributed System Security Symposium (NDSS) 2026 Thanks, NSF, for supporting our research on trustworthy medical AI! Our paper “Location-Enhanced Information Flow Analysis for Smart Home Automations” will appear in the 26th Privacy Enhancing Technologies Symposium (PETS) 2026 Our paper \"BadMerging: Backdoor Attacks Against Model Merging\" is accepted to appear at CCS 2024 Thanks, Cisco, for supporting our research on LLM for security analysis! Thanks, NSF, for supporting our research on privacy-preserving mobility data generation! I'm Program Vice Co-Chair for USENIX Security 2025; please submit your interesting papers! Our paper  \"AuthSaber: Automated Safety Verification of OpenID Connect Programs\" is accepted to appear at CCS 2024 Our paper \"Remote Keylogging Attacks in Multi-user VR Applications\" is accepted to appear in Usenix Security 2024 I'm serving as CCS 2024 Software Security PC chair; please submit your interesting papers! Delighted to receive the CCS 2023 Top Reviewer Award! Our paper \"Alexa, is the skill always safe? Uncover Lenient Skill Vetting Process and Protect User Privacy at Run Time\" is accepted to appear at ICSE 2024 Our paper “Towards Real-time Voice Interaction Data Collection Monitoring and Ambient Light Privacy Notification for Voice-controlled Services” has been accepted to appear at Symposium on Usable Security and Privacy (USEC) Our paper \"Towards Detection-Recovery Strategy for Robust Decentralized Matrix Factorization\" is accepted to appear at ESORICS 2024 Our paper \"Anomaly Transmitter Recognition and Tracking\" is accepted to appear at DySPAN 2024 I'm serving as Oakland 2024 associate PC chair; please submit your interesting papers! Thanks, NSF, for supporting our project \"Assessing the Relationship Between Privacy Regulations and Software Development to Improve Rulemaking and Compliance.\" Our paper \"When Can Linear Learners be Robust to Indiscriminate Poisoning Attacks?\" is accepted to appear at NeurIPS 2023 Our paper \"SyzTrust: State-aware Fuzzing on Trusted OS Designed for IoT Devices\" is accepted to appear at Oakland 2024 Congratulations to Dr. Suya, Dr. Faysal Hossain Shezan, and Dr. Tu Le for successfully passing their Ph.D. Defenses! Thanks, Keysight, for the award on device security! Our paper \"MOCK: Optimizing Kernel Fuzzing Mutation with Context-aware Dependency\" is accepted to appear at NDSS 2024 Our paper “Exploring Smart Commercial Building Occupants' Perceptions and Notification Preferences of IoT Data Collection,”  is accepted to appear at IEEE European Symposium on Security and Privacy (EuroS&P), 2023 Our papers \"Privacy-preserving Liveness Detection for Securing Smart Voice Interfaces\", and “One Bad Apple Spoils the Barrel: Understanding the Security Risks Introduced by Third-Party Components in IoT Firmware\" are accepted to appear in TDSC 2023 Our paper \"Towards Usable Security Analysis Tools for Trigger-Action Programming\" is accepted to appear at SOUPS 2023 Our paper \"PLUE: Language Understanding Evaluation Benchmark for Privacy Policies in English\" is accepted to appear at ACL 2023 Our paper \"UVSCAN: Detecting Third-Party Component Usage Violations in IoT Firmware\" is accepted to appear in Usenix Security 2023 Thanks, Okawa Foundation, for the Award on Trustworthy Human-AI Collaborations! Our paper \"Retrieval Enhanced Data Augmentation for Question Answering on Privacy Policies\" is accepted to appear in EACL 2023 Our paper \"ML-FEED: Machine Learning Framework for Efficient Exploit Detection\" received the best paper award at IEEE TPS 2022! We published two papers on enforcing privacy regulations. CHKPLUG: Checking GDPR Compliance of WordPress Plugins via Cross-language Code Property Graph at NDSS 2023, and Is Your Policy Compliant? A Deep Learning-based Empirical Study of Privacy Policies' Compliance with GDPR at WEPS 2022. Our paper \"Cerberus: Query-driven Scalable Security Checking for OAuth Service Provider Implementations\" is accepted to appear in CCS 2022 Our paper \"A Large-Scale Empirical Analysis of the Vulnerabilities Introduced by Third-party Components in IoT Firmware\" is accepted to appear in ISSTA 2022 Our paper \"TransRisk: Mobility Privacy Risk Prediction based on Transferred Knowledge\" is accepted to appear in Ubicomp 2022 Our paper \"SkillBot: Identifying Risky Content for Children in Alexa Skills\" is accepted to appear in ACM TOIT 2022 Our paper \"Towards Return Parity in Markov Decision Processes\" is accepted to appear in AISTATS 2022 I'll join 2022 CRA Career Mentoring Workshop as a panelist Our paper \"Your Microphone Array Retains Your Identity: A Robust Voice Liveness Detection System for Smart Speakers\" is accepted to appear in Usenix Security 2022 We are excited to receive a Facebook Research Award on Perception Integrity in Virtual Reality, in collaboration with Seongkook Heo NSF has chosen to fund our grant \"Toward safe, private, and secure home automation: from formal modeling to user evaluation\", which is in collaboration with Lujo Bauer, and Limin Jia from Carnegie Mellon University Our paper \"MPInspector: A Systematic and Automatic Approach for Evaluating the Security of IoT Messaging Protocols\" is accepted to appear in Usenix Security 2021 Our papers \"Understanding and Mitigating Accuracy Disparity in Regression\" and \"Model-Targeted Poisoning Attacks with Provable Convergence\" are accepted to appear in ICML 2021 Our paper \"Intent Classification and Slot Filling for Privacy Policies\"  is accepted to appear in ACL 2021 We are excited to receive a Google Research Scholar Award on \"Exploit Generation Using Reinforcement Learning\" with Yu Feng! Our paper \"CRYPTGPU: Fast Privacy-Preserving Machine Learning on the GPU\" is accepted to appear in Oakland 2021. Our paper \"VerHealth: Vetting Medical Voice Applications through Policy Enforcement\" is accepted to appear in the Proceedings of The ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies (IMWUT/UbiComp) 2021. Our paper “Curse or Redemption? How Data Heterogeneity Affects the Robustness of Federated Learning”, is accepted to appear in the Thirty-Fifth AAAI Conference on Artificial Intelligence (AAAI) 2021. Congratulations to Chenghan for winning the honorable mention for CRA Outstanding Undergraduate Researcher Award! I'm serving as the shadow PC chair for Oakland 2021. Please apply to participate if you are interested. I'm serving as the co-chair for SafeThings 2021. Please submit your great work! Congratulations to Faysal for winning the Linklab Outstanding Graduate Researcher Award! Our paper \"Trade-offs and Guarantees on Adversarial Representation Learning for Information Obfuscation\" is accepted to appear in NeurIPS 2020 Our paper \"PolicyQA: A Reading Comprehension Dataset for Privacy Policies\" is accepted to appear in Findings of EMNLP 2020 NSF has chosen to fund our grant on Private Data Analytics, Synthesis, and Sharing for Large-Scale Multi-Modal Smart City Mobility Research, which is in collaboration with Desheng Zhang, and Dimitris Metaxas I've received an NSF CAREER Award on CAREER: Secure Voice-Controlled Platforms Our paper \"iOS, Your OS, Everybody's OS: Vetting and Analyzing Network Services of iOS Apps\" is accepted to appear in Usenix Security 2020 Our paper \"Read Between the Lines: An Empirical Measurement of Sensitive Applications of Voice Personal Assistant Systems\" is accepted to appear in the Web conference 2020. Our paper \"SPEAKER-RADAR: a Sonar-b",
  "content_length": 14391,
  "method": "requests",
  "crawl_time": "2025-12-01 14:53:19"
}