{
  "name": "Yuan Xie 0001",
  "homepage": "https://seng.hkust.edu.hk/about/people/faculty/yuan-xie",
  "status": "success",
  "content": "Yuan XIE 謝源 | HKUST School of Engineering Skip to main content Yuan XIE 謝源 Yuan XIE 謝源 Details Yuan XIE 謝源 Tel (852) 3469 3062 Email Email yuanxie@ust.hk Office Room CYT3011 Links Personal Web Google Scholar https://scholar.google.com/citations?user=dK2ZuDcAAAAJ&hl=en View Full ProfileBack First Name (and Middle Name If Any) YuanXIE謝源 Highest Degree Acquired (e.g. PhD in Engineering Science) PhD in Computer Engineering, Princeton University Related Web Titles Fang Professor of EngineeringChair Professor, Department of Electronic and Computer EngineeringChair Professor, Department of Computer Science and EngineeringDirector of HKUST-SDU Intelligent Computing Joint LaboratoryDirector of Institute of Integrated Circuits and Systems Contact Information Tel (852) 3469 3062 Email Email yuanxie@ust.hk Office Room CYT3011 Links Personal Web Google Scholar https://scholar.google.com/citations?user=dK2ZuDcAAAAJ&hl=en Research Interests Research Interests Computer architecture Electronic design automation Machine learning Very large-scale integration (VLSI) Research Area Research Area Integrated circuits and systems (ICS) Microelectronics (mE) Biography Biography Prof. Yuan Xie received B.S. degree in Electronic Engineering from Tsinghua University, and his M.S. and Ph.D. degrees in Computer Engineering from Princeton University.  He has a rich industry experience with IBM, AMD,  and Alibaba Group. He was also on the faculty of Pennsylvania State University and University of California, Santa Barbara. He is a Fellow of IEEE, a Fellow of ACM, and a Fellow of AAAS. He is a recipient of many awards, including NSF CAREER Award (2006), IEEE Computer Society Edward J. McCluskey Technical Achievement Award (2021), and IEEE CAS Society Industrial Pioneer Award (2023). View Full Profile Back Research Interests Research Interests Computer architecture Electronic design automation Machine learning Very large-scale integration (VLSI) Research Area Research Area Integrated circuits and systems (ICS) Microelectronics (mE) Biography Biography Prof. Yuan Xie received B.S. degree in Electronic Engineering from Tsinghua University, and his M.S. and Ph.D. degrees in Computer Engineering from Princeton University.  He has a rich industry experience with IBM, AMD,  and Alibaba Group. He was also on the faculty of Pennsylvania State University and University of California, Santa Barbara. He is a Fellow of IEEE, a Fellow of ACM, and a Fellow of AAAS. He is a recipient of many awards, including NSF CAREER Award (2006), IEEE Computer Society Edward J. McCluskey Technical Achievement Award (2021), and IEEE CAS Society Industrial Pioneer Award (2023). View Full Profile Back",
  "content_length": 2684,
  "method": "requests",
  "crawl_time": "2025-12-01 14:53:19"
}