{
  "name": "Yuan Tian 0008",
  "homepage": "http://sophiaytian.com",
  "status": "success",
  "content": "Yuan Tian Yuan Tian (田园) Assistant Professor · Queen's University, Canada · School of Computing AI for Software Engineering · LLM · MSR Dr. Yuan Tian is an Assistant Professor in the School of Computing at Queen's University, Canada. Before joining Queen's, Yuan was a data scientist at the Living Analytics Research Centre (LARC), Singapore. She received her Ph.D. degree in Information Systems from Singapore Management University in May 2017, under the supervision of Prof. David Lo (IEEE/ACM fellow). Yuan visited Carnegie Mellon University in 2015 and Inria Paris in 2013. Yuan leads the RISE research lab which develops reliable and intelligent support for software engineering. RISE’s current research topics include automatic technical debt/bug/code change management, LLM for code transformation and human-AI collaboration. Thank you for your interest. All available spots for Fall 2025 have been filled. News [01/2025] Our paper \"InterTrans: Leveraging Transitive Intermediate Translations to Enhance LLM-based Code Translation\" was accepted by the Research Track of the 47th ACM/IEEE International Conference on Software Engineering (ICSE 2025). Congratulations, Marcos and co-authors! [01/2025] Our paper \"Understanding Abandonment and Slowdown Dynamics in the Maven Ecosystem\" was accepted by MSR 2025 Mining Challenge Track. Congratulations, Amit and co-authors! [12/2024] Our paper \"Obfuscated Clone Search in JavaScript based on Reinforcement Subsequence Learning\" was accepted by TOSEM. Congratulations, Leo and co-authors! [11/2024] I am honored to serve as co-chair for the SETA (Symposium on Software Engineering Technologies & Applications) track of the 49th IEEE Computer Society Signature Conference on Computers, Software, and Applications (COMPSAC 2025). Please consider submit your work to COMPSAC'25. We are looking forward to seeing you July 2025 in Toronto . [10/2024] Our paper \"ZS4C: Zero-Shot Synthesis of Compilable Code for Incomplete Code Snippets using LLMs\" was accepted by TOSEM. Congratulations, co-authors! [10/2024] Our NSERC Alliance-Mitacs project on \"Pragmatic Automated Code Transformation Leveraging Large Language Models\" has been funded. We will be collaborating with our industry partner Ross Video on this exciting project. [10/2024] Our paper \"An Empirical Study on Developers Shared Conversations with ChatGPT in GitHub Pull Requests and Issues\" was accepted by the Journal First Track of the 47th ACM/IEEE International Conference on Software Engineering (ICSE 2025). Huizi will present the work at ICSE 2025 in Ottawa . View all News → Selected Publications Obfuscated Clone Search in JavaScript based on Reinforcement Subsequence Learning. ACM Transactions on Software Engineering and Methodology (TOSEM), 2025. ZS4C: Zero-Shot Synthesis of Compilable Code for Incomplete Code Snippets using ChatGPT. ACM Transactions on Software Engineering and Methodology (TOSEM), 2024. An Empirical Study on the Effectiveness of Large Language Models for SATD Identification and Classification. Empirical Software Engineering (EMSE), 2024. An Empirical Study on Developers Shared Conversations with ChatGPT in GitHub Pull Requests and Issues. Accepted by ICSE'25 Journal-First Track and Empirical Software Engineering (EMSE), 2024. PeaTMOSS: A Dataset and Initial Analysis of Pre-Trained Models in Open-Source Software. Mining Software Repositories (MSR), 2024. Exploring the Impact of the Output Format on the Evaluation of Large Language Models for Code Translation. Best Research Paper Award at AI Foundation Models and Software Engineering (Forge), 2024. View all publications → RISE Lab (Goodwin 621) Current Students Mohammad Sadegh Sheikhaei PhD student, Fall 2020 - (on Job Market) Jerin Yasmin PhD student, Fall 2021 - (previous MSc student 2019-2021) Kazi Amit Hasan Fast-track PhD student (coadvised with Prof. Steven Ding), Fall 2022 - Marcos Macedo Fast-track PhD student (coadvised with Prof. Bram Adams), Fall 2023 - Huizi Hao Fast-track PhD student (coadvised with Prof. Ahmed Hassan), Fall 2023 - Cameron Parker MSc student, Winter 2024 - David Jiang MSc student, Fall 2024 - Conor Gallagher Undergraduate RA, Fall 2024 - Mingjun Gao Undergraduate RA, Fall 2024 - Alumni Jiale Amber Wang Undergraduate RA, 2022/04-2024/04 (Now research-based master at University of Waterloo) Hong Qing MSc student, 2022/09-2024/04 (Now work at Duke University) DongJun Jin MSc student, 2021/05-2022/09 (Now work at Veeva Systems) Julia Liu MSc student, 2020/08-2022/03 Hanwen Hu MSc student, 2020/08-2021/10 Ka Lai Yung MSc student, 2019/08-2021/05 Teaching Current CISC 235 Data Structures, Winter 2025 CISC 351/372, CMPE 351 Advanced Data Analytics, Winter 2025 Past Undergraduate Level CISC 235 Data Structures, Winter 2020, Fall 2020, Winter 2021-2024 CISC/CMPE 351 Advanced Data Analytics, Winter 2019-2024 CISC 451 Topics in Data Analytics, Fall 2024 Graduate Level CISC 839 Topics in Data Analytics, Summer 2022-2024 (for DEBI program), Fall 2024 (for SOC, shared with CISC 451) MDPM 822 Emerging Computing Technologies, Fall 2022-2024 (for MDPM program) CISC 843/880 Mining Software Respositories, Winter 2019-2021 Contact y [dot] tian [at] queensu [dot] ca School of Computing, Queen's University, Kingston, Ontario K7L 3N6 Office: Goodwin 635",
  "content_length": 5295,
  "method": "requests",
  "crawl_time": "2025-12-01 14:53:14"
}