{
  "name": "Yuan Huang 0002",
  "homepage": "https://huangyuan-hy.github.io",
  "status": "success",
  "content": "Yuan Huang Yuan Huang（黄袁） Associate Professor, Doctoral Advisor E-mail: huangyuan5 (at) mail.sysu.edu.cn School of Software Engineering, Sun Yat-Sen University, China Other Sites: Chinese Homepage, Google Scholar, DBLP Office: Room 321, Comprehensive Laboratory Building, Zhuhai Campus, Sun Yat-Sen University Biography Huang Yuan received the Ph.D degree in computer science from Sun Yat-Sen University in 2017. He is an associate professor in the School of Software Engineering, Sun Yat-sen University. He was a research assistant at the Hong Kong Polytechnic University. He is particularly interested in Generative Software Intelligence, Software Quality Control, Code Defect Location and Repair, Hallucinations in LLM-Generated Code, Blockchain, Smart Contract. He has published more than 50 papers in the software engineering journals and conferences, including: TSE, TOSEM, TSC, EMSE, ASEJ, IST, JSS, SPE, STVR, JSEP and FSE, ASE, ICSE, ICPC, SANER, ESEM, etc. Looking for highly motivated students in the areas of Software Engineering and Blockchain. Research Background 07/2021 - Present, Associate Professor, School of Software Engineering, Sun Yat-Sen University 02/2019 - 06/2021, Post-doctoral, School of Computer Science and Engineering, Sun Yat-sen University 01/2018 - 01/2019, Research Assistant, Department of Computing, The Hong Kong Polytechnic University 09/2013 - 12/2017, Ph.D, School of Data and Computer Science, Sun Yat-sen University News October 10，2025，ByteCue: enhancing bytecode comment generation with API information was accepted at ACM Transactions on Software Engineering and Methodology (CCF A). To quickly and accurately understand the meaning of bytecode and further assist programmers in several software activities, we propose a bytecode comment generation approach called ByteCue in this study. August 05，2025，GPTVD: Vulnerability Detection and Analysis Method Based on LLM's Chain of Thoughts was accepted at Automated Software Engineering (CCF B). June 30，2025，Commit Messages Generation Based on Core Changes was accepted at ACM Transactions on Software Engineering and Methodology (CCF A). To better generate commit messages, in this study we propose a novel method that identifies the core code change in a commit for commit message generation. Incorporating core change information can boost the performance of other existing methods (such as NMT, NNGen, CoreGen, etc.) January 29，2025，Characterizing Smart Contract Evolution was accepted at ACM Transactions on Software Engineering and Methodology (CCF A). In this paper, we conducted a large-scale empirical study to characterize the evolution of smart contracts in Ethereum. December 17, 2024，Towards improving the performance of comment generation models by using bytecode information was accepted at IEEE Transactions on Software Engineering (CCF A). The bytecode information is introduced to improve the accruccy of the comment generation models in this study. November 27，2024，TG-CUP: A Transformer and GNN Based Multi-Modal Comment Updating Method was accepted at ACM Transactions on Software Engineering and Methodology (CCF A). We propose a new outdated comment update model TG-CUP in this study. October 31, 2024, An Alternative to Code Comment Generation? Generating Comment from Bytecode was accepted at Information and Software Technology (CCF B). In this study, we propose a novel approach called ByteGen to generate comments from bytecode. August 7, 2024, An Empirical Study on Learning-based Techniques for Explicit and Implicit Commit Messages Generation was accepted at ASE 2024 (CCF A). This work studies the performance of the learning-based models on the task of explicit and implicit commit message generation. August 5, 2024, Deep Learning-based Software Engineering: Progress, Challenges, and Opportunities was accepted at SCIENCE CHINA-Information Sciences (CCF B). In this paper, we present the first task-oriented survey on deep learning-based software engineering. It covers twelve major software engineering subareas significantly impacted by deep learning techniques. Such subareas spread out the through the whole lifecycle of software development and maintenance, including requirements engineering, software development, testing, maintenance, and developer collaboration. July 7, 2024, Are your comments outdated? Toward automatically detecting code-comment consistency was accepted at JSEP 2024 (CCF B). This work proposed an automatic method for detecting code-comment consistency. June 17, 2024, Are the smart contracts on Q&A site reliable? was accepted at SPE 2024 (CCF B). In this article, we conduct an empirical study investigating the distribution of vulnerabilities and gas-inefficient patterns in Ethereum Stack Exchange. April 3, 2024, Ethereum Transaction Replay Platform Based on State-wise Account Input Data was accepted at IEEE Transactions on Services Computing (CCF A). In this study we propose an efficient transaction replay platform, EthReplayer, which can not only replay the historical transactions of Ethereum quickly and faithfully but also realize the modification of transactions to achieve the purpose of testing with actual transactions. March 5, 2024, Generative Software Engineering is posted on the arXiv. This paper presents a comprehensive literature review of generative tasks in software engineering by applying large language models (LLMs). URL: https://arxiv.org/abs/2403.02583. February 17, 2024, Do Code Summarization Models Process Too Much Information? Function Signature May Be All What Is Needed was accepted at ACM Transactions on Software Engineering and Methodology (CCF A). This study found that there is no significant difference in BLEU value between comments generated using the function signature and those generated using the entire function as input. February 1, 2024, The Sword of Damocles: Upgradeable Smart Contract in Ethereum was accepted at ICPC 2024 (CCF B). This paper explores two ways in which smart contracts can be upgraded, and finds one of them can be quietly upgraded to the detriment of users. January 23, 2024, JIT-Smart: A Multi-Task Learning Framework for Just-In-Time Defect Prediction and Localization was accepted at FSE/ESEC 2024 (CCF A). Unlike traditional methods, which usually model just-in-time defect prediction and localization as a two-stage task, JIT-Smart models the commit-level prediction task and the line-level localization task in a unified way. In the prediction phase, JIT-Smart outperforms 7 SOTA methods, and in the localization phase, JIT-Smart outperforms 3 SOTA methods. January 11, 2024, ESGen: Commit Message Generation Based on Edit Sequence of Code Change was accepted at ICPC 2024 (CCF B). This work was completed by Li Yangzi, an undergraduate student in our research group. January 04, 2024, An Empirical Study of Code Reuse between GitHub and Stack Overflow during Software Development was accepted at Journal of Systems and Software (CCF B). This paper is an extension version of the paper accepted by ICPC'22. See More... December 01, 2023, Smart Contract Code Repair Recommendation based on Reinforcement Learning and Multi-metric Optimization was accepted at ACM Transactions on Software Engineering and Methodology (CCF A). November 18, 2023, Towards Automatically Identifying the Co-change of Production and Test Code was accepted at Software Testing, Verification & Reliability (CCF B). July 03, 2023, Snippet Comment Generation Based on Code Context Expansion was accepted at ACM Transactions on Software Engineering and Methodology (CCF A). June 12, 2023, An Empirical Study on Real Bug Fixes from Solidity Smart Contract Projects was accepted at Journal of Systems and Software (CCF B). June 08, 2023, Studying Differentiated Code to Support Smart Contract Update was accepted at Empirical Software Engineering (CCF B). This paper is an extension version of the paper accepted by ICPC'19. January 05, 2023, A Comparative Study on Method Comment and Inline Comment was accepted at ACM Transactions on Software Engineering and Methodology (CCF A). In this paper, we studied the task of automatic code comment generation, and revealed the equivalent mechanism of function-level external comment and internal comment, and explored the theoretical basis of building the automatic generation model of the internal comment. December 16, 2022, Security Code Recommendations for Smart Contract was accepted at SANER'23. In this paper, we proposed SMARTREP, an end-to-end tool, for smart contract repair with one-line patches. November 28, 2022, BCGen: A Comment Generation Method for Bytecode was accepted at Automated Software Engineering Journal. In this paper, we have initially explored the problem of code comment generation in scenarios where source code is not available, using bytecode as input to the generation model. The significance of this work is that code comment generation tools can be generalized from open source software to closed source software. March 9, 2022, Towards Exploring the Code Reuse from Stack Overflow during Software Development was accepted at ICPC'22. In this paper, we conduct a comprehensive empirical study to learn how programmers reuse code on Stack Overflow during project development. July 20, 2021, Reviewing rounds prediction for code patches was accepted at Empirical Software Engineering. Publication (*Corresponding Author) Software Engineering Yuan Huang, Jinbo Huang, Xiangping Chen, Zibin Zheng, Towards improving the performance of comment generation models by using bytecode information, IEEE Transactions on Software Engineering (TSE ), 2024. [PDF] Yuan Huang, Jinyu Jiang, Xiapu Luo, Xiangping Chen, Zibin Zheng, and Gang Huang, Change-Patterns Mapping: A Boosting Way for Change Impact Analysis, IEEE Transactions on Software Engineering (TSE ), 2022. [PDF] Yuan Huang, Xiangping Chen, Kai Hong, Zibin Zheng, Code Review Knowledge Perception: Fusing Multi-Features for Salient-Class Location, IEEE Transa",
  "content_length": 21330,
  "method": "requests",
  "crawl_time": "2025-12-01 14:53:13"
}