{
  "name": "Yuan-Fang Li",
  "homepage": "https://research.monash.edu/en/persons/yuan-fang-li",
  "status": "success",
  "content": "Yuan-Fang Li - Monash University Yuan-Fang Li public CV View Scopus Profile Yuan-Fang Li Assoc Professor Associate Professor, Department of Data Science & AI https://orcid.org/0000-0003-4651-2821 EmailYuanFang.Limonashedu Accepting PhD StudentsPhD projects<a href=\"https://supervisorconnect.it.monash.edu/\" onclick=\"target='_blank';\">https://supervisorconnect.it.monash.edu/</a> 20022026 Research activity per year Personal profile Research interestsYuan-Fang Li (李元放) is an Associate Professor in the Department of Data Science & Artificial Intelligence (DS+AI), Faculty of Information Technology, Monash University. He is also the Associate Dean International of the Faculty. Yuan-Fang's research interests include knowledge graphs, natural language processing, multimodality, and representation learning (embedding) of networks/graphs. Some of the research problems he works on include: Complex question answering over text and knowledge graphs.Knowledge extraction from other modalities: e.g. event/relation extraction from text and scene graph generation from images.Structural & temporal learning on graphs.Question generation from text & knowledge graphs. Related Links: More information can be found at Yuan-Fang's personal homepage. Monash teaching commitmentYuan-Fang has experience as the Chief Examiner for the following units in the Faculty of IT: FIT4002 Software engineering studio projectFIT4004/FIT5171 System validation and verification, quality and standardsFIT5138 Advanced Software EngineeringFIT3013 Formal specification for software engineeringFIT4008 Reading unitMinor thesis, Masters thesis and Honours thesis units Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Education/Academic qualificationComputer Science, Doctor of Philosophy, National University of Singapore (NUS)Award Date: 18 Dec 2006Computer Science, Bachelor of Computing (Honours), National University of Singapore (NUS)Award Date: 7 Aug 2002 Research area keywordsKnowledge GraphsNatural Language ProcessingKnowledge RepresentationOntologiesSemantic Web Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Projects Projects per year 2014 2015 2019 2020 2022 2027 1 Active 10 Finished Projects per year HARNESS: Hierarchical Abstractions and Reasoning for Neuro-Symbolic SystemsRezatofighi, H. (Primary Chief Investigator (PCI)), Garcia De La Banda Garcia, M. (Chief Investigator (CI)), Li, Y.-F. (Chief Investigator (CI)), Stuckey, P. (Chief Investigator (CI)), Gasevic, D. (Chief Investigator (CI)), Gutierrez, J. (Chief Investigator (CI)), Qu, L. (Chief Investigator (CI)), Ignatiev , A. (Chief Investigator (CI)), Swiecki, Z. (Chief Investigator (CI)), Vered, M. (Chief Investigator (CI)), Chen, G. (Chief Investigator (CI)), Haffari, R. (Chief Investigator (CI)) & Say, B. (Chief Investigator (CI))20/06/23 → 20/02/27Project: Research Large-scale multimodal knowledge management: From organization and user modeling to fast contextual presentationGasevic, D. (Primary Chief Investigator (PCI)), Swiecki, Z. (Chief Investigator (CI)), Li, Y.-F. (Chief Investigator (CI)), Haffari, R. (Chief Investigator (CI)), Hayat, M. (Chief Investigator (CI)), Chen, G. (Chief Investigator (CI)), Tsai, Y.-S. (Chief Investigator (CI)), Do, T. (Chief Investigator (CI)), Zhuang, B. (Chief Investigator (CI)) & Wang, T. (Chief Investigator (CI))2/09/22 → 1/09/25Project: Research Cross-lingual text summarisation with a planLi, Y.-F. (Primary Chief Investigator (PCI)), Haffari, R. (Chief Investigator (CI)) & Qu, L. (Chief Investigator (CI))1/06/22 → 31/08/22Project: Research Intelligent process control based on large-scale data mining and deep reinforcement learningLi, Y.-F. (Primary Chief Investigator (PCI)), Pan, S. (Chief Investigator (CI)) & Chang, X. (Chief Investigator (CI))Metso Outotec Oy, Outotec Pty Ltd1/07/20 → 30/06/23Project: Research Reasoning under Uncertainty with Natural Language (2)Li, Y.-F. (Primary Chief Investigator (PCI)), Haffari, R. (Chief Investigator (CI)), Chang, X. (Chief Investigator (CI)), Wang, T. (Chief Investigator (CI)) & Pan, S. (Chief Investigator (CI))1/06/20 → 15/11/23Project: Research View all 11 projects Research output Research output per year 2002 2015 2019 2020 2021 2022 2023 2026 103 Conference Paper 38 Article 9 Chapter (Book) 3 Other 3 More 2 Foreword / Postscript 1 Abstract Research output per year Research output per year Hypergraph node representation learning with one-stage message passingQu, S., Wang, W., Li, Y. F., Zhou, X. & Yuan, F., Jan 2026, In: Neural Networks. 193, 10 p., 107973.Research output: Contribution to journal › Article › Research › peer-review Open AccessFile Scalable and effective negative sample generation for hyperedge predictionQu, S., Wang, W., Li, Y.-F., Nguyen, Q. V. H. & Yin, H., Jan 2026, In: Neural Networks. 193, 13 p., 108034.Research output: Contribution to journal › Article › Research › peer-review Open AccessFile NEUSIS: A Compositional Neuro-Symbolic Framework for Autonomous Perception, Reasoning, and Planning in Complex UAV Search MissionsCai, Z., Cardenas, C. R., Leo, K., Zhang, C., Backman, K., Li, H., Li, B., Ghorbanali, M., Datta, S., Qu, L., Gutierrez, J., Ignatiev, A., Li, Y.-F., Vered, M., Stuckey, P. J., De La Banda, M. G. & Rezatofighi, H., Sept 2025, In: IEEE Robotics and Automation Letters. 10, 9, p. 9502-9509 8 p.Research output: Contribution to journal › Article › Research › peer-review Pytester: Deep reinforcement learning for text-to-testcase generationTakerngsaksiri, W., Charakorn, R., Tantithamthavorn, C. & Li, Y. F., Jun 2025, In: Journal of Systems and Software. 224, 15 p., 112381.Research output: Contribution to journal › Article › Research › peer-review Open AccessFile 2 Citations (Scopus) Co-designing a knowledge management tool for educator communities of practiceFernández-Nieto, G. M., Swiecki, Z., Tsai, Y. S., Sha, L., Wei, Y., Wen, J., Li, Y., Jin, Y., Feraud, I. S., Li, Y. F., Wang, W., Chen, G. & Gasevic, D., 1 Jul 2024, Proceedings of the 2024 ACM Designing Interactive Systems Conference. Fritsch, J., Alaoui, S. F. & Le Dantec, C. A. (eds.). New York NY USA: Association for Computing Machinery (ACM), p. 1970-1990 21 p.Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review Open AccessFile 2 Citations (Scopus) View all 156 research outputs Prizes Best Student Paper AwardLi, Y.-F. (Recipient), Jan 2020Prize: Prize (including medals and awards) Kurzweil Best Paper PrizeLi, Y.-F. (Recipient), 2017Prize: Prize (including medals and awards) President’s Graduate Fellowship ScholarshipLi, Y.-F. (Recipient), 2005Prize: Other distinction Singapore Millennium Foundation ScholarshipLi, Y.-F. (Recipient), 2004Prize: Other distinction Activities Activities per year 2013 2019 2020 9 Peer review responsibility 4 Professional association or peak discipline body 1 Editorial responsibility Activities per year World Wide Web (Journal)Li, Y.-F. (Peer reviewer)2020 → …Activity: Publication peer-review and editorial work types › Peer review responsibility Information Sciences (Journal)Li, Y.-F. (Peer reviewer)2020Activity: Publication peer-review and editorial work types › Peer review responsibility Neurocomputing (Journal)Li, Y.-F. (Peer reviewer)2019 → …Activity: Publication peer-review and editorial work types › Peer review responsibility BMC Bioinformatics (Journal)Li, Y.-F. (Peer reviewer)2019 → …Activity: Publication peer-review and editorial work types › Peer review responsibility Director, Bachelor of Software Engineering Degree (BSE)Li, Y.-F. (Executive Member)2019 → …Activity: External Academic Engagement › Professional association or peak discipline body View all 14 activities Press/Media Healthcare efficiency: AI technology to reduce hospital readmissionsHettige, B., Wang, T., Li, Y.-F. & Buntine, W.11/05/201 item of Media coveragePress/Media: Article/Feature",
  "content_length": 8403,
  "method": "requests",
  "crawl_time": "2025-12-01 14:53:20"
}