{
  "name": "Yuanming Shi",
  "homepage": "https://faculty.sist.shanghaitech.edu.cn/faculty/shiym/home.html",
  "status": "success",
  "content": "Yuanming SHI ç³è¿æ Yuanming Shi Home Education Research Group Teaching Publications Talks Yuanming SHI ç³è¿æ Professor School of Information Science and Technology (SIST), ShanghaiTech University Email: shiym@shanghaitech.edu.cn Office: Room C-403.C, SIST Building 1, 393 Middle Huaxia Road, Pudong District, Shanghai 201210, China. Highlights: We have openings for Postdoc researchers. Research areas: edge AI, space computing, wireless communications, and large-scale optimization. [Resume][Google Citations] News Jul. 2021, ICCC Tutorial: “Federated Machine Learning in 6G: Opportunities and Challenges”. [slides] Nov. 2020, I was elevated to IEEE Senior Member. May 2020, I was selected as an editor of IEEE Journal on Selected Areas in Communications, âMachine Learning in Communications and Networksâ Series. Apr. 2020, book “Low-overhead Communications in IoT Networks: Structured Signal Processing Approaches” has been published by Springer. [website] [codes] Dec. 2019, IEEE GLOBECOM Tutorial: “Mobile Edge Artificial Intelligence: Opportunities and Challenges”. [slides] Dec. 2019, I was selected as an editor of IEEE Transactions on Wireless Communications. Jul. 2018, we organized a workshop âInformation, Learning and Decisionâ at ShanghaiTech. Dec. 2017, IEEE GLOBECOM Tutorial: “Sparse and Low-Rank Optimization for Dense Wireless Networks: Models, Algorithms and Theory”. [slides] Oct. 2016 - Feb. 2017, visit University of California, Berkeley, hosted by Prof. Martin J. Wainwright. Dec. 2016, my paper on Large-Scale Convex Optimization won The 2016 IEEE Signal Processing Society Young Author Best Paper Award, co-authored with Jun Zhang, Brendan OâDonoghue, and Khaled B. Letaief. Apr. 2016, my paper on Cloud-RAN won The 2016 Marconi Prize Paper Award in Wireless Communications, joint work with Jun Zhang and Khaled B. Letaief. Page generated 2024-04-15 16:05:49 CST, by jemdoc. (source)",
  "content_length": 1927,
  "method": "requests",
  "crawl_time": "2025-12-01 14:53:20"
}