{
  "name": "Yuanfeng Zhou",
  "homepage": "http://www.en.sc.sdu.edu.cn/info/1027/1152.htm",
  "status": "success",
  "content": "ï»¿ Yuanfeng Zhou-è½¯ä»¶å­¦é¢è±æ Contact Us ï¼86ï¼-531-88391516 Fax ï¼86ï¼-531-88391686 ä¸­æ Home About People Programs Research Campus People Locationï¼ Home >> People >> Research Center of Intelligent Information Processing Yuanfeng Zhou 2019-12-24editï¼rjyw Yuanfeng Zhou (å¨å å³°) Professor, PhD supervisor Personal information: Email: yfzhou@sdu.edu.cn, yuanfeng.zhou@gmail.com Address: School of Software Shandong University ShunHua Road 1500#, Jinan, China Zip Code:250101 Education and Qualifications: Professorï¼Shandong University, 2017.9 â now. Associate Professor, Shandong University, 2012.2 â 2017.8. Post-doctoral fellow, The University of Hong Kong, 2009.9- 2011.9. Research Assistant, The University of Hong Kong, 2009.1- 2009.8. Ph.D., Shandong University, 2009.6. M.E., Shandong University, 2005.6. B.E., Shandong University, 2002.6. Research Fields: Computer Graphics, Image Processing, 3D modelling â¢Intelligent graphics â¢Medical Image Processing â¢Information Visualization â¢Virtual Reality Selected Publication: (1) Guangshun Wei, Yuanfeng Zhou, Xifeng Gao, Qian Ma, Shiqing Xin, Ying He. Field-aligned Quadrangulation for Image Vectorization. Computer Graphics Forums (Pacific Graphics 2019), 38(7):171-180, 2019. (2) Long Ma, Ying He, Qian Sun, Yuanfeng Zhou, Wenping Wang, Caiming Zhang. Constructing 3D Self-Supporting Surfaces with Isotropic Stress Using 4D Minimal Hypersurfaces of Revolution. ACM Transactions on Graphics, 38(5): 144:1-144:13, 2019. (3) Xiao Pan, Yuanfeng Zhou, Zhonggui Chen, Caiming Zhang, Texture Relative Superpixel Generation With Adaptive Parameters, IEEE Transactions on Multimedia, 2019. 21(8): 1997-2011. (4) Fengyi Gao, Guangshun Wei, Shiqing Xin, Shanshan Gao, Yuanfeng Zhou. 2D skeleton extraction based on heat equation. Computers & Graphics(Special issue of SMI'18), 2018, 74: 99-108. (5) Shiqing Xin, Wenping Wang, Ying He, Yuanfeng Zhou, Shuang-Min Chen, Changhe Tu, Zhenyu Shu, Lightweight preprocessing and fastquery of geodesic distance via proximity graph. Computer-Aided Design 102: 128-138,(2018). (6) Zhong Li, Zhou Yuanfeng, Zhang Xiao-feng, Guo Qiang, Zhang Cai-ming. Image segmentation by level set evolution with region consistency constraint. Applied Mathematics:A Journal of Chinese Universities, 2017, 32(04):422-442. (7) Yuanfeng Zhou, Xiao Pan, Wenping Wang, Yilong Yin, Caiming Zhang, Superpixels by Bilateral Geodesic Distance. IEEE Transactions on Circuits and Systems for Video Technology, 2017, 27(11): 2281-2293. (8) Xiao Pan, Yuanfeng Zhou, Feng Li, Caiming Zhang, Superpixels of RGB-D Images for Indoor Scenes Based on Weighted Geodesic Driven Metric, IEEE Transactions on Visualization and Computer Graphics, 23(10): 2342-2356, 2017. (9) Yuanfeng Zhou, Hui Xu, Xiao Pan, Caiming Zhang, Parsing Main Structures of Indoor Scenes from Single RGB-D Image, Journal of Advanced Mechanical Design, Systems, and Manufacturing, Special Issue on ACDDE2015, 2016, 10(8):p.JAMDSM0102. (10) Yuanfeng Zhou, Shanshan Gao, Efficient topology preserving triangular remeshing algorithm with adaptive vertices insertion, Elsevier Applied Mathematical Modelling, 2016, 40:5421-5430. (11) Yuanfeng Zhou, Caiming Zhang, Pengbo Bo. Efficient Tetrahedral Mesh Generation Based on Sampling Optimization. Computer Animation and Virtual Worlds, 2015, 26(6):577-587. (12) Yuanfeng Zhou, Feng Sun, Wenping Wang, Jiaye Wang, Caiming Zhang. Fast Updating of Delaunay Triangulation of Moving Points by Bi-cell Filtering. Computer Graphics Forums (Pacific Graphics 2010), 2010, 29(7):2233-2242. (13) Shixiang Jia, Caiming Zhang, Xuemei Li, Yuanfeng Zhou. Mesh resizing based on hierarchical saliency detection. Graphical Models, 2014, 76(5): 355-362. (14) Weitao Li, Yuanfeng Zhou, Caiming Zhang, Xuemei Li, Robust Multi-level Partition of Unity Implicits from Triangular Meshes. Journal of Visualization and Computer Animation, 2014, 25(2): 115-127. (15) Zhou Yuanfeng, Bo Pengbo, Zhang Caiming, Gao Shanshan. A new interactive method for controlling implicit surfaces. Chinese Journal of Computer, 2009, 32(6):1206-1213. (in Chinese) (16) Zhou Yuanfeng, Zhang Caiming, He Ping. Feature Preserving Mesh Simplification Algorithm Based on Square Volume Measure. Chinese Journal of Computer, 2009, 32(2):203-212. (in Chinese) (17) Xiaojie Wang, Yuanfeng Zhou, Xiao Pan, Caiming Zhang, A robust 3D point cloud skeleton extraction method, SCIENCE CHINA Information Sciences: 2017, 47(7):832-845. (18) Xiao Pan, Yuanfeng Zhou, Shanshan Gao, Mingze Xu. Virtual Endoscopy Automatic Navigation Method Based on Rotation Minimizing Frames.Journal of Computer-Aided Design and Computer Graphics, 2015, 27(8):1548-1554. (in Chinese) (19) Li Weitao, Zhou Yuanfeng, Gao Shanshan, Zhang Caiming. Rapid sampling on implicit surfaces via hybrid optimization. Chinese Journal of Computer, 2014, 37(3): 593-601.(in Chinese) (20) Long Ma, Yuanfeng Zhou, Hao Pan, Caiming Zhang. A Framework for Modeling High Quality Tension-Determined Surfaces, Computer Graphics, 2016, 61:50-59. SCI (21) Xin Zhang, Qian Liu, Xuemei Li, Yuanfeng Zhou, Caiming Zhang, Non-local feature back-projection for image super-resolution. IET Image Processing 10(5): 398-408 (2016) (22) Qian Liu, Caiming Zhang, Qiang Guo, Hui Xu and Yuanfeng Zhou, Adaptive sparse coding on PCA dictionary for image denoising. The Visual Computer 32(4): 535-549 (2016) (23) Dongmei Niu, Peer-Timo Bremer, Peter Lindstrom, Bernd Hamann, Yuanfeng Zhou, Caiming Zhang, Two-dimensional shape retrieval using the distribution of extrema of Laplacian eigenfunctions. The Visual Computer, 33(5): 607-624, (2017) (24) Yongxia Zhang, Long Ma, Yuanfeng Zhou, Caiming Zhang, Automatic superpixel generation algorithm based on a quadric error metric in 3D space. Journal of Signal, Image and Video Processing, 11(3): 471-478, 2017 (25) Xiao Pan, Yuanfeng Zhou, Caiming Zhang, Qian Liu. Flooding Based Superpixels Generation With Color, Compactness And Smoothness Constraints. In proceedings of IEEE International Conference on Image Processing (ICIP), Paris, 2014, pp.4432-4436. Projects: (1) Research on intelligent processing methods and application of time-varying complex flow field data in biomedical field. Key project of NSFC, 2020-01 - 2023-12. Co-PI (2) Research on the theories and applications of surface smooth cross fields construction with singularity optimization. NSFC project, 2018-01 - 2021-12. PI (3) Research on Key Technologies of Multi-Human Body Modeling Based on Distributed RGB-D Sensor Network in Complex Environment. The key research and development project of Shandong province, 2017.08 â 2019.08. PI (4) Research on theories and applications of high precision constant mean curvature surface modeling. NSFC project, 2016-01 - 2016-12. PI (5) Research of rapid modelling based on 4D medical images. NSFC project, 2013.1 - 2015.12. PI (6) Research on 3D tetrahedral mesh generation of medical image via hybrid optimization, the Scientific Research Foundation for the Excellent Middle-Aged and Youth Scientists of Shandong Province of China, 2013.10 - 2015.10. PI (7) Research on 3D modeling problems of the dynamic digital human heart with high precision, Shandong University Innovation Foundation, 2012.11 - 2014.11. PI (7) 3D locating and visualization systems for low-frequency rotating magnetic therapy equipment, enterprise cooperation projects, 2013.4 - 2014.12. PI 2009 - 2012: (1) The project of WATERMAN, The University of Hong Kong. (2) The project of Remote visualization and system implementation of massive data in large scale dynamic scene, 863 project. Professional Services: CCF members Geometric Design and Computing Committee members, CSIAM CCF CAD&CG Committee members Reviewers of conferences and journals of IEEE TIP, SIAM, TVC, IEEE Access, CAD, Pacific Graphics, SPM, Journal of Computer, Journal of Computer Aided Design and Graphics. Honors & Awards: Shandong Provincial Science and Technology Progress Award, second prize, 2014. (5th) Institution of Higher Education Science and Technology Award of Chinese Ministry of Education, 2007. (9th) Geometry Design and Image Compressing, Higher Education Department of Shandong Province, Shandong, first prize of excellent scientific researchï¼2007. (4th) Previousï¼Xuemei Li Nextï¼Gongping Yang Address: 1500 ShunHua Road, High Tech Industrial Development Zone, Jinan, China 250101 Tel: (86)-531-88391516 Postcode: 250101",
  "content_length": 8430,
  "method": "requests",
  "crawl_time": "2025-12-01 14:53:20"
}