{
  "name": "Yuankai Qi",
  "homepage": "https://sites.google.com/site/yuankiqi",
  "status": "success",
  "content": "Yuankai Qi(齐元凯)Search this siteEmbedded FilesSkip to main contentSkip to navigationYuankai Qi (齐元凯)BIOGRAPHY:I am a Lecturer at Macqurie University, and also an Adjunct Lecturer with the Australian Institute for Machine Learning (AIML) of The University of Adelaide. I am looking for highly motivated Ph.D. students and visiting students. Feel free to contact me for PhD and Master (research) supervision. I received my Ph.D degree from Harbin Institute of Technology (HIT) in 2018, supervised by Prof Qingming Huang. My research interests span computer vision, natural language processing, and speech processing, such  vision-language navigation for robots, video captioning, image generation from text, image editing, crowd counting, action recognition,  visual object tracking, movie dubbing, and music generation.See recent publications on Google Scholar: hereEmail: qykshr(at)gmail.comUniversity Scholarship Application Dates (two rounds per year): Usually March-April and June-July for international students; May-June and Sept-Oct for Australian PR/Citizens. More details can be found here. Government- or Industry-funded HDR applicants are equivalently welcome!News:I will serve as Area Chair for ICML 2026I have been selected as one of World's Top 2% Scientists 2025 in Standford and Elsevier's report!Two papers accepted to AAAI 2026!I will serve as Area Chair for CVPR 2026I will serve as  Area Chair  for ICLR 2026One paper accepted to TPAMI!One paper accepted to PR!Three papers got accepted to ACM MM 2025, including one Oral!One paper got accepted to ICCV 2025I will serve as AAAI 2026 Area ChairI will serve as NeurIPS 2025 Area ChairI will serve as ICCV 2025 Area ChairFive papers got accepted to CVPR 2025!Two papers got accepted to AAAI 2025We won the ICPR 2024 Best Student Paper Award!We won the ACM MM 2024 Best Paper Award!Honors and Awards:World's Top 2% Scientists 2024 and 2025APRS ECR Award 2023 Honourable Mention Winner of CAAI Outstanding Doctoral Dissertations, China, 2020 (10 winners across China, link English, Simple Chinese)Merit PhD Candidate of Heilongjiang Province, China, 2017Winner of Supreme National Scholarship for PhD Candidates, 2016VisDrone 2018: Runner-up in the Vision Meets Drones: Single Object Tracking Challenge! [VisDrone2018 results]DAVIS 2017: Champion in the DAVIS Challenge on Video Object Segmentation 2017! [DAVIS2017 results]VOT 2016: Our State-and-Scale Aware Tracker (SSAT) achieves the most accurate tracking results among totally 70 trackers on VOT 2016!  [ VOT2016 results paper ]Services:Area Chair of ICML 2026, CVPR 2026,  ICLR 2026/2025, AAAI 2026, NeurIPS 2025, ICCV 2025Reviewer of IEEE T-PAMI, IJCV, T-IP, T-MM, and T-CSVTReviewer of  ICLR, AAAI, IJCAI, ICCV, ECCV, NeurIPS, CVPR, ICRA, and ACM MMRefer to this link for the full publication listSelected Publications: Gaoxiang Cong, Jiadong Pan, Liang Li, Yuankai Qi, Yuxin Peng, Anton van den Hengel, Jian Yang, Qingming Huang: EmoDubber: Towards High Quality and Emotion Controllable Movie Dubbing, CVPR 2025, accepted as HighlightZhedong Zhang, Liang Li, Gaoxiang Cong, Haibing YIN, Yuhan Gao, Chenggang Yan, Anton van den Hengel, Yuankai Qi: From Speaker to Dubber: Movie Dubbing with Prosody and Duration Consistency Learning, ACM MM 2024, Oral, Best Paper Award, top 3.97%Matineh Pooshideh, Amin Beheshti, Yuankai Qi, Helia Farhood, Mike Simpson, Nick Gatland, Mehdi Soltany: Presentation Attack Detection: A Systematic Literature Review, ACM Computing Surveys (IF: 23.8), 2024.Zhedong Zhang, Liang Li, Jiehua Zhang, Zhenghui Hu, Hongkui Wang, Chenggang Yan, Jian Yang, and Yuankai Qi: Generating high-quality Symbolic Music Using Fine-Grined Discriminators, ICPR 2024, Oral, Best Student Paper AwardMinh Hieu Phan, Yutong Xie, Bowen Zhang, Yuankai Qi, Zhibin Liao, Antonios Perperidis, Son Lam Phung, Johan Verjans, Minh-Son To: Structural Attention: Rethinking Transformer for Unpaired Medical Image Synthesis, MICCAI 2024, early accept, top 11%Guorong Li, Hanhua Ye, Yuankai Qi*, Shuhui Wang, Laiyun Qing, Qingming Huang*, Ming-Hsuan Yang: Learning Hierarchical Modular Networks for Video Captioning, IEEE TPAMI 2023, * Corresponding authorWanrong Zhu, Yuankai Qi, Pradyumna Narayana, Kazoo Sone, Sugato Basu, Xin Eric Wang, Qi Wu, Miguel Eckstein, William Yang Wang: Diagnosing Vision-and-Language Navigation: What Really Matters, NAACL, 2022, OralDong An, Yuankai Qi, Yan Huang, Qi Wu, Liang Wang, Tieniu Tan:  Neighbor-view Enhanced Model for Vision and Language Navigation, ACM MM,  2021, OralYicong Hong, Qi Wu, Yuankai Qi, C. R. Opazo, Stephen Gould: A Recurrent Vision-and-Language BERT for Navigation. CVPR, 2021, OralYuankai Qi, Qi Wu, Peter Anderson, Xin Wang, William Yang Wang, Chunhua Shen, Anton van den Hengel, REVERIE: Remote Embodied Visual Referring Expression in Real Indoor Environments, CVPR, 2020, Oral, [Code]Yuankai Qi, Shengping Zhang, Weigang Zhang, Li Su, Qingming Huang, Ming-Hsuan Yang, Learning Attribute-Specific Representations for Visual Tracking, AAAI, 2019, SpotlightYuankai Qi, Shengping Zhang, Lei Qin, Qingming Huang, Hongxun Yao, Jongwoo Lim, Ming-Hsuan Yang, Hedging Deep Features for Visual Tracking, IEEE Trans. PAMI, 2018.Yuankai Qi, Lei Qin, Jian Zhang, Shengping Zhang, Qingming Huang, Ming-Hsuan Yang, Structure-aware Local Sparse Coding for Visual Tracking, IEEE Trans. IP, 2018.Yuankai Qi, Shengping Zhang, Lei Qin, Hongxun Yao, Qingming Huang, Jongwoo Lim, Ming-Hsuan Yang, Hedged Deep Tracking, IEEE CVPR, 2016Google SitesReport abuseGoogle SitesReport abuse",
  "content_length": 5541,
  "method": "requests",
  "crawl_time": "2025-12-01 14:53:21"
}