{
  "name": "Yuanqing Zheng",
  "homepage": "http://www4.comp.polyu.edu.hk/~csyqzheng",
  "status": "success",
  "content": "Welcome to Yuanqing's page Yuanqing Zheng (郑元庆) Associate Professor Department of Computing The Hong Kong Polytechnic University Office: PQ721, Mong Man Wai Building Phone: (852) 2766 7288 Fax: (852) 2766 0842 Email: csyqzheng@comp.polyu.edu.hk Hiring We are looking for PolyU Ug/Pg student helpers, PhD students, research staffs in all levels to work on exciting research projects related to Internet of Things, wireless sensing, ubiquitous computing, embedded systems, security and privacy, robotics, and artificial intelligence. If you are interested in any of these or other research topics, please feel free to contact me. Biography Yuanqing Zheng is an associate professor in the Department of Computing, the Hong Kong Polytechnic University. Previously, he was an assistant professor in the same department during 2014-2020. He received the Ph.D. degree in Computer Science from Nanyang Technological University, Singapore. He received the B.S. degree in Electrical Engineering and the M.E. degree in Communication and Information System both from Beijing Normal University, Beijing, China. He is/was on the editorial board of Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies (ACM IMWUT), ACM Transactions on Sensor Networks (ACM TOSN), Computer Networks, and IEEE Transactions on Wireless Communications (IEEE TWC). He is a Senior Member of IEEE and a Member of ACM. Teaching 2024/2025-Sem 2: COMP1011 - Programming Fundamentals Research Interests Internet of Things, Wireless Networking, Ubiquitous Computing, Embedded AI Recent Publications (full list) IoT and Wireless Networking (LoRa, LPWAN): [SIGCOMM'25] Ziyue Zhang, Xianjin Xia, Ruonan Li, Yuanqing Zheng, “Towards Next-Generation Global IoT: Empowering Massive Connectivity with Harmonious Multi-Network Coexistence”, In ACM SIGCOMM, 2025, (PDF). [IMC'25 (short paper)] Wenchang Chai, Jinhong Liu, Ziyue Zhang, Xianjin Xia, Yuanqing Zheng, Ningning Hou, Qiang Yang, Weiwei Chen, Tao Gu, “Satellite IoT in Practice: A First Measurement Study on Network Availability, Performance, and Costs”, In ACM IMC, 2025, (PDF). [MOBICOM'25] Ruonan Li, Ziyue Zhang, Xianjin Xia, Ningning Hou, Wenchang Chai, Shiming Yu, Yuanqing Zheng, Tao Gu, “From Interference Mitigation to Toleration: Pathway to Practical Spatial Reuse in LPWANs ”, In ACM MobiCom, 2025, (PDF). [MOBISYS'25] Shiming Yu, Ziyue Zhang, Xianjin Xia, Yuanqing Zheng, Jiliang Wang, “Are LoRa Logical Channels Really Orthogonal? Practically Orthogonalizing Massive Logical Channels”, In ACM MobiSys, 2025, (PDF). [SENSYS'25] Ningning Hou, Yifeng Wang, Xianjin Xia, Shiming Yu, Yuanqing Zheng, Tao Gu, “MoLoRa: Intelligent Mobile Antenna System for Enhanced LoRa Reception in Urban Environments”, In ACM SenSys, 2025, (PDF). [CCS'25] Xieyang Sun, Yuanqing Zheng, Wei Xi, Zuhao Chen, Zhizhen Chen, Han Hao, Zhiping Jiang, Sheng Zhong, “TEMPEST-LoRa: Cross-Technology Covert Communication”, In ACM CCS, 2025, (PDF). [SENSYS'24] Shiming Yu, Xianjin Xia, Ziyue Zhang, Ningning Hou, Yuanqing Zheng, “FDLoRa: Tackling Downlink-Uplink Asymmetry with Full-duplex LoRa Gateways”, In ACM SenSys, 2024, (PDF). [MOBICOM'24] Shiming Yu, Xianjin Xia, Ningning Hou, Yuanqing Zheng, and Tao Gu, “Revolutionizing LoRa Gateway with XGate: Scalable Concurrent Transmission across Massive Logical Channels”, In ACM MobiCom, 2024, (PDF), (Bib). [MOBICOM'23] Xianjin Xia, Qianwu Chen, Ningning Hou, Yuanqing Zheng, and Mo Li, “XCopy: Boosting Weak Links for Reliable LoRa Communication”, In ACM MobiCom, 2023, (PDF), (Bib). [INFOCOM'23] Ningning Hou, Xianjin Xia, Yifeng Wang, Yuanqing Zheng, “One Shot for All: Quick and Accurate Data Aggregation for LPWANs”, In IEEE INFOCOM, 2023, (PDF), (Bib). [SENSYS'22] Xianjin Xia, Qianwu Chen, Ningning Hou, Yuanqing Zheng, “HyLink: Towards High Throughput LPWANs with LoRa Compatible Communication”, In ACM SenSys, 2022, (PDF), (Bib), (Best Paper Candidate in ACM SenSys 2022). [INFOCOM'22] Ningning Hou, Xianjin Xia, Yuanqing Zheng, “Don’t Miss Weak Packets: Boosting LoRa Reception with Antenna Diversities”, In IEEE INFOCOM, 2022, (PDF), (Bib). [MOBICOM'21] Xianjin Xia, Ningning Hou, Yuanqing Zheng, and Tao Gu, “PCube: Scaling LoRa Concurrent Transmissions with Reception Diversities”, In ACM MobiCom, 2021, (PDF), (Bib). [INFOCOM'21] Ningning Hou, Xianjin Xia, Yuanqing Zheng, “Jamming of LoRa PHY and Countermeasure”, In IEEE INFOCOM, Virtual Conference, 10-13 May 2021, (PDF), (Bib), (Presentation Video). [ICNP'20] Ningning Hou, Yuanqing Zheng , \"CloakLoRa: A Covert Channel over LoRa PHY\", In IEEE ICNP, Madrid, Spain, Oct 13-16, 2020, (PDF), (Bib), (Presentation Video). [INFOCOM'20] Xianjin Xia, Yuanqing Zheng, Tao Gu, \"LiteNap: Downclocking LoRa Reception\", In IEEE INFOCOM, Beijing, China, April 2020, (PDF), (Bib), (Presentation Video). [SENSYS'19] Xianjin Xia, Yuanqing Zheng, Tao Gu, \"FTrack: Parallel Decoding for LoRa Transmissions\", In ACM SenSys, New York, NY, USA, November 2019, (PDF), (Bib). Ubiquitous Computing and Wireless Sensing (Acoustic and RF Sensing): [Security'25] Weiye Xu, Danli Wen, Jianwei Liu, Zixin Lin, Yuanqing Zheng, Xian Xu, Jinsong Han, “DiskSpy: Exploring a Long-Range Covert-Channel Attack via mmWave Sensing of μm-level HDD Vibrations”, In USENIX Security, 2025, (PDF). [INFOCOM'24] Qiang Yang, Yuanqing Zheng, “Neural Enhanced Underwater SOS Detection”, In IEEE INFOCOM, 2024, (PDF). [INFOCOM'24] Kaiyan Cui, Leming Shen, Yuanqing Zheng, Fu Xiao, Jinsong Han, “Talk2Radar: Talking to mmWave Radars via Smartphone Speaker”, In IEEE INFOCOM, 2024, (PDF). [SENSYS'23] Qiang Yang, Yuanqing Zheng, “AquaHelper: Underwater SOS Transmission and Detection in Swimming Pools”, In ACM SenSys, 2023, (PDF), (Bib). [SENSYS'23] Sijie Ji, Xuanye Zhang, Yuanqing Zheng, Mo Li, “Construct 3D Hand Skeleton with Commercial WiFi”, In ACM SenSys, 2023, (PDF), (Bib). [IPSN'23] Kaiyan Cui, Qiang Yang, Yuanqing Zheng, Jinsong Han, “mmRipple: Communicating with mmWave Radars through Smartphone Vibration”, In ACM IPSN, 2023, (PDF), (Bib). [INFOCOM'23] Qiang Yang, Kaiyan Cui, Yuanqing Zheng, “VoShield: Voice Liveness Detection with Sound Field Dynamics”, In IEEE INFOCOM, 2023, (PDF), (Bib). [MOBICOM'22] Weiye Xu, Wenfan Song, Jianwei Liu, Yajie Liu, Xin Cui, Yuanqing Zheng, Jinsong Han, Xinhuai Wang, Kui Ren, “Mask Does Not Matter: Anti-Spoofing Face Authentication using mmWave without On-site Registration”, In ACM MobiCom, 2022, (PDF), (Bib). [INFOCOM'22] Qiang Yang, Yuanqing Zheng, “DeepEar: Sound Localization with Binaural Microphones”, In IEEE INFOCOM, 2022, (PDF), (Bib). [UBICOMP'21 & IMWUT] Qiang Yang and Yuanqing Zheng, “Model-based Head Orientation Estimation for Smart Devices”, In ACM UbiComp, Virtual Conference, 21-26 September 2021, (PDF), (Bib), (Presentation Video). [INFOCOM'21] Kaiyan Cui, Yanwen Wang, Yuanqing Zheng, Jinsong Han, “ShakeReader: 'Read' UHF RFID using Smartphone”, In IEEE INFOCOM, Virtual Conference, 10-13 May 2021, (PDF), (Bib), (Presentation Video). [INFOCOM'21] Weiye Xu, Jianwei Liu, Shimin Zhang, Yuanqing Zheng, Feng Lin, Jinsong Han, Fu Xiao, Kui Ren, “RFace: Anti-Spoofing Facial Authentication Using COTS RFID”, In IEEE INFOCOM, Virtual Conference, 10-13 May 2021, (PDF), (Bib), (Presentation Video), (Best Paper Candidate in IEEE INFOCOM 2021). [INFOCOM'20] Yanwen Wang, Jiaxing Shen, Yuanqing Zheng, \"Push the Limit of Acoustic Gesture Recognition\", In IEEE INFOCOM, Beijing, China, April 2020, (PDF), (Bib), (Presentation Video), (Best Paper Award in IEEE INFOCOM 2020). [UBICOMP'19 & IMWUT] Yanwen Wang, Yuanqing Zheng, \"Modeling RFID Signal Reflection for Contact-free Activity Recognition\", In ACM UbiComp, London, UK, September 2019, (PDF), (Bib). [UBICOMP'18 & IMWUT] Tianben Wang, Daqing Zhang, Yuanqing Zheng, Tao Gu, Xingshe Zhou, and Bernadette Dorizzi, \"C-FMCW Based Contactless Respiration Detection Using Acoustic Signal\", In ACM UbiComp, Singapore, September 2018, (PDF), (Bib). Embedded AI (LLM for Embedded Systems and Applications): [arXiv preprint] Xinyu Huang, Leming Shen, Zijing Ma, Yuanqing Zheng, “Towards Privacy-Preserving and Personalized Smart Homes via Tailored Small Language Models”, arxiv:2507.08878, (PDF). [MOBICOM'25] Leming Shen, Qiang Yang, Yuanqing Zheng, Mo Li, “AutoIOT: LLM-Driven Automated Natural Language Programming for AIoT Applications”, In ACM MobiCom, 2025, (PDF). [SENSYS'25] Leming Shen, Qiang Yang, Xinyu Huang, Zijing Ma, Yuanqing Zheng, “GPIoT: Tailoring Small Language Models for IoT Program Synthesis”, In ACM SenSys, 2025, (PDF). [MOBISYS'24] Leming Shen, Qiang Yang, Kaiyan Cui, Yuanqing Zheng, Xiao-Yong Wei, Jianwei Liu, Jinsong Han, “FedConv: A Learning-on-Model Paradigm for Heterogeneous Federated Clients”, In ACM MobiSys, 2024, (PDF). Professional Services Journal Editor: Associate Editor: Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies (IMWUT) (2023-) Associate Editor: ACM Transactions on Sensor Networks (TOSN) (2023-) Associate Editor: Computer Networks (2023-) Associate Editor: IEEE Transactions on Wireless Communications (TWC) (2021-2024) Guest Editor: ACM Transactions on Sensor Networks, Special Issue on Low Power Wide Area Networks, 2022 Conference Chair: Demo Co-Chair: The 31st Annual International Conference on Mobile Computing and Networking (ACM MOBICOM'25) Finance Co-Chair: The 23rd ACM International Conference on Mobile Systems, Applications, and Services (ACM MOBISYS'25) TPC Track co-Chair: Wireless Sensing and Mobile Computing Track, IEEE ICPADS 2022 TPC Track co-Chair: Systems and Applications Track, IEEE MASS 2021 Demo and Poster Co-Chair: IEEE International Conference on Distributed Computing Systems (ICDCS’22) Publication Co-Chair: ACM/IEEE Conference on Internet of Things Design and Implementation (IoTDI’22) Publication co-Chair: International Conference on Embedded Wireless Systems and Networks (EWSN'19) Web Chair: The 15th International Conference on Information Processing in Sensor Networks (IPS",
  "content_length": 11103,
  "method": "requests",
  "crawl_time": "2025-12-01 14:53:21"
}