{
  "name": "Yuanyuan Feng",
  "homepage": "http://www.yuanyuanfeng.com",
  "status": "success",
  "content": "Yuanyuan Feng (冯园媛), Ph.D. Yuanyuan FengHuman-computer interation & data privacy researcher Assistant Professor in Computer Science at University of Vermont Follow Burlington, VT, USA Twitter Google Scholar ORCID I’m an Assistant Professor in the Department of Computer Science at the University of Vermont (UVM). Before joining UVM, I was a postdoctoral researcher in the School of Computer Science at Carnegie Mellon University (CMU) and earned my PhD degree from the College of Computing & Informatics at Drexel University.My Research is at the intersection of human-computer interaction (HCI), usable security & privacy, responsible artificial intelligence (AI), and health informatics. I investigate technical, societal, and interdisciplinary research questions towards building an ideal future where computing technologies can leverage people’s personal data in appropriate, ethical, and meaningful ways.Please see the Students page for my PhD recruitment plan.News(November 2025) My doctoral student Tamunotonye Harry’s first-authored journal article describing how we leveraged web analytics to improve cadiovascular clinical trial recruitment is accetped by the high impact factor medical journal – Circulation: Cardiovascular Quality and Outcomes!(September 2025) This qualitative research paper first-authored by our doctoral student Onyinye Dibia, titled “We need a standard”: Toward an expert-informed privacy label for differential privacy, is accepted by the Proceedings on Privacy Enhancing Technologies Symposium (PoPETS). We plan to present this work at PETS 2026!(July 2025) Our Systematization of Knowledge (SoK) paper analyzing the landscape of usability studies in differential privacy is accepted by the Proceedings on Privacy Enhancing Technologies Symposium (PoPETS). The amazing doctoral student and first author Onyinye Dibia presents this work at PETS 2025 in Washington DC on July 15.(August 2024) My first-authored paper, titled “Contextual acceptance of COVID-19 mitigation mobile apps in the United States: Mixed methods survey study on postpandemic data privacy”, has been publihsed in the Journal of Medical Internet Research!(August 2024) I’m super excited to share our NSF SaTC award with my Co-PI Dr. Joe Near – A Novel Mechanism for Effective and Accountable Communication of Differential Privacy through Multi-Stakeholder Research. We hope our research can facilitate the broader adoption of differential privacy!(August 2024) My first-authored paper, titled “Understanding how to inform blind and low-vision users about data privacy through privacy question answering assistants” at the 2024 USENIX Security Symposium provides insights into blind and low-vision users’ expectations when it comes to usability, accessibility, trust and equity issues regarding digital data privacy.(August 2024) Happy to share our paper, titled “Evaluating the usability of differential privacy tools with data practitioners?” at the 2024 USENIX SOUPS! Through a usability study on four Python-based differential privacy (DP) tools, we provide evidence-based recommendations to improve DP tools’ usability to broaden DP adoption.(April 2024) I’m happy to share my CRII award – A Contextual Integrity Approach for Privacy Reasoning Regarding Performance Tracking Technologies in US College Athletics. Many thanks to the National Science Foundation!",
  "content_length": 3369,
  "method": "requests",
  "crawl_time": "2025-12-01 14:53:24"
}