{
  "name": "Yubin Xia",
  "homepage": "https://ipads.se.sjtu.edu.cn/yubin_xia",
  "status": "success",
  "content": "Yubin Xia's Homepage (夏虞斌) [IPADS] yubin_xia Table of Contents Yubin Xia's Homepage (夏虞斌) About Me Professional Services Awards and Honors Publications 2025 2024 2023 2022 2021 2020 2019 2018 2017 2016 2015 2014 2013 2012 Yubin Xia's Homepage (夏虞斌) Professor Institute of Parallel And Distributed Systems (IPADS), School of Software Room 3401, Software Building, 800 Dongchuan Rd., Shanghai, China, 200240 Email: xiayubin at sjtu dot edu dot cn 中文主页 About Me I am a professor in School of Software at Shanghai Jiao Tong University and a member of Institute of Parallel And Distributed Systems (IPADS). My research interests include operating systems, computer architecture. Currently, I'm now focusing on hardware-software co-design for better performance and isolation. Some recent projects by my students and colleagues include the Penglai (蓬莱) RISC-V TEE, the XPC architecture extension for fast IPC, the Catalyzer serverless framework with <1ms startup latency, the ServerlessBench test suit for serverless frameworks, and the DeSearch search engine for web3. In the era of AI, technologies represented by LLM are driving exciting revolutions. During the App era, OSes were designed for human interaction; in the LLM era, OSes will increasingly be operated by large language models (LLMs) rather than by humans. Consequently, both OSes and applications face unprecedented opportunities and challenges. In IPADS, we have proposed the concept of a “Model-Native Operating System” and have already begun new researches, exploring topics including record & replay of AI Agents, memory of AI Agents, new abstractions and interfaces of AI OSes, etc. I am currently looking for self-motivated students with a good background in computer systems. Please email me if you have interests. Professional Services 2026: TPC of ASPLOS, EuroSys 2025: TPC of SOSP, OSDI, EuroSys 2024: TPC of OSDI, EuroSys, ATC 2023: TPC of OSDI, APSys 2023: TPC Co-Chair of ICDCS Track, with Alysson Bessani 2022: TSG member of OpenHarmony on confidential computation 2022: TPC Co-Chair of VEE, with Dan Williams 2022: TPC of EuroSys 2021: TPC of EuroSys, SEED, HPC-China 2020: TPC of EuroSys, VEE, MSST, APSys 2019: TPC of MSST, ChinaSys, NASAC, HPC-China, CRVF 2018: TPC of OSDI, MobiSys, HPC-China 2017: LAC of SOSP; TPC of AsiaCCS, HPC-China 2016: TPC of HPC-China 2014: TPC of ACA, APSys Awards and Honors Best Paper Award of SOSP, 2025. “Jiahe” Outstanding Young Faculty Award of Shanghai Jiao Tong University, 2024. Distinguished Member of CCF, 2023. NASAC Youth Software Innovation Award, by CCF, 2022. A Member of the Privacy-Preserving Computation Tech Innovators China, by MIT Tech Review, 2022. Test of Time Award of DSN, 2022. Excellence in Teaching Award of Shanghai Jiao Tong University, 2021. Best Paper Award of VEE, 2019. Shanghai Academic/Technology Research Leader, 2019. Technological Invention Award of Ministry of Education (the 1st prize, the 4th inventor), 2018. Senior Member of China Computer Federation (CCF), 2018. Excellent Teacher Award of SJTU (the 3rd prize), 2016. Challenge Cup (special-class award, the 1st prize), 2015. Best Paper Nominee Award of HPCA, 2014. Publications 2025 [Arxiv] Cheng Zhang, Erhu Feng, Xi Zhao, Yisheng Zhao, Wangbo Gong, Jiahui Sun, Dong Du, Zhichao Hua, Yubin Xia, Haibo Chen. MobiAgent: A Systematic Framework for Customizable Mobile Agents. Arxiv, 2025. github [Arxiv] Erhu Feng, Wenbo Zhou, Zibin Liu, Le Chen, Yunpeng Dong, Cheng Zhang, Yisheng Zhao, Dong Du, Zhichao Hua, Yubin Xia, Haibo Chen. Get Experience from Practice: LLM Agents with Record & Replay, Arxiv, 2025. [Arxiv] Jingkai He, Tianjian Li, Erhu Feng, Dong Du, Qian Liu, Tao Liu, Yubin Xia, Haibo Chen. History Rhymes: Accelerating LLM Reinforcement Learning with RhymeRL, Arxiv, 2025. [SOSP] Le Chen, Dahu Feng, Erhu Feng, Yingrui Wang, Rong Zhao, Yubin Xia, Pinjie Xu, Haibo Chen, Characterizing Mobile SoC for Accelerating Heterogeneous LLM Inference. SOSP, 2025. [SOSP] (Best Paper Award) Jingkai He, Yunpeng Dong, Dong Du, Mo Zou, Zhitai Yu, Yuxin Ren, Ning Jia, Yubin Xia, Haibo Chen. How to Copy Memory? Coordinated Asynchronous Copy as a First-Class OS Service. SOSP, 2025. [OSDI] Yuanpei Wu, Dong Du, Chao Xu, Yubin Xia, Ming Fu, Yang Yu, Binyu Zang, Haibo Chen. OS Rendering Service Made Parallel with Out-of-Order Execution and In-Order Commit. OSDI, 2025. [OSDI] Xiaohu Chai, Tianyu Zhou, Keyang Hu, Jianfeng Tan, Tiwei Bie, Anqi Shen, Dawei Shen, Qi Xing, Shun Song, Tongkai Yang, Le Gao, Feng Yu, Zhengyu He, Dong Du, Yubin Xia, Kang Chen, Yu Chen. Fork in the Road: Reflections and Optimizations for Cold Start Latency in Production Serverless Systems. OSDI, 2025. [USENIX ATC] Le Chen, Yiyang Wu, Jinyu Gu, Yubin Xia, Haibo Chen. μEFI: A Microkernel-Style UEFI with Isolation and Transparency. USENIX Annual Technical Conference, Boston, MA, USA, July 2025. [ISCA] Dahu Feng, Erhu Feng, Dong Du, Pinjie Xu, Yubin Xia, Haibo Chen, Rong Zhao. Topology-Aware Virtualization over Inter-Core Connected Neural Processing Units. ISCA, 2025. [ASPLOS] Yuanpei Wu, Dong Du, Chao Xu, Yubin Xia, Ming Fu, Binyu Zang, Haibo Chen. D-VSync: Decoupled Rendering and Displaying for Smartphone Graphics. ASPLOS, 2025. [EuroSys] Jiacheng Shi, Yang Yu, Jinyu Gu, Yubin Xia. A Hardware-Software Co-Design for Efficient Secure Containers. EuroSys, 2025. [USENIX Security] Jiacheng Shi, Jinyu Gu, Yubin Xia, Haibo Chen. Serverless Functions Made Confidential and Efficient with Split Containers. USENIX Security, 2025. [ToCS] Shulin Fan, Zhichao Hua, Yubin Xia, Haibo Chen. XpuTEE: A High-Performance and Practical Heterogeneous Trusted Execution Environment for GPUs. ToCS, 2025. 2024 [ISCA] Erhu Feng, Dahu Feng, Dong Du, Yubin Xia, Haibo Chen. sNPU: Trusted Execution Environments on Integrated NPUs. ISCA, 2024. [ASPLOS] Erhu Feng, Dahu Feng, Dong Du, Yubin Xia, Wenbin Zheng, Siqi Zhao, Haibo Chen. sIOPMP: Scalable and Efficient I/O Protection for TEEs. ASPLOS, 2024. [USENIX ATC] Qingyuan Liu, Yanning Yang, Dong Du, Yubin Xia, Ping Zhang, Jia Feng, James Larus, Haibo Chen. Harmonizing Efficiency and Practicability: Optimizing Resource Utilization in Serverless Computing with Jiagu. USENIX Annual Technical Conference, Santa Clara, CA, USA, July 2024. [USENIX ATC] Jiahao Chen, Zeyu Mi, Yubin Xia, Haibing Guan, Haibo Chen. Flexible, Secure and Efﬁcient CVM Maintenance with Conﬁdential Procedure Calls. USENIX Annual Technical Conference, Santa Clara, CA, USA, July 2024. [SoCC] Yanning Yang, Dong Du, Haitao Song, Yubin Xia. On-demand and Parallel Checkpoint/Restore for GPU Applications. SoCC 2024. 2023 [OSDI] Mingyu Li, Xuyang Zhao, Le Chen, Cheng Tan, Huorong Li, Sheng Wang, Zeyu Mi, Yubin Xia, Feifei Li, Haibo Chen. Encrypted Databases Made Secure Yet Maintainable. OSDI, 2023. [ISCA] Shulin Fan, Zhichao Hua, Yubin Xia, Haibo Chen, Binyu Zang. ISA-grid: Architecture of Fine-grained Privilege Control for Instructions and Registers. ISCA, Orlando, FL, US. 2023. [MICRO] Dong Du, Bicheng Yang, Yubin Xia, Haibo Chen. Accelerating Extra Dimensional Page Walks for Confidential Computing. The 56th IEEE/ACM International Symposium on Microarchitecture (MICRO), Toronto, Canada. 2023. [HPCA] Erhu Feng, Dong Du, Yubin Xia, Haibo Chen. Efﬁcient Distributed Secure Memory with Migratable Merkle Tree. The 29th IEEE International Symposium on High-Performance Computer Architecture (HPCA-29), Montreal, QC, Canada. 2023. [paper] 2022 [ASPLOS] Dong Du, Qingyuan Liu, Xueqiang Jiang, Yubin Xia, Binyu Zang, Haibo Chen. Serverless Computing on Heterogeneous Computers. The 27th International Conference on Architectural Support for Programming Languages and Operating Systems (ASPLOS'22). [paper] [USENIX ATC] Jinyu Gu, Hao Li, Wentai Li, Yubin Xia, Haibo Chen. EPK: Scalable and Efficient Memory Protection Key. USENIX ATC, 2022. [paper] [USENIX Security] Jinyu Gu, Bojun Zhu, Mingyu Li, Wentai Li, Yubin Xia, and Haibo Chen. A Hardware-Software Co-design for Efficient Intra-Enclave Isolation. The 31st USENIX Security Symposium, Boston, MA, USA, 2022. [paper] [ToCS] Yubin Xia, Dong Du, Zhichao Hua, Binyu Zang, Haibo Chen, Haibing Guan. Boosting Inter-Process Communication with Architectural Support. ACM Transactions on Computer Systems.2022. [paper] 2021 [SOSP] Dingji Li, Zeyu Mi, Yubin Xia, Binyu Zang, Haibo Chen, Haibing Guan. TwinVisor: Hardware-isolated Confidential Virtual Machines for ARM. Proceedings of the 28th ACM Symposium on Operating Systems Principles (SOSP'21). October 2021. [paper] [OSDI] Erhu Feng, Xu Lu, Dong Du, Bicheng Yang, Xueqiang Jiang, Yubin Xia, Binyu Zang, Haibo Chen. Scalable Memory Protection in the PENGLAI Enclave. The 15th USENIX Symposium on Operating Systems Design and Implementation, 2021. [paper] [OSDI] Mingyu Li, Tianxu Zhang, Jinhao Zhu, Cheng Tan, Yubin Xia, Sebastian Angel, Haibo Chen. Bringing Decentralized Search to Decentralized Services. 15th USENIX Symposium on Operating Systems Design and Implementation, 2021. [paper] [ISCA] Mingyu Li, Yubin Xia, Haibo Chen. PIE: Confidential Serverless Made Efficient with Plug-In Enclaves. The IEEE/ACM International Symposium on Computer Architecture. 2021. [paper] [IEEE TC] Yubin Xia, Zhichao Hua, Yang Yu, Jinyu Gu, Haibo Chen, Binyu Zang, Haibing Guan. Colony: A Privileged Trusted Execution Environment with Extensibility. IEEE Transactions on Computers, Accepted, 2021. [paper] [IEEE TC] Jinyu Gu, Xinyue Wu, Bojun Zhu, Yubin Xia, Binyu Zang, Haibing Guan, and Haibo Chen. Enclavisor: A Hardware-software Co-design for Enclaves on Untrusted Cloud. IEEE Transactions on Computers, Accepted, 2021. [paper] [JCST] Jinyu Gu, Hao Li, Yubin Xia, Haibo Chen, Chenggang Qin, Zhengyu He. Unified Enclave Abstraction and Secure Enclave Migration on Heterogeneous Security Architectures. JCST, 2021. [paper] [SCIS] Zhichao Hua, Yang Yu, Jinyu Gu, Yubin Xia, Haibo Chen, Binyu Zang. TZ-Container: Protecting Container from Untrusted OS with ARM TrustZone. SCIENCE CHINA Information Sciences, 2021. [",
  "content_length": 15577,
  "method": "requests",
  "crawl_time": "2025-12-01 14:53:25"
}