{
  "name": "Yuchen Liu 0001",
  "homepage": "https://yuchen-sh.github.io",
  "status": "success",
  "content": "Homepage @ NC State | Yuchen Liu’s Homepage Homepage @ NC State YUCHEN LIU Ph.D., Assistant Professor Department of Computer Science Department of Electrical & Computer Engineering (courtesy) Affiliate in AI & Machine Learning at N.C. PSI College of Engineering North Carolina State University Office: Room 2407, EB III Email: yuchen.liu AT ncsu.edu Phone: +1 919-515-3412 Official Website Biography I received my Ph.D. degree at the Georgia Institute of Technology, worked with Dr. Douglas M. Blough in the Critical Networking Lab. I am currently a tenure-track Assistant Professor in the Department of Computer Science and Department of Electrical and Computer Engineering at North Carolina State University (NCSU). My research focuses on advancing user-centric applications through ubiquitous networking and intelligence, encompassing networks, machine learning, computing, and communications: networking and systems (wireless networks, digital twins, Open RAN, and cybersecurity) machine learning for data, networks, security and privacy (generative AI, LLM, distributed/reinforcement learning, multi-modal data) mobile computing (UAVs, autonomous sensing, networked agentic systems) new communication paradigms (mmWave, THz, nextG Wi-Fi) optimization and reasoning (resilience theory, foundation models and applied systems) software development and simulation (differentiable and portable simulators, open-source testbeds) These research works have been recognized by NSF CAREER Award (2025), NVIDIA Academic Awards (2025), National AI Research Resource Pilot Award (2025), NCSU Carla Savage Award (2025), IEEE IPCCC Best Paper Award Runner-up (2024), IFIP Networking Best Paper Award Runner-up (2024), IEEE ICCCN Best Paper Award (2023), ACM MobiWac Best Paper Award (2022), IEEE LANMAN Best Paper Award (2022), IEEE LCN Best Paper Award Second Place (2020), and ACM MSWiM Best Paper Award Finalist (2019). Our ongoing research and educational efforts are also supported by NSF CNS (#2312138), NSF SaTC (#2350075), and NSF NAIRR Supplement (#2506757) grants. Recent News more [11.2025] Glad to attend and present our network digital twins work in The International Conference for High Performance Computing, Networking, Storage, and Analysis (SC 25)! [10.2025]💵 Glad to receive an Educational and Technology Fund from NC State to support our multi-level mmWave sensing project! [10.2025] Congrats on the acceptance of our paper on integration of Cooperative Reinforcement Learning and Multi-Scale Digital Twinning at IEEE Transactions on Mobile Computing (TMC)! [09.2025] Our paper on Integrated Sensing and Multi-modal Communications was accepted by IEEE Journal on Selected Areas in Communications (JSAC)! Congrats to Xuanhao and all! [09.2025] Glad to give a talk at DOE Oak Ridge National Laboratory about Digital Twins and Agentic Networking. See you at AIRES 6 ORNL Events here! [09.2025] Congrats on the acceptance of our paper on Transferring, Merging, and Splitting Task-Oriented Network Digital Twins at ACM 22nd International Symposium on Mobility Management and Wireless Access! [08.2025] Congrats on the acceptance of our paper for human-free network anomaly analysis at IEEE IPCCC! [08.2025] Congrats on the acceptance of our two papers for neurosymbolic AI and semantic communication at IEEE GLOBECOM! [07.2025] Glad to join the Organizing Committee for IEEE INFOCOM 2026 to serve as the Publicity Chair. Please consider submitting your paper here! [07.2025] Invited talk at NSF webinars on National Artificial Intelligence Research Resource, focusing on advanced AI research and multi-modal data generation. [06.2025]💵 Honored to receive the NSF CAREER Award for fundamental research on resilience-native and reconfigurable wireless networks, thanks NSF! [06.2025] Congrats on the acceptance of our paper for resilient and self-adaptive 3D networks at Transactions on Internet Technology (TOIT)! [05.2025] Invited to serve on the panel at ACW 2025 on Advancing Wireless Research over AERPAW. [05.2025] Congrats on the acceptance of our paper for generative AI models in communication systems at IEEE Communications Magazine! [05.2025]🔈Call for Paper: We are organizing the 2nd Workshop in IEEE GLOBECOM on Digital Twins over NextG IoT and Networking (link). Please submit your paper if you are working on relevant topics! [04.2025] Congrats on the acceptance of our paper for synergizing AI and digital twins at IEEE Wireless Communications! [03.2025]💵 We got the TELS Fund from NCSU to support our project on Transforming Learning Through AI, Hands-On Computational Creativity, and Digital Art! [03.2025]💵 Thrilled to receive the NVIDIA Academic Grant Program Award -- for our research on Multi-Level Network Modeling and Scientific Simulation with LLMs! [03.2025]🏆 Honored to named the Carla Savage Award at NC State -- thanks to my colleagues and students for their support! [03.2025] Invited to serve on two NSF panels. [02.2025] Congrats on the acceptance of our paper for universal packets compression in multi-modal communications at IEEE International Symposium on a World of Wireless, Mobile and Multimedia Networks (WoWMoM)! [02.2025]💵 Received NAIRR Pilot Demonstration Project grant and resources to advance multi-dimensional data generation and continuous modeling in AI-based CPS, thanks NSF! [01.2025] Congrats on the acceptance of our two papers for diffusion models in generative wireless and edge networks at IEEE Transactions on Cognitive Communications and Networking (TCCN)! [01.2025]💵 Congratulations to Everett Tucker for receiving the Research Experiences for Undergraduates (REU) Award to support digital twin and RL research in our group. [01.2025] Congrats on the acceptance of our three papers for wireless positioning and secure federated learning at IEEE International Conference on Communications (ICC)! [12.2024] Congrats on the acceptance of our paper for Passive Inter-Satellite Localization at IEEE Transactions on Wireless Communications (TWC)! [12.2024] Invited to give a talk about mapping data networks into digital reality at ORNL's Advanced Technologies Section (ATS) Seminar Series in DOE Oak Ridge National Laboratory. [11.2024]🏆 Our paper, titled \"Revolutionizing Wireless Modeling and Simulation with Network-Oriented LLMs\", received the Best Paper Award Runner-up at 43rd IEEE IPCCC! [11.2024]🔈Call for Paper: We are organizing the Workshop in IEEE INFOCOM on Digital Twins over NextG Wireless Networks (link). Please submit your paper here if you are working on relevant topics! [11.2024] Our journal paper on Contextual Beam Management for mmWave Wireless Networks was accepted at IEEE Journal on Selected Areas in Communications (JSAC)! Congrats Zhizhen! [10.2024]💵 We got an Educational and Technology Fund from NCSU to support our wireless sensing project! [09.2024] Congrats on the acceptance of our paper for Open RAN with air mobility at the Elsevier Computer Communications! [09.2024] Congrats on the acceptance of our paper for LLM in network instrution detection at the IEEE CCNC! [09.2024] Will attend the Oak Ridge National Laboratory’s Core Universities AI Workshop and post our recent LLM & DT works! [08.2024] Congrats on the acceptance of our paper for an interactive, automated, and script-free simulation paradigm using LLMs at the IEEE IPCCC! [08.2024] Congrats on the acceptance of our three papers focusing on Localization against Jamming Attacks, DT Synchronization, and Clustered Federated Learning at the IEEE Global Communications Conference (GLOBECOM)! [07.2024]🔈Media coverage on \"How a ‘Digital Twin’ Can Make Wireless Networks Faster, More Reliable\". [07.2024] Our paper on fast and robust 3D object reconstruction is accepted to ACM MM 2024. [07.2024]💵 Our project on \"Towards Secure and Privacy-enhancing Digital World Experiences\" is funded by the NSF SaTC Core program, thanks NSF! [06.2024]🏆 Our paper, titled \"Poisoning Attacks on Federated Learning-based Wireless Traffic Prediction\", received the Best Paper Award Runner-up at IEEE/IFIP Networking! [05.2024] Our journal paper on mmWave Radio with Mobility Awareness was accepted at IEEE Transactions on Mobile Computing (TMC)! Congrats Zhizhen! [05.2024] Our journal paper on Digital Network Twins for Edge Caching Optimization was accepted at IEEE Journal on Selected Areas in Communications (JSAC)! Congrats Zifan! [05.2024]🔈Excited to announce our upcoming Summer Residential Camp: Seeing through a Digital World, happening this summer. Join us for an opportunity to delve into the intricacies of complex network systems within the digital realm! [05.2024] Congrats on the acceptance of recent demo paper on Virtualizing Data Poisoning Behaviors in Federated Learning in IEEE International Conference on Distributed Computing Systems (ICDCS) 2024! [04.2024] Congrats on the acceptance of recent paper on AERPAW Digital Twin and Testbed for Signal Source Localization in the SLICES Workshop of IFIP/IEEE Networking 2024! [04.2024]🔈Glad to serve as Associate Editor of IEEE Transactions on Machine Learning in Communications and Networking, and please feel free to submit your work here. [04.2024]🔈Congratulations to my Ph.D. student, Zifan Zhang, for receiving the NCSU Graduate Merit Award (GMA)! [02.2024]🔈Glad to serve as an Area Editor for Elsevier Computer Networks journal, and please feel free to submit your work here. [01.2024] Congrats on the acceptance of two recent papers on Beam Management and Material-inspired Networking in IEEE International Conference on Communications (ICC)! See you in Denver! [12.2023] Congrats on the acceptance of two recent papers on Digital Network Twins in IEEE Journal of Selected Topics in Signal Processing (JSTSP) and IEEE International Conference on Acoustics, Speech and Signal Processing (ICASSP)! [09.2023]💵 Our project on \"Digital Network Twins\" (serve as lead PI) is funded by the NSF CNS Core program, thanks NSF! [08.2023] Congrats on the acceptance of our journal paper on Graph Neural",
  "content_length": 10851,
  "method": "requests",
  "crawl_time": "2025-12-01 14:53:27"
}