{
  "name": "Yuchong Hu",
  "homepage": "http://yuchonghu.com",
  "status": "success",
  "content": "Home Research Publications People Miscellaneous Yuchong Hu (胡燏翀) Professor, Doctoral advisor, School of Computer Science and Technology, Huazhong University of Science and Technology (HUST) 华中科技大学 Address: B512, Wuhan National Laboratory for Optoelectronics School of Computer Science and Technology Huazhong University of Science and Technology Wuhan, China, 430074 Email: yuchonghu [at] hust.edu.cn twitters Yuchong Hu received the B.Eng. degree in Computer Science and Technology from Special Class for the Gifted Young (SCGY), the University of Science and Technology of China (USTC) in 2005, and the Ph.D. degree in Computer Software and Theory from the University of Science and Technology of China (USTC) in 2010. He was a postdoctoral researcher at the Institute of Network Coding (INC) at the Chinese University of Hong Kong (CUHK) in 2010-2012, and was a postdoctoral researcher at the Department of Computer Science and Engineering at the Chinese University of Hong Kong (CUHK) in 2013-2015. He is now a professor of the School of Computer Science and Technology at the Huazhong University of Science and Technology (HUST). His research mainly focuses on designing and implementing storage and computing systems in data centers (for cloud, big data, AI and HPC) with high data reliability, high performance and ultra-low cost, mainly based on coding and compression/deduplication theory and techniques. He published about 90 papers, in which more than 30 papers as the first/corresponding author are accepted in conferences FAST (four times), SC, SoCC, ICDCS, IPDPS, INFOCOM, ICPP, ICCD, Cluster and jounrals TOS, JSAC, TON, TIT, TIFS, TPDS. News: 2025 Nov.2025HPCA accepted: Congrats to Lin Wang! Oct.2025ICDE accepted: Congrats to Zhangqiang Ming! Jul.2025ICPP accepted: Congrats to Guanglei Xu! Jun.2025CLUSTER accepted: Congrats to Lin Wang! Jun.2025SC accepted: Congrats to Chenxuan Yao (Undergraduate) and Feifan Liu! May.2025Euro-Par accepted: Congrats to Xinjue Zheng! Apr.2025HPDC accepted: Congrats to Zhangqiang Ming! 2024 Dec.2024FAST accepted: Congrats to Chuang Gan! Nov.2024DATE accepted: Congrats to Renzhi Xiao! Aug.2024ICCD accepted: Congrats to Renzhi Xiao! Jun.2024SC accepted: Congrats to Hai Zhou! May.2024Euro-Par accepted: Congrats to Lin Wang! Mar.2024HPDC accepted: Congrats to Zhangqiang Ming! Mar.2024MSST accepted: Congrats to Baijian Ma! 2023 Aug.2023three ICCD accepted: Congrats to Chuang Gan, Renzhi Xiao and Hai Zhou! Jul.2023CLUSTER accepted: Congrats to Yuzuo Zhang! Apr.2023TPC member at ACM SIGOPS ChinaSys 2023. 2022 Dec.2022IPDPS accepted: Congrats to Qi Yu! Nov.2022FAST accepted (corresponding author). Oct.2022National Youth Talent Plan (国家青年人才计划). Jun.2022NSFC General Programs (PI). May.2022ICPP accepted: Congrats to Lin Wang! Apr.2022Top Ten Excellent Young Teachers of HUST in 2022. Apr.2022TC accepted: Congrats to Hai Zhou! Jan.2022TPDS accepted: Congrats to Hai Zhou! 2021 Dec.2021ICDCS accepted: Congrats to Qiaori Yao! Dec.2021National Key Research and Development Program of China for Young Scholars (PI) Nov.2021Huawei ICT Competition TECH4ALL Special Award (4/50): Congrats to Xin Zhao, Pengyu Gong, Leyan Zhao! （News） Oct.2021Key Research and Development Program of Hubei Province (PI) Aug.2021National scholarship for graduate students awarded: Congrats to Liangfeng Cheng and Qiaori Yao! Aug.2021TON accepted (First author). May.2021SC accepted: Congrats to Liangfeng Cheng! Apr.2021two ICPP accepted: Congrats to Liangfeng Cheng and Hai Zhou! Mar.2021BIGO/Sangfor scholarship: Congrats to Liangfeng Cheng and Qiaori Yao! 2020 Dec.2020ICDCS accepted: Congrats to Qiaori Yao! Nov.2020FAST accepted (First & corresponding author). Jul.2020TOS accepted: Congrats to Xiaolu Li! May.2020Journal of Systems Architecture accepted: Congrats to Liuqing Ye! 2019 Oct.2019TOS accepted: Congrats to Liuqing Ye! Sep.2019National scholarship for graduate students awarded: Congrats to Liangfeng Cheng! Sep.2019ICCD accepted: Congrats to Chunxue Zuo! Aug.2019SoCC accepted: Congrats to Liangfeng Cheng! June2019TON accepted (corresponding author). April2019SRDS accepted: Congrats to Liuqing Ye! 2018 Jan.2018ICPP accepted: Congrats to Mengting Lu! Jan.2018NSFC General Programs (PI) Oct.2018Hubei Provincial Science and Technology Progress Award, The First Prize. Aug.2018National scholarship for graduate students awarded: Congrats to Xiaoyang Zhang and Liangfeng Cheng! Jul.2018ICCD accepted: Congrats to Chunxue Zuo! Apr.2018Chair of \"Tech. & App. Forum of Next-generation Memorizer\" at \"Global Storage Semicon & Flash Memory Technology Summit\". Jan.2018Aliyun-CCF TCIST Excellent Paper Award: Congrats to Xiaoyang Zhang! 2017 Nov.2017Outstanding Undergraduate Thesis Award, Hubei Provincial Education Department: Congrats to Liangfeng Cheng! Oct.2017INFOCOM accepted: Congrats to Xiaoyang Zhang! Sep.2017National scholarship for graduate students awarded: Congrats to Wenxiang Chen! Aug.2017ISPA accepted: Congrats to Wenxiang Chen! Jun.2017TOS accepted (first author). May.2017TIFS accepted (corresponding author). Apr.2017SRDS accepted: Congrats to LiuQing Ye! Jan.2017TIT accepted (first author). Jan.2017TPDS accepted (corresponding author). Jan.2017JSAC accepted (corresponding author).",
  "content_length": 5251,
  "method": "requests",
  "crawl_time": "2025-12-01 14:53:26"
}