{
  "name": "Yuchou Chang",
  "homepage": "https://www.umassd.edu/directory/ychang1",
  "status": "success",
  "content": "Yuchou Chang, PhD | UMass Dartmouth Skip to main content Toggle share controls Share on Facebook Share this on X Share on LinkedIn Print this page Email this page Copy URL Link copied to clipboard! University of Massachusetts Dartmouth faculty Yuchou Chang, PhD Associate ProfessorComputer & Information Science Dr. Yuchou Chang’s Research Website Contact 508-999-8475 xbg`mf0?tl`rrc-dct Dion 317B Education2012University of Wisconsin-MilwaukeePhD2006Shanghai Jiao Tong UniversityME2003Northwestern Polytechnical UniversityBE TeachingProgramsProgramsComputer Science BS, BS/MSComputer Science Cybersecurity Computer Science MSData Science BS, BS/MSData Science Graduate CertificateData Science MSEngineering and Applied Science PhD Teaching Courses CIS 412: Artificial Intelligence Artificial intelligence problem-solving paradigms. The course covers heuristic versus algorithmic methods, rational and heuristic approaches, and description of cognitive processes; and objectives of work in artificial intelligence, the mid-brain problem and nature of intelligence, simulation of cognitive behavior, and self-organizing systems. Examples are given of representative applications. CIS 530: Advanced Data Mining Coverage of advanced topics of data mining and its applications. The course will review related mathematics and then focus on data mining core algorithms and advanced modeling including regression, dimensionality reduction, support vector machines, clustering, graph theory, and frequent pattern mining. The course will also explore several real-world problems and discuss strategies for large-scale data. Requires pre-knowledge from an undergraduate course on algorithms and data structures. CIS 561: Artificial Intelligence Expert system architectures: forward-production, logic programming, deductive retrieval, and semantic network systems. The course also treats natural language systems, illustrative working systems, and AI programming. CIS 561: Artificial Intelligence Expert system architectures: forward-production, logic programming, deductive retrieval, and semantic network systems. The course also treats natural language systems, illustrative working systems, and AI programming. CIS 569: Visual Analytics Theories and models in visual analytics. Visual analytics covers cognitive theories, advanced computational models and usable visual interface for sensemaking of data. This course is intended for graduate students interested in using visualizations for data analytics in their own work, or students interested in building visual analytics tools. CIS 600: Master's Project Prerequisites: Completion of three core courses.   Development of a detailed, significant project in computer science under the close supervision of a faculty member, perhaps as one member of a student team. This project may be a software implementation, a design effort, or a theoretical or practical written analysis. Project report with optional oral presentation must be evaluated by three faculty members including the project supervisor. CIS 600: Master's Project Prerequisites: Completion of three core courses.   Development of a detailed, significant project in computer science under the close supervision of a faculty member, perhaps as one member of a student team. This project may be a software implementation, a design effort, or a theoretical or practical written analysis. Project report with optional oral presentation must be evaluated by three faculty members including the project supervisor. CIS 600: Master's Project Prerequisites: Completion of three core courses.   Development of a detailed, significant project in computer science under the close supervision of a faculty member, perhaps as one member of a student team. This project may be a software implementation, a design effort, or a theoretical or practical written analysis. Project report with optional oral presentation must be evaluated by three faculty members including the project supervisor. CIS 600: Master's Project Prerequisites: Completion of three core courses.   Development of a detailed, significant project in computer science under the close supervision of a faculty member, perhaps as one member of a student team. This project may be a software implementation, a design effort, or a theoretical or practical written analysis. Project report with optional oral presentation must be evaluated by three faculty members including the project supervisor. CIS 600: Master's Project Prerequisites: Completion of three core courses.   Development of a detailed, significant project in computer science under the close supervision of a faculty member, perhaps as one member of a student team. This project may be a software implementation, a design effort, or a theoretical or practical written analysis. Project report with optional oral presentation must be evaluated by three faculty members including the project supervisor. Teaching Online and Continuing Education Courses CIS 530: Advanced Data Mining Coverage of advanced topics of data mining and its applications. The course will review related mathematics and then focus on data mining core algorithms and advanced modeling including regression, dimensionality reduction, support vector machines, clustering, graph theory, and frequent pattern mining. The course will also explore several real-world problems and discuss strategies for large-scale data. Requires pre-knowledge from an undergraduate course on algorithms and data structures. CIS 561: Artificial Intelligence Expert system architectures: forward-production, logic programming, deductive retrieval, and semantic network systems. The course also treats natural language systems, illustrative working systems, and AI programming. Register for this course. ResearchResearch awards $ 20,000 awarded by Office of Naval Research for Tiny ML-UUVs: Tiny Machine Learning for Low-Power Unmanned Undersea Vehicles ResearchResearch interestsArtificial Intelligence / Machine Learning / Pattern RecognitionBiomedical ImagingIntelligent RoboticsBrain-Computer InterfaceStatistical Signal Processing Latest from Yuchou Mentioned inJan 23, 2025 Sharan Anil Kumar, MS ’22: Turning risk into reward at UMass Dartmouth Contact 508-999-8475 xbg`mf0?tl`rrc-dct Dion 317B Search staff directory Profile edit +t4 Back to top of screen CLOSE MAIN MENU Check My Status myUMassD Support UMassD Directory Search",
  "content_length": 6406,
  "method": "requests",
  "crawl_time": "2025-12-01 14:53:27"
}