{
  "name": "Yudong Chen 0001",
  "homepage": "https://pages.cs.wisc.edu/~yudongchen",
  "status": "success",
  "content": "Yudong Chen Search Yudong Chen Associate Professor Department of Computer Sciences, University of Wisconsin-Madison I am an Associate Professor in the Department of Computer Sciences at the University of Wisconsin-Madison. My research interests include machine learning, reinforcement learning, optimization, and high-dimensional statistics. Some of the topics that I am recently interested in are: reinforcement learning theory, non-convex and nonsmooth learning problems, stochastic optimization and approximation. My research has been recognized by an NSF CAREER Award, the Vilas Associates Award, and paper awards from ACM SIGMETRICS, INFORMS, and the Applied Probability Society. Previously I was an associate professor with tenure in the School of Operations Research and Information Engineering (ORIE) at Cornell University. Before that I was a postdoc in the EECS Department at the University of California, Berkeley. I obtained my Ph.D. in Electrical and Computer Engineering from the University of Texas at Austin. I received my B.S. and M.S. in Automation from Tsinghua University. News Our paper on LoRA-One is accepted to ICML 2025 for Oral presentation. Congratulation to Yuanhe! Matthew Zurek receives a Cisco Systems Distinguished Graduate Fellowship (4/25/2025)! I am selected for the Vilas Associates award. Our paper on average-reward MDP is the winner for the 2024 INFORMS Applied Probability Society Best Student Paper Prize. It is also accepted to NeurIPS 2024 for Oral presentation. Congratulation to my student Matthew Zurek! Our work on RL with low-rank structure received the Best Student Paper Award from ACM SIGMETRICS 2023. Congratulation to my student Tyler Sam! Publications Also see my Google Scholar page 2025 Faster Fixed-Point Methods for Multichain MDPs Matthew Zurek, Yudong Chen Neural Information Processing Systems (NeurIPS), Poster, 2025. [arxiv] Optimal Single-Policy Sample Complexity and Transient Coverage for Average-Reward Offline RL Matthew Zurek, Guy Zamir, Yudong Chen Neural Information Processing Systems (NeurIPS), Poster, 2025. [arxiv] The Shape of Generalization through the Lens of Norm-based Capacity Control Yichen Wang, Yudong Chen, Lorenzo Rosasco, Fanghui Liu Neural Information Processing Systems (NeurIPS), Poster, 2025. [arxiv] Unichain and Aperiodicity are Sufficient for Asymptotic Optimality of Average-Reward Restless Bandits Yige Hong, Qiaomin Xie, Yudong Chen, and Weina Wang Mathematics of Operations Research, 2025. [arxiv] Span-Agnostic Optimal Sample Complexity and Oracle Inequalities for Average-Reward RL Matthew Zurek, Yudong Chen Conference on Learning Theory (COLT), 2025. [arxiv] LoRA-One: One-Step Full Gradient Could Suffice for Fine-Tuning Large Language Models, Provably and Efficiently Yuanhe Zhang, Fanghui Liu, Yudong Chen International Conference on Machine Learning (ICML), Oral, 2025. [arxiv] [icml link] Stable Offline Value Function Learning with Bisimulation-based Representations Brahma S. Pavse, Yudong Chen, Qiaomin Xie, Josiah P. Hanna International Conference on Machine Learning (ICML), Poster, 2025. [arxiv] [icml link] Functional Homotopy: Smoothing Discrete Optimization via Continuous Parameters for LLM Jailbreak Attacks Zi Wang, Divyam Anshumaan, Ashish Hooda, Yudong Chen, Somesh Jha International Conference on Learning Representations (ICLR), 2025. [arxiv] Two-Timescale Linear Stochastic Approximation: Constant Stepsizes Go a Long Way Jeongyeol Kwon, Luke Dotson, Yudong Chen, Qiaomin Xie International Conference on Artificial Intelligence and Statistics (AISTATS), 2025. [arxiv] Cost-Effective Dynamic Sampling in High Dimensional Online Monitoring with Advantage Actor-Critic Haoqian Li, Yudong Chen, Kaibo Liu International Journal of Production Research, 2025. [paper link] A Piecewise Lyapunov Analysis of Sub-quadratic SGD: Applications to Robust and Quantile Regression Yixuan Zhang, Dongyan (Lucy) Huo, Yudong Chen, Qiaomin Xie ACM SIGMETRICS 2025. [arxiv] Entry-Specific Matrix Estimation under Arbitrary Sampling Patterns through the Lens of Network Flows Yudong Chen, Xumei Xi, Christina Lee Yu Innovations in Theoretical Computer Science (ITCS), 2025. [arxiv] [extended abstract] The Plug-in Approach for Average-Reward and Discounted MDPs: Optimal Sample Complexity Analysis Matthew Zurek, Yudong Chen International Conference on Algorithmic Learning Theory (ALT), 2025. [arxiv] 2024 Span-Based Optimal Sample Complexity for Weakly Communicating and General Average Reward MDPs Matthew Zurek, Yudong Chen Neural Information Processing Systems Conference (NeurIPS), Oral, 2024. [arxiv] Winner, INFORMS Applied Probability Society Best Student Paper Prize. (This paper supersedes our earlier preprint that only considers weakly communicating MDPs.) The Collusion of Memory and Nonlinearity in Stochastic Approximation Dongyan (Lucy) Huo, Yixuan Zhang, Yudong Chen, Qiaomin Xie Neural Information Processing Systems Conference (NeurIPS), Spotlight, 2024. [arxiv] [code] The Limits of Transfer Reinforcement Learning with Latent Low-rank Structure Tyler Sam, Yudong Chen, Christina Lee Yu Neural Information Processing Systems Conference (NeurIPS), Poster, 2024. [arxiv] Achieving Exponential Asymptotic Optimality in Average-Reward Restless Bandits without Global Attractor Assumption Yige Hong, Qiaomin Xie, Yudong Chen, and Weina Wang Preprint 2024. [arxiv] Inception: Efficiently Computable Misinformation Attacks on Markov Games Jeremy McMahan, Young Wu, Yudong Chen, Xiaojin Zhu, Qiaomin Xie Reinforcement Learning Conference (RLC), 2024. [rlc link] [arxiv] (Earlier version with preliminary results in [here].) Learning to Stabilize Online Reinforcement Learning in Unbounded State Spaces Brahma S. Pavse, Matthew Zurek, Yudong Chen, Qiaomin Xie, Josiah P. Hanna International Conference on Machine Learning (ICML), 2024. [arxiv] [icml link] [code] Minimally Modifying a Markov Game to Achieve Any Nash Equilibrium and Value Young Wu, Jeremy McMahan, Yiding Chen, Yudong Chen, Xiaojin Zhu, Qiaomin Xie International Conference on Machine Learning (ICML), 2024. [arxiv] [icml link] [code] Gap-Free Clustering: Sensitivity and Robustness of SDP Matthew Zurek, Yudong Chen Conference on Learning Theory (COLT), 2024. [arxiv] [colt link] Prelimit Coupling and Steady-State Convergence of Constant-stepsize Nonsmooth Contractive SA Yixuan Zhang, Dongyan (Lucy) Huo, Yudong Chen, Qiaomin Xie ACM SIGMETRICS 2024. [arxiv] [acm link] On the Scalability and Memory Efficiency of Semidefinite Programs for Lipschitz Constant Estimation of Neural Networks Zi Wang, Bin Hu, Aaron J. Havens, Alexandre Araujo, Yang Zheng, Yudong Chen, and Somesh Jha International Conference on Learning Representations (ICLR), 2024. [pdf] [code] Global Optimality of the EM Algorithm for Mixtures of Two Linear Regression Jeongyeol Kwon, Wei Qian, Constantine Caramanis, Yudong Chen, Damek Davis, Nhat Ho IEEE Transactions on Information Theory, vol. 70, no. 9, pp. 6519-6546, 2024. [ieee link] (Earlier version with parrtial results available on [arxiv]) Local Minima Structures of Gaussian Mixture Models Yudong Chen, Dogyoon Song, Xumei Xi, and Yuqian Zhang IEEE Transactions on Information Theory, vol. 70, no. 6, pp. 4218-4257, 2024. [arxiv] [ieee link] Effectiveness of Constant Stepsize in Markovian LSA and Statistical Inference Dongyan (Lucy) Huo, Yudong Chen, and Qiaomin Xie AAAI Conference on Artificial Intelligence (AAAI), 2024. [arxiv] Stochastic Methods in Variational Inequalities: Ergodicity, Bias and Refinements Emmanouil-Vasileios Vlatakis-Gkaragkounis, Angeliki Giannou, Yudong Chen, Qiaomin Xie International Conference on Artificial Intelligence and Statistics (AISTATS), Oral, 2024. [aistats link]. (Preliminary version on [arxiv].) 2023 Restless Bandits with Average Reward: Breaking the Uniform Global Attractor Assumption Yige Hong, Qiaomin Xie, Yudong Chen, and Weina Wang Neural Information Processing Systems Conference (NeurIPS), Spotlight, 2023. [arxiv] [neurips link] [code] Matrix Estimation for Offline Reinforcement Learning with Low-Rank Structure Xumei Xi, Christina Lee Yu, and Yudong Chen Preprint, 2023. [arxiv] Partial preliminary results appears in the 3rd NeurIPS Offline RL Workshop, 2022. Bias and Extrapolation in Markovian Linear Stochastic Approximation with Constant Stepsizes Dongyan (Lucy) Huo, Yudong Chen, and Qiaomin Xie ACM SIGMETRICS, 2023. [arxiv] [acm link] Overcoming the Long Horizon Barrier for Sample-Efficient Reinforcement Learning with Latent Low-Rank Structure Tyler Sam, Yudong Chen, and Christina Lee Yu ACM SIGMETRICS, 2023. [arxiv] [acm link] Best Student Paper, ACM SIGMETRICS 2023. Algorithmic Regularization in Model-free Overparametrized Asymmetric Matrix Factorization Liwei Jiang, Yudong Chen, and Lijun Ding SIAM Journal on Mathematics of Data Science (SIMODS), vol. 5, no. 3, pp. 723-744, 2023. [arxiv] [siam link] Entry-Specific Bounds for Low-Rank Matrix Completion Under Highly Non-Uniform Sampling Xumei Xi, Christina Lee Yu, and Yudong Chen IEEE International Symposium on Information Theory (ISIT), 2023. [arxiv] [ieee link] 2022 A Geometric Approach to k-means Jiazhen Hong, Wei Qian, Yudong Chen, and Yuqian Zhang Transactions on Knowledge and Data Engineering, 2025. [arxiv] Clustering Heterogeneous Financial Networks Hamed Amini, Yudong Chen, Andreea Minca, and Xin Qian Mathematical Finance, 2022. [link] Towards a Unified Quadrature Framework for Large-Scale Kernel Machines Fanghui Liu, Xiaolin Huang, Yudong Chen, and Johan Suykens IEEE Transactions on Pattern Analysis and Machine Intelligence, vol. 44, no. 11, pp. 7975-7988, 2022. [ieee link] Hidden Integrality and Semi-random Robustness of SDP Relaxation for Sub-Gaussian Mixture Models Yingjie Fei and Yudong Chen Mathematics of Operations Research, vol. 47, no. 3, pp. 2464-2493, 2022. [MOR link] Partial preliminary results appeared in COLT 2018. Random Features for Kernel Approximation: A Survey on Algorithms, Theory, and Beyond Fanghui Liu, Xia",
  "content_length": 24103,
  "method": "requests",
  "crawl_time": "2025-12-01 14:53:28"
}