{
  "name": "Yue Wang 0041",
  "homepage": "https://yuewang.xyz",
  "status": "success",
  "content": "Yue Wang I am an Assistant Professor at USC CS (2023 Fall-), leading the Geometry, Vision, and Learning Lab. I graduated from MIT EECS in 2022, advised by Prof. Justin Solomon at the Geometric Data Processing Group. I was also fortunate to collaborate with Prof. Michael Bronstein and Prof. Phillip Isola. Previously, I was a master student at University of California, San Diego. Prior to that, I received my BEng in Computer Science from Zhejiang University. I am looking to hire multiple PhDs/visiting students. For PhD applicants, please mention my name in your application. Interested candidates for internship positions can refer to this job post and I will respond as soon as I find a good fit. My research lies in the intersection of computer vision, computer graphics, and robotics. My goal is to use machine learning to enable robotic intelligence with minimal human supervision. I study how to design 3D learning systems which leverage geometry, appearance, motion, and any other cues that are naturally available in sensory inputs. I am also broadly interested in fundamental deep learning tools and eclectic applications on top of these systems. Topics I currently focus on include: Simulation. Constructing photorealistic simulations that replicate rare environments and enabling foundation model learning from synthetic or hybrid data sources. Perception. Leveraging geometric, semantic, and motional cues to develop data-efficient algorithms for robust scene perception and understanding in both simulated and real-world settings. Decision Making. Integrating knowledge from foundation models (such as LLMs) into intelligent agents for humanoids and robotic manipulation in novel and unknown environments. PhD students: Emily Jia (co-advised with Yajie Zhao) Jiageng Mao (Qualcomm Fellow) Jiawei Yang (Nvidia Fellow, Annenberg Fellow, Qualcomm Fellow) Junjie Ye (Qualcomm Fellow, Capital One Fellow) Cameron Smith (Qualcomm Fellow) Siheng Zhao (Amazon ML Fellow) Yiqi Zhao (co-advised with Jyo Deshmukh and Lars Lindemann) Kyle Hatch (co-advised with Daniel Seita) Toan Nguyen (co-advised with Daniel Seita) Yihe Tang Junying Wang (co-advised with Ulrich Neumann) Quankai Gao (co-advised with Ulrich Neumann) MS students: Jonathan Zamora Ting-Hsuan Chen Hongyi Jing Rong Xue Undergrads: Dylan Sun Kaidi Kang Zhenyu Zhao William Liu Alumni: James Qian (Next stop: transferred to Stanford) Ziyu Chen (Next stop: PhD at Stanford with Jiajun Wu and Fei-Fei Li) Scott Gao (Next stop: PhD with Jernej Barbic) Mingtong Zhang (Next stop: PhD at Princeton with Dhruv Shah) Haozhe Lou (Next stop: RA at Tsinghua) Wei Zhou (Next stop: PhD at UPenn with Jiatao Gu and Antonio Loquercio) Yuxuan Kuang (Next stop: PhD at CMU) Selected Award: Toyota Research Young Faculty Researcher Powell Faculty Research Award ICBS Best Paper Award Nvidia Fellowship MIT William A. Martin Master’s Thesis Award news Aug 15, 2025 Three papers accepted to ICCV 2025. UH1 is accepted to Humanoids 2025. RoLA is accepted to CoRL 2025. Apr 15, 2025 RoboVerse is accepted to RSS 2025. Deformable Beta Splatting is accepted to SIGGRAPH 2025. Feb 11, 2025 PhysBench is selected as an oral presentation (1.8%). OmniRe and LoRA3D are selected as spotlight presentations (5.1%). Congratulations to Wei, Jiageng, Ziyu, and Ziqi. Jan 28, 2025 Two papers accepted to ICRA 2025! Congratulations to Jiageng and Junjie. Jan 22, 2025 Eight papers accepted to ICLR 2025! Congratulations to all my students and collaborators. selected publications Humanoids Learning from Massive Human Videos for Universal Humanoid Pose Control Jiageng Mao, Siheng Zhao, Siqi Song, Tianheng Shi, Junjie Ye, Mingtong Zhang, Haoran Geng, Jitendra Malik, Vitor Guizilini, and Yue Wang In International Conference on Humanoid Robots 2025 Bib PDF Website @inproceedings{mao2025uh1, title = {Learning from Massive Human Videos for Universal Humanoid Pose Control}, author = {Mao, Jiageng and Zhao, Siheng and Song, Siqi and Shi, Tianheng and Ye, Junjie and Zhang, Mingtong and Geng, Haoran and Malik, Jitendra and Guizilini, Vitor and Wang, Yue}, year = {2025}, booktitle = {International Conference on Humanoid Robots}, } SIGGRAPH Deformable Beta Splatting Rong Liu*, Dylan Sun*, Meida Chen, Yue Wang#, and Andrew Feng# In ACM SIGGRAPH 2025 Bib PDF Website @inproceedings{liu2025, title = {Deformable Beta Splatting}, author = {Liu*, Rong and Sun*, Dylan and Chen, Meida and Wang#, Yue and Feng#, Andrew}, year = {2025}, booktitle = {ACM SIGGRAPH}, } RSS RoboVerse: Towards a Unified Platform, Dataset and Benchmark for Scalable and Generalizable Robot Learning Haoran Geng*, Feishi Wang*, Songlin Wei*, Yuyang Li*, Bangjun Wang*, Boshi An*, Charlie Tianyue Cheng*, Haozhe Lou, Peihao Li, Yen-Jen Wang, Yutong Liang, Dylan Goetting, Chaoyi Xu, Haozhe Chen, Yuxi Qian, Yiran Geng, Jiageng Mao, Weikang Wan, Mingtong Zhang, Jiangran Lyu, Siheng Zhao, Jiazhao Zhang, Jialiang Zhang, Chengyang Zhao, Haoran Lu, Yufei Ding, Ran Gong, Yuran Wang, Yuxuan Kuang, Ruihai Wu, Baoxiong Jia, Carlo Sferrazza, Hao Dong, Siyuan Huang#, Yue Wang#, Jitendra Malik#, and Pieter Abbeel# In Robotics: Science and Systems 2025 Bib PDF Website @inproceedings{roboverse, title = {RoboVerse: Towards a Unified Platform, Dataset and Benchmark for Scalable and Generalizable Robot Learning}, author = {Geng*, Haoran and Wang*, Feishi and Wei*, Songlin and Li*, Yuyang and Wang*, Bangjun and An*, Boshi and Cheng*, Charlie Tianyue and Lou, Haozhe and Li, Peihao and Wang, Yen-Jen and Liang, Yutong and Goetting, Dylan and Xu, Chaoyi and Chen, Haozhe and Qian, Yuxi and Geng, Yiran and Mao, Jiageng and Wan, Weikang and Zhang, Mingtong and Lyu, Jiangran and Zhao, Siheng and Zhang, Jiazhao and Zhang, Jialiang and Zhao, Chengyang and Lu, Haoran and Ding, Yufei and Gong, Ran and Wang, Yuran and Kuang, Yuxuan and Wu, Ruihai and Jia, Baoxiong and Sferrazza, Carlo and Dong, Hao and Huang#, Siyuan and Wang#, Yue and Malik#, Jitendra and Abbeel#, Pieter}, year = {2025}, booktitle = {Robotics: Science and Systems}, } ICLR Oral PhysBench: Benchmarking and Enhancing Vision-Language Models for Physical World Understanding Wei Chow*, Jiageng Mao*, Boyi Li, Daniel Seita, Vitor Campagnolo Guizilini, and Yue Wang In International Conference on Learning Representations 2025 Bib PDF @inproceedings{chow2025, title = {PhysBench: Benchmarking and Enhancing Vision-Language Models for Physical World Understanding}, author = {Chow*, Wei and Mao*, Jiageng and Li, Boyi and Seita, Daniel and Guizilini, Vitor Campagnolo and Wang, Yue}, year = {2025}, booktitle = {International Conference on Learning Representations}, } ICLR Spotlight OmniRe: Omni Urban Scene Reconstruction Ziyu Chen, Jiawei Yang, Jiahui Huang, Riccardo Lutio, Janick Martinez Esturo, Boris Ivanovic, Or Litany, Zan Gojcic, Sanja Fidler, Marco Pavone, Li Song, and Yue Wang In International Conference on Learning Representations 2025 Bib PDF Code Website @inproceedings{chen2025, title = {OmniRe: Omni Urban Scene Reconstruction}, author = {Chen, Ziyu and Yang, Jiawei and Huang, Jiahui and de Lutio, Riccardo and Esturo, Janick Martinez and Ivanovic, Boris and Litany, Or and Gojcic, Zan and Fidler, Sanja and Pavone, Marco and Song, Li and Wang, Yue}, year = {2025}, booktitle = {International Conference on Learning Representations}, } ICLR Spotlight LoRA3D: Low-Rank Self-Calibration of 3D Geometric Foundation models Ziqi Lu, Heng Yang, Danfei Xu, Boyi Li, Boris Ivanovic, Marco Pavone, and Yue Wang In International Conference on Learning Representations 2025 Bib PDF @inproceedings{lu2026, title = {LoRA3D: Low-Rank Self-Calibration of 3D Geometric Foundation models}, author = {Lu, Ziqi and Yang, Heng and Xu, Danfei and Li, Boyi and Ivanovic, Boris and Pavone, Marco and Wang, Yue}, year = {2025}, booktitle = {International Conference on Learning Representations}, } ICLR STORM: Spatio-Temporal Reconstruction Model for Large-Scale Outdoor Scenes Jiawei Yang, Jiahui Huang, Yuxiao Chen, Yan Wang, Boyi Li, Yurong You, Apoorva Sharma, Maximilian Igl, Peter Karkus, Danfei Xu, Boris Ivanovic, Yue Wang*, and Marco Pavone* In International Conference on Learning Representations 2025 Bib PDF Website @inproceedings{yang2025, title = {STORM: Spatio-Temporal Reconstruction Model for Large-Scale Outdoor Scenes}, author = {Yang, Jiawei and Huang, Jiahui and Chen, Yuxiao and Wang, Yan and Li, Boyi and You, Yurong and Sharma, Apoorva and Igl, Maximilian and Karkus, Peter and Xu, Danfei and Ivanovic, Boris and Wang*, Yue and Pavone*, Marco}, year = {2025}, booktitle = {International Conference on Learning Representations}, } CORL Oral RAM: Retrieval-Based Affordance Transfer for Generalizable Zero-Shot Robotic Manipulation Yuxuan Kuang, Junjie Ye, Haoran Geng, Jiageng Mao, Congyue Deng, Leonidas Guibas, He Wang, and Yue Wang In The Conference on Robot Learning 2024 Bib PDF Code Website @inproceedings{kuang2024, title = {RAM: Retrieval-Based Affordance Transfer for Generalizable Zero-Shot Robotic Manipulation}, author = {Kuang, Yuxuan and Ye, Junjie and Geng, Haoran and Mao, Jiageng and Deng, Congyue and Guibas, Leonidas and Wang, He and Wang, Yue}, year = {2024}, booktitle = {The Conference on Robot Learning}, } COLM A Language Agent for Autonomous Driving Jiageng Mao*, Junjie Ye*, Yuxi Qian, Marco Pavone, and Yue Wang In Conference on Language Modeling 2024 Bib PDF Website @inproceedings{mao2024agent, title = {A Language Agent for Autonomous Driving}, author = {Mao*, Jiageng and Ye*, Junjie and Qian, Yuxi and Pavone, Marco and Wang, Yue}, year = {2024}, booktitle = {Conference on Language Modeling}, } ECCV Oral Denoising Vision Transformers Jiawei Yang*, Katie Z Luo*, Jiefeng Li, Congyue Deng, Leo Guibas, Kilian Q Weinberger, Yonglong Tian, and Yue Wang In The European Conference on Computer Vision 2024 Bib PDF Website @inproceedings{yang2024dvt, title = {Denoising Vision Transformers}, author = {Yang*, Jiawei and Luo*, Katie Z and Li, Jiefeng and Deng, Congyue and Guibas, Leo and Wei",
  "content_length": 10127,
  "method": "requests",
  "crawl_time": "2025-12-01 14:53:30"
}