{
  "name": "Yue Li 0006",
  "homepage": "https://yuelee.bitbucket.io",
  "status": "success",
  "content": "Yue Li's Homepage Yue Li (李樾) I am an Associate Professor of the Department of Computer Science and Technology at Nanjing University, where Tian Tan and I co-run the PASCAL Research Group. We develop static program analysis techniques and tools for solving the problems in programming languages, software engineering and security. Before joining Nanjing University, I was a postdoc working at Aarhus University (CASA Group), Denmark (2017 - 2019), and University of New South Wales (CORG), Australia (UNSW Sydney) (2016 - 2017). I received my PhD degree in Computer Science from UNSW Sydney in 2016, and B.Eng degree in Software Engineering and M.Eng degree in Computer Science from Northwestern Polytechnical University in 2010 and 2012, respectively. Selected Papers The Essence of Verilog: A Tractable and Tested Operational Semantics for Verilog (OOPSLA'23) Context Sensitivity without Context: A Cut-Shortcut Approach to Fast and Precise Pointer Analysis (PLDI'23) Tai-e: A Developer-Friendly Static Analysis Framework for Java by Harnessing the Good Designs of Classics (ISSTA'23) Making Pointer Analysis More Precise by Unleashing the Power of Selective Context Sensitivity (OOPSLA'21) A Principled Approach to Selective Context Sensitivity for Pointer Analysis (TOPLAS'20) Understanding and Analyzing Java Reflection (TOSEM'19) Precision-Guided Context Sensitivity for Pointer Analysis (OOPSLA'18) Scalability-First Pointer Analysis with Self-Tuning Context-Sensitivity (FSE'18) Efficient and Precise Points-to Analysis: Modeling the Heap by Merging Equivalent Automata (PLDI'17) Program Tailoring: Slicing by Sequential Criteria (ECOOP'16) Making k-Object-Sensitive Pointer Analysis More Precise with Still k-Limiting (SAS'16) Effective Soundness-Guided Reflection Analysis (SAS'15) Self-Inferencing Reflection Resolution for Java (ECOOP'14) Contact Office: Room 536, Building of Computer Science and Technology Nanjing University (Xianlin Campus), 163 Xianlin Avenue, Qixia District, Nanjing, Jiangsu, China. Email: yueli at nju.edu.cn Google Scholar, dblp",
  "content_length": 2066,
  "method": "requests",
  "crawl_time": "2025-12-01 14:53:30"
}