{
  "name": "Yue Jiang 0002",
  "homepage": "https://yuejiang-nj.github.io",
  "status": "success",
  "content": "Yue Jiang Yue Jiang Email: yue.jiang [at] utah.edu Follow @YueJiang_nj CV (Updated in Oct. 2024) | Linkedin | Google Scholar WeChat Blog: yuejiang_phd I am an Assistant Professor at the University of Utah (Fall 2025). I am finishing my Ph.D. in the Computational Behavior Lab directed by Prof. Antti Oulasvirta, working on Computational User Interface Understanding and Eye Tracking on User Interfaces (Secondary advisor: Prof. Vikas Garg) at Aalto University and the Finnish Center for Artificial Intelligence (FCAI), Finland 🇫🇮. I served as an Accessibility Chair for CHI2023 and CHI2024. I received the Meta PhD Fellowship, Google Europe Students with Disabilities Scholarship, and Nokia Scholarship. I was selected as a Heidelberg Laureate Forum Young Researcher and UCSD Data Science Rising Star. I initiated and served as the lead organizer for the Computational User Interface Workshops, successfully held three times at the CHI conference. During my Ph.D., I interned at Apple AIML Lab and Adobe Research Document Intelligence Lab. I was a visiting Ph.D. student in Prof. Jeffrey Bigham's BIG Lab at Carnegie Mellon University in 2024. I also collaborate closely with Prof. Wolfgang Stuerzlinger (Simon Fraser University, Canada 🇨🇦) and Prof. Christof Lutteroth (University of Bath, UK 🇬🇧) on our series of OR-Constraint (ORC) Adaptive GUI layout projects. Previously, I worked on Human Motion Capture and the Reconstruction of Non-Rigid Deformations at the Max Planck Institute for Informatics, Germany 🇩🇪 and was a software engineer in the FPGA group at Intel. I got my Master's degree in Computer Graphics under Prof. Matthias Zwicker from the University of Maryland, College Park, USA 🇺🇸, and my Bachelor's degree in Computer Science Specialist and Mathematics Major under Prof. Gerald Penn from the University of Toronto, Canada 🇨🇦. Photo taken in Pittsburgh in 2024. I am looking for new student, especially students working on multimodal generative AI, eye tracking, UI agent, UI generation, or other related research areas. Fill in this Google Form if you are interested in joining my group as an RA or a PhD student. My Research I aim to develop human-centered technologies that enhance human capabilities by adapting to users and their contexts. Computational Representation for Graphical User Interfaces Explore how to best represent graphical UIs for computation. - Capture the key properties and characteristics of UI designs so that we do not need to encode them manually. - Effectively carry out the operations we need for downstream applications, such as how to learn, infer, optimize, and adapt. Show/Hide Papers Constraint-Based Representation Disjunctive Constraint System for Resizable GUIs:ORC Layout (CHI2019) GUI-specific Constraint Solver: ORCSolver (CHI2020) Reverse Engineering Resizable GUIs: ReverseORC (CHI2021) Adaptive Documents: FlexDoc (VL/HCC2024) GUI Editor for Resizable GUIs: L3 Editor Graph-Based Representation Graph-Based Constraint Prediction for GUI Autocompletion: Graph4GUI (CHI2024) Suggesting Colors with Graph Neural Networks:Suggesting Color (CHI2024 Workshop) Understanding Human Behaviors and Interactions - Capture human behaviors and interactions including eye tracking, human poses, and hand gestures. - Create AI models to predict and simulate human behaviors. Show/Hide Papers Eye Tracking Eye Tracking across Different UI Types: UEyes (CHI2023) Personalized Scanpath Prediction: EyeFormer (UIST2024) Design Decisions in Scanpath Modeling: Design Decisions (ETRA2024) Gaze Behaviors on Visualization: VisRecall++ (ETRA2024) Eye Tracking on Visual Search:Visual Search (IJHCS) Motion Capture and 3D Reconstruction Capturing Human Pose, Clothing, Facial Expression, and Hand Gestures from RGB Videos: HiFECap (BMVC2022) Activity Recognition with Doppler Radar Data: Vid2Doppler (CHI2021) Differentiable Rendering for 3D Reconstruction: SDFDiff (CVPR2020 Oral Top 5%) Interactive Agents UI-Speciifc Vision Language Model: ILuvUI UI Automation for Accessibility Testing: AXNav (CHI2024) Code-Based Synthetic UI Generation: DreamStruct (ECCV2024) Interactive Visualization and Writing Assistant Tool: Gender Roles in Greeting Card Messages (CHI2022 Best Paper Honorable Mention) Highlights I am currently serving as a PC Member at VL/HCC2025 and an Associate Chair (AC) at CHI2026. I was an Associate Chair (AC) for Full Papers at CHI2025, a Program Committee Member for full paper at IUI2025, and a Program Committee Member for the ASSETS2024 Experience Reports track. I have been selected as a Heidelberg Laureate Forum Young Researcher. I served as the Accessibility Co-Chair, Associate Chair (AC) for Late Breaking Works, and Session Chair for two sessions at CHI2024. I am visiting Prof. Jeffrey P. Bigham's BIG Lab at Carnegie Mellon University in 2024. I am excited to receive the 2023 Meta Research PhD Fellowship! Yay! :-) We are organizing our third Computational User Interface workshop, 'Computational Methodologies for Understanding, Automating, and Evaluating User Interfaces' at CHI2024. Welcome to participate! I served as the Accessibility Co-Chair, Workshop Juror, Associate Chair (AC) for Late Breaking Works, and Session Chair for two sessions at CHI2023. I enjoyed my internship with the UI Understanding team under Jeff Nichols at Apple AIML so much! I wish it could be longer! We organized our second Computational User Interface workshop, 'The Future of Computational Approaches for Understanding and Adapting User Interfaces' at CHI2023. I served as a PC member at IUI2023. I received the 2022 Google Europe Students with Disabilities Scholarship. I received Special Recognition for Outstanding Reviews for CHI2024, UIST2022 and CHI2021. Representative Publications Graph4GUI: Graph Neural Networks for Representing Graphical User Interfaces Yue Jiang, Changkong Zhou, Vikas Garg*, Antti Oulasvirta* ACM CHI Conference on Human Factors in Computing Systems (CHI2024) Webpage | Paper EyeFormer: Predicting Personalized Scanpaths with Transformer-Guided Reinforcement Learning Yue Jiang*, Zixin Guo*, Hamed R. Tavakoli, Luis A. Leiva, Antti Oulasvirta (*Equal Contribution) ACM Symposium on User Interface Software and Technology (UIST2024) Webpage | Paper | Supp | Video | Video Preview | Code UEyes: Understanding Visual Saliency across User Interface Types Yue Jiang, Luis A. Leiva, Hamed R. Tavakoli, Paul R. B. Houssel, Julia Kylmala, Antti Oulasvirta ACM CHI Conference on Human Factors in Computing Systems (CHI2023) Webpage | Paper | Supp | Video | Video Preview | Dataset | Code SDFDiff: Differentiable Rendering of Signed Distance Fields for 3D Shape Optimization Yue Jiang, Dantong Ji, Zhizhong Han, Matthias Zwicker IEEE/CVF Computer Vision and Pattern Recognition Conference (CVPR2020) (Oral Top 5%) Project Page | Paper | Supp | Code | Video | Talk HiFECap: Monocular High-Fidelity and Expressive Capture of Human Performances Yue Jiang, Marc Habermann, Vladislav Golyanik, Christian Theobalt British Machine Vision Conference (BMVC2022) Webpage | Paper | Supp | Video | poster | Presentation Other Full Paper Publications ILuvUI: Instruction-tuned LangUage-Vision modeling of UIs from Machine Conversations Yue Jiang, Eldon Schoop, Amanda Swearngin, Jeffrey Nichols ACM Conference on Intelligent User Interfaces (IUI2025) Paper DreamStruct: Understanding Slides and UIs via Synthetic Data Generation Yi-Hao Peng, Faria Huq, Yue Jiang, Jason Wu, Xin Yue Li, Jeffrey Bigham, Amy Pavel European Conference on Computer Vision (ECCV2024) Paper | Supp AXNav: Replaying Accessibility Tests from Natural Language Maryam Taeb, Amanda Swearngin, Eldon Schoop, Ruijia Cheng, Yue Jiang, Jeffrey Nichols ACM CHI Conference on Human Factors in Computing Systems (CHI2024) Paper | Video | Video Preview FlexDoc: Flexible Document Adaptation through Optimizing both Content and Layout Yue Jiang, Christof Lutteroth, Rajiv Jain, Christopher Tensmeyer, Varun Manjunatha, Wolfgang Stuerzlinger, Vlad Morariu IEEE Symposium on Visual Languages and Human-Centric Computing (VL/HCC2024) Paper | Video VisRecall++: Analysing and Predicting Visualisation Recallability from Gaze Bahaviour Yao Wang, Yue Jiang, Zhiming Hu, Constantin Ruhdorfer, Mihai Bâce, Andreas Bulling ACM Symposium on Eye Tracking Research and Applications (ETRA2024) Paper Impact of Design Decisions in Scanpath Modeling Parvin Emami, Yue Jiang, Zixin Guo, Luis A. Leiva ACM Symposium on Eye Tracking Research and Applications (ETRA2024) Paper Pretty Princess vs. Successful Leader: Gender Roles in Greeting Card Messages Jiao Sun, Tongshuang Wu, Yue Jiang, Ronil Awalegaonkar, Xi Victoria Lin, Diyi Yang ACM CHI Conference on Human Factors in Computing Systems (CHI2022) (Best Paper Honorable Mention) Paper ReverseORC: Reverse Engineering of Resizable User Interface Layouts with OR-Constraints Yue Jiang, Wolfgang Stuerzlinger, Christof Lutteroth ACM CHI Conference on Human Factors in Computing Systems (CHI2021) Paper | Video | Video Preview Vid2Doppler: Synthesizing Doppler Radar Data from Videos for Training Privacy-Preserving Activity Recognition Karan Ahuja, Yue Jiang, Mayank Goel, Chris Harrison ACM CHI Conference on Human Factors in Computing Systems (CHI2021) Paper | Video Preview | Code “Positive Energy”: Perceptions and Attitudes Towards COVID-19 Information on Social Media in China Zhicong Lu, Yue Jiang, Chenxinran Shen, Margaret C Jack, Daniel Wigdor, Mor Naaman ACM CHI Computer-Supported Cooperative Work and Social Computing (CSCW2021) Paper ORCSolver: An Efficient Solver for Adaptive GUI Layout with OR-Constraints Yue Jiang, Wolfgang Stuerzlinger, Matthias Zwicker, Christof Lutteroth ACM CHI Conference on Human Factors in Computing Systems (CHI2020) Project Page | Paper | Supp | Code | Video | Video Preview | Talk The Government's Dividend: Complex Perceptions of Social Media Misinformation in China Zhicong Lu, Yue Jiang, Cheng Lu, Mor Naaman, Daniel Wigdor ACM CHI Conference on Human Factors in Computing Systems (CHI2",
  "content_length": 23633,
  "method": "requests",
  "crawl_time": "2025-12-01 14:53:29"
}