{
  "name": "Yue Ning 0001",
  "homepage": "https://yue-ning.github.io",
  "status": "success",
  "content": "Yue Ning Yue Ning Students Teaching Research Publication About Me Gateway South 448 1 Castle Point Terrace, Hoboken, NJ, USA Hello! I am an Associate Professor in the department of Computer Science at Stevens Institute of Technology. My research interests lie at the intersection of machine learning, artificial intelligence, and data analytics, focusing on social informatics, health care, and financial technologies. In particular, my research group is dedicated to developing predictive and generative methods that effectively capture spatio-temporal, dynamic, and interpretable patterns in large-scale datasets. Our work is supported by the National Science Foundation, Nvidia, and Stevens Institute of Technology. I received my Ph.D. from the Department of Computer Science of Virginia Tech under Dr. Naren Ramakrishnan. I am also affiliated with Stevens Institute for Artificial Intelligence (SIAI), Center for Research Toward Advancing Financial Technologies (CRAFT), and Semcer Center for Healthcare Innovation (CHI). Openings: I am looking for PhD students. Review this file if you are interested in working with me. Research Interests Machine Learning and Deep Learning Data Science Socially Responsible AI News 09.2025 Paper on Agentic Causal Discovery was accepted by EMNLP 2025 (Findings). 08.2025 Congratulations to Nan Cui and Jing Chen on successfully defending their PhD theses! 05.2025 Congratulations to Sandy Han and Pengfei Hu on their summer internships. Best wishes for a productive and rewarding experience! 01.2025 Paper on Graph OOD generalization was accepted by AISTATS 2025. 10.2024 Paper on Continual Graph Learning was accepted by NeurIPS 2024. 10.2024 We are grateful to receive an award from NSF NAIRR Pilot to support our research on domain-informed foundation models! 10.2024 I am excited to receive a research fellowship from the NIH-sponsored AIM-AHEAD program! This fellowship will support my work on developing AI methods to address and mitigate health outcome disparities. 09.2024 Invited talk at University of Delaware. 08.2024 Tutorial talk at KDD 2024. 08.2024 I will serve as Co-chair for AAAI Doctoral Consortium (2025). 02.2024 Congratulations to Chang on successfully defending his PhD thesis! 11.2023 Invited talk at Case Western Reserve University. 09.2023 Paper on contrastive learning for ICD coding was accepted by NeurIPS 2023. 09.2023 Paper on fair federated graph neural networks was accepted by ICDM 2023. 08.2023 Paper on time series generation was accepted by TKDE. 05.2023 Paper on graph unlearning was accepted by KDD 2023. 05.2023 Received Early Career Award for Research Excellence from Stevens. 03.2023 Stevens media published a nice article on my research. 02.2023 Invited talk at ADP Data Science and Machine Learning. 12.2022 Invited keynote talk at MLoG workshop at ICDM'22. 10.2022 Paper on news-enhanced pandemic forecasting was accepted by IEEE BigData 2022. 09.2022 Two papers were accepted by ICDM 2022. 07.2022 Congratulations to Dr. Deng who successfully defended her PhD thesis! 05.2022 Songgaojun Deng received the Excellence in Graduate Research Award from Stevens! 05.2022 Chang Lu started summer internship at NEC Labs America. 05.2022 Paper on causal event analysis was accepted by KDD 2022. 12.2021 Paper on health event prediction using dynamic disease graphs was accepted by AAAI 2022. 11.2021 Invited talk at the Computer Science department, NJIT. 11.2021 Paper on anti-Asian hate speech detection was accepted by ICWSM 2022. 09.2021 I am serving as student travel award co-chair for KDD 2022. 08.2021 Paper on interpretable event prediction was accepted by CIKM 2021. 06.2021 I am honored to receive an NSF CAREER award to explore deep interpretable methods for temporal event modeling. Thanks NSF! 05.2021 PhD student Songgaojun Deng received Excellence Doctoral Fellowship. Congratulations Songgaojun! 04.2021 Paper on collaborative graph learning for health event prediction was accepted by IJCAI 2021. 02.2021 Check out our toturial on Explainable AI for Societal Event Predictions in AAAI 2021. 02.2021 Paper on fake news detection was accepted by PAKDD 2021. 01.2021 I will serve on the Bergen County Academies ATCS advisory board. 11.2020 I will serve as a senior PC for IJCAI-2021. 10.2020 Paper on asynchronous online federated learning was accepted by IEEE BigData 2020. 07.2020 Paper on predicting long-term influenza-like illness cases was accepted by CIKM 2020. 07.2020 Invited to serve on the PC of ICLR 2021, IJCAI 2021, TheWebConf 2021. 05.2020 Paper on dynamic knowledge graph based multi-event forecasting was accepted by KDD 2020. 05.2020 Received an NSF CRII award to explore and create deep learning models for learning dynamic graph-based event precursors. Thanks NSF! 03.2020 Paper on reducing identity bias in detecting toxic comment detection was accepted by ICWSM 2020. 09.2019 Received an Nvidia GPU grant. Thanks Nvidia! 08.2019 I will be teaching a new course: Natural Language Processing in the fall semester. 08.2019 Invited to serve on the PC of AAAI 2020. 04.2019 Paper on modeling dynamic event context graphs was accepted by KDD 2019. 04.2019 Check out our tutorial on Spatio-Temporal Event Forecasting and Precursor Identification in KDD 2019. 01.2019 Invited to serve on the PC of KDD 2019, ASONAM 2019, SDM 2019. Professional Service Organizing Committee Doctoral Consortium Co-chair: AAAI 2025 Local Arrangement Chair: IEEE INFOCOM 2023 Student Travel Award Co-chair: KDD 2022 Area Chair: KDD 2024, KDD 2025 Session Chair SDM 2021 KDD 2020 Senior PC: IJCAI 2021 Program Committee: KDD 2019-2023 Program Committee: AAAI 2020-2024 Program Committee: ICLR 2021, 2023, 2024 Program Committee: ICML 2020-2023 Program Committee: NeurIPS 2021-2023 Program Committee: IJCAI 2021-2023 Program Committee: CVPR 2023 Program Committee: The Web Conf (previously WWW) 2021-2023 Program Committee: CIKM short paper track 2022 Program Committee: PAKDD 2020-2022 Program Committee: SDM 2019-2024 Program Committee: IEEE BigData 2020-2023 Program Committee: ICMLA 2019 Program Committee: ASONAM 2018-2022 Reviewer: Sensors, published by MDPI Reviewer: Nature Communications Reviewer: Pattern Recognition Reviewer: IEEE Transactions on Knowledge and Data Engineering (TKDE) Reviewer: ACM Transactions on Knowledge Discovery from Data (TKDD) Reviewer: IEEE/ACM Transactions on Computational Biology and Bioinformatics Reviewer: Social Network Analysis and Mining (SNAM) Reviewer: IEEE Transactions on Intelligent Transportation Systems (T-ITS) Reviewer: IEEE Transactions on Emerging Topics in Computational Intelligence (TETCI) Reviewer: IEEE Transactions on Neural Networks and Learning Systems (TNNLS) Guest Editor: Frontiers in Big Data Contact Mailing Address 1 Castle Point Terrace, Hoboken, NJ 07030, USA Office Gateway South 448 Email yue.ning AT stevens.edu",
  "content_length": 6870,
  "method": "requests",
  "crawl_time": "2025-12-01 14:53:30"
}