{
  "name": "Yuekang Li",
  "homepage": "https://www.unsw.edu.au/staff/yuekang-li",
  "status": "success",
  "content": "Mr Yuekang Li Type in a search term Search Follow Follow LinkedIn Facebook Instagram TikTok YouTube Back to Mr Yuekang Li Lecturer Engineering Computer Science and Engineering Follow me Follow me Yuekang Li joins UNSW from Nanyang Technological University (NTU) where he worked in the Continental-NTU cooperate lab as a Research Assistant Professor. He obtained his Ph.D. degree and bachelor’s degree in 2020 and 2016 from NTU respectively. Yuekang’s research interests lie in various software engineering topics. In particular, he has been focusing on software testing/quality assurance techniques. He is passionate about applying testing techniques to different scenarios and solving some fundamental problems in dynamic program analysis. E-mail yuekang.li@unsw.edu.au Location School of Computer Science and Engineering Room 501-G, K17 Building UNSW Kensington Campus Publications Publications Media Media Grants Grants Awards Awards Research Activities Research Activities Engagement Engagement Teaching and Supervision Teaching and Supervision Books Book Chapters Edited Books Journal Articles Journal articles | 2025 Ge J; Zheng Y; Li Y; Ma W; Habib SM; Kakkolangara P; Byman GW; Liu Y, 2025, 'OptRCA: A More Efficient and Accurate Approach for Automated Root Cause Analysis and Explanation', ACM Transactions on Software Engineering and Methodology, http://dx.doi.org/10.1145/3736718 Journal articles | 2025 Kan S; Li Y; He W; Xing Z; Zhu L; Sui Y, 2025, 'S pectre : Automated Aliasing Specifications Generation for Library APIs with Fuzzing', ACM Transactions on Software Engineering and Methodology, http://dx.doi.org/10.1145/3725811 Journal articles | 2025 Li S; Xie K; Li Y; Li H; Ren Y; Sun L; Zhu H, 2025, 'TransferFuzz-Pro: Large Language Model Driven Code Debugging Technology for Verifying Propagated Vulnerability', IEEE Transactions on Software Engineering, 51, pp. 2396 - 2411, http://dx.doi.org/10.1109/TSE.2025.3584774 Journal articles | 2025 Wang S; Li Y; Wang K; Liu Y; Li H; Liu Y; Wang H, 2025, 'MiniScope: Automated UI Exploration and Privacy Inconsistency Detection of MiniApps via Two-phase Iterative Hybrid Analysis', ACM Transactions on Software Engineering and Methodology, 34, http://dx.doi.org/10.1145/3709351 Journal articles | 2024 Li N; Li Y; Liu Y; Shi L; Wang K; Wang H, 2024, 'Drowzee: Metamorphic Testing for Fact-Conflicting Hallucination Detection in Large Language Models', Proceedings of the ACM on Programming Languages, 8, http://dx.doi.org/10.1145/3689776 Journal articles | 2024 Li Y; Liu Y; Deng G; Zhang Y; Song W; Shi L; Wang K; Li Y; Liu Y; Wang H, 2024, 'Glitch Tokens in Large Language Models: Categorization Taxonomy and Effective Detection', Proceedings of the ACM on Software Engineering, 1, pp. 2075 - 2097, http://dx.doi.org/10.1145/3660799 Journal articles | 2024 Zhang X; Zhang C; Li X; Du Z; Mao B; Li Y; Zheng Y; Li Y; Pan L; Liu Y; Deng R, 2024, 'A Survey of Protocol Fuzzing', ACM Computing Surveys, 57, http://dx.doi.org/10.1145/3696788 Journal articles | 2022 Li S; Xie X; Lin Y; Li Y; Feng R; Li X; Ge W; Dong JS, 2022, 'Deep Learning for Coverage-Guided Fuzzing: How Far are We?', IEEE Transactions on Dependable and Secure Computing, pp. 1 - 13, http://dx.doi.org/10.1109/TDSC.2022.3200525 Journal articles | 2022 Wei X; Xiao M; Wang B; Wang C; Li Y; Dou J; Cui Z; Dou J; Wang H; Ma S; Zhu C; Yuan G; Yang N; Song T; Zhou H; Chen H; Bai Y; Chen Q, 2022, 'Avoiding Structural Collapse to Reduce Lead Leakage in Perovskite Photovoltaics', ANGEWANDTE CHEMIE-INTERNATIONAL EDITION, 61, http://dx.doi.org/10.1002/anie.202204314 Journal articles | 2022 Yao S; Chen C; Chen Q; Zhang J; Li Y; Zeng Y, 2022, 'An integrated hydrodynamic and multicriteria evaluation Cellular Automata-Markov model to assess the effects of a water resource project on waterbird habitat in wetlands', JOURNAL OF HYDROLOGY, 607, http://dx.doi.org/10.1016/j.jhydrol.2022.127561 Journal articles | 2020 Li Y; Zhou X; Chen J; Guo W; He S; Gao S; Peng P, 2020, 'Laser-Patterned Copper Electrodes for Proximity and Tactile Sensors', Advanced Materials Interfaces, 7, http://dx.doi.org/10.1002/admi.201901845 Journal articles | 2020 Yao S; Li X; Liu C; Zhang J; Li Y; Gan T; Liu B; Kuang W, 2020, 'New assessment indicator of habitat suitability for migratory bird in wetland based on hydrodynamic model and vegetation growth threshold', ECOLOGICAL INDICATORS, 117, http://dx.doi.org/10.1016/j.ecolind.2020.106556 Journal articles | 2019 Luo H; Lou VWQ; Li Y; Chi I, 2019, 'Development and Validation of a Prognostic Tool for Identifying Residents at Increased Risk of Death in Long-Term Care Facilities', JOURNAL OF PALLIATIVE MEDICINE, 22, pp. 258 - 266, http://dx.doi.org/10.1089/jpm.2018.0219 Working Papers Other Conference Papers | 2025 Chen Z; Kemper P; Liu Y; Gorzny J; Siqueira D; Li Y; Pellegrino D; Derka M, 2025, 'A Methodology for Replicating Historical Exploits on EVM-Compatible Blockchains', in Proceedings 2025 IEEE ACM 7th International Workshop on Emerging Trends in Software Engineering for Blockchain Wetseb 2025, pp. 57 - 60, http://dx.doi.org/10.1109/WETSEB66605.2025.00014 Conference Papers | 2025 Ding Z; Deng G; Liu Y; Ding J; Chen J; Sui Y; Li Y, 2025, 'IllusionCAPTCHA: A CAPTCHA based on Visual Illusion', in Www 2025 Proceedings of the ACM Web Conference, pp. 3683 - 3691, http://dx.doi.org/10.1145/3696410.3714726 Conference Papers | 2025 Ding Z; Fu Q; Ding J; Deng G; Liu Y; Li Y, 2025, 'A Rusty Link in the AI Supply Chain: Detecting Evil Configurations in Model Repositories', in Proceedings 46th IEEE Symposium on Security and Privacy Workshops Spw 2025, pp. 260 - 264, http://dx.doi.org/10.1109/SPW67851.2025.00036 Conference Papers | 2025 Jin D; Fu Q; Li Y, 2025, 'Good News for Script Kiddies? Evaluating Large Language Models for Automated Exploit Generation', in Proceedings 46th IEEE Symposium on Security and Privacy Workshops Spw 2025, pp. 278 - 282, http://dx.doi.org/10.1109/SPW67851.2025.00039 Conference Papers | 2025 Kute DV; Xu Z; Li Y; Rabhi F, 2025, 'Truman: A Large Language Model-based Multi-agent Simulator for Synthetic Money Laundering Data Generation', in Proceedings of the International Joint Conference on Autonomous Agents and Multiagent Systems Aamas, pp. 2594 - 2596 Conference Papers | 2025 Li S; Li Y; Chen Z; Dong C; Wang Y; Li H; Chen Y; Zhu H, 2025, 'TransferFuzz: Fuzzing with Historical Trace for Verifying Propagated Vulnerability Code', in Proceedings International Conference on Software Engineering, pp. 268 - 280, http://dx.doi.org/10.1109/ICSE55347.2025.00061 Conference Papers | 2025 Sun W; Miao Y; Li Y; Zhang H; Fang C; Liu Y; Deng G; Liu Y; Chen Z, 2025, 'Source Code Summarization in the Era of Large Language Models', in Proceedings International Conference on Software Engineering, pp. 1882 - 1894, http://dx.doi.org/10.1109/ICSE55347.2025.00034 Conference Papers | 2025 Xu Z; Liu Y; Deng G; Wang K; Li Y; Shi L; Picek S, 2025, 'Continuous Embedding Attacks via Clipped Inputs in Jailbreaking Large Language Models', in Proceedings 46th IEEE Symposium on Security and Privacy Workshops Spw 2025, pp. 270 - 277, http://dx.doi.org/10.1109/SPW67851.2025.00038 Conference Papers | 2025 Zhao J; Li Y; Zou Y; Xiao Y; Jiang N; Li Y; Zhong N; Peng B; Jian K; Huo W, 2025, 'From Constraints to Cracks: Constraint Semantic Inconsistencies as Vulnerability Beacons for Embedded Systems', in Proceedings of the 34th Usenix Security Symposium, pp. 685 - 704 Conference Papers | 2024 Deng G; Liu Y; Mayoral-Vilches V; Liu P; Li Y; Xu Y; Zhang T; Liu Y; Pinzger M; Rass S, 2024, 'PENTESTGPT: Evaluating and Harnessing Large Language Models for Automated Penetration Testing', in Proceedings of the 33rd Usenix Security Symposium, pp. 847 - 864 Conference Papers | 2024 Du Z; Li Y; Zheng Y; Zhang X; Zhang C; Liu Y; Habib SM; Li X; Wang L; Liu Y; Mao B, 2024, 'Medusa: Unveil Memory Exhaustion DoS Vulnerabilities in Protocol Implementations', in Www 2024 Proceedings of the ACM Web Conference, pp. 1668 - 1679, http://dx.doi.org/10.1145/3589334.3645476 Conference Papers | 2024 Liu T; Deng Z; Meng G; Li Y; Chen K, 2024, 'Demystifying RCE Vulnerabilities in LLM-Integrated Apps', in Ccs 2024 Proceedings of the 2024 ACM Sigsac Conference on Computer and Communications Security, pp. 1716 - 1730, http://dx.doi.org/10.1145/3658644.3690338 Conference Papers | 2024 Liu Y; Deng G; Xu Z; Li Y; Zheng Y; Zhang Y; Zhao L; Zhang T; Wang K, 2024, 'A Hitchhiker’s Guide to Jailbreaking ChatGPT via Prompt Engineering', in Sea4dq 2024 Proceedings of the 4th International Workshop on Software Engineering and AI for Data Quality in Cyber Physical Systems Internet of Things Co Located with Esec Fse 2024, pp. 12 - 21, http://dx.doi.org/10.1145/3663530.3665021 Conference Papers | 2024 Wang G; Li Y; Liu Y; Deng G; Li T; Xu G; Liu Y; Wang H; Wang K, 2024, 'MeTMaP: Metamorphic Testing for Detecting False Vector Matching Problems in LLM Augmented Generation', in Proceedings 2024 IEEE ACM 1st International Conference on AI Foundation Models and Software Engineering Forge 2024, pp. 12 - 23, http://dx.doi.org/10.1145/3650105.3652297 Preprints | 2024 Xu Z; Liu Y; Deng G; Li Y; Picek S, 2024, A Comprehensive Study of Jailbreak Attack versus Defense for Large Language Models, http://dx.doi.org/10.48550/arXiv.2402.13457 Conference Papers | 2024 Yang W; Gao C; Liu X; Li Y; Xue Y, 2024, 'Rust-twins: Automatic Rust Compiler Testing through Program Mutation and Dual Macros Generation', in Proceedings 2024 39th ACM IEEE International Conference on Automated Software Engineering Ase 2024, pp. 631 - 642, http://dx.doi.org/10.1145/3691620.3695059 Conference Papers | 2024 Yu J; Xie X; Zhang C; Chen S; Li Y; Shen W, 2024, 'Bugs in Pods: Understanding Bugs in Container Runtime Systems', in Issta 2024 Proceedings of the 33rd ACM SIGSOFT International Symposium on Software Testing and Analysis, pp. 1364 - 1376, http://dx.doi.org/10.1145/3650212.3680366 Conference Papers | 2024 Zhang C; Zheng Y; Bai M; Li Y; ",
  "content_length": 20048,
  "method": "requests",
  "crawl_time": "2025-12-01 14:53:34"
}