{
  "name": "Yueling Zhang",
  "homepage": "https://faculty.ecnu.edu.cn/_s43/zyl2_23207/main.psp",
  "status": "success",
  "content": "软件工程学院 Group 3 Created with Sketch. 教师个人主页 English 返回首页 欢迎登录 张越龄 副教授 软件工程学院 导航 个人资料 研究方向 招生与培养 开授课程 科研项目 学术成果 荣誉及奖励 个人资料 部门： 软件工程学院 毕业院校： 华东师范大学 学位： 博士 学历： 博士 邮编： 200062 联系电话： 传真： 电子邮箱： ylzhang@sei.ecnu.edu.cn 办公地址： 理科楼B1104 通讯地址： 上海市中山北路3663号 教育经历 •    2015.09-2019.07    华东师范大学            博士（软件工程）2017-2018   访问普林斯顿大学2018-2019   访问伊利诺伊大学香槟分校  •    2013.09-2015.07    复旦大学                      硕士（软件工程）•    2008.09-2012.07     华东师范大学                  学士（软件工程） 工作经历 •    2019.09-2022.05 华东师范大学                 软件工程学院， 博士后，合作导师何积丰院士        2020 - 2022        新加坡管理大学               计算与信息系统学院，合作交流，Research Scientist，合作导师孙军教授•    2022.06-今          华东师范大学                  软件工程学院， 副教授 个人简介 本课题组系统建模（临港班）方向仍有研究生名额，欢迎具有一定系统架构基础且愿意去临港的同学申报张越龄，博士，具有4年国外留学工作经历。主要研究方向为约束求解理论与技术研究、程序（协议）分析与验证、AI芯片编译器理论与技术研究，加入高可信软件研究团队。在CAV、ASE、ISSTA、SCP等国际高水平期刊或会议上发表文章16篇。代表性成果包括：Accelerating All-SAT Computation with Short Blocking Clauses，ASE，CCF-AEfficient white-box fairness testing through gradient search，ISSTA，CCF-ASyntax-Guided Termination Analysis，CAV，CCF-AProgrammable Logic Controllers Past Linear Temporal Logic for Monitoring Applications in Industrial Control Systems， IEEE Transactions on Industrial Informatics， SCI一区Optimizing backbone filtering， SCP， CCF-B欢迎博士后、博士、硕士以及华东师范大学的本科生加入我们的研究小组，如果你对Programming Language (PL)、约束求解、软件（协议）分析与验证、软件安全、可信人工智能、AI芯片编译等方向感兴趣，欢迎随时邮件联系和交流（附上你的简历和你的项目经历）。我们也欢迎暑期实习生。 社会兼职 研究方向 本课题组约束求解与形式化分析方向仍有研究生名额，欢迎具有一定数学基础的同学申报约束求解理论方法研究及应用软件（程序、协议、智能系统）可信安全分析与验证AI芯片编译器理论与技术研究欢迎博士后、博士、硕士以及华东师范大学的本科生加入我们的研究小组，如果你对Programming Language (PL)、约束求解、软件分析与验证、软件安全、可信人工智能、AI芯片编译等方向感兴趣，欢迎随时邮件联系和交流（附上你的简历和你的项目经历）。我们也欢迎暑期实习生。所在高可信软件研究团队具有多名教授，研究领域包括需求工程、硬件验证、软件测试、深度学习及安全、AI芯片编译技术等。相关技术应用于多家公司企业，如字节跳动、腾讯、卡斯柯等。本团队所提供的本科生毕业设计题目包括：智能化软件分析 -- 大语言模型提取软件性质/循环程序分析/可满足约束求解AI系统安全、公平、可信分析AI芯片、FPGA、AI模型编译器研究智能合约、协议分析测试与验证 招生与培养 本课题组约束求解与形式化分析方向仍有研究生名额，欢迎具有一定数学基础的同学申报欢迎对约束求解，系统（程序、协议、AI分析），Programming Language感兴趣的同学申报 开授课程 编译原理智能计算系统专业英语系统软件安全 科研项目 上海市浦江人才计划 基于国产AI芯片的编译优化方法研究 主持 国家自然科学基金青年项目 位向量约束求解器的理论与算法研究 主持 3. 总线协议验证 学术成果 1. Yueling Zhang, Geguang Pu*, Jun Sun. Accelerating All-SAT Computation with short Blocking Clauses. ASE 2020 CCF A. 2. Lingfeng Zhang, Yueling Zhang*, Min Zhang*. Efficient White-box Fairness Testing through Gradient Search. ISSTA 2021 CCF A. 3. Grigory Fedyukovich, Yueling Zhang, Aarti Gupta. Syntax-Guided Termination Analysis. CAV 2018 CCF A. 4. Jianwen Li, Kristin Y. Rozier, Geguang Pu, Yueling Zhang, Moshe Y. Vardi. SAT-based Explicit LTLf Satisfiability Checking. AAAI 2019 CCF A. 5. Jianwen Li, Geguang Pu, Yueling Zhang, Moshe Y. Vardi, Kristin Y. Rozier. SAT-based Explicit LTLf Satisfiability Checking. Artif. Intell. 2020 CCF A, SCI. 6. Xia Mao; Xin Li; Yanhong Huang; Jianqi Shi; Yueling Zhang. PLC Past Linear Temporal Logic for Monitoring Applications in Industrial Control Systems. IEEE Transactions on Industrial Informatics. SCI. 7. Yueling Zhang, Min Zhang*, Geguang Pu*. Optimizing Backbone Filtering. Sci. Comput. Program 2020 CCF B, SCI. 8. Yueling Zhang, Geguang Pu*, Min Zhang*, William Y. Generating Adversarial Examples for DNN using Pooling Layers. J. Intell. Fuzzy Syst 2019 SCI. 9. Yueling Zhang, Min Zhang*, Geguang Pu*, Fu Song, Jianwen Li. Towards Backbone Computing: A Greedy-Whitening based Approach. AI Commun. 2018 SCI. 10. Jianwen Li, Shufang Zhu, Yueling Zhang, Geguang Pu, Moshe Y. Vardi. Safety Model Checking with Complementary Approximations. ICCAD 2017 CCF B. 11. Yueling Zhang, Geguang Pu*, Min Zhang*. SMTBCF: Efficient Backbone Computing for SMT Formulas. ICFEM 2019 CCF C. 12. Yueling Zhang, Jianwen Li, Min Zhang*, Geguang Pu*, Fu Song. Optimizing Backbone Filtering. TASE 2017 CCF C. 13. Bangfeng Xia, Yueling Zhang*, Weiting Chen, Xiangfeng Wang, Jiangtao Wang*. EdgeAugment: Data Augmentation by Fusing and Filling Edge Maps. ICANN 2020 CCF C. 14. Chunguang Jiang, Yueling Zhang*, Jiangtao Wang*, Weiting Chen. Approximated Masked Global Context Network for Skin Lesion Segmentation. ICANN 2021 CCF C.15. Shunkai Zhou, Yueling Zhang*, Jiangtao Wang*, Guitao Cao. Generating Adversarial Examples by Distributed Upsampling. ICONIP 2021 CCF C 16. Xia Mao, Yueling Zhang, Jianqi Shi, Yanhong Huang, Qin Li. A Refinement Development Approach for Enhancing the Safety of PLC Programs with Event-B. SCP 2021 SCI, CCF B 荣誉及奖励 10 访问 相关教师 版权所有 © 华东师范大学",
  "content_length": 4326,
  "method": "requests",
  "crawl_time": "2025-12-01 14:53:34"
}