{
  "name": "Yuepeng Wang 0001",
  "homepage": "https://www.cs.sfu.ca/~yuepeng",
  "status": "success",
  "content": "Yuepeng Wang Yuepeng Wang Assistant Professor School of Computing Science Simon Fraser University Email: yuepeng@sfu.ca Phone: 778-782-7111 Office: TASC1 8007 [Research] [Teaching] [Students] [Publications] [Service] I am an Assistant Professor in the School of Computing Science at Simon Fraser University, Canada. Prior to joining SFU, I was a postdoctoral researcher at the University of Pennsylvania. I obtained my PhD and MSc degrees from the University of Texas at Austin and my BEng degree with honors from the University of Science and Technology of China. I am looking for PhD and thesis MSc students. If you are interested in working with me, please send me an email with your CV and transcript. Research My research areas include programming languages, formal methods, software engineering, and databases. I am particularly interested in the followings. Program Verification. Given a program (or multiple programs) and a specification, program verification aims to check the program always satisfies the specification. Sample applications: Verifying equivalence of SQL queries [OOPSLA'24], equivalence between SQL and Cypher queries [PLDI'25] Verifying equivalence of database applications [POPL'18] Verifying workflows of smart contracts [VSTTE'19] Program Synthesis. Given a specification, program synthesis aims to generate a program that satisfies the specification. Specifications include input-output examples, logical formulas, natural language descriptions, reference implementations, and their combinations. Sample applications: Evolving database and applications from examples and reference implementations [PLDI'19] [VLDB'20] Helping end-users write database queries [OOPSLA'17][ICSE'25] Assisting developers to explore and analyze programs [UIST'21] [ICLR'22] Optimizing gas consumption of smart contracts [OOPSLA'22] Teaching CMPT 477 / 777 Formal Verification, Fall 2025 CMPT 489 / 980 Special Topics in Programming Languages: Program Synthesis, Fall 2025 CMPT 383 Comparative Programming Languages, Spring 2025 CMPT 477 / 777 Formal Verification, Fall 2024 CMPT 489 / 980 Special Topics in Programming Languages: Program Synthesis, Fall 2024 CMPT 383 Comparative Programming Languages, Spring 2024 CMPT 477 / 777 Formal Verification, Fall 2023 CMPT 489 / 980 Special Topics in Programming Languages: Program Synthesis, Fall 2023 CMPT 383 Comparative Programming Languages, Spring 2023 CMPT 477 / 777 Formal Verification, Fall 2022 CMPT 383 Comparative Programming Languages, Spring 2022 CMPT 777 Formal Verification, Fall 2021 Students Yang He (PhD student, 09/2022 -- Present) Qikang Liu (PhD student, 09/2023 -- Present) Xiaoyu Liu (PhD student, 01/2024 -- Present) Jingqian Liu (PhD student, 09/2024 -- Present) David Deng (MSc student, 09/2024 -- Present) Yanming Liu (GDDP student, 01/2025 -- 04/2025) Pinhan Zhao (Undergrad from NYU, 06/2022 -- 04/2023, external collaboration with Xinyu Wang from UMich) Byeongguk Kwak (SFU VPR Undergrad Student Research Award, 05/2023 -- 08/2023) Yanwen Cai (SFU VPR Undergrad Student Research Award, 05/2023 -- 08/2023) Jiangrong Liu (Remote intern from HUST, 10/2023 -- 06/2024) Jashanraj Gosain (SFU SoSy Capstone student, 01/2024 -- 08/2024) Evan Dyce (NSERC Undergrad Student Research Award, 05/2024 -- 08/2024) Ruijie Wang (Mitacs Globalink Internship Program, 05/2025 -- 08/2025) Publications Graphiti: Bridging Graph and Relational Database Queries. PLDI'25 Yang He, Ruijie Fang, Isil Dillig, Yuepeng Wang [paper][extended version][artifact] Polygon: Symbolic Reasoning for SQL using Conflict-Driven Under-Approximation Search. PLDI'25 Pinhan Zhao, Yuepeng Wang, Xinyu Wang [paper][extended version] Synthesizing Document Database Queries using Collection Abstractions. ICSE'25 Qikang Liu, Yang He, Yanwen Cai, Byeongguk Kwak, Yuepeng Wang [paper][extended version][artifact] Formalization, Implementation, and Verification of the Bluetooth L2CAP State Machine. MobiCom'25 Tan Khang Le, Mohammad Omidvar Tehrani, Yuepeng Wang, Jianliang Wu, Steven Y. Ko [paper] From Batch to Stream: Automatic Generation of Online Algorithms. PLDI'24 Ziteng Wang, Shankara Pailoor, Aaryan Prakash, Yuepeng Wang, Isil Dillig [paper] VeriEQL: Bounded Equivalence Verification for Complex SQL Queries with Integrity Constraints. OOPSLA'24 Yang He*, Pinhan Zhao*, Xinyu Wang, Yuepeng Wang Distinguished Paper Award [paper][extended version][artifact] Demonstration of the VeriEQL Equivalence Checker for Complex SQL Queries. VLDB'24 Demo Pinhan Zhao*, Yang He*, Xinyu Wang, Yuepeng Wang [paper] Verifying Declarative Smart Contracts. ICSE'24 Haoxian Chen, Lan Lu, Brendan Massey, Yuepeng Wang, Boon Thau Loo [paper] Semantic Code Refactoring for Abstract Data Types. POPL'24 Shankara Pailoor, Yuepeng Wang, Isil Dillig [paper] Synthesis-Powered Optimization of Smart Contracts via Data Type Refactoring. OOPSLA'22 Yanju Chen*, Yuepeng Wang*, Maruth Goyal, James Dong, Yu Feng, Isil Dillig [paper] Declarative Smart Contracts. FSE'22 Haoxian Chen, Gerald Whitters, Mohammad Javad Amiri, Yuepeng Wang, Boon Thau Loo [paper] CodeTrek: Flexible Modeling of Code using an Extensible Relational Representation. ICLR'22 Pardis Pashakhanloo, Aaditya Naik, Yuepeng Wang, Hanjun Dai, Petros Maniatis, Mayur Naik [paper] Automatic Repair for Network Programs. TACAS'22 Lei Shi, Yuepeng Wang, Boon Thau Loo, Rajeev Alur [paper] Sporq: An Interactive Environment for Exploring Code Using Query-by-Example. UIST'21 Aaditya Naik, Jonathan Mendelson, Nate Sands, Yuepeng Wang, Mayur Naik, Mukund Raghothaman [paper] Synthesizing Data Structure Refinements from Integrity Constraints. PLDI'21 Shankara Pailoor, Yuepeng Wang, Xinyu Wang, Isil Dillig [paper] Data Migration using Datalog Program Synthesis. VLDB'20 Yuepeng Wang, Rushi Shah, Abby Criswell, Rong Pan, Isil Dillig [paper] [extended version] Synthesizing Database Programs for Schema Refactoring. PLDI'19 Yuepeng Wang, James Dong, Rushi Shah, Isil Dillig [paper] [extended version] Formal Verification of Workflow Policies for Smart Contracts in Azure Blockchain. VSTTE'19 Yuepeng Wang, Shuvendu Lahiri, Shuo Chen, Rong Pan, Isil Dillig, Cody Born, Immad Naseer, Kostas Ferles [paper] Relational Program Synthesis. OOPSLA'18 Yuepeng Wang, Xinyu Wang, Isil Dillig [paper] [extended version] Verifying Equivalence of Database-Driven Applications. POPL'18 Yuepeng Wang, Isil Dillig, Shuvendu Lahiri, William Cook [paper] [extended version] SQLizer: Query Synthesis from Natural Language. OOPSLA'17 Navid Yaghmazadeh, Yuepeng Wang, Isil Dillig, Thomas Dillig Distinguished Paper Award [paper] Component-Based Synthesis for Complex APIs. POPL'17 Yu Feng, Ruben Martins, Yuepeng Wang, Isil Dillig, Thomas Reps [paper] [extended version] Hunter: Next-Generation Code Reuse for Java. FSE'16 Demo Yuepeng Wang, Yu Feng, Ruben Martins, Arati Kaushik, Isil Dillig, Steven Reiss [paper] [long version] [poster] Information Exchange with Collision Detection on Multiple Channels. Journal of Combinatorial Optimization 2016 Yuepeng Wang, Yuexuan Wang, Dongxiao Yu, Jiguo Yu, Francis Lau [paper] Mutual Privacy-Preserving Regression Modeling in Participatory Sensing. INFOCOM'13 Kai Xing, Zhiguo Wan, Pengfei Hu, Haojin Zhu, Yuepeng Wang, Xi Chen, Yang Wang, Liusheng Huang [paper] A Localized Backbone Renovating Algorithm for Wireless Ad Hoc and Sensor Networks. INFOCOM'13 Kai Xing, Shuo Zhang, Lei Shi, Haojin Zhu, Yuepeng Wang [paper] Service Program Committee, ICFP'26 Program Committee, POPL'26 Program Committee, SAS'25 Review Committee, PLDI'24 Review Committee, OOPSLA'24 Reviewer, IEEE Transactions on Software Engineering, 2024 Reviewer, ACM Transactions on Software Engineering and Methodology, 2023 Reviewer, IEEE Transactions on Software Engineering, 2023 Program Committee, ECOOP'23 Distinguished Reviewer Award Program Committee, VSTTE'23 External Review Committee + Artifact Evaluation Committee, OOPSLA'23 Program Committee, SRC@POPL'23 Web Co-Chair, POPL'23 Reviewer, SRC@SPLASH'22 Program Committee, VSTTE'22 Program Committee, PLDI'22 Web Co-Chair, POPL'22 Artifact Evaluation Committee, CAV'20 Artifact Evaluation Committee, POPL'20",
  "content_length": 8140,
  "method": "requests",
  "crawl_time": "2025-12-01 14:53:35"
}