{
  "name": "Yufei Tao 0001",
  "homepage": "http://www.cse.cuhk.edu.hk/~taoyf",
  "status": "success",
  "content": "Welcome to Yufei Tao's Homepage Yufei Tao Professor and University Senate Member Dept. of Computer Science and Engineering The Chinese University of Hong Kong Office: RM 1011, Ho Sin-Hang Engineering Building Tel: +852-39438437; Email: taoyf@cse.cuhk.edu.hk Publications General Information Research Interests Yufei Tao's research aims to develop \"small-and-sweet\" algorithms: (i) small: easy to implement for deployment in practice, and (ii) sweet: having non-trivial theoretical guarantees. He particularly enjoys working on problems that arise at the cross-intersection of databases, machine learning, and theoretical computer science. Short Bio Major Awards IEEE Fellow (Class of 2024) ICDT Best Paper Award 2023 GEMS of PODS 2022 ACM Fellow (Class of 2020) PODS Best Paper Award 2018 SIGMOD Best Paper Award 2015 SIGMOD Best Paper Award 2013 Hong Kong Young Scientist Award 2002 All Research-Oriented Awards Remark on Coauthorships I value healthy collaborations and take authorships seriously. Every coauthor in my papers needs to make a substantial amount of contributions. Students are reminded that their advisors, if without major contributions, will be left out from the author list. Teaching Awards Vice-Chancellor's Exemplary Teaching Award 2021 Dean's Exemplary Teaching Award 2018, 2021 Past Courses at CUHK ENGG1410 Linear Algebra and Vector Calculus CSCI2100 Data Structures BMEG3120 Database and Security for Biomedical Engineering CSCI3160 Design and Analysis of Algorithms CSCI5010 Practical Computational Geometry Algorithms CSCI5020 External Memory Data Structures CSCI5610 Advanced Data Structures CMSC5724 Data Mining and Knowledge Discovery To CUHK students: I would consider writing you a recommendation letter for graduate schools only if you meet these conditions. Graduate Supervision I believe in supervising a very small number of PhD students simultaneously. In my career, the number has never exceeded 3 and is usually 1. Currently, there is a PhD opening under my supervision. Applications can be sent in by email, and are accepted until the position is filled. Each application must include a detailed transcript (of the applicant's undergraduate study) and a CV that lists the applicant's awards (since high school) and publications. Applicants with background in math or theoretical algorithms are especially welcome. The accepted student is expected to research on both practical and theoretical algorithms on large-scale data. Ongoing Sangsiri Nawapon (since 2025) Tingting Duan (since 2025) Graduated Dr. Ru Wang (PhD 2025) Dr. Shiyuan Deng (PhD 2024) Prof. Shangqi Lu (PhD 2022) Dr. Junhao Gan (PhD 2017) Dr. Xiaocheng Hu (PhD 2015) Dr. Cheng Sheng (PhD 2012) Prof. Xiaokui Xiao (PhD 2008) In memory of my student Yu Wang I also worked with M.Phil. students Jiexing Li, Ling Ding, Xiaobing Wu, Sze Man Yuen, Jeonghun Yoon, and Hao Wu. Professional Services Editor-in-Chief of ACM Transactions on Database Systems (TODS), 2025-now Associate Editorships ACM Transactions on Spatial Algorithms and Systems (TSAS), 2022-now Computer Science Review (CSR), 2021-now ACM Transactions on Database Systems (TODS), 2008-2015 IEEE Transactions on Knowledge and Data Engineering (TKDE), 2012-2014 Program Chairmanships (full list) PC chair of PODS 2020 PC co-chair of ICDE 2014 Program Committee Memberships Keynote Speaker of ICDT 2016 (full list)",
  "content_length": 3377,
  "method": "requests",
  "crawl_time": "2025-12-01 14:53:35"
}