{
  "name": "Yufeng Zhang 0001",
  "homepage": "http://csee.hnu.edu.cn/people/zhangyufeng",
  "status": "success",
  "content": "张羽丰-湖大信息科学与工程学院 教师登录 English 返回首页 学院概况 学院简介 学院领导 师资力量 机构设置 决策机构 教学单位 计算机科学系 软件工程系 通信工程系 信息工程系 计算机工程系 网络空间安全系 实验中心 基础教学部 研究机构 特色学院 条件装备 办事机构 人才培养 本科培养 研究生培养 博士生培养 留学生培养 学科专业方向 科学研究 科研项目 科研成果 成果转化 学术信息 工作流程 招生就业 本科招生 硕士招生 博士招生 学生就业 实习就业基地 学生工作 学生动态 学生党建 团学工作 日常管理 心理健康 奖励工作 社团组织 党群工作 党建工作 工会工作 关工委工作 学术资源 资源管理系统 精品课程 实验仪器设备 张羽丰 我的位置在： 首页 > 学院概况 > 师资力量 > 张羽丰 教师介绍 现任湖南大学信息科学与工程学院教授，博士生导师，岳麓学者，中国计算机学会形式化方法专委会委员。本硕博毕业于国防科技大学计算机学院。2020年加入湖南大学信息科学与工程学院。研究方向为高可信软件、程序分析与测试、人工智能。主持国家自然科学基金青年/面上项目、工信部某重大专项子课题、CCF-华为胡杨林基金等多项项目，参与多项973、863、核高基、科技部重点研发、国防预研等项目。在ICSE、ASE、FSE、ISSTA、ISSRE、IEEE-TSC、NeurIPS、TKDE等顶级国际会议及期刊上发表论文十余篇。 中文名： 张羽丰 英文名： 学历： 博士 职称： 教授 联系电话： 电子邮件： yufengzhang@hnu.edu.cn 研究方向： 高可信软件、程序分析与测试、人工智能 联系地址： 湖南省长沙市湖南大学信息科学与工程学院 所属机构： 计算机科学系 学院教师 教学 2025年，数据结构与算法。2024年，数据结构与算法。2023年，计算理论导引。2022年秋，计算理论导引。2022年春，计算理论导引。2021年春，计算理论导引。推荐课程：MIT 计算理论导引：https://ocw.mit.edu/courses/18-404j-theory-of-computation-fall-2020/，《计算理论导引》作者Professor Michael Sipser 的课程。 CMU 程序分析课程：https://cmu-program-analysis.github.io/2021/，内容涵盖数据流分析、抽象解释、程序验证、符号执行、SMT求解等。The Fuzzing Book：https://www.fuzzingbook.org/，内容涵盖模糊测试与符号执行。(B站上也有视频） 学生培养 课题组招收程序分析与测试、编译优化、人工智能方向2026届博士/硕士生，欢迎来信~欢迎基本功扎实、有科研热情的同学报考！硕士报考条件：1.思想品德端正。2.基础理论扎实：如果本科为计算机专业，需熟练掌握以下专业核心课程：算法设计与分析、离散数学、编译原理、操作系统。如果学过数值计算或者数值优化更佳；3.动手能力强，掌握C/C++/Java/Python等至少一门语言；如果本科非计算机专业，需要有对应的实践能力；4.对程序静/动态分析、软件测试感兴趣；或者对人工智能及其在软件可信性领域的应用感兴趣；5.对科研有热情，对探索未知有兴趣 ，有主动学习的习惯；6.乐于交流和讨论问题；*这一条尤其重要*；博士报考条件：1.数理基础扎实；2.动手能力强；3.具有较好的英语水平，满足论文阅读与写作的需要；4.real interested in research。同时欢迎有兴趣参加科研的本科生加入~联系方式：yufengzhang@hnu.edu.cn，yuffonzhang@163.com对有志于攻读硕士博士学位的同学，请尽早与我联系。我会手把手亲自指导学生，帮助学生选题、设计思路、定期讨论课题进展、设计实现方案、设计实验、修改论文。鼓励学生在中国计算机学会推荐国际学术会议和期刊和一流期刊上发表论文。时间无价，请不要在读学位期间浪费时间。 学术论文 - Yufeng Zhang, Jialu Pan, Wanwei Liu, Zhenbang Chen, Kenli Li, Ji Wang, Zhiming Liu. Kullback-Leibler Divergence-Based Out-of-Distribution Detection  with Flow-Based Generative Models. IEEE Transactions on Knowledge and Data Engineering, 2024. (CCF A类期刊)- Yufeng Zhang, Jialu Pan, Wanwei Liu, Zhenbang Chen, Xinwang Liu, Kenli Li, Ji Wang. On the Properties of Kullback-Leibler Divergence Between Multivariate Gaussian Distributions. Thirty-seventh Conference on Neural Information Processing Systems (NeurIPS 2023, CCF A类会议)- Weiyu Pan, Zhenbang Chen, Guofeng Zhang, Yunlai Luo, Yufeng Zhang, Ji Wang. Grammar-Agnostic Symbolic Execution by Token Symbolization, in 30th ACM SIGSOFT International Symposium on Software Testing and Analysis (ISSTA 2021). - Zhenbang Chen, Zehua Chen, Ziqi Shuai, Guofeng Zhang, Weiyu Pan, Yufeng Zhang, Ji Wang. Synthesize Solving Strategy for Symbolic Execution, in 30th ACM SIGSOFT International Symposium on Software Testing and Analysis (ISSTA 2021). - Ziqi Shuai, Zhenbang Chen, Yufeng Zhang, Jun Sun, Ji Wang. Type and Interval aware Array Constraint Solving for Symbolic Execution, in 30th ACM SIGSOFT International Symposium on Software Testing and Analysis (ISSTA 2021，CCF A类会议)- Yufeng Zhang*, Zhenbang Chen*, Ziqi Shuai, Tianqi Zhang, Kenli Li, Ji Wang. Multiplex Symbolic Execution: Exploring Multiple Paths by Solving Once. The 35th IEEE/ACM International Conference on Automated Software Engineering (ASE 2020, CCF A类会议).- Tianqi Zhang, Yufeng Zhang, Zhenbang Chen, Ziqi Shuai, Ji Wang. Efficient Multiplex Symbolic Execution with Adaptive Search Strategy. The 35th IEEE/ACM International Conference on Automated Software Engineering (ASE 2020, Late Break Result).- Zehua Chen, Zhenbang Chen, Ziqi Shuai, Yufeng Zhang, Weiyu Pan. Synthesizing Smart Solving Strategy for Symbolic Execution. The 35th IEEE/ACM International Conference on Automated Software Engineering (ASE 2020, Late Break Result).- Hengbiao Yu, Zhenbang Chen, Yufeng Zhang, Ji Wang, Wei Dong. RGSE: A Regular Property Guided Symbolic Executor for Java. Proceedings of the 2017 11thJoint Meeting on Foundations of Software Engineering (FSE 2017, CCF A类会议).- Yufeng Zhang, Zhenbang Chen, Ji Wang, Wei Dong, Zhiming Liu. Regular Property Guided Dynamic Symbolic Execution. 37th IEEE/ACM International Conference on Software Engineering (ICSE 2015, CCF A类会议).- Xianjin Fu, Zhenbang Chen, Yufeng Zhang, Chun Huang, Wei Dong, Ji Wang. MPISE: Symbolic Execution of MPI Programs. IEEE 16th International Symposium on High Assurance Systems Engineering (HASE 2015).- Hong Zhu， Yufeng Zhang. A Test Automation Framework for Collaborative Testing of Web Service Dynamic Compositions. Springer's Handbook on WebServices, 2014.- Yufeng Zhang, Zhenbang Chen, Ji Wang. Speculative Symbolic Execution. IEEE 23rd International Symposium on Software Reliability Engineering (ISSRE 2012，CCF B类会议).- Hong Zhu, Yufeng Zhang. Collaborative Testing of Web Services. IEEE Transactions on Services Computing, 2013.- Yufeng Zhang，Zhenbang Chen，Ji Wang. S2PF: Speculative symbolic PathFinder. ACM SIGSOFT Software Engineering Notes, 2012 (CCF C类).- Yufeng Zhang, Hong Zhu. An Intelligent Broker Approach to Semantics-Based Service Composition. IEEE 35th Annual Computer Software and Applications Conference (COMPSAC 2011, CCF C类). 湖大官网 湖大微信 湖大微博 版权所有©湖南大学2017          湖南大学党委宣传部          地址：湖南省长沙市岳麓区麓山南路麓山门          邮编：410082          Email：xiaoban@hnu.edu.cn          域名备案信息：[www.hnu.edu.cn,www.hnu.cn/湘ICP备05000239号]          [hnu.cn 湘教QS3-200503-000481 hnu.edu.cn 湘教QS4-201312-010059]",
  "content_length": 5276,
  "method": "requests",
  "crawl_time": "2025-12-01 14:53:36"
}