{
  "name": "Yuguang Wang 0001",
  "homepage": "https://yuguangwang.github.io",
  "status": "success",
  "content": "Yu Guang Wang Home Publication Seminars Group Service Teaching Honor Funding Yu Guang Wang Associate Professor Institute of Natural Sciences School of Mathematical Sciences Shanghai Jiao Tong University Adjunct Associate Professor Shanghai AI Lab Adjunct Associate Professor UNSW Sydney Email: Mail: yuguang.wang@sjtu.edu.cn Institute of Natural Sciences Shanghai Jiao Tong University 361, Build. No.6, Science Buildings No. 800 Dongchuan Road, Minhang District Shanghai 200240, China Introduction I am an Associate Professor in Institute of Natural Sciences, School of Mathematical Sciences, Department of Computer Science and Engineering, and Key Lab of Scientific and Engineering Computing of Minister of Education (MOE-LSC), at Shanghai Jiao Tong University. I am Adjunct Associate Professor at Shanghai AI Laboratory and UNSW Sydney. My research interests lie in artificial intelligence, computational mathematics, statistics and data science. In particular, I am working on geometric deep learning, graph neural networks, applied harmonic analysis, Bayesian inference, information geometry, numerical analysis, and applications to biomedicine and protein design. Previously, I was a research scientist at Max Planck Institute for Mathematics in Sciences, in Prof Guido Montufar's Deep Learning Theory Group. I obtained my PhD in applied mathematics from University of New South Wales under supervision of Prof Ian Sloan and Rob Womersley. I am a recipient of ICERM Semester Postdoctoral Fellowship of Brown University (2018), a long-term IPAM visitor of UCLA (2019), and long-term visitor of AI Group of Prof Pietro Lio at Univeristy of Cambridge (2022). News [Paper] \"Harnessing TME depicted by histological images to improve the cancer prognosis through a deep learning system\" is accepted by Cell Reports Medicine. Congrats, Ruitian! [Benchmark] ProteinLMBench is released in 8 April 2024. The first evaluation system for LLM for Protein Engineering in the world! [Platform] TourSynbio Protein LLM is released in 8 April 2024. The first ChatGPT for Protein Design in China! [Paper] GraDe-IF paper joint with Kai, Zhou, Shen and Lio has been accepted in NeurIPS 2023. It provides a GNN-based diffusion model for inverse protein folding. Congrats! [Paper] ACMP paper joint with Yuelin, Kai, Xinliang and Shi has been accepted in ICLR 2023 as a Spotlight Paper. Also Oral Presentation in NeurIPS 2022 Workshop on New Frontiers in Graph Learning. Congrats! [Member] Jialin has been awarded Outstanding Graduate of Shanghai! She is going to pursue PhD in CS in Yale Univeristy in her next career stage. Big Congrats! [Member] Xuebin's PhD thesis on graph neural networks with wavelet analysis has been approved by the University of Sydney! Congrats, Dr Zheng! Current Research Interests Artificial Intelligence: Graph Neural Networks, Geometric Deep Learning, Large Language Model, Information Geometry, Optimization Algorithms, Distributed Learning, Generative Models, Topological Data Analysis, Expressivity and Generalization of Deep Neural Networks, Kernel Methods, Reinforcement Learning Applied Math and Statistics: Applied Harmonic Analysis, Signal Processing, Bayesian Statistics, Computational Geometry, SDEs Interdisciplinary: AI for Sciences, AI for Mathematics, AI for Health/Medicine, AI for Synbio and Protein Design, Cosmic Microwave Background (CMB) Publications List of publications can be found at my Google Scholar. Book Chapter Analysis of Framelet Transforms on Simplex. Y. G. Wang, H. Zhu. Contemporary Computational Mathematics: a Celebration for the 80th Birthday of Ian Sloan. Editors: Josef Dick, Frances Y. Kuo, Henryk Wozniakowski, Publisher: Springer, 2018. Technical Report White Paper: Geometry and Learning from Data in 3D and Beyond. P. Kr. Banerjee, Y. G. Wang et al. Technical Report, UCLA IPAM Long Program, Spring 2019. Selected Papers Harnessing TME depicted by histological images to improve cancer prognosis through a deep learning system. R. Gao, X. Yuan, Y. Ma, T. Wei, L. Johnston, Y. Shao, W. Lv, T. Zhu, Y. Zhang, J. Zheng, G. Chen, J. Sun, Y. G. Wang, Z. Yu. Cell Reports Medicine 2024. Graph Denoising Diffusion for Inverse Protein Folding. Y. Kai, B. Zhou, Y. Shen, P. Lio, Y. G. Wang. NeurIPS 2023. EqMotion: Equivariant Multi-agent Motion Prediction with Invariant Interaction Reasoning. C. Xu, R. T. Tan, Y. Tan, S. Chen, Y. G. Wang, X. Wang, Y. Wang. CVPR 2023. How powerful are shallow neural networks with bandlimited random weights? M. Li, S. Sho, F. Cao, Y. G. Wang, J. Liang. ICML 2023. Robust Graph Representation Learning for Local Corruption Recovery. B. Zhou, Y. Jiang, Y. G. Wang, J. Liang, J. Gao, S. Pan, X. Zhang. WWW 2023 (Also in ICML 2022 Workshop on Topology, Algebra, and Geometry in Machine Learning). ACMP: Allen-Cahn Message Passing with Attractive and Repulsive Forces for Graph Neural Networks. Y. Wang, K. Yi, X. Liu, Y. G. Wang, S. Jin. ICLR 2023 (Spotlight) (Also in NeurIPS 2022 Workshop on New Frontiers in Graph Learning) Lightweight Equivariant Graph Representation Learning for Protein Engineering. B. Zhou, O. Lv, K. Yi, X. Xiong, L. Hong, Y. G. Wang. NeurIPS 2022 Workshop on Machine Learning in Structral Biology Cell Graph Neural Networks Enable Digital Staging of Tumour Microenvironment and Precisely Predict Patient Survival in Gastric Cancer. Y. Wang, Y. G. Wang, C. Hu, M. Li, Y. Fan, N. Otter, I. Sam, H. Gou, Y. Hu, T. Kwok, J. Zalcberg, A. Boussioutas, R. J. Daly, G. Montufar, P. Lio, D. Xu, G. I. Webb, J. Song. npj Precision Oncology 2022. Weisfeiler and Lehman Go Cellular: CW Networks. C. Bodnar, F. Frasca, N. Otter, Y. G. Wang, P. Lio, G. Montufar, M. Bronstein. NeurIPS 2021. Distributed Learning via Filtered Hyperinterpolation on Manifolds. G. Montufar, Y. G. Wang. Foundations of Computational Mathematics 2021. How Framelets Enhance Graph Neural Networks. X. Zheng, B. Zhou, J. Gao, Y. G. Wang, P. Lio, M. Li, G. Montufar. ICML 2021 (Spotlight). Code Weisfeiler and Lehman Go Topological: Message Passing Simplicial Networks. C. Bodnar, F. Frasca, Y. G. Wang, N. Otter, G. Montufar, P. Lio, M. Bronstein. ICML 2021 (Spotlight). (Also as a Spotlight in ICLR 2021 Workshop on GTRL). Decimated Framelet System on Graphs and Fast G-Framelet Transforms. X. Zheng, B. Zhou, Y. G. Wang, X. Zhuang. Journal of Machine Learning Research 2022. Code Algorithm 1018: FaVeST-Fast Vector Spherical Harmonic Transforms. M. Li, Q. T. Le Gia, Y. G. Wang. ACM Transactions on Mathematical Software 2021. Code also in CALGO (see file 1018.gz) Improve Concentration of Frequency and Time by Novel Complex Spherical Designs. M. Sourisseau, Y. G. Wang, R. S. Womersley, H.-T. Wu, W.-H. Yu. Applied and Computational Harmonic Analysis 2021. Code Distributed Filtered Hyperinterpolation For Noisy Data on the Sphere. S.-B. Lin, Y. G. Wang, D.-X. Zhou. SIAM Journal on Numerical Analysis 2021. Path Integral Based Convolution and Pooling for Graph Neural Networks. Z. Ma, J. Xuan, Y. G. Wang, M. Li, P. Lio. NeurIPS 2020. Code Haar Graph Pooling. Y. G. Wang, M. Li, Z. Ma, G. Montufar, X. Zhuang, Y. Fan. ICML 2020. Code Tight Framelets and Fast Framelet Filter Bank Transforms on Manifolds. Y. G. Wang, X. Zhuang. Applied and Computational Harmonic Analysis, 48(1): 64–95, 2020. Isotropic Sparse Regularization for Spherical Harmonic Representations of Random Fields on the Sphere. Q. T. Le Gia, I. H. Sloan, R. S. Womersley, Y. G. Wang. Applied and Computational Harmonic Analysis, 49(1): 257–278, 2020. Fully Discrete Needlet Approximation on the Sphere. Y. G. Wang, Quoc T. Le Gia, I. H. Sloan, R. S. Womersley. Applied and Computational Harmonic Analysis, 43: 292–316, 2017. Code Group Members I am hiring PhD/Masters students in Graph Neural Networks, Geometric Deep Learning, NLP and AI for Science (in particular on AI for Protein Design and AI for Synbio): model, algorithm, theory and applications, from mathematics and computer science. Postgraduate candidates can jointly affiliate with Institute of Natural Sciences (INS) with School of Mathematical Sciences or Department of Computer Science and Engineering, Shanghai Jiao Tong University. PhD Hanwen Liu, 2022-, Shanghai Jiao Tong University, INS & Math, research on computational mathematics, deep learning, GNNs Hao Chen, 2022-, Shanghai Jiao Tong University, INS & Stats, research on causality, deep learning theory (joint with Prof Lin Liu) Chutian Zhang, 2021-, Shanghai Jiao Tong University, INS & Math, research on GNNs, geometric deep learning Yahao Ding, 2023-, Shanghai Jiao Tong University, CS, research on LLM, transformer, GNNss Yuelin Wang, 2020-, Shanghai Jiao Tong University, research on theory and algorithms for geometric deep learning (joint with Prof Shi Jin) Kai Yi, 2020-, UNSW Statistics and Data Science, research on deep Bayesian learning, graph neural networks, (joint with A/Prof Yanan Fan, Dr Jan Hamann) Master Chutian Zhang, Shanghai Jiao Tong University, INS & Math, research on theory of GNNs, 2021 Alumni Xinye Xiong  (Master, Shanghai Jiao Tong University) Xinliang Liu (Postdoc, now at KAUST) Yuehua Liu (Postdoc, now at Philips Research) Xuebin Zheng (PhD, University of Sydney, now at EcoPlants) Jialin Chen (Honors, Shanghai Jiao Tong University, now at Yale University in CS) Yiqing Shen (Honors, Shanghai Jiao Tong University, now at Johns Hopkins University in CS) Recent and Upcoming Events Regular Seminars • AI Group Seminar, University of Cambridge, 2023. • Distinguished Lectures and INS Colloquia, INS, SJTU, Online, 2022. • AI + Math Colloquia, INS, SJTU, Online, 2022. • Deep Learning Theory & Math Machine Learning Seminar, MPI MIS + UCLA, Online, 2022. • Machine Learning + X Seminars, Brown University, Online, 2022. • M2D2: Molecular Modeling And Drug Discovery, Mila & Valence, Online, 2022. Workshop and Conference • Applied Geometry for Data Sciences, Institute for Mathematical Sciences, National University of Singapore, 30 September - 12 October 2024. • Biomolecular Topology: Modelling an",
  "content_length": 14660,
  "method": "requests",
  "crawl_time": "2025-12-01 14:53:37"
}