{
  "name": "Yuhan Luo",
  "homepage": "https://yuhanlolo.github.io/me",
  "status": "success",
  "content": "YUHAN LUO YUHAN LUO About Publication BiWell Lab Teaching Misc. Assistant Professor CS@CityUHK Y6422 Yeung Kin Man Bldg yuhanluo@cityu.edu.hk News & Travel 2025.07 - ACM DIS, Madeira, Portugal 2025.06 - Talk & KLIC group visit@MSRA Hong Kong - SIGCHI Asia Summer School, Bangkok, Thailand - One paper accepted to CSCW 2025.05 - One paper accepted to IJHCS 2025.04 - ACM CHI, Yokohama, Japan - One paper accepted to CUI '25 - One paper accepted to DIS '25 2025.01 Two papers accepted to CHI '25 I'm a Human-Computer Interaction (HCI) researcher, currently an assistant professor appointed by the Department of Computer Science at City University of Hong Kong since 2022. My research seeks to enhance individuals' everyday health and well-being through unlocking the potential of ubiquitous computing technologies. I build multimodal systems (e.g., speech interfaces, chatbots) to support self-tracking, design interventions to encourage health behaviors, and explore opportunities for utilizing personal data in healthcare contexts. Short bio: I received my Ph.D. in Information Studies from University of Maryland in 2022 (advised by Dr. Eun Kyoung Choe), MS in Information Science and Technology from Penn State in 2017, and BEng in Computer Science from Southeast University in 2015, respectively. I was a UX researcher intern at Meta (People Engineering) in 2020 and Google (Android) in 2019. Prospective students: please checkout the lab page. Active Projects Human-AI Interaction for Wellbeing • Healthy lifestyle: [cui25-smarteats] [cui25-wip-multi-llm] • Mental health: [chi25-chatlab] [ijhcs25-prompt] • Productivity: [chi24-stayfocused] [idc25-wip-reading] Multimodal Interaction in Personal Informatics • Systematic review: [dis25-reflecting] • Emotion tracking & emotional communication: [chi24-gesture] Service Student Research Competition Co-Chair: ACM CHI 2025 General Co-Chair: Greater Bay Area (GBA) PreCHI 2025 Publication Co-Chair: ACM DIS 2023—2024 Student Volunteer Co-Chair: ACM DIS 2022 Associated Chair (AC) in Program Committee: CHI 2023—2026, CSCW 2023, CHI 2019 LBW Conference Reviewer: ACM CHI 2019—2025, IMWUT 2018—2024, CSCW 2021—2025, DIS 2021, IDC 2020, AIMA 2019 Journal Reviewer: ACM Transactions on Computing for Healthcare 2025; International Journal of Human-Computer Studies (IJHCS) 2025; ACM Transactions on Computing Surveys 2024, human-computer interaction (TOCHI) 2021; JMIR 2020—2021 Last updates: July, 2025",
  "content_length": 2450,
  "method": "requests",
  "crawl_time": "2025-12-01 14:53:37"
}