{
  "name": "Yujie Tang",
  "homepage": "https://web.cs.dal.ca/~yujiet",
  "status": "success",
  "content": "Dr. Yujie Tang's Homepage - Dalhousie University Yujie Tang Assistant Professor, PhD Faculty of Computer Science Dalhousie University Goldberg Building 6050 University Avenue Halifax, NS, Canada B3H 4R2 Email: yujie.tang@dal.ca Office: Room 434 [Home]  [Research]  [Publication]  [Professional Activities]  [Open Position] News Prof. Yujie Tang is now having openings for research positions. Please check the Open Position page for details. Work Experience Assistant Professor (Tenure-Track), Dalhousie University, Halifax, NS, Canada (September 2022 - Present). Assistant Professor (Tenure-Track), Algoma University, Sault Ste. Marie, ON, Canada (July 2019 - August 2022). Post-Doctoral Fellow, University of Waterloo, Waterloo, ON, Canada (October 2017 - June 2019). Education Ph.D., University of Waterloo, Waterloo, Canada. M.E., Harbin Institute of Technology, Shenzhen, China. B.E., Lanzhou Jiaotong University, Lanzhou, China. Brief Biography Dr. Yujie Tang is an Assistant Professor with the Faculty of Computer Science, Dalhousie University, Halifax, NS. Prior to joining Dalhousie, she was an Assistant Professor with the School of Computer Science and Technology at Algoma University, Sault Ste. Marie, ON, from July 2019 to August 2022. She had been a postdoctoral fellow from October 2017 to June 2019 at the Department of Electrical and Computer Engineering, University of Waterloo, ON, working with Prof. Xuemin (Sherman) Shen. She received her Ph.D. degree in Electrical and Computer Engineering from the University of Waterloo, Waterloo, ON, under the supervision of Prof. Jon W. Mark. Her research interests include Internet of Vehicles, resource management in heterogeneous networks, machine learning, software-defined networking, cooperative networking, and cognitive radio networks. She is a member of IEEE, IEEE ComSoC, and IEEE VTS. She has served on the technical committees of several major conferences in networking such as IEEE INFOCOM, GLOBECOM, ICC and VTC. Awards Faculty Research Startup Fund, Dalhousie University, 2022. NSERC Discovery Grant, NSERC, 2021-2026. Algoma University Research Fund, Algoma University, 2021. Faculty Research Startup Fund, Algoma University, 2019. Best Speaker Award in ECE Graduate Student Research Talk, University of Waterloo, 2017. Faculty of Engineering (FoE) Award (four times), University of Waterloo, 2013-2017. University of Waterloo Graduate Scholarship, University of Waterloo, 2013-2015. International Doctoral Student Award, University of Waterloo, 2012-2016. Graduate Research Studentship, University of Waterloo (twice), 2011–2012. Provost Doctoral Entrance Award for Women, University of Waterloo, 2011.",
  "content_length": 2679,
  "method": "requests",
  "crawl_time": "2025-12-01 14:53:41"
}