{
  "name": "Yuji Matsumoto 0001",
  "homepage": "https://www.riken.jp/en/research/labs/aip/goalorient_tech/knowl_acqui/index.html",
  "status": "success",
  "content": "Knowledge Acquisition Team | RIKEN Skip to main content Home Research Centers & Labs RIKEN Center for Advanced Intelligence Project Goal-Oriented Technology Research Group Please enable JavaScript in your browser. RIKEN Center for Advanced Intelligence Project Knowledge Acquisition Team Team Director: Yuji Matsumoto (D.Eng.) Japanese Page Research Summary A huge amount of knowledge is being produced along with the advance of scientific fields. Such expert knowledge is partly organized in domain databases, but a large portion of it is still kept in scholarly documents. It is time-consuming and cumbersome to construct domain databases and to conduct content-aware retrieval of scholarly documents. The Knowledge Acquisition Team aims at text/figure analysis and knowledge extraction from scholarly documents and also at development of infrastructure for content-aware retrieval of scholarly documents through domain database completion, knowledge organization, relation and summarization technologies. Research Subjects: Natural Language Processing Knowledge Acquisition Machine Learning Main Research Fields Informatics Related Research Fields Multidisciplinary Complex Systems Intelligent informatics Keywords Natural Language Processing Knowledge Acquisition Machine Learning Information Extraction Information Retrieval Selected Publications 1. Ukyo Honda, Taro Watanabe, Yuji Matsumoto \"Switching to Discriminative Image Captioning by Relieving a Bottleneck of Reinforcement Learning\" Proceedings of IEEE/CVF Winter Conference on Applications of Computer Vision (WACV), January, 2023 2. Kenichiro Ando, Takashi Okumura, Mamoru Komachi, Hiromasa Horiguchi, Yuji Matsumoto \"Is artificial intelligence capable of generating hospital discharge summaries from inpatient records?\" PLOS Digit Health 1(12): e0000158, December 12, 2022. 3. Hiroki Teranishi, Yuji Matsumoto \"Coordination Generation via Synchronized Text-Infilling\" Proceedings of the 29th International Conference on Computational Linguistics (COLING), pp.5914-5924, October 2022. 4. Ikuya Yamada, Koki Washio, Hiroyuki Shindo, Yuji Matsumoto \"Global Entity Disambiguation with BERT\" Proceedings of the 2022 Annual Conference of the North American Chapter of the Association for Computational Linguistics (NAACL) (Volume 2: Short Papers), pp.3264-3271, Seattle, +Online, July 2022. 5. Yiran Wang, Hiroyuki Shindo, Yuji Matsumoto, Taro Watanabe \"Nested Named Entity Recognition via Explicitly Excluding the Influence of the Best Path\" The Joint Conference of the 59th Annual Meeting of the Association for Computational Linguistics and the 11th International Joint Conference on Natural Language Processing, (ACL-IJCNLP), pp.3547-3557, August 2021. 6. Ukyo Honda, Yoshitaka Ushiku, Atsushi Hashimoto, Taro Watanabe and Yuji Matsumoto \"Denoising Pseudo-Captions in Unsupervised Image Captioning\" Proceedings of the 16th conference of the European Chapter of the Association for Computational Linguistics (EACL), Online, pp. 3692-3702, April, 2021. 7. Vu Tran, Van-Hien Tran, Phuong Minh Nguyen, Chau Minh Nguyen, Ken Satoh, Yuji Matsumoto, Minh Le Nguyen \"CovRelex: A COVID-19 Retrieval System with Relation Extraction\" Proceedings of the 16th conference of the European Chapter of the Association for Computational Linguistics (EACL): System Demonstrations, Online, pp. 24-31, April, 2021. 8. Noriki Nishida, Yuji Matsumoto \"Out-of-Domain Discourse Dependency Parsing via Bootstrapping: An Empirical Analysis on Its Effectiveness and Limitation\" Transaction of the Association for Computational Linguistics (TACL), Vol.10, pp.127-144, February 9, 2022. 9. Yuya Sawada, Takashi Wada, Takayoshi Shibahara, Hiroki Teranishi, Shuhei Kondo, Hiroyuki Shindo, Taro Watanabe and Yuji Matsumoto \"Coordination Boundary Identification without Labeled Data for Compound Terms Disambiguation\" Proceedings of the 28th International Conference on Computational Linguistics (COLING), pp.3043-3049, December 2020. 10. Ikuya Yamada, Akari Asai, Hiroyuki Shindo, Hideaki Takeda, Yuji Matsumoto \"LUKE: Deep Contextualized Entity Representations with Entity-aware Self-attention\" Proceedings of the 2020 Conference on Empirical Methods in Natural Language Processing (EMNLP), pp. 6442-6454, November 2020. Related Links Knowledge Acquisition Team | RIKEN Center for Advanced Intelligence Project Lab Members Principal investigator Yuji Matsumoto Team Director Core members Noriki Nishida Research Scientist Thuy Van Phi Postdoctoral Researcher Rumana Ferdous Munne Postdoctoral Researcher Shanshan Liu Technical Staff I Narumi Tokunaga Technical Staff II Hiroki Ouchi Visiting Scientist Yutaro Shigeto Visiting Scientist Ikuya Yamada Visiting Scientist Junichiro Mori Visiting Scientist Kouji Kozaki Visiting Scientist Akiko Aizawa Visiting Scientist Katsuhito Sudoh Visiting Scientist Kenji Yamauchi Visiting Scientist Yuki Arase Visiting Scientist Takayoshi Shibahara Visiting Scientist Satoshi Sekine Visiting Scientist Shuhei Kurita Visiting Scientist An Tuan Dao Research Part-time Worker I Truong Dinh Do Research Part-time Worker I An Hoang Trieu Research Part-time Worker I Xincan Feng Research Part-time Worker I Guanting Luo Research Part-time Worker I Contact Information Nihonbashi 1-chome Mitsui Building, 15th floor,1-4-1 Nihonbashi, Chuo-ku, TokyoEmail: yuji.matsumoto@riken.jp Top",
  "content_length": 5343,
  "method": "requests",
  "crawl_time": "2025-12-01 14:53:40"
}