{
  "name": "Yujun Yan",
  "homepage": "https://sites.google.com/umich.edu/yujunyan/home",
  "status": "success",
  "content": "Yujun YanSearch this siteEmbedded FilesSkip to main contentSkip to navigationYujun YanAssistant ProfessorDepartment of Computer ScienceDartmouth CollegeOffice: ECSC 215, 15 Thayer DriveHanover, NH 03755-4404Email: first.last at dartmouth dot eduGoogle Scholar | CV | TwitterI am an Assistant Professor at Dartmouth College, where I joined in 2023. My research lies at the intersection of machine learning and network science, with a focus on modeling complex topological structures. I aim to develop more expressive and generalizable graph-based ML models by integrating theoretical insights with practical designs. Beyond foundational work, I explore the application of structural modeling in domains such as neuroscience, knowledge reasoning, and multi-agent systems. I earned my Ph.D. from the University of Michigan, Ann Arbor in 2022, under the supervision of Danai Koutra. I am recruiting Ph.D. students and interns. Many motivated interns have the opportunity to produce a paper or submission during their internship.Please send your CV and transcripts via email if you are interested in working with me. Please apply to our Ph.D. program using this link: Ph.D. in Dartmouth CS.NewsOct. 2025 Congratulations to my undergrad intern, Fabrice M. Niyigaba, on being selected for Francis L. Town Scientific Prize in Computer Science!Sept. 2025 One paper accepted to NeurIPS 2025 as a spotlight. Congratulations to all my co-authors!Sept. 2025 Accept the invitation to serve as an Area Chair at ICLR 2026.Aug. 2025 Two papers accepted to the findings of EMNLP 2025. Congratulations to all my co-authors!Aug. 2025 Serve as the session chair at KDD 2025.June 2025 Glad to receive a funding from DARPA AIQ.May 2025 Congratulations to my undergraduate intern, John Chin, on being selected for the James O. Freedman Presidential Scholars Program!May 2025 One paper is accepted to the findings of ACL 2025! Congrats to the leading author, my PhD student, Xuyuan Liu!May 2025 Two papers are accepted to the Research Track at KDD 2025! Congrats to my intern Gaotang Li and all our amazing collaborators!May 2025 One paper is accepted to ICML 2025! Congrats to my co-authors!Apr. 2025 Serve as a panelist @ Agentic AI for Science workshop, ICLR 2025.Apr. 2025 Accept the invitation to serve as an Area Chair at NeurIPS 2025.Apr. 2025 Give a talk at AAAI 2025 Spring Symposium Series.Mar. 2025 My undergrad intern, Xinjie Shen, will begin his PhD at Georgia Tech.Feb. 2025 Accept the invitation to be the BlueSky Track Co-chair at ICDM 2025! Thrilled to join the organizing committee!Dec. 2024 Congrats to my undergrad intern, Ly Nguyen, on receiving an honorable mention for CRA Outstanding Undergraduate Researcher Awards! Dec. 2024 Our workshop on \"Towards Agentic AI for Science: Hypothesis Generation, Comprehension, Quantification, and Validation\" has been accepted to ICLR and WWW 2025! Thank you to my collaborators. Please stay tuned.Nov. 2024 Give a talk on the Generalizations of GNNs at Applied & Computational Mathematics Seminar.Sept. 2024 Three papers are accepted to NeurIPS 2024! Congrats to my PhD student Xuyuan Liu, my interns Yinghao Cai and Qihui Yang, and my student and faculty collaborators!Sept. 2024 Accept the invitation to give a talk at the 2024 CCN Workshop: Neuroscience and Artificial Intelligence! Looking forward to seeing you at the Hanover Inn on October 21-22.July 2024 One paper is accepted to CIKM 2024!June 2024 Congratulations to my undergraduate intern, Ly Nguyen, on having a paper accepted to the KDD Undergraduate Consortium and on receiving the Lovelace Research Scholarship and the UGAR Conference Grant from Dartmouth!May 2024 Two papers are accepted to ICML 2024! Congratulations to my PhD student, Zheng Huang, on his first paper from our lab and on receiving the ICML travel award!May 2024 My undergrad intern, Gaotang Li, will begin his PhD at UIUC.Dec. 2023 Congrats to my undergrad intern, Gaotang Li, on receiving an honorable mention for CRA Outstanding Undergraduate Researcher Awards! July 2023 Accept the invitation as a session chair @ KDDMay 2023 One paper got accepted to the research track of KDD! Congratulations to my undergrad intern Gaotang Li on his first paper!May 2023 Check out our new preprint on size generalizability of GNNs!April. 2023 Accept the invitation as a reviewer @ NeurIPS 2023, and JMLR, as a panelist at GLB workshop@KDD Mar. 2023 Teach the course CS 74/274 \"Machine Learning & Statistical Data Analysis\"Feb. 2023 Accept the invitation as a reviewer @ ICML 2023Jan. 2023 Accept the invitation as a PC member @ IJCAI 2023Jan. 2023 Teach the course CS 89.23 \"Network Science and Complex Systems\"Previous yearsNov. 2022 Accept the invitation as a Session Chair @ ICDM 2022Nov. 2022 Successfully passed my Ph.D. defense !!!Aug. 2022 Our paper \"two sides of the same coin: heterophily and oversmoothing in graph convolutional neural networks\" is accepted to ICDM 2022Aug. 2022 Accept the invitation as a reviewer @ ICLR 2023Apr. 2022 Talk at DartmouthApr. 2022 Talk at University of ArizonaApr. 2022 Accept the invitation as a reviewer @ NeurIPS 2022Mar. 2022 Talk at Hong Kong University of Science and TechnologyFeb. 2022 Talk at University of Illinois, ChicagoJan. 2022 Our paper \"Augmentations in Graph Contrastive Learning: Current Methodological Flaws & Towards BetterPractices\" is accepted at the WWW 2022Dec. 2021 Accept the invitation as a reviewer @ ICML 2022Oct. 2021 Our paper \"improving semi-supervised federated learning by reducing the gradient diversity of models\" isaccepted at IEEE Big DataOct. 2021 Our paper accepted at 3DVAug. 2021 Accept the invitation as a reviewer @ ICLR 2022June-Aug. 2021 Internship at Microsoft ResearchApr. 2021 Accept the invitation as a reviewer @ NeurIPS 2021Dec. 2020 Poster presentation at NeurIPS 2020 Sept. 2020 Our papers \"Neural Execution Engines: Learning to Execute Subroutines\" and \"Beyond Homophily in Graph                                       Neural Networks: Current Limitations and Effective Designs\" are accepted at NeurIPS 2020! Aug. 2020 A patent application is approved to be filed by GoogleJune - Aug. 2020 Internship at Google ResearchFeb. 2020 A grant is approved based on my work at Google. Congrats Danai on the Google Faculty Research Award!Report abuseReport abuse",
  "content_length": 6311,
  "method": "requests",
  "crawl_time": "2025-12-01 14:53:40"
}