{
  "name": "Yulei Sui",
  "homepage": "https://research.unsw.edu.au/people/associate-professor-yulei-sui",
  "status": "success",
  "content": "Associate Professor Yulei Sui | UNSW Research Skip to main content Researcher Fields of Research (FoR) Software engineering, Software testing, verification and validation Biography Yulei Sui is an Associate Professor and ARC Future Fellow at UNSW. His research interests lie in Software Engineering and Program Analysis. In particular, his research focuses on building open-source frameworks for static analysis and verification techniques to improve software reliability and quality. His recent interest lies at the intersection of software engineering, natural languages and code LLMs. Specifically, his current research...view more Yulei Sui is an Associate Professor and ARC Future Fellow at UNSW. His research interests lie in Software Engineering and Program Analysis. In particular, his research focuses on building open-source frameworks for static analysis and verification techniques to improve software reliability and quality. His recent interest lies at the intersection of software engineering, natural languages and code LLMs. Specifically, his current research projects explore testing, analysis and verification for software systems and AI models. His work has appeared in conferences and journals in program analysis and software engineering. His research has received recognition through a number of Best/Distinguished paper awards at conferences, including ICSE 2025, 2018, FSE 2024, OOPSLA 2020, SAS 2019, and CGO 2013, and has been supported by competitive grants and fellowships such as ARC Discovery Projects, JSPS Invitational Fellowship, and industry awards (Amazon and Google). He is currently an ARC Future Fellow (2023-2026), a UNSW Scientia Fellow and a Fellow of Engineers Australia (FIEAust). He leads the development of SVF, an open-source framework for code analysis and verification, built in collaboration with students and colleagues. His community contributions include service on editorial boards (e.g., Associate Editor for IEEE Transactions on Software Engineering and IEEE Transactions on Reliability) and program committees, as well as program co-chair roles at conferences including LCTES 2024, SAS 2025, and ISSRE 2025. My Grants National Competitive Grants: ARC Discovery Project (DP250101396), Lead CI, Certifying Code Language Models to Fortify Software Engineering Foundations, 2025-2027 ARC Future Fellowship (FT220100391), Solo CI,  Learning Software Security Analysers with Imperfect Data,  2023-2026 ARC Discovery Project (DP210101348), Lead CI, Learning to Pinpoint Emerging Software Vulnerabilities, 2021-2023 ARC Discovery Project (DP200101328), 2nd CI, Adversarial Learning of Hybrid Representation, 2020-2022 ARC DECRA (DE170101081), Solo CI, Adaptive Value-Flow Analysis to Improve Code Reliability and Security, 2017 - 2019 Other Grants: Amazon Research Award Grant, Solo CI, Path-Sensitive Typestate Analysis via Sparse Abstract Execution, 2025 Google Aspire Grant, Lead CI, Cross-Component Cross-Language Static Analysis, 2023 CSIRO Tech4HSE project, Lead CI, Software-Hardware Co-Design for AI Applications, 2024-2026 UNSW-UTS TDS Grant, UNSW Lead CI, Metric Visualization Framework for Customer Trust Satisfaction, 2025-2026 Data61's PhD scholarship, Lead CI, Certified AI for Correctness and Robustness, 2023-2026 Data61's PhD scholarship, Lead CI, Privacy Preserving Deep Learning, 2023-2026 My Qualifications Ph.D. in Computer Science from UNSW Sydney My Awards 2025            Amazon Research Award (ARA) 2025            Distinguished Paper Award, 47th International Conference on Software Engineering (ICSE 2025) 2024            Distinguished Paper Award, International Conference on the Foundations of Software Engineering (FSE 2024) 2024            Fellow of Engineers Australia (FIEAust) 2023-2026  ARC Future Fellow 2023            UNSW Scientia Fellow 2023            Google ASPIRE Award 2022            JSPS Invitational Fellowship 2021            ICSE 2021 Distinguished Reviewer 2020            ACM SIGPLAN Distinguished Paper Award (OOPSLA 2020) 2020            ISSRE Best Paper Nominee (ISSRE 2020) 2019            Radhia Cousot Best Paper Award (SAS 2019) 2018            ACM SIGSOFT Distinguished Paper Award (ICSE 2018) My Engagement External: Associate Editor, IEEE Transactions on Software Engineering Associate Editor, IEEE Transactions on Reliability Program Chair of 25th ACM SIGPLAN/SIGBED International Conference on Languages, Compilers, and Tools for Embedded Systems (LCTES 2024) Program Co-Chair of 32nd Static Analysis Symposium (SAS 2025) Program Co-Chair of 36th IEEE International Symposium on Software Reliability Engineering. (ISSRE 2025) Internal: Postgraduate Coordinator, School of Computer Science and Engineering Member, Higher Degree Committee, Faculty of Engineering View less Location Engineering Follow My Google Scholar Publications by Associate Professor Yulei Sui Book Chapters 2 Journal articles 52 Conference Papers 85 Preprints 1 View all » ORCID as entered in ROS https://orcid.org/0000-0002-9510-6574 UNSW Sydney NSW 2052 Australia Telephone +61 2 93851000 Authorised by Deputy Vice-Chancellor (Research) UNSW CRICOS Provider Code: 00098G ABN: 57 195 873 179 Join the conversation Facebook Twitter UNSW Youtube LinkedIn Pinterest Instagram Member Group of Eight Member Universitas 21 Member Global Alliance of Technological Universities Member Association of Pacific Rim Universities MemberPLuS Alliance Home 2025 Strategic Initiatives SHARP UNSW Futures Interdisciplinary Research World Class Research Infrastructure Grand Challenges Thought Leadership & Public Engagement Knowledge Exchange ARTU - Aggregate Ranking of Top Universities Contact Us Deputy Vice-Chancellor (Research & Enterprise) Pro Vice-Chancellor (Research) Graduate Research Scholarships Applying for a Scholarship External Scholarships How to apply Higher Degree Research Programs Submitting an Application Finding a Supervisor Fees and Costs FAQs Thesis Thesis Preparation Examination Graduation Help and Advice Arc UNSW – Postgraduate Council Arc UNSW – Student Life Financial Support New to UNSW Research Events & Workshops Study with Us Research Training Extend Your Career Networks New to UNSW Research Research Career Opportunities Research Impact UNSW Areas of Research Strength Biomedical Sciences Contemporary Humanities and Creative Arts Defence and Security Fundamental and Enabling Sciences ICT, Robotics and Devices Law, Business and Economics Next Generation Materials and Technologies Social Policy, Government and Health Policy Water, Climate, Environment and Sustainability Fellows of Learned Academies Research News & Stories Research Integrity Research Ethics & Compliance Support Research Integrity for Staff Supervisors and Research Integrity Research Ethics and Compliance Support Animal Research Ethics Human Research Ethics Radiation Safety Research Export Controls Research Strategy Office About the RSO Partner with us Contact Us Partner With Us Services for Researchers Research Grants and Contracts (RGC) About Us Current Funding Opportunities Resources and Quicklinks Systems Research Infrastructure Analytical Centre (MWAC) Contacts & About Us Data Management, Storage and Tools Network Labs Shared Research Equipment UNSW Research Infrastructure Scheme Partner With Us Pricing Tool Researcher Hub (UNSW login) Current Funding Opportunities Research News UNSW Centres and Institutes Find a Researcher FAQ: Researcher Profiles - Tags & Codes",
  "content_length": 7457,
  "method": "requests",
  "crawl_time": "2025-12-01 14:53:42"
}