{
  "name": "Yuliya Babovich-Lierler",
  "homepage": "https://www.unomaha.edu/college-of-information-science-and-technology/about/faculty-staff/yuliya-lierler.php",
  "status": "success",
  "content": "Yuliya Lierler | College of Information Science & Technology | University of Nebraska Omaha Yuliya Lierler Yuliya Lierler, Ph.D. Professor Computer Science email: ylierler@unomaha.edu office: PKI 280D office phone: 402.554.4911 lab room: 372 Google Scholar: https://scholar.google.com/citations?user=KlTD9RQAAAAJ&hl=en ORCID: https://orcid.org/0000-0002-6146-623X personal website: https://www.unomaha.edu/nlpkr digital commons: https://digitalcommons.unomaha.edu/do/search/?q=(author%3A%22Yuliya%20Lierler%22%20AND%20-bp_author_id%3A%5B*%20TO%20*%5D)%20OR%20bp_author_id%3A(%22bb09d176-8374-46cc-bd96-ad3d16bcdaaa%22)&start=0&context=1823872&sort=date_desc&facet= note: This profile is pulling in data from Digital Measures. Postings on personal websites or social media do not indicate that the individual is speaking on behalf of UNO. General Information General Information Biography Dr. Yuliya Lierler joined the Computer Science Department in the College of Information Science & Technology (IS&T) at the University of Nebraska Omaha (UNO) in 2012. She is now at the rank of the full professor. In September 2020, she was appointed to the Cheryl Prewett Diamond Professorship. In 2025, she received Mentor of the Year Award from Aksarben Foundation. A year earlier, she was awarded an Outstanding Research and Creativity Award by the College of IS&T. Dr. Lierler’s research interests and contributions are within the field of artificial intelligence, especially in the area of knowledge representation, automated reasoning, declarative problem solving, and natural language understanding. She is a co-director of the NLPKR lab (https://www.unomaha.edu/nlpkr). She is the author of seventy peer-reviewed articles that appeared in various prestigious AI venues including Artificial Intelligence Journal and AAAI conference. Dr. Lierler published an open access textbook titled Discrete Mathematics in a Nutshell or Theoretical Foundations of Computer Science (https://digitalcommons.unomaha.edu/compscifacbooks/5/) and a book targetting young adult audience titled Ditigatl Minimalism for Teens (https://www.amazon.com/Digital-Minimalism-Teens-control-ourselves/dp/B0FBKL58X9). In 2020, she was elected as an Executive Committee member of the Association of Logic Programming. Dr. Lierler was a program co-chair of several international conferences including the 38th International Conference on Logic programming, 2022. Prior to coming to UNO, Dr. Lierler was a Computing Innovation Fellow Postdoc at the University of Kentucky. She holds a Ph.D. in Computer Sciences from the University of Texas at Austin. Teaching Interests Artificial intelligence; Formal methods in computer science; Knowledge representation; Natural Language processing and understanding.Sample Syllabi and Lecture Notes can be found at the Digital Commons website provided earlier. Research Interests My research interests are in the field of artificial intelligence, especially in the area of knowledge representation, automated reasoning, declarative problem solving, and natural language understanding.My publications can be found the Digital Commons website provided earlier.The link to the Knowledge Representation and Natural Language Understanding Lab follows https://www.unomaha.edu/nlpkr . Service Summary Co-Chair of the 38th International Conference on Logic Programming (ICLP), 2022;Co-Chair of the 15th International Conference on Logic Programming and Nonmonotonic Reasoning (LPNMR), 2019;Computer Science Graduate Program Committee Chair, 2018-2020;Co-Chair of the 19th International Symposium on Practical Aspects of Declarative Languages (PADL), 2017 Awards and Honors Mentor of the Year Award for the Nebraska Women in Tech, Teaching - 2025Best Student Paper Award: \"First-Order Modular Logic Programs and their Conservative extensions\" (with Amelia Harrison), Scholarship/Research - 2016IS&T Outstanding Research Award, Scholarship/Research - 2024Cheryl Prewett Diamond Professorship, Scholarship/Research - 2020 Education Ph D, University of Texas at Austin, Austin, USA, Computer Science, 2010 Professional Development Community of Practice: Teaching, The AI Advantage: Transforming Teaching and Preparing Students to Thrive , 08/01/2024 - 10/01/2024Community of Practice: Teaching, The Foundations of Teaching Online, 4e, 06/01/2023 - 07/01/2023 Service Service Professional Association for Logic Programming, Board of Advisors of a Company, Executive Committee member of ALP. https://www.cs.nmsu.edu/ALP/the-association-for-logic-programming/board/ ., 06/01/2020 - 06/30/202038th International Conference on Logic Programming, Chairperson, A program co-chair of the 138th International Conference on Logic Programming, 07/01/2021 - present15th International Conference on Logic Programming and Nonmonotonic Reasoning , Chairperson, A program co-chair of the 15th International Conference on Logic Programming and Nonmonotonic Reasoning , 11/01/2017 - present19th International Symposium on Practical Aspects of Declarative Languages , Chairperson, A program co-chair of the 19th International Symposium on Practical Aspects of Declarative Languages., 11/01/2015 - present",
  "content_length": 5172,
  "method": "requests",
  "crawl_time": "2025-12-01 14:53:45"
}