{
  "name": "Yulia Gryaditskaya",
  "homepage": "https://yulia.gryaditskaya.com",
  "status": "success",
  "content": "Yulia Gryaditskaya Dr. Yulia Gryaditskaya Senior Research Scientist at Adobe, UK Visiting Academic at CVSSP and Surrey Institute for People-Centred AI, UK Email address: Curriculum Vitae (108 KB) Google Scholar LinkedIn GitHub ORCID Twitter I am currently most interested in controllable video generation, with a focus on spatial control and the coherent generation of storyboards and video segments. If you are interested in collaborations, please don’t hesitate to reach out. We are also hiring for internships — the next application cycle will be for 2026. Bio Yulia Gryaditskaya is a Senior Research Scientist at Adobe, UK. Prior to that, she was an Assistant Professor (2022–2024) at the Centre for Vision, Speech and Signal Processing (CVSSP) and the Surrey Institute for People-Centred AI. During this time, she supervised PhD, master's, and bachelor's students and taught two modules: (1) Computer Graphics and Vision (with labs on OpenGL) and (2) VR, AR, and the Metaverse (with labs on Unity). She developed the VR, AR, and the Metaverse module from scratch, which is now part of the University of Surrey’s online master's program. Additionally, she earned a Postgraduate Degree in Learning and Teaching in Higher Education. She initially joined CVSSP as a Senior Research Fellow (2020–2022) on a research-only track. During her time at Surrey, she supervised and co-supervised eight PhD students in areas such as sketch-based modeling and retrieval, sketch understanding, and sketch generation. Before joining CVSSP, she was a Postdoctoral Researcher (2017–2020) at Inria, working in the GraphDeco group under the supervision of Dr. Adrien Bousseau. During this time, she spent several weeks at MIT CSAIL, US, hosted by Prof. Fredo Durand. She also spent several weeks in TU Delft, Netherlands, working closely with Mark Sypesteyn and Jan Willem Hoftijzer. Her research focused on concept sketching techniques, sketch understanding, and sketch-based modeling. She earned her PhD in 2017 from MPI Informatics, Germany, under the guidance of Prof. Karol Myszkowski and Prof. Hans-Peter Seidel. Her PhD research focused on High Dynamic Range (HDR) imaging, covering topics such as HDR calibration, HDR video capture on mobile devices, tone mapping, structured light fields, and material editing in such light fields. During her PhD, she spent six months with the Color and HDR Group at Technicolor R&D, Rennes, France, under the mentorship of Dr. Erik Reinhard. She holds a degree (2007–2012) in Applied Mathematics and Computer Science with a specialization in Operations Research and System Analysis from the Lomonosov Moscow State University. Yulia’s research has been published in top computer graphics and vision venues, including ACM Transactions on Graphics (TOG), Computer Graphics Forum (CGF), IEEE Transactions on Image Processing (TIP), ACM SIGGRAPH, ECCV, ICCV, ICLR, CVPR, and IEEE 3DV. She is also a co-author of an international patent based on her CGF publication. Interview at ICCV Daily Research Interests Yulia's main research interests lie in controllable 2D and 3D generative AI, focusing on the intersection of creativity and technology. Sketch-Based Modeling Sketch-Based Image Generation Spatial Guidance in the Generative Process Image/Video Editing and Manipulation Generative AI Semantic Understanding",
  "content_length": 3336,
  "method": "requests",
  "crawl_time": "2025-12-01 14:53:44"
}