{
  "name": "Yulong Shen",
  "homepage": "https://web.xidian.edu.cn/ylshen",
  "status": "success",
  "content": "沈玉龙 | 个人信息 | 西安电子科技大学个人主页 学术信息网 西电导航 关于 使用说明 搜索 系统首页 登录 控制面板 收藏 沈玉龙的留言板 沈玉龙的主页:个人信息团队新闻科学研究科技成果论文成果知识产权科研团队课程教学媒体报道团队文化English 基本信息沈玉龙　教授 博士/硕士生导师博士学科：计算机科学与技术、网络空间安全硕士学科：计算机科学与技术工作单位：计算机科学与技术学院主要研究方向云计算与数据安全智能网络内生安全联系方式通信地址：陕西省西安市雁塔区太白南路2号电子邮箱：ylshen@mail.xidian.edu.cn办公地点：南校区网安大楼A1-0912招生信息研究生招生工作咨询：             联系人：焦老师             联系电话：18192722878             联系邮箱：cyjiao@xidian.edu.cn研究生招生基本要求：            1.热爱科研工作，思维敏捷；            2.身心健康，为人端正；            3.具有较强的上进心和团队协作能力；            4.具有较强的计算机与网络安全基础、               数理基础等。I am always looking for self-motivated international students for research (M.S., Ph.D., or postdoc). Please send your CV and transcript to Dr. Ke Cheng (Email:chengke@xidian.edu.cn) if you are interested. Information on Xidian M.S. and Ph.D. admission and scholarships can be found here.相关链接J-NaNA期刊NaNA 2025会议CCNIS 2025会议陕西省网络与系统安全重点实验室团队公众号欢迎扫码关注NSS团队公众号！ 个人简介        沈玉龙，男，博士。西安电子科技大学“华山学者”领军教授，博士/硕士研究生导师，国家级人才，陕西省网络与系统安全重点实验室副主任，教育部创新团队的骨干成员，空天地一体化综合业务网全国重点实验室信息安全中心固定研究人员。        长期从事下一代网络安全、云计算与数据安全等研究。近年来主持和承担了国家重点研发计划、国家自然科学基金重点项目等20余项，以主要完成人获国家技术发明二等奖2项，省部级一等奖5项。        研发的“秦盾”云加密数据库系统获中国科协创新创业大赛金奖（16/1800+）和最佳商业投资价值奖（2/1800+），获2018 CCTV中国十大创业榜样（当时高校唯一）。发表SCI/EI论文100余篇，Google scholar他引2000余次，出版专著7部；授权发明专利70余项，PCT专利5项，已转让专利13项；登记软著40多项；制定中国通信/电子行业标准5项。主要学术兼职陕西省计算机学会网络空间安全专委会主任智慧城市产业生态圈安全技术组主席信标委大数据标准工作组技术专题组联合组长国际会议NaNA永久主席和发起人国际期刊J-NaNA编委中国电子学会理事中国计算机学会物联网专委会执行委员、区块链专委会执行委员ACM西安副主席、IEEE会员全国信息技术标准化技术委员会第二届物联网分技术委员会（SAC/TC28/SC41）委员IEEE WiCcm 2016的TPC Chair、ACM SACMAT2016的Public Chair、IEEE ICEBE、INCoS、SOWN、CIS、CWSN 等会议的TPC成员（作为大会主席/TPC成员等服务各类国际会议30余次）团队新闻2022年4月，沈玉龙教授的发明专利“一种多域分层的多域物联网平台及多域管理方法”获中国专利优秀奖2021年4月，博士生孙冉冉论文\"Covert Rate Maximization in Wireless Full-Duplex Relaying Systems with Power Control\"被SCI I区期刊IEEE Transactions on Communications (TCOMM)录用2021年4月，博士生赵双睿论文\"Secure and Energy-Efficient Precoding for MIMO Two-Way Untrusted Relay Systems\"被CCF A类期刊IEEE Transactions on Information Forensics & Security (TIFS)录用2020年9月，西电青岛研究院院长沈玉龙教授参加2020年世界工业互联网产业大会2020年9月，西电青岛研究院协办的2020世界工业互联网产业大会城阳论坛成功召开2020年9月，西电青岛研究院产教融合研究生联合培养基地开学典礼隆重举行2020年9月，课题组论文Exploiting Channel Gain and Phase Noise for PHY-layer Authentication in Massive MIMO Systems被CCF A类期刊 IEEE Transactions on Information Forensics & Security (TIFS)录用2020年6月，博士生赵双睿论文\"Secure Beamforming for Full-duplex MIMO Two-way Untrusted Relay Systems\"被CCF A类期刊IEEE Transactions on Information Forensics & Security (TIFS)录用2020年4月，沈玉龙教授牵头完成的“多域物联网安全服务关键技术及应用”获2019年度陕西省科学技术奖技术发明奖一等奖更多新闻... 版权声明 未经西安电子科技大学以及个人主页教师本人许可，不得复制、转载和传播本页内容，禁止用于任何商业用途。如需转载请征得主页所有者同意，并附上主页链接！ 更新 沈玉龙的留言板 技术支持：电院网络中心陕ICP备05016463号-3© 2025 西安电子科技大学",
  "content_length": 2630,
  "method": "requests",
  "crawl_time": "2025-12-01 14:53:44"
}