{
  "name": "Yulun Zhang 0001",
  "homepage": "https://yulunzhang.com",
  "status": "success",
  "content": "Yulun Zhang Yulun Zhang Associate Professor AI Institute, School of Computer Science, Shanghai Jiao Tong University Email: yulun100@gmail.com I have been a tenure-track associate professor at School of Computer Science, Shanghai Jiao Tong University since Mar. 2024. Previously, I was a postdoctoral researcher at Computer Vision Lab, ETH Zürich, Switzerland. I obtained my Ph.D. degree from Department of Electrical & Computer Engineering, Northeastern University, USA, in Aug. 2021. Before that I received my master degree from the Department of Automation, Tsinghua University, China, in Jul. 2017 and B.E degree from School of Electronic Engineering, Xidian University, China, in Jul. 2013. I was an intern or visiting student at Adobe Research, Harvard University, Nanyang Technological University, The University of Sydney, and Shenzhen Institute of Advanced Technology, CAS. My research interest broadly includes machine learning and computer vision. Specifically, I focus on image/video restoration (e.g., super-resolution, denoising, deblurring), synthesis (e.g., style transfer, texture transfer), biomedical image enhancement and analysis, deep model compression (e.g., network pruning, quantization), computational imaging (e.g., spectral compressive imaging), multimodal learning, large language model, efficient diffusion model, etc. I am/was an Area Chair for CVPR, ICCV, ECCV, NeurIPS, ICLR, ICML, ACM MM, IJCAI, AAAI, WACV, PRCV and Senior Program Committee (SPC) member for IJCAI, AAAI. Our research has been generously supported by academic/industry sponsors, such as NSFC, Huawei, vivo, Lenovo, Adobe, MangoTV, Meituan, Transsion, and Tencent. Openings: We are looking for self-motivated undergraduate interns, graduate students, and PostDocs to join our group. If you are interested, please email me with your resume and transcript. You can also refer to CSRankings for CV, ML, and AI ranking information. 大家好！欢迎本科实习生，硕士/(全职/在职)博士，(全职/在职)博士后加入我们，一起做有影响力的科研！有意向的同学请发送邮件给我，并附上简历和成绩单，详情如下： 点击查看申请详情 本科实习生申请 基本要求：上海交大本科大一、大二、大三学生 附件材料：简历+成绩单 邮件题目：本科实习-姓名-学校-专业 更多关于本科实习的信息请见Openings。 硕士、(全职/在职)博士申请 基本要求：直博需获得当年所在学校的推免名额，普博需入学时获得硕士学位 附件材料：简历+成绩单 邮件题目：硕士申请-姓名-学校-专业，直博申请-姓名-学校-专业，普博申请-姓名-学校-专业 (全职/在职)博后申请 基本要求：入职时获得博士学位 附件材料：简历 邮件题目：博后申请-姓名-博士学校-专业 News Aug 2025 I am serving as an Area Chair for CVPR 2026 and ICLR 2026. Jul 2025 I am serving as an Area Chair for AAAI 2026 and WACV 2026. Jun 2025 5 papers accepted to ICCV 2025. May 2025 4 papers accepted to ICML 2025. Feb 2025 I am serving as an Area Chair for NeurIPS 2025 and ACM MM 2025. Dec 2024 I am serving as an Area Chair for ICML 2025, ICCV 2025, and IJCAI 2025. Sep 2024 I am serving as an Area Chair for CVPR 2025 and 7 papers accepted to NeurIPS 2024. Aug 2024 I am serving as an Area Chair for ICLR 2025. Jul 2024 4 papers accepted to ECCV 2024. Jun 2024 Received a gift funding from Adobe Research. I am serving as a Senior Program Committee (SPC) member for AAAI 2025. May 2024 4 papers accepted to ICML 2024. Mar 2024 I am serving as an Area Chair for NeurIPS 2024. Feb 2024 5 papers accepted to CVPR 2024. Jan 2024 I am serving as an Area Chair for ECCV 2024, ICML 2024, and PRCV 2024. 3 papers accepted to ICLR 2024. Dec 2023 We release DPoser, a robust 3D human pose prior leveraging diffusion models (project, code, paper). Nov 2023 I am serving as an Area Chair for ACM MM 2024 and IJCAI 2024 . We have also released several works: PromptSR (text prompt in image super-resolution), BiDRN (binarization in 3D whole-body human mesh recovery), DeqIR (parallel sampling in diffusion-based image restoration), and Reti-Diff (Retinex-based latent DM and Transformer for illumination degradation image restoration). Sep 2023 4 papers accepted to NeurIPS 2023. Among them, HI-Diff is a diffusion model for realistic image deblurring. BiSCI is the first work about binarization in spectral compressive imaging. Aug 2023 I am serving as an Area Chair for ICLR 2024. Jul 2023 9 papers accepted to ICCV 2023 and 2 papers accepted to ACM MM 2023. Jun 2023 I am serving as an Area Chair for CVPR 2024 and a Senior Program Committee (SPC) member for AAAI 2024. 1 paper about blind SR is accepted to TIP. 1 paper is accepted to MICCAI 2023. Pyramid Attention Networks for Image Restoration is accepted to IJCV. May 2023 I am serving as an Associate Editor for Multimedia Tools and Applications (MTAP). 1 paper accepted to TIP. Apr 2023 1 paper accepted to TPAMI and 1 paper accepted to ICML 2023. I am serving as a Reviewer for ACM MM 2023. We are also collecting papers about Diffusion Models in Low-Level Vision. Welcome to make your contributions! Mar 2023 I am serving as an Area Chair for NeurIPS 2023 and a Reviewer for MICCAI 2023. Feb 2023 6 papers accepted to CVPR 2023. Jan 2023 3 papers accepted to ICLR 2023, 1 paper accepted to ISBI 2023. Dec 2022 I am serving as a Senior Program Committee (SPC) member for IJCAI 2023 and Reviewer for ICML 2023. Nov 2022 I am serving as an Area Chair for ICCV 2023. We have 2 papers accepted to AAAI 2023. They are about lightweight SR (HPUN) and hyperspectral image denoising (SST). Oct 2022 I am serving as an Area Chair for CVPR 2023. We have 1 paper accepted to TIP. Sep 2022 We have 2 papers accepted to NeurIPS 2022. They are about image restoration (CAT) and spectral compressive imaging (DAUHST). Jul 2022 I am serving as a Senior Program Committee (SPC) member for AAAI 2023 and reviewer for ICLR 2023. We have 5 papers accepted to ECCV 2022 and 1 paper accepted to TPAMI. Jun 2022 We have released the codebase for Spectral Compressive Imaging. We have 1 paper accepted to TPAMI and 2 papers accepted to ACM MM 2022. May 2022 We have 2 papers accepted to ICML 2022. Our paper RCAN ranks top 10 most influential papers based on citations in ECCV 2018. See Most Influential ECCV Papers. Apr 2022 We have 2 papers accepted to IJCAI 2022. We won the first place in NTIRE Spectral Reconstruction Challenge at CVPR, 2022. The paper and codebase of our solution MST++ have been released. Mar 2022 We have 3 papers (two about spectral compressive imaging, one about interpretable image SR) accepted to CVPR 2022. I am serving as reviewer for ECCV 2022 and NeurIPS 2022. Jan 2022 We have 1 paper accepted to TPAMI and another one accepted to ICLR 2022. I am serving as reviewer for ACM MM 2022 and MICCAI 2022. Dec 2021 I am serving as SPC for IJCAI 2022 and reviewer for ICML 2022. Sep 2021 3 papers are accepted to NeurIPS 2021. I am serving as reviewer for CVPR 2022. Jul 2021 3 papers are accepted to ICCV 2021. I accept the invitation to the novel Program Committee Board of IJCAI with service time from 2022 to 2024. Jun 2021 1 paper is accepted to TCYB and TIP. I am serving as reviewer for ICLR 2022. Apr 2021 Our real-world image denoising paper is accepted to IJCAI 2021. I am serving as reviewer for NeurIPS 2021 and ACM MM 2021. Mar 2021 Our papers about MR image enhancement and real-world image denoising are accepted to CVPR 2021. One paper about MR image super-resolution is accepted to TCSVT. Feb 2021 Our paper RDN ranks top 10 most influential papers based on citations in CVPR 2018. See Most Influential CVPR Papers. Jan 2021 Our Neural Pruning paper (code) is accepted to ICLR 2021. I am serving as reviewer for ICCV 2021. Dec 2020 I am serving as a Senior Program Committee (SPC) member for IJCAI 2021 and PC member for ICML 2021, MICCAI 2021. Sep 2020 We have 1 paper accepted to TNNLS and another one accepted to NeurIPS 2020. Code will be available soon. Jul 2020 We have 2 papers accepted to ECCV 2020. Code/data will be available soon. Jun 2020 We release the code for our paper: Pyramid Attention Networks for Image Restoration Feb 2020 We have 3 papers accepted to CVPR 2020. Congratulations to all authors! Jan 2020 We have 1 paper accepted to TPAMI. Dec 2019 We release the TensforFlow code and pre-trained models for ICCV19MST at MST. The PyTorch code for MST is on the way. Apr 2019 We release all the train/test codes and pre-trained models for ICLR19RNAN at RNAN. Dec 2018 We have 1 paper accepted to ICLR 2019. Jul 2018 We have 1 paper accepted to ACM MM 2018 and 1 paper accepted to ECCV 2018. PyTorch version for our CVPR18RDN has been implemented by Nguyễn Trần Toàn (trantoan060689@gmail.com) and merged into EDSR-PyTorch. Jun 2018 I accept the invitation to serve as Program Committee member of AAAI 2019. Feb 2018 I will intern to Adobe Research (San Jose, CA) this summer. We have 1 paper accepted to CVPR 2018 as spotlight. All the codes are available at Github. Jul 2017 I recieve ‘Excellent Graduate of Beijing’ award, ‘Excellent Graduate in Department of Automation, Tsinghua University’ award, Excellent Master Thesis Award, Tsinghua University’ award, and Shenzhen Universiade International Scholarship. May 2017 We have 1 IEEE TSMC paper accepted. Our team (HelloSR: Xintao Wang, Yapeng Tian, Ke Yu, Yulun Zhang, Shixiang Wu, Chao Dong, Liang Lin, Yu Qiao) ranks 2nd place in NTIRE Image Super-Resolution Challenge. Recent Publications arXiv Towards Redundancy Reduction in Diffusion Models for Efficient Video Super-Resolution Jinpei Guo, Yifei Ji, Zheng Chen, Yufei Wang, Sizhuo Ma, Yong Guo, Yulun Zhang*, and Jian Wang arXiv preprint arXiv:2509.23980 (arXiv), 2025 PDF Code Website arXiv InfVSR: Breaking Length Limits of Generic Video Super-Resolution Ziqing Zhang†, Kai Liu†, Zheng Chen, Xi Li, Yucong Chen, Bingnan Duan, Linghe Kong*, and Yulun Zhang* arXiv preprint arXiv:2510.00948 (arXiv), 2025 PDF Code arXiv FideDiff: Efficient Diffusion Model for High-Fidelity Image Motion Deblurring Xiaoyang Liu†, Zhengyan Zhou†, Zihang Xu, Jiezhang Cao, Zheng Chen, and Yulun Zhang* arXiv preprint arXiv:2510.01641 (arXiv), 2025 PDF Code arXiv Asymmetric VAE for One-Step Video Super-Resolution Acceleration Jianze Li, Yong Guo, Yulun Zhang*, and Xiaokang Yang arXiv preprint arXiv:2509.24142 (arXiv), 2025 PDF Code arXiv RIFLE: Removal of Image Flicker-Banding via Latent Diffusion Enhancement Libo Zhu†, Zihan Zhou†, Xiaoya",
  "content_length": 18727,
  "method": "requests",
  "crawl_time": "2025-12-01 14:53:45"
}