{
  "name": "Yumeng Yang",
  "homepage": "http://faculty.sist.shanghaitech.edu.cn/faculty/yangym/index.html",
  "status": "success",
  "content": "Home Welcome Spin InfoTech (SIT) Lab at ShanghaiTech University has been established by Assistant Professor Yumeng Yang since Janurary 2020. The lab commits to the development of spin-electronic devices for the next generation of information technology. In particular, it aims to build reliable high speed and energy efficient spin current based solid-state devices with emerging applications in Internet of Things, Industry 4.0, Artificial Intelligence, etc. The lab acknowledges the funding support from the National Key R&D Program, National Natural Science Foundation China, Shanghai Pujiang Program and ShanghaiTech University. We are always looking for motivated students and researchers, and please feel free to contact us . < > Spin orbit torque is an energy efficient technique to write the magnetic information. Magneto-resistance is adopted to sensitively detect the stored magnetic information. Silicon-on-insulator MOSFET is used as a selector to determine the bit for operation. Gallery Recent Highlights September 16, 2025: PhD student Chuang Man presented our work, entittled \"High-Frequency Bulk Acoustic Wave Resonator with Ferromagnetic Electrodes for Magnetic Field Sensing\" in 2025 IEEE International Ultrasonics Symposium (IUS), and won best poster presentation award. Congrats Chuang! September 15, 2025: We have five new master students Hongru Yuan, Linru Wang, Ruoshen Yang, Jun Jiang and Yixuan Li joining the group. Welcome on board! July 10, 2025: We held a gathering to celebrate Master student Yanghui Liu's graduation and bid farewell to Yuteng as he returns to Singapore. Best wishes to you both! June 13, 2025: Our collaboration work, entittled \"Topological Surface State Dominated Nonlinear Transverse Response and Microwave Rectification at Room Temperature\", with Prof. Liang Liu from Shanghai Jiaotong University, has been accepted by Advanced Functional Materials. Congrats Yaqi and Robin! May 7, 2025: Our collaboration work, entittled \"A Hardware Prototype of an MRAM-based Stochastic Computing System\" with Prof. Siting Liu, has been accepted by GLSVLSI '25: Proceedings of the Great Lakes Symposium on VLSI 2025 . February 22, 2025: Our collaboration work with Prof. Yihong Wu from National University of Singapore (NUS) \"Third harmonic resistance in ferromagnet/heavy-metal bilayers\" has been accepted by Physical Review B. February 11, 2025: Our collaboration work, entittled \"An SRAM-based Stochastic Number Generator for Stochastic Computing\" with Prof. Siting Liu, has been accepted by 2025 IEEE International Symposium on Circuits and Systems (ISCAS). Archived",
  "content_length": 2608,
  "method": "requests",
  "crawl_time": "2025-12-01 14:53:44"
}