{
  "name": "Yumei Huo",
  "homepage": "http://www.cs.csi.cuny.edu/~yumei",
  "status": "success",
  "content": "Yumei Huo 's Homepage Dr. Yumei Huo Professor Department of Computer Science College of Staten Island, CUNY Doctoral faculty Department of Computer Science The Graduate Center, CUNY 2800 Victory Blvd 1N-215 Staten Island, New York 10314 Office: 1N-202 Email: yumei.huo@csi.cuny.edu Phone: (718) 982-2841 Teaching | Research | Publications | Links | Vita | Research Statement Teaching Fall 2024: CSC382 Analysis of Algorithms CSC450 Honors Workshop CSC 90000-33 Dissertation Supervision (The Graduate Center) Spring 2024: CSC305 Operatating Sys Prog Lab CSC382 Analysis of Algorithms CSC450 Honors Workshop CSC 90000-33 Dissertation Supervision (The Graduate Center) Courses taught in the previous semesters Research interest High Performance Computation Design and Analysis of Algorithms Sequence and Scheduling Computation and Complexity Combinatorial Optimization Operations Research Machine Learning Pattern Recognition Publications Journal Papers Wang Y., J. Wang, and Y. Huo, \"Multitasking scheduling with job switching allowed between alternate periods,\" International Journal of Production Research, 2024 February; :1-23. Fu B., Y. Huo, and H. Zhao, \"Multitasking scheduling with shared processing,\" Naval Research Logistics, 2023 December; 71(4):595-608. Fu B., Y. Huo, and H. Zhao, \"Streaming approximation scheme for minimizing total completion time on parallel machines subject to varying processing capacity,\" Theoretical Computer Science, 2023 June; 961:113937. Fu, B., Y. Huo and H. Zhao, \"\"Streaming Algorithms for Multitasking Scheduling with Shared Processing ,\" Discrete Applied Mathematics, 2022 October; 320:346-355. Tan J., L. Jing, Y. Huo, Y. Tian, O. Akin, \"LGAN: Lung Segmentation in CT Scans Using Generative Adversarial Network, Computerized Medical Imaging and Graphics, 87, 101817, 2021. Tan J., Y. Gao, Z. Liang, W. Cao, M.J. Pomeroy, Y. Huo, L. Li, MA Barish, A. F. abbasi, P. J. Pickhardt, 3D-GLCM CNN: A 3-dimensional gray-level co-occurrence matrix based CNN model for polyp classification via CT colonography, IEEE Transactions on Medical Imaging, 39 (6), 2013-2024, 2019. Huo. Y, Parallel Machine Makespan Minimization Subject to Machine Availability and Total Completion Time Constraints, Journal of Scheduling, 22(4): 433-447, 2019. Gao Y., J. Tan, Z. Liang, L. Li, Y. Huo, Improved computer-aided detection of pulmonary nodules via deep learning in the sinogram domain., Visual Computing for Industry, Biomedicine, and Art, 2: 1-9, 2019. Tan J., Y. Huo, Z. Liang, L. Li, Expert knowledge-infused deep learning for automatic lung nodule detection, Journal of X-ray science and technology, 27(1), 17-35, 2019. Huo, Y. and H. Zhao, \"Two Machine Scheduling Subject to Arbitrary Machine Availability Constraints,\" Omega, Omega, 76: 128-136, 2018. Huo, Y. and H. Zhao, \"Total Completion Time Minimization on Multiple Machines Subject to Machine Availability and Makespan Constraints,\" European Journal of Operational Research, 243(2): 547-554, 2015. Huo, Y., B. Reznichenko and H. Zhao, \"Minimizing Total Weighted Completion Time with Unexpected Machine Unavailability,\" Journal of Scheduling, 17(2): 161-172, 2014. Fu, B, Y. Huo and H. Zhao, \"Coordinated Scheduling of Production and Delivery with Production Window and Delivery Capacity Constraints,\" Theoretical Computer Science, 422: 39-51, 2012. Fu, B, Y. Huo and H. Zhao, \"Approximation Schemes for Parallel Machine Scheduling with Availability Constraints,\" Discrete Applied Math, 159: 1555-1565, 2011. Huo, Y. and H. Zhao, \"Bicriteria Scheduling Concerned with Makespan and Total Completion Time Subject to Machine Availability Constraints\", Theoretical Computer Science, 412:1081-1091, 2011. Huo, Y., J. Y-T. Leung and X. Wang, \"Integrated Production and Delivery Scheduling with Disjoint Windows,\" Discrete Applied Math, 158:921-931, 2010. Huo, Y. and J. Y-T. Leung, \"Fast Approximation Algorithms for Job Scheduling with Processing Sets Restrictions\", Theoretical Computer Science, 411: 3947-3955, 2010. Huo, Y. and J. Y-T. Leung, \"Parallel Machine Scheduling with Nested Processing Set Restrictions,\" European Journal of Operational Research, 204:229-236, 2010. Fu, B, Huo, Y. and H. Zhao, \"Exponential Inapproximability and FPTAS for Scheduling with Availability Constraints\", Theoretical Computer Science, 410:2663-2674, 2009. Huo, Y., J. Y-T. Leung and X. Wang,\"Preemptive Scheduling Algorithms with Nested Processing Set Restriction,\" International Journal of Foundations of Computer Science, 20(6): 1147-1160, 2009. Fu, B, Y. Huo and H. Zhao, \"Makespan Minimization with Machine Availability Constraints,\" Discrete Mathematics, Algorithms and Applications, 1(2): 141-151, 2009. Huo, Y. , J. Y-T. Leung and X. Wang,\"A Fast Preemptive Scheduling Algorithm with Release Times and Inclusive Processing Set Restrictions,\" Discrete Optimization, 6(3): 292-298, 2009. Huo, Y., H. Li, and H. Zhao, \"Minimizing Total Completion Time in Two-Machine Flow Shops with Exact Delays,\" Computers & Operations Research, 36(6): 2018-2030, 2009. Huo, Y., J. Y-T. Leung and X. Wang, \"Online Scheduling of Equal-Processing-Time Task Systems,\" Theoretical Computer Science, 401: 85-95, 2008. Huo, Y. , J. Y-T. Leung and H. Zhao, \"Complexity of Two Dual Criteria Scheduling Problems,\" Operations Research Letters, 35:211-220, 2007. Huo, Y. , J. Y-T. Leung and H. Zhao, \"Bi-criteria Scheduling Problems: Number of Tardy Jobs and Maximum Weighted Tardiness,\" European Journal of Operational Research, 177:116-134, 2007. Huo, Y. and J. Y-T. Leung, \"Minimizing Mean Flow Time for UET Tasks,\" ACM Transactions on Algorithms, Vol. 2, No. 2, pp. 244-262. April 2006. Huo, Y. and J. Y-T. Leung, \"Online Scheduling of Precedence Constrained Tasks,\" SIAM J. on Computing, Volume 34, Number 3, pp. 743-762. 2005. Huo, Y. and J. Y-T. Leung, \"Minimizing Total Completion Time for UET Tasks with Release Time and Outtree Precedence Constraints,\" Mathematical Methods of Operations Research, Vol. 62, No. 2, pp. 275-278, 2005. Huo, Y. and Q. Wang, \"Control Flow Analysis and Simulator Design for VLIW Architecture Microprocessor\", MINI-MICRO SYSTEMS, Vol. 22, No. 5, 2001. Tu, X. and Y. Huo, \"Knowledge Economics-oriented Intelligence Simulation Technology\", Computer Simulation, 1999(7). Recent Conference Papers Fu B, Y. Huo, H. Zhao, \"Sublinear Algorithms for Scheduling with Chain Precedence Constraints,\" The 30th International Computing and Combinatorics Conference (COCOON 2024), Forthcoming. Tan J., S. Zhang, W. Cao, Y. Gao, L.C. Li, Y. Huo, Z. Liang, \"A multi-stage fusion strategy for multi-scale GLCM-CNN model in differentiating malignant from benign polyps,\" Medical Imaging 2020: Computer-Aided Diagnosis, 11314, 113141S, 2020. Huo Y. and H. Zhao, \"Revisit Heuristics for Flowshop Scheduling with Availability Constraint,\" The 9th Multidisciplinary International Conference on Scheduling: Theory and Applications (MISTA 2019), 609-611, 2019. Tan J., Y. Gao, W. Cao, M.J. Pomeroy, S. Zhang, Y. Huo, L. Li, Z. Liang, \"GLCM-CNN: Gray Level Co-occurrence Matrix based CNN Model for Polyp Diagnosis,\" IEEE EMBS International Conference on Biomedical & Health Informatics (BHI), 1-4, 2019. Tan J., Y. Gao, Y. Huo, L. Li, Z. Liang, \"Sharpness preserved sinogram synthesis using convolutional neural network for sparse-view CT imaging,\" Medical Imaging: Image Processing, 109490E, 2019. Tan J., Y. Huo, Z. Liang, L. Li, \"A Fast Automatic Juxta-pleural Lung Nodule Detection Framework Using Convolutional Neural Networks and Vote Algorithm,\" The International Workshop on Patch-Based Techniques in Medical Imaging,(Patch-MI@MICCAI 2018), Lecture Notes in Computer Science Vol. 11075, page 85-92, 2018. Tan J., Y. Huo, Z. Liang, L. Li, \"Apply Convolutional Neural Network to Lung Nodule Detection: Recent Progress and Challenges,\" The International Conference for Smart Health 2017 (ICSH 2017), Lecture Notes in Computer Science Vol. 10347, page 214-222, 2017. Tan J., A. Kotov, R.P. Mohammadiani, Y. Huo, \"Sentence Retrieval with Sentiment-specific Topical Anchoring for Review Summarization,\" Proceedings of the 2017 ACM on Conference on Information and Knowledge Management (CIKM 2017), page 2323-2326. Tan J., Huo Y., Z. Liang and L. Li, \"A Comparison Study On The Effect Of False Positive Reduction In Deep Learning Based Detection For Juxtapleural Lung Nodules: CNN VS DNN,\" Modeling and Simulation in Medicine Symposium 2017 (MSM 2017),Proceedings of the Symposium on Modeling and Simulation in Medicine,Article No. 8. Huo, Y. and H. Zhao, \"Minimizing Total Completion Time in Flow shop with Availability Constraints,\" 9th International Workshop on Computational Optimization (WCO'16), Proceedings of the Federated Conference on Computer Science and Information Systems (FedCSIS 2016), page 637-645. Tan J., Huo Y., and L. Li, \"Using ConvNet to recognize lung nodule from CT user data: A feasibility study,\" Computational Approaches for Cancer Workshop 2016 (CAFCW-2016). Huo, Y. and Huang J.X., \"Parallel ant colony optimization for flow shop scheduling subject to limited machine availability,\" The sixth IEEE Workshop on Parallel Computing and Optimization, IEEE International Parallel and Distributed Processing Symposium Workshops (IPDPS Workshops 2016), 756-765, 2016. Huo, Y., \"Makespan Minimization on Multiple Machines Subject to Machine Unavailability and Total Completion Time Constraints,\" The tenth International Conference on Algorithmic Aspects of Information and Management (AAIM 2014), Lecture Notes In Computer Science , Vol. 8546: 56-65, 2014. Huo, Y. and H. Zhao, \"Bi-criteria Scheduling on Multiple Machines Subject to Machine Availability Constraints,\" The Seventh International Frontiers of Algorithmics Workshop and The Ninth International Conference on Algorithmic Aspects of Information and Management (FAW-AAIM 2013), Lecture Notes In Computer Science, Vol. 7924: 325-338, 2013 Recent Refereed Poster \"Huo, Y. and F. Gu, \"Adoptions and Outcomes of NSF/IEEE TCPP PDC Curriculum at College of Staten Is",
  "content_length": 17196,
  "method": "requests",
  "crawl_time": "2025-12-01 14:53:46"
}