{
  "name": "Yuming Zhou",
  "homepage": "https://cs.nju.edu.cn/zhouyuming",
  "status": "success",
  "content": "Home page for Yuming Zhou Yuming Zhou Email: zhouyuming(at)nju.edu.cn School of Computer Science Nanjing University 163 Xianlin Avenue, Qixia District Nanjing, Jiangsu Province, China, 210023 I am currently a professor in the School of Computer Science at Nanjing University. I received my Ph.D. degree in computer science from Southeast University in 2003. From January 2003 to December 2004, I was a researcher at Tsinghua University. From February 2005 to February 2008, I was a researcher at Hong Kong Polytechnic University. Open positions (New!) Positions available for highly motivated Ph.D students with a major in computer science, mathematics, or related fields Positions available for master's students with a major in computer science, mathematics, or related fields Current interests My research interests focus on software quality assurance in software engineering, especially on software testing, defect prediction/detection, and program analysis. Software testing: cost-effective mutation testing, testing for/with AI Defect prediction/detection: explainable defect prediction, defect reduction planning, vulnerability detection Program analysis: data-driven program analysis, selective program analysis, program analysis for/with AI Our objective is to provide strong (i.e., simple yet effective) baseline approaches for important problems in software quality assurance (see examples). A baseline approach defines a meaningful point of reference and hence allows a meaningful evaluation of any new approach against previous approaches. The ongoing use of a strong baseline approach would help advance the state-of-the-art more reliably and quickly. If you are interested in our “SEE” (Simple yEt Effective) group, please contact me. Teaching Software metrics Mathematical modelling in computer science Awards/honors 2024: Advisor for an Excellent PhD dissertation awarded by the Jiangsu Computer Society 2018: Advisor for an Excellent PhD dissertation in Jiangsu Province 2013: \"Deng Feng\" Distinguished Scholars Program, Nanjing University 2012: First Prize of Jiangsu Science and Technology Award 2010: China Computer Federation Young Computer Scientist Award 2008: Program for New Century Excellent Talents in University, Ministry of Education 2007: First Prize of Jiangsu Science and Technology Progress Award Students Yang Wang Yimeng Guo (co-supervised by Lin Chen ) Zeyu Lu Jun Wang (co-supervised by Yanhui Li and Lin Chen ) Maolin Sun (co-supervised by Yibiao Yang ) Yuge Nie Lei Zhang Lei Shu Xuan Wang Beining Wu Liwei Ye Yufei Wu Alumni 2025: Yi Rong (MSc), Jiaxin Tang (MSc), Wenjie Xu (PhD, co-supervised by Prof. Yanhui Li and Prof. Lin Chen) 2024: Huihui Liu (Postdoctor), Xutong Liu (PhD), Xiaowei Zhang (PhD, co-supervised by Prof. Lin Chen), Wei Lai (MSc), Yicong Xu (MSc) 2023: Yuanqing Mei (PhD) 2022: Zhaoqiang Guo (PhD), Shiran Liu (PhD), Peng Zhang (PhD), Huicong Zhou (MSc) 2019: Yi Bin (MSc), Xu Zhang (MSc), Wanwangying Ma (PhD, co-supervised by Prof. Lin Chen and Prof. Baowen Xu) 2018: Yangyang Zhao (PhD), Qianqian Jia (MSc), Hui Wan (MEng) 2017: Yiyang Feng (MSc) 2016: Yibiao Yang (PhD), Fei Zhao (MSc), Yaming Tang (MSc), Changsong Liu (MSc) 2014: Yansong Wu (MSc), Zhijian Wang (MSc) 2013: Hongyuan Zhao (MSc), Dongxiao Zhao (MSc), Xiang Zhang (MEng), Zhenxing Xu (MEng) 2012: Qingqing Tian (MSc), Chaodong Xue (MSc), Rong Zhao (MEng) 2011: Musheng Wang (MSc), Ming Yang (MSc, co-supervised with Prof. Xiaoyu Zhou) Selected papers Qingyang Li, Yibiao Yang, Maolin Sun, Jiangchang Wu, Qingkai Shi, Yuming Zhou. Isolating compiler faults via multiple pairs of adversarial compilation configurations. ACM Transactions on Software Engineering and Methodology, accepted, 2025. Jun Wang, Chenghao Su, Yijie Ou, Yanhui Li, Jialiang Tan, Lin Chen, Yuming Zhou. Translating to a low-resource language with compiler feedback: A case study on Cangjie. IEEE Transactions on Software Engineering, 51(9), 2025: 2671-2692. Zeyu Lu, Yang Wang, Yi Rong, Yifan Huang, Xuan Wang, Peng Zhang, Shan Gao, Maolin Sun, Yibiao Yang, Yanhui Li, Lin Chen, Yuming Zhou. Understanding the potentially confounding effect of test suite size in test effectiveness evaluation. ACM Transactions on Software Engineering and Methodology, accepted, 2025. Peng Zhang, Zeyu Lu, Yang Wang, Yibiao Yang, Yuming Zhou, Mike Papadakis. Enriching mutation testing with innovative method invocation mutation: Filling the crucial missing piece of the puzzle. IEEE Transactions on Software Engineering, 51(7), 2025: 2125-2143. Yibiao Yang, Qingyang Li, Maolin Sun, Jing Yang, Jiangchang Wu, Yuming Zhou. Isolating compiler faults through differentiated compilation configurations. IEEE Transactions on Software Engineering, 51(6), 2025: 1838-1853. Peng Zhang, Mike Papadakis, Yuming Zhou. FuMi: A runtime fuzz-based machine learning precision measurement and testing framework. ACM Transactions on Software Engineering and Methodology, accepted, 2025. Yutian Tang, Xiapu Luo, Yuming Zhou. A systematic study on real-world Android app bundles. IEEE Transactions on Software Engineering, 51(5), 2025: 1615-1628. Linghan Meng, Yanhui Li, Lin Chen, Mingliang Ma, Yuming Zhou, Baowen Xu. Less is more: Feature engineering for fairness and performance of machine learning software. ACM Transactions on Software Engineering and Methodology, accepted, 2025. Yimeng Guo, Zhifei Chen, Lu Xiao, Lin Chen, Yanhui Li, Yuming Zhou. Understanding and identifying technical debt in the co-evolution of production and test code. IEEE Transactions on Software Engineering, 51(5), 2025: 1415-1436. Wenjie Xu, Yanhui Li, Mingliang Ma, Lin Chen, Yuming Zhou. Weighted suspiciousness and balanced aggregation to boost spectrum-based fault localization of deep learning models. ACM Transactions on Software Engineering and Methodology, 34(7), article 192, 2025: 1-28. Xutong Liu, Shiran Liu, Zhaoqiang Guo, Peng Zhang, Yibiao Yang, Huihui Liu, Hongmin Lu, Yanhui Li, Lin Chen, Yuming Zhou. Towards a framework for reliable performance evaluation in defect prediction. Science of Computer Programming, 238, 103164, 2024: 1-26. [Data&Code] Zhijie Liu, Yutian Tang, Xiapu Luo, Yuming Zhou, Liangfeng Zhang. No need to lift a finger anymore? Assessing the quality of code generation by ChatGPT. IEEE Transactions on Software Engineering, 50(6), 2024: 1548-1584. Yimeng Guo, Zhifei Chen, Lin Chen, Wenjie Xu, Yanhui Li, Yuming Zhou, Baowen Xu. Generating Python type annotations from type inference: How far are we? ACM Transactions on Software Engineering and Methodology, 33(5), article 123, 2024: 1-38. Zhichao Zhou, Yuming Zhou, Chunrong Fang, Zhenyu Chen, Xiapu Luo, Jingzhu He, Yutian Tang. Coverage goal selector for combining multiple criteria in search-based unit test generation. IEEE Transactions on Software Engineering, 50(4), 2024: 854-883. Peng Zhang, Yang Wang, Xutong Liu, Zeyu Lu, Yibiao Yang, Yanhui Li, Lin Chen, Ziyuan Wang, Chang-ai Sun, Xiao Yu, Yuming Zhou. Assessing effectiveness of test suites: what do we know and what should we do? ACM Transactions on Software Engineering and Methodology, 33(4), article 86, 2024: 1-32. [Data&Code] Zhaoqiang Guo, Tingting Tan, Shiran Liu, Xutong Liu, Wei Lai, Yibiao Yang, Yanhui Li, Lin Chen, Wei Dong, Yuming Zhou. Mitigating false positive static analysis warnings: Progress, challenges, and opportunities. IEEE Transactions on Software Engineering, 49(12), 2023: 5154 - 5188. Yang Wang, Peng Zhang, Maolin Sun, Zeyu Lu, Yibiao Yang, Yutian Tang, Junyan Qian, Zhi Li, Yuming Zhou. Uncovering bugs in code coverage profilers via control flow constraint solving. IEEE Transactions on Software Engineering, 49(11), 2023: 4964-4987. [Data&Code] Di Wu, Xiaoyuan Jing, Hongyu Zhang, Yang Feng, Haowen Chen, Yuming Zhou, Baowen Xu. Retrieving API knowledge from tutorials and stack overflow based on natural language queries. ACM Transactions on Software Engineering and Methodology, 32(5), article 109, 2023: 1-36. Zhaoqiang Guo, Shiran Liu, Xutong Liu, Wei Lai, Mingliang Ma, Xu Zhang, Chao Ni, Yibiao Yang, Yanhui Li, Lin Chen, Guoqiang Zhou, Yuming Zhou. Code-line-level bugginess identification: How far have we come, and how far have we yet to go? ACM Transactions on Software Engineering and Methodology, 32(4), article 102, 2023: 1-55. [Data&Code] Xiaowei Zhang, Weiqin Zou, Lin Chen, Yanhui Li, Yuming Zhou. Towards the analysis and completion of syntactic structure ellipsis for inline comments. IEEE Transactions on Software Engineering, 49(4), 2023: 2285-2302. Yulou Cao, Lin Chen, Wanwangying Ma, Yanhui Li, Yuming Zhou, Linzhang Wang. Towards better dependency management: A first look at dependency smells in Python projects. IEEE Transactions on Software Engineering, 49(4), 2023: 1741-1765. Shiran Liu, Zhaoqiang Guo, Yanhui Li, Chuanqi Wang, Lin Chen, Zhongbin Sun, Yuming Zhou, Baowen Xu. Inconsistent defect labels: essence, causes, and influence. IEEE Transactions on Software Engineering, 49(2), 2023: 586-610. [Data&Code] [Supplemental material] Peng Zhang, Yang Wang, Xutong Liu, Yanhui Li, Yibiao Yang, Ziyuan Wang, Xiaoyu Zhou, Lin Chen, Yuming Zhou. Mutant reduction evaluation: what is there and what is missing? ACM Transactions on Software Engineering and Methodology, 31(4), article 69, 2022: 1-46. [Data&Code] [Supplemental material] Peng Zhang, Yanhui Li, Wanwangying Ma, Yibiao Yang, Lin Chen, Hongmin Lu, Yuming Zhou, Baowen Xu. CBUA: A probabilistic, predictive, and practical approach for evaluating test suite effectiveness. IEEE Transactions on Software Engineering, 48(3), 2022: 1067-1096. [Data&Code] Zhaoqiang Guo, Shiran Liu, Jinping Liu, Yanhui Li, Lin Chen, Hongmin Lu, Yuming Zhou. How far have we progressed in identifying self-admitted technical debts? A comprehensive empirical study. ACM Transactions on Software Engineering and Methodology, 30(4), article 45, 2021: 1-56. [Data&Code] Lin Chen, Di Wu, Wanwangying Ma, Yuming Zhou, Baowen Xu, Hareton Leung. How C++ templates are used for generic programming –an emp",
  "content_length": 18463,
  "method": "requests",
  "crawl_time": "2025-12-01 14:53:45"
}