{
  "name": "Yun-Heh Jessica Chen-Burger",
  "homepage": "https://researchportal.hw.ac.uk/en/persons/yun-heh-chen-burger",
  "status": "success",
  "content": "Yun-Heh Chen-Burger - Heriot-Watt Research Portal View Scopus Profile Yun-Heh Chen-Burger Dr Associate Professor, School of Mathematical & Computer SciencesAssociate Professor, School of Mathematical & Computer Sciences, Computer Science https://orcid.org/0000-0002-7909-0541 EmailY.J.ChenBurgerhw.acuk EH14 4ASUnited Kingdom 20102024 Research activity per year Personal profile Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Fingerprint Dive into the research topics where Yun-Heh Chen-Burger is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 2 Similar Profiles information INIS 100% applications INIS 88% optimization INIS 79% supply INIS 79% chains INIS 79% Supply Chain Computer Science 79% disasters INIS 64% Swarm Intelligence Computer Science 64% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output Research output per year 2010 2016 2021 2024 17 Conference contribution 5 Article 3 Chapter 1 Chapter (peer-reviewed) 1 More 1 Paper Research output per year Research output per year An efficient swarm intelligence approach to the optimization on high-dimensional solutions with cross-dimensional constraints, with applications in supply chain managementLiu, H. P., Phoa, F. K. H., Chen-Burger, Y.-H. & Lin, S. P., 18 Jan 2024, In: Frontiers in Computational Neuroscience. 18, 1283974.Research output: Contribution to journal › Article › peer-review Open AccessFile applications 100% chains 100% solutions 100% supply 100% constraints 100% 3 Citations (Scopus) 34 Downloads (Pure) An Investigation into Influences of Tweet Sentiments on Stock Market MovementsHao, Z. & Chen-Burger, Y.-H. J., 23 Aug 2022, Agents and Multi-Agent Systems: Technologies and Applications 2022. Springer, p. 87-97 11 p. (Smart Innovation, Systems and Technologies; vol. 306).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open AccessFile investigations 100% market 100% stocks 100% United States of America 100% Finance 100% 2 Citations (Scopus) 413 Downloads (Pure) Decentralized Supply Chain Optimization via Swarm IntelligenceSingh, K., Liu, H. P., Phoa, F. K. H., Lin, S. P. & Chen-Burger, Y.-H. J., 26 Jun 2022, Advances in Swarm Intelligence. ICSI 2022. Tan, Y., Shi, Y. & Niu, B. (eds.). Springer, p. 432-441 10 p. (Lecture Notes in Computer Science; vol. 13344).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution chains 100% supply 100% optimization 100% Supply Chain 100% algorithms 75% 2 Citations (Scopus) Analysing Tweets Sentiments for Investment Decisions in the Stock MarketHao, Z. & Chen-Burger, Y.-H. J., 8 Jun 2021, Agents and Multi-Agent Systems: Technologies and Applications 2021. Springer, p. 129-141 13 p. (Smart Innovation, Systems and Technologies; vol. 241).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open AccessFile information 100% market 100% stocks 100% investment 100% Time Information 100% 2 Citations (Scopus) 156 Downloads (Pure) Metaheuristic Optimization on Tensor-Type Solution via Swarm Intelligence and Its Application in the Profit Optimization in Designing Selling SchemePhoa, F. K. H., Liu, H. P., Chen-Burger, Y. H. & Lin, S. P., 7 Jul 2021, Advances in Swarm Intelligence. ICSI 2021. Tan, Y. & Shi, Y. (eds.). Springer, p. 72-82 11 p. (Lecture Notes in Computer Science; vol. 12689).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open AccessFile applications 100% solutions 100% optimization 100% profits 100% Metaheuristics 100% 3 Citations (Scopus) 89 Downloads (Pure) View all 27 research outputs",
  "content_length": 4215,
  "method": "requests",
  "crawl_time": "2025-12-01 14:53:53"
}