{
  "name": "Yun-Hao Liu 0001",
  "homepage": "https://people.gix.tsinghua.edu.cn/yunhao",
  "status": "success",
  "content": "åäºæµ© åäºæµ© (English Version) æ¸ åå¤§å­¦å ¨çåæ°å­¦é¢ï¼GIXï¼é¢é¿ æ¸ åå¤§å­¦èªå¨åç³»ææãåå£«çå¯¼å¸ï¼å½å®¶èªç¶åºéå§æ°åºéå¹´åºéè·å¾è ï¼ACM Fellowï¼IEEE Fellowï¼CCF Fellowï¼ACM Chinaè£èªä¸»å¸­ã2023å¹´æä¸ºä¸­å½ç§å­¦é¢é¢å£«å¢éææåéäººã ä¸»è¦ç ç©¶é¢åä¸ºç©èç½ä¸å·¥ä¸äºèç½ãå®¤å å®ä½ä¸ç½ç»è¯æ­ãå ·èº«æºè½å¯¼èªç­ãå ±åè¡¨éè¦å­¦æ¯æååä¼è®®è®ºæ400ä½ç¯ï¼æªè³2025å¹´6æï¼è°·æ­å­¦æ¯å¼ç¨48000ä½æ¬¡ï¼SCIä»å¼12000ä½æ¬¡ï¼h-index105ãè·å¾å½å®¶èªç¶ç§å­¦äºç­å¥ï¼æè²é¨èªç¶ç§å­¦ä¸ç­å¥ï¼æè²é¨ææ¯åæä¸ç­å¥ï¼ä¸­å½è®¡ç®æºå­¦ä¼èªç¶ç§å­¦ä¸ç­å¥ï¼ä¸­å½çµå­å­¦ä¼èªç¶ç§å­¦ä¸ç­å¥ï¼ACMä¸»å¸­å¥ï¼CCFçéå¥ç­å¥é¡¹ï¼è·ACM SenSys 2023æ¶é´æ£éªå¥ï¼å¤æ¬¡è·å¾MobiComï¼SenSysç­å½é èåå­¦æ¯ä¼è®®æä½³è®ºæå¥ã åäºæµ©äº1995å¹´è·æ¸ åå¤§å­¦å·¥å­¦å­¦å£«å­¦ä½ï¼2003å2004å¹´è·ç¾å½å¯æ­æ ¹å·ç«å¤§å­¦å·¥å­¦ç¡å£«åå·¥å­¦åå£«å­¦ä½ï¼2004å¹´è³2011å¹´å¨é¦æ¸¯ç§æå¤§å­¦è®¡ç®æºç³»å·¥ä½ï¼åä»»å©çææãå¯ææãç³»ç ç©¶çé¨ä¸»ä»»ï¼Postgraduate Directorï¼ï¼2011å¹´æ ä»»æ¸ åå¤§å­¦ææï¼2013å¹´è³2017å¹´ä»»ACM Chinaä¸»å¸­ï¼æ¸ åå¤§å­¦è½¯ä»¶å­¦é¢é¢é¿ï¼2018å¹´ä»»ç¾å½å¯æ­æ ¹å·ç«å¤§å­¦è®²å¸­ææï¼MSU Foundation Professorï¼ãè®¡ç®æºç³»ä¸»ä»»ï¼2020å¹´ä»»æ¸ åå¤§å­¦å ¨çåæ°å­¦é¢é¢é¿ï¼èªå¨åç³»ææãå¤æ¬¡åéå¨å½é èåå­¦æ¯ä¼è®®ä¸å°±è®¡ç®æºç½ç»åç³»ç»ç ç©¶ä½å¤§ä¼ç¹éæ¥åï¼Keynote Speechï¼ãä¸»æäºå¤é¡¹å½å®¶èªç¶ç§å­¦åºéå§éå¤§é¡¹ç®ãéç¹é¡¹ç®åç§æé¨éç¹ç åè®¡åé¡¹ç®ç­ Email: yunhao AT tsinghua.edu.cn ç»å: 1990 - 1995 æ¸ åå¤§å­¦èªå¨åç³»ï¼å·¥å­¦å­¦å£« 1995 - 1997 åäº¬å¤å½è¯­å¤§å­¦é«çº§ç¿»è¯å­¦é¢ï¼æå­¦ç¡å£« 1997 - 2001 å¨ä¸­åäººæ°å ±åå½é®çµé¨åä¿¡æ¯äº§ä¸é¨å·¥ä½ 2001 - 2004 ç¾å½å¯è¥¿æ ¹å·ç«å¤§å­¦è®¡ç®æºç³»ï¼å·¥å­¦ç¡å£«ï¼å·¥å­¦åå£« 2004 - 2011 é¦æ¸¯ç§æå¤§å­¦è®¡ç®æºç³»ï¼åä»»å©çææãå¯ææãç³»ç ç©¶çé¨ä¸»ä»» 2011- åèæ¸ åå¤§å­¦ï¼æ ä»»ææ 2013 - 2017 æ¸ åå¤§å­¦è½¯ä»¶å­¦é¢ææãé¢é¿ 2018 - 2020 ç¾å½å¯æ­æ ¹å·ç«å¤§å­¦MSUï¼Foundation Professorï¼è®²å¸­ææï¼ãè®¡ç®æºç³»ä¸»ä»» 2020è³ä» ä»»æ¸ åå¤§å­¦å ¨çåæ°å­¦é¢é¢é¿ï¼æ¸ åå¤§å­¦èªå¨åç³»ææãåå£«çå¯¼å¸ ç§ç æå°±ï¼ ç§ç ç»¼è¿°ï¼ åäºæµ©å´ç»äºèç½åä¸ç©äºèå¼å±ç ç©¶ãæåºäºâä¸ç©ç¸èä¸ç©çâçå¿µãè®¾è®¡åå®ç°äºææ©çåºäºRFIDçç©èç½å®¤å å®ä½ç³»ç»LANDMARCï¼æ¯å½é ä¸å¯¹ç©èç½ä½ç³»ç»æè¿è¡æ¢ç´¢çååç³»ç»ä¹ä¸ï¼è¯¥ç ç©¶è¢«åè¿å¤æ¬ç»å ¸æç§ä¹¦ï¼æä¸ºå¾å¤é«æ ¡ç ç©¶çè¯¾ç¨å å®¹ãæ­¤åè¿ä¸æ­¥æåºå·®åå¢å¼ºå ¨æ¯å¾æ¹æ³ï¼å°åºäºRFIDçå®ä½ç²¾åº¦æé«å°æ¯«ç±³çº§ï¼ç®åä»ä¿æå®ä½ç²¾åº¦çè®°å½ãåäºæµ©è¿åå»ºäºç©èç½å¯æ©å±æ§çè®ºåç©èç½å ·èº«æºè½å¯¼èªçè®ºï¼åæäºè¢«å¨è¯æ­ç­èªç»ç½ææ¯ï¼æ­å»ºäºç»¿éåä¼ ï¼GreenOrbs/CitySeeï¼ç³»ç»ï¼ä¸ºå¤§è§æ¨¡èªç»ç»ç©èç½å¥ å®äºçè®ºåå®è·µåºç¡ã å­¦æ¯è®ºèï¼ è®ºèå ä½è æ¶é´ ISBN å ·èº«æºè½ åäºæµ© 2025 1st Edition, ä¸­ä¿¡åºçç¤¾ï¼2025. ISBN: 978-7-5217-7209-8 Location, Localization, and Localizability - Location-awareness Technology for Wireless Networks Yunhao LiuãZheng Yang 2024 2nd Edition, Springer, Berlin, 2024. ISBN: 978-981-97-3175-6 Wireless Indoor Localization â A Crowdsourcing Approach Chenshu Wuï¼Zheng Yangï¼and Yunhao Liu 2018 1st Editionï¼Springerï¼Berlinï¼2018. ISBN: 978-981-13-0355-5 Content Distribution for Mobile Internet: A Cloud-based Approach Zhenhua Liï¼Yafei Daiï¼Guihai Chenï¼and Yunhao Liu 2016 1st Editionï¼Springerï¼Berlinï¼2016. ISBN: 978-981-10-1462-8 ç©èç½å¯¼è®º åäºæµ© 2022 4th Editionï¼ç§å­¦åºçç¤¾ï¼2022. ISBN: 978-7-0307-2685-8 ä»äºèå°æ°å·¥ä¸é©å½ åäºæµ© 2017 1st Editionï¼æ¸ åå¤§å­¦åºçç¤¾ï¼2017. ISBN: 978-730-24-5297-3 ä»£è¡¨æ§æåè®ºæï¼ Liu Y, Zhang J, Chen Y, Wang W, Yang S, Na X, Sun Y, He Y. Real-time continuous activity recognition with a commercial mmWave radar. IEEE Transactions on Mobile Computing. 2025 March, vol. 24, no. 3, pp. 1684-1698 Liu Y, Liu L, Zheng Y, Liu Y, Dang F, Li N, Ma K. Embodied navigation. Science China Information Sciences. 2025 Apr; 68(4):1-39. Lin H, Liu C, Li Z, Qian F, Li M, Xiong P, Liu Y. Aging or glitching? what leads to poor android responsiveness and what can we do about it?. IEEE Transactions on Mobile Computing 23, no. 2 (2023):1521-1533. Lin H, Li Z, Gao D, Liu Y, Qian F, Xu T, Xiao B, Qin X. Trinity: High-Performance and Reliable Mobile Emulation through Graphics Projection. ACM Transactions on Computer Systems. 2024 Sep 20;42(3-4):1-33. Xie P, Li L, Wang J, Liu Y. Passive Visible Light Tag system for Localization and Posture Estimation. IEEE Transactions on Mobile Computing. 2024 Jan 1. Guo X, He Y, Nan J, Zhang J, Liu Y, Shangguan L. A Low-Power Demodulator for LoRa Backscatter Systems With Frequency-Amplitude Transformation. IEEE/ACM Transactions on Networking. 2024 May 17. Xu Y, Dang F, Xu R, Chen X, Liu Y. LSync: A universal event-synchronizing solution for live streaming. IEEE/ACM Transactions on networking. 2024. Li Z, Li X, Yang X, Wang X, Qian F, Liu Y. Fast uplink bandwidth testing for internet users. IEEE/ACM Transactions on Networking. 2023 Jan 13;31(4):1886-901. Cao H, Xu J, Yang Z, Shangguan L, Zhang J, He X, Liu Y. Scaling up edge-assisted real-time collaborative visual slam applications. IEEE/ACM Transactions on Networking. 2023 Nov 22. Jin M, He Y, Yang S, Liu Y, Yan L, Sun Y. Versatile RFID-based sensing: Model, algorithm, and applications. IEEE Transactions on Mobile Computing. 2022 Jun 10;22(10):6223-36. Wang W, Li J, He Y, Liu Y. Localizing multiple acoustic sources with a single microphone array. IEEE Transactions on Mobile Computing. 2022 Jun 27;22(10):5963-77. Cao H, Xu J, Li D, Shangguan L, Liu Y, Yang Z. Edge assisted mobile semantic visual SLAM. IEEE Transactions on Mobile Computing. 2022 Aug 24;22(12):6985-99. He Y, Zheng Y, Jin M, Yang S, Zheng X, Liu Y. Red: Rfid-based eccentricity detection for high-speed rotating machinery. IEEE Transactions on Mobile Computing. 2019 Dec 27;20(4):1590-601. Jiang C, He Y, Zheng X, Liu Y. OmniTrack: Orientation-aware RFID tracking with centimeter-level accuracy. IEEE Transactions on Mobile Computing. 2019 Oct 28;20(2):634-46. Liu Y, Wang J, Zhang Y, Cheng L, Wang W, Wang Z, Xu W, Li Z. Vernier: Accurate and fast acoustic motion tracking using mobile devices. IEEE Transactions on Mobile Computing. 2019 Oct 7;20(2):754-64. Zhang K, Wu C, Yang C, Zhao Y, Huang K, Peng C, Liu Y, Yang Z. Chromacode: A fully imperceptible screen-camera communication system. Proceedings of the 24th Annual International Conference on Mobile Computing and Networking 2018 Oct 15 (pp. 575-590). Qiao C, Wang J, Liu Y. Beyond QoE: Diversity adaptation in video streaming at the edge. IEEE/ACM Transactions on Networking. 2020 Oct 29;29(1):289-302. Jin M, He Y, Jiang C, Liu Y. Parallel backscatter: Channel estimation and beyond. IEEE/ACM Transactions on Networking. 2021 Mar 12;29(3):1128-40. Zhang D, Yao L, Chen K, Yang Z, Gao X, Liu Y. Preventing sensitive information leakage from mobile sensor signals via integrative transformation. IEEE Transactions on Mobile Computing. 2021 May 6;21(12):4517-28. Gong L, Li Z, Wang H, Lin H, Ma X, Liu Y. Overlay-based android malware detection at market scales: systematically adapting to the new technological landscape. IEEE Transactions on Mobile Computing. 2021 May 12;21(12):4488-501. Guo J, He Y, Jiang C, Jin M, Li S, Zhang J, Xi R, Liu Y. Measuring micrometer-level vibrations with mmWave radar. IEEE Transactions on Mobile Computing. 2021 Oct 7;22(4):2248-61. Guo X, Shangguan L, He Y, Zhang J, Jiang H, Siddiqi AA, Liu Y. Efficient ambient LoRa backscatter with on-off keying modulation. IEEE/ACM Transactions on Networking. 2021 Nov 1;30(2):641-54. Wang X, Zhou Z, Zhao Y, Zhang X, Xing K, Xiao F, Yang Z, Liu Y. Improving urban crowd flow prediction on flexible region partition. IEEE Transactions on Mobile Computing. 2019 Aug 20;19(12):2804-17. Li Y, Zheng J, Li Z, Liu Y, Qian F, Bai S, Liu Y, Xin X. Understanding the ecosystem and addressing the fundamental concerns of commercial MVNO. IEEE/ACM Transactions on Networking. 2020 Apr 10;28(3):1364-77. Lin Q, Yang L, Jia H, Duan C, Liu Y. Revisiting reading rate with mobility: Rate-adaptive reading in COTS RFID systems. Proceedings of the 13th International Conference on emerging Networking EXperiments and Technologies 2017 Nov 28 (pp. 199-211). Wang X, Zhou Z, Xiao F, Xing K, Yang Z, Liu Y, Peng C. Spatio-temporal analysis and prediction of cellular traffic in metropolis. IEEE Transactions on Mobile Computing. 2018 Sep 16;18(9):2190-202. Zhang L, Li XY, Liu K, Liu C, Ding X, Liu Y. Cloak of invisibility: Privacy-friendly photo capturing and sharing system. IEEE Transactions on Mobile Computing. 2018 Oct 30;18(11):2488-501. Duan C, Yang L, Lin Q, Liu Y, Xie L. Robust spinning sensing with dual-rfid-tags in noisy settings. IEEE Transactions on Mobile Computing. 2018 Oct 25;18(11):2647-59. Qian K, Wu C, Yang Z, Zhou Z, Wang X, Liu Y. Enabling phased array signal processing for mobile WiFi devices. IEEE Transactions on Mobile Computing. 2017 Nov 28;17(8):1820-33. Duan C, Yang L, Lin Q, Liu Y. Tagspin: High accuracy spatial calibration of RFID antennas via spinning tags. IEEE Transactions on Mobile Computing. 2018 Jan 22;17(10):2438-51. Ma Q, Zhang S, Zhu T, Liu K, Zhang L, He W, Liu Y. PLP: Protecting location privacy against correlation analyze attack in crowdsensing. IEEE transactions on mobile computing. 2016 Nov 3;16(9):2588-98. Zhou Z, Shangguan L, Zheng X, Yang L, Liu Y. Design and implementation of an RFID-based customer shopping behavior mining system. IEEE/ACM transactions on networking. 2017 Apr 12;25(4):2405-18. Sh",
  "content_length": 31027,
  "method": "requests",
  "crawl_time": "2025-12-01 14:53:47"
}