{
  "name": "Yun Fu 0001",
  "homepage": "http://www1.ece.neu.edu/~yunfu",
  "status": "success",
  "content": "Yun Raymond Fu ' Webpage Y. Raymond Fu     Dr. and Professor GoogleCitation  CSRankings AIRankings  SmileLab  NEUNews  LinkedIn COE Distinguished Professor Member of Academia Europaea (The Academy of Europe) Member of European Academy of Sciences and Arts Fellow of US National Academy of Inventors (NAI) Fellow of AAAS, AAAI, IEEE, AIMBE, OSA, SPIE, IAPR, AAIA. PI and Founding Director of SmileLab Department of ECE, College of Engineering Khoury College of Computer Science (Affiliated) Northeastern University 403 Dana Research Center 360 Huntington Avenue Boston, MA 02115 Ph: (617) 373-7328 E-mail: yunfu AT ece Dot neu Dot edu Publications Notes for Applicants   Map for Visitors Dr. Raymond Fu is widely-renowned AI expert, distinguished professor, and a successful serial entrepreneur. He received the Ph.D. degree in Electrical and Computer Engineering from the University of Illinois at Urbana-Champaign. He is Distinguished Professor affiliated with both College of Engineering and the Khoury College of Computer Sciences at Northeastern University. He has authored more than 500 scientific publications as well as over 50 patented inventions. He received 7 Prestigious Young Investigator Awards from NAE, ONR, ARO, IEEE, INNS, UIUC, Grainger Foundation; 12 Best Paper Awards from IEEE, ACM, IAPR, SPIE, SIAM; many major Industrial Awards from Google, Amazon, Samsung, Adobe, JPMorgan Chase, NEC, Snap, Cisco, Toyota, MERL, PicsArt, Konica Minolta, Zebra, and Mathworks, etc. He is Member of Academia Europaea (MAE), Member of European Academy of Sciences and Arts, Fellow of National Academy of Inventors (NAI), Fellow of AAAS, AAAI, IEEE, AIMBE, IAPR, OSA, SPIE, and AAIA; a Lifetime Distinguished Member of ACM, Lifetime Senior Member of Institute of Mathematical Statistics, member of ACM Future of Computing Academy, Global Young Academy, AAAS, and INNS. Successful in entrepreneurship (4x), he was the Founder and CEO of AI startup Giaran acquired by the prestigious global cosmetic firm Shiseido (Stock 4911: Tokyo) in 2017, which applies his AI based augmented reality technology to benefit Shiseido¡¯s global thousands-of-million e-commerce market. It was the first M&A of such AI based digital cosmetics in the global cosmetics and beauty market. He was also the co-founder, board member, CTO and later Chief Scientist of TVision Insights since 2015, a big data company inventing novel computer vision technology to measure second-by-second, eyes-on-screen Attention to TV and CTV content and ads. Tvision raised in total $58million fund after series B and was the winner of the Advertising Research Foundation's Innovation A-List, Microsoft Innovative Award, Mass Challenge 2015 Gold Award, MIT Innovation Initiative, $100K MIT Entrepreneurship Competition, MIT Enterprise Forum, and First prize of NECINA NEW Accelerator 2015. Research Interests: Artificial Intelligence -- Computer Vision, Machine Learning, Data Mining Academy and Fellow: Fellow of Association for the Advancement of Artificial Intelligence (AAAI) (since 2025),  Fellow of American Institute For Medical and Biological Engineering (since 2024), Member of European Academy of Sciences and Arts (EASA) (since 2023), Fellow of National Academy of Inventors (NAI) (since 2023), Member of Academia Europaea (MAE) (since 2022), AAAS (since 2022) IEEE Fellow (since 2019), OSA Fellow (since 2019), SPIE Fellow (since 2018), IAPR Fellow (since 2016), AAIA Fellow (since 2021), ACM Future of Computing Academy (since 2017), Global Young Academy (GYA member), Beckman Institute (Beckman Graduate Fellow, 2007-2008), ACM (life Distinguished member), AAAI (life Senior member). Entrepreneurship: Co-Founder of Bithuman; Founder of AInnovation Labs; Founder and CEO of Giaran [Acquired by Shiseido(Stock 4911:Tokyo) in 2017]; Co-Founder and CTO of Tvision Insights [58Million funding since 2015]. Associate Editor: ACM Transactions on Knowledge Discovery from Data (TKDD)(2020-), IEEE Transactions on Pattern Analysis and Machine Intelligence (TPMAI) (2023-). Former PhD and Postdoc: Prof. Ming Shao (Umass), Prof. Sheng Li (U of Virginia), Prof. Hongfu Liu (Brandeis U), Prof. Allan Ding (Tulane U), Prof. Zhiqiang Tao (RIT), Prof. Yu Kong (MSU), Dr. Joe Robinson (Amazon), Dr. Handong Zhao (Adobe), Dr. Yue Wu (Microsoft), Dr. Kunpeng Li (Meta), Dr. Kai Li (Meta), Dr. Lichen Wang (Zillow), Dr. Songao Jiang (Amazon), Prof. Yu Yin (CWRU). News -  02/2025, Selected in 2024 Stanford University List of Top 2% Scientists Worldwide -  01/2025, 3 papers accepted by ICLR25. -  01/2025, elected to Fellow of Association for the Advancement of Artificial Intelligence (AAAI) Last Update: 04-15-2025, Copyright 2004~2025, Raymond Fu, All Rights Reserved",
  "content_length": 4728,
  "method": "requests",
  "crawl_time": "2025-12-01 14:53:51"
}