{
  "name": "Yun Huang 0003",
  "homepage": "https://ischool.illinois.edu/people/yun-huang",
  "status": "success",
  "content": "Yun Huang | School of Information Sciences School of Information Sciences Search Visit What is an iSchool? Request Information Upcoming Events Tuition & Financial Support Recruitment & Admissions Staff iSchool Ambassadors Student Videos Academics Undergraduate Graduate Informatics Programs Course Catalog People Dean's Cabinet Faculty Staff Adjuncts & Affiliates Emeriti Faculty Doctoral Students Committees School Directory Research Areas Projects Vision Labs Services Showcase Research Fellows Scholars-in-Residence Postdoctoral Researchers Videos Engage Corporate Recruit iSchool Talent Give Host a Practicum Alumni Dean's Council Student Life Academic Support Center Student Development Opportunities Student Organizations Convocation Practicum & Career Courses Career Support Help Desk News News Feed Events Calendar In the Media Publications Upcoming Events Lectures Awards About Strategic Plan History Data and Reporting iSchool at a Glance Building Facilities Community Job Openings Contact Us Yun Huang Associate Professor PhD, Information and Computer Science, University of California, Irvine Room 5135, 614 E. Daniel St. (217) 244-2368 yunhuang@illinois.edu https://yunhuang.web.illinois.edu https://salt.ischool.illinois.edu Other professional appointments Faculty Affiliate, Department of Computer ScienceFaculty Affiliate, Illinois InformaticsFaculty Affiliate, Siebel Center for Design Research focus Human-computer interaction, social computing, mobile computing, computer-supported cooperative work, human-AI interaction, conversational agents, social media, and crowdsourcing. Honors and Awards Linowes Faculty Fellowship, the Cline Center, University of Illinois, 2024-2025Awardee of OpenAI Researcher Access Program (2024)2024-2025 Emerging Research Leaders Academy at the Illinois Institute for Health Sciences and Technology Co-Investigator of an OpenAI project (2023)Co-Investigator of an NSF-led AI Institute (2023)Institute of Museum and Library Services (IMLS) Early Career Development Grant (2022)Teacher Ranked as Excellent, University of Illinois (Spring 2021, Fall 2021, Spring 2022, Fall 2023)NSF CRII award Google Faculty Research AwardBest Paper Honorable Mention at the ACM CHI ConferenceNSF I-Corps AwardiConference Best Paper Award Biography Yun Huang is an associate professor in the School of Information Sciences at the University of Illinois at Urbana-Champaign. She co-directs the Social Computing Systems (SALT) Lab. Before joining Illinois, she was a faculty member in the School of Information Studies at Syracuse University and a postdoc fellow at Carnegie Mellon University. Her work focuses on social computing systems research, in which she examines context-driven approaches of designing crowdsourcing systems. For example, her research examines how different contexts impact user contributions to crowdsourcing systems; how to leverage these contextual effects to design innovative social computing systems that can better engage users; and how crowdsourced user behavioral data may help better understand users and the community. She received her PhD from the Donald Bren School of Information and Computer Sciences at the University of California, Irvine. She earned her bachelor's degree from the Department of Computer Science and Technology at Tsinghua University, in Beijing, China. Courses currently teaching Fall 2025 - Independent Study - IS389YHU Fall 2025 - Intro Gen AI for Human-AI Coll - IS492AIG Fall 2025 - Intro Gen AI for Human-AI Coll - IS492AIU Fall 2025 - Independent Study - IS589YH Spring 2026 - Independent Study - IS189YH Spring 2026 - Independent Study - IS389YH Spring 2026 - Independent Study - IS389YHU Spring 2026 - Intro to Generative AI for Hum - IS492BIG Spring 2026 - Intro to Generative AI for Hum - IS492BIU Spring 2026 - Independent Study - IS589YH Office hours By appointment, please contact professor Publications & Papers Yongming Li, Hangyue Zhang, Andrea Yaoyun Cui, Zisong Ma, Yunpeng Song, Zhongmin Cai, Yun Huang (2025). EyeSee: Enhancing Art Appreciation through Anthropomorphic Interpretations from Multiple Perspectives. In Proceedings of the Conference on Human Factors in Computing Systems (CHI), 2025.Runze Cai, Nuwan Janaka, Hyeongcheol Kim, Yang Chen, Shengdong Zhao, Yun Huang, David Hsu (2025). AiGet: Transforming Everyday Moments into Hidden Knowledge Discovery with AI Assistance on Smart Glasses. In Proceedings of the Conference on Human Factors in Computing Systems (CHI), 2025.Yang Chen, Felicia Fang-Yi Tan, Zhuoyu Wang, Xing Liu, Jiayi Zhang, Yun Huang, Shengdong Zhao, Ching Chiuan Yen (2025). ViFeed: Promoting Slow Eating and Food Awareness through Strategic Video Manipulation during Screen-Based Dining. In Proceedings of the Conference on Human Factors in Computing Systems (CHI), 2025. *Recipient of an honorable mention paper award, given to the top 5% of conference papersQingxiao Zheng, Minrui Chen, Hyanghee Park, Zhongwei Xu, Yun Huang (2025). Evaluating Non-AI Experts' Interaction with AI: A Case Study in Library Context. In Proceedings of the Conference on Human Factors in Computing Systems (CHI), 2025.Qingxiao Zheng, Minrui Chen, Pranav Sharma, Yiliu Tang, Mehul Oswal, Yiren Liu, Yun Huang (2025). EvAlignUX: Advancing UX Evaluation through LLM-Supported Metrics Exploration. In Proceedings of the Conference on Human Factors in Computing Systems (CHI), 2025.Hyanghee Park, Sol Bee Jung, Young Hee Byun, Daehwan Ahn, Chan Woo Park, Sunjoo Byun, Yun Huang (2025). Lessons from Real-World Settings: What Makes It Uniquely Difficult to Design Cognitive Training Programs for Children with Autism Spectrum Disorder and Other Developmental Disabilities. In Proceedings of the Conference on Human Factors in Computing Systems (CHI), 2025.Yiliu Tang, Jason Situ, Andrea Yaoyun Cui, Mengke Wu, Yun Huang (2025). LLM Integration in Extended Reality: A Comprehensive Review of Current Trends, Challenges, and Future Perspectives. In Proceedings of the Conference on Human Factors in Computing Systems (CHI), 2025.Si Chen, Jingyi Xie, Ge Wang, Haizhou Wang, Haocong Cheng, Yun Huang (2025). From Scores to Careers: Understanding AI’s Role in Supporting Collaborative Family Decision-Making in Chinese College Applications. In Proceedings of the Conference on Human Factors in Computing Systems (CHI), 2025.Qingxiao Zheng,  Abhinav Choudhry, Zihan Liu, Parisa Rabbani, Yuting Hu, Abbie Olszewski, Yun Huang, Jinjun Xiong (2025).  AI-Enhanced Speech-Language Intervention Documentation: Opportunities and Design Goals. In the Proceedings of the 26th International Conference on Artificial Intelligence in Education (AIED), 2025Yiren Liu, Pranav Sharma, Mehul Oswal, Haijun Xia, Yun Huang (2025). PersonaFlow: Designing LLM-Simulated Expert Perspectives for Enhanced Research Ideation. In the Proceedings of the ACM Designing Interactive Systems. Presentations Yun Huang, Towards Building the Mobile Crowdsourcing Genome, School of Information, University of Michigan, 2019.Yun Huang, Qunfang Wu, Yaxing Yao: Bluetooth Low Energy (BLE) Beacons Alone Didn't Work!, the ACM International Joint Conference on Pervasive and Ubiquitous Computing and Proceedings of the 2018 ACM International Symposium on Wearable Computers (Ubicomp 2018).Qunfang Wu, Yisi Sang, Shan Zhang, Yun Huang: Danmaku vs. Forum Comments: Understanding User Participation and Knowledge Sharing in Online Videos, the 25th ACM International Conference on Supporting Group Work (GROUP), 2018.Yun Huang, Yifeng Huang, Na Xue, Jeffery Bigham (2017): Leveraging Complementary Contributions of Different Workers for Efficient Crowdsourcing of Video Captions. the ACM Conference on Human Factors in Computer Systems (CHI 2017).Yun Huang, Crowdsourcing for Community Engagement, School of Information Management, Peking University, Beijing China, 2017.Yun Huang, Brian Dobreski, Huichuan Xia: Human Library: Understanding Experience Sharing as a Participatory Service. the ACM Conference on Computer-Supported Cooperative Work and Social Computing (CSCW 2017).Yun Huang, Data-Driven Approaches to Understanding Community Policing on Social Media Platforms, the 2nd International Conference on Computational Social Science (IC2S2 2016) Conference, Chicago, IL.Yun Huangm, Municipal Police Departments on Facebook: What Are They Posting and Are People Engaging?, The 17th Annual International Conference on Digital Government Society (DG.O 2016) Conference, Shanghai, China.Yun Huang, Modeling Sharing Decision of Campus Safety Reports and Its Design Implications to Mobile Crowdsourcing for Safety, the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services, Copenhagen (MobileHCI), Denmark.Yun Huang, Emotion Map: A Mobile Social System for Improving Emotion Awareness and Regulation, CSCW 2015 Conference, Vancouver, Canada. Active Research Projects Advancing STEM Online Learning by Augmenting Accessibility with Interactive Companionship Inclusive AI: A ChatGPT Plugin and DAO for Engaging Vulnerable Groups in AI Completed Research Projects I-Corps: Beacon-Enabled Smart Location-Based Service Teach High School Students about Cybersecurity and AI Ethics via Empathy-Driven Hands-On Projects In the News iSchool well represented at ASIS&T 2025 November 10 2025 iSchool researchers present at CSCW 2025 October 9 2025 Huang named a 2025–2026 Linowes Fellow July 28 2025 iSchool cohosts data science scholars through Bolashak International Scholarship Program May 14 2025 iSchool researchers to present at CHI 2025 April 23 2025 Faculty receive support for AI-related projects from new pilot program March 17 2025 iSchool participation in iConference 2025 March 11 2025 Youth-AI-Safety named a winning team in international hackathon March 6 2025 SafeRBot to assist community, police in crime reporting January 22 2025 Huang awarded Linowes Fellowship August 22 2024 Research Areas: Community Informatics Computational Social Science, Social Computing Computing for Social Good ",
  "content_length": 10289,
  "method": "requests",
  "crawl_time": "2025-12-01 14:53:47"
}