{
  "name": "Yun Chen 0007",
  "homepage": "https://yunc.me",
  "status": "success",
  "content": "Language Intelligence and MAchine Learning (LIMaL) Lab – Homepage of CHEN Yun, focus on NLP and machine learning from SUFE Skip to main content CHEN Yun (陈云) Associate professor School of Information Management & Engineering Shanghai University of Finance and Economics yunchen[at]sufe[dot]edu[dot]cn [Google Scholar] Biography I am an associate professor in SUFE, working on natural language processing. I received the Ph.D.  degree from The University of Hong Kong in 2018, under the supervision of Prof. Victor O.K. Li, and received the bachelor degree from Tsinghua University in 2013. I was a visiting scholar with the Tsinghua Natural Language Processing Group and NYU CILVR Group. Before joining SUFE, I worked as a phonetic & semantics researcher at Huawei Noah’s Ark Lab in Hong Kong during 2018-2019. I served as an AC for EMNLP 2022, CCL 2023 and an reviewer for ACL, EMNLP, AAAI, COLING, AACL, AIJ, FCS, TALLIP, JCST. I have broad research interests in machine learning and natural language processing. Currently, I am mainly working on large language model and multilingual multimodal learning. Positions avaliable: Master/PhD program students. 招收博士生、硕士生和本科生，欢迎有志于研究生成式人工智能的学生加入本课题组！请附简历邮件联系 What’s New? 2025-08. We have two papers accepted by EMNLP 2025 conference,Pi-SQL: Enhancing Text-to-SQL with Fine-Grained Guidance from Pivot Programming Languages, and G2: Guided Generation for Enhanced Output Diversity in LLMs 2025-07, I will serve as an Area Chair for Arr 2025 July 2025-05. We have three papers accepted by ACL 2025 conference,ImPart: Importance-Aware Delta-Sparsification for Improved Model Compression and Merging in LLMs, TAG-INSTRUCT: Controlled Instruction Complexity Enhancement through Structure-based Augmentation,and FANNO: Augmenting High-Quality Instruction Data with Open-Sourced LLMs Only 2025-01. We have four papers accepted by NAACL 2025 conference,MiLoRA: Harnessing Minor Singular Components for Parameter-Efficient LLM Finetuning, SeqAR: Jailbreak LLMs with Sequential Auto-Generated Characters, FinEval: A Chinese Financial Domain Knowledge Evaluation Benchmark for Large Language Models and LayAlign: Enhancing Multilingual Reasoning in Large Language Models via Layer-Wise Adaptive Fusion and Alignment Strategy 2024-09. We have two papers accepted by NeurIPS 2024 conference, SeTAR: Out-of-Distribution Detection with Selective Low-Rank Approximation and Delta-CoMe: Training-Free Delta-Compression with Mixed-Precision for Large Language Models 2024-09. We have one long papers accepted by EMNLP 2024 main conference, Distract Large Language Models for Automatic Jailbreak Attack 2024-05. We have two long papers accepted by ACL 2024 (one main conference, one findings), LoRA-Flow: Dynamic LoRA Fusion for Large Language Models in Generative Tasks  and PACIT: Unlocking the Power of Examples for Better In-Context Instruction Tuning 2024-03. We release the Technology and Security White Paper on the Application of Large Language model in Finance with Ant Group and BCTC [PDF] 2023-08, we have one paper awarded as the best English paper by CCL 2023, Lexical Complexity Controlled Sentence Generation for Language Learning 2023-05, we have one long paper accepted by ACL 2023 main conference, mCLIP: Multilingual CLIP via Cross-lingual Transfer 2023-04, I will serve as an Area Chair for CCL 2023 Selected Publications G2: Guided Generation for Enhanced Output Diversity in LLMs Zhiwen Ruan, Yixia Li, Yefeng Liu, Yun Chen, Weihua Luo, Peng Li, Yang Liu, Guanhua Chen. In Proceedings of EMNLP 2025. (CCF B) Pi-SQL: Enhancing Text-to-SQL with Fine-Grained Guidance from Pivot Programming Languages. Hanqing Wang, Zonghan Yang, Jian Yang, Xiao Yan, Yun Chen, Guanhua Chen. In Findings of  EMNLP 2025. (CCF B) ImPart: Importance-Aware Delta-Sparsification for Improved Model Compression and Merging in LLMs Yan Yang, Yixia Li, Hongru Wang, Xuetao Wei, Jianqiao Yu, Yun Chen*, Guanhua Chen. In Proceedings of ACL 2025. (CCF A) TAG-INSTRUCT: Controlled Instruction Complexity Enhancement through Structure-based Augmentation He Zhu, Zhiwen Ruan, Junyou Su, Xingwei He, Wenjia Zhang, Yun Chen, Guanhua Chen. In Findings of  ACL 2025. (CCF A) FANNO: Augmenting High-Quality Instruction Data with Open-Sourced LLMs Only He Zhu, Yifan Ding, Yicheng Tao, Zhiwen Ruan, Yixia Li, Wenjia Zhang, Yun Chen, Guanhua Chen. In Findings of  ACL 2025. (CCF A) MiLoRA: Harnessing Minor Singular Components for Parameter-Efficient LLM Finetuning Hanqing Wang, Yixia Li, Shuo Wang, Guanhua Chen, Yun Chen*. In Proceedings of NAACL 2025. (CCF B) [PDF] SeqAR: Jailbreak LLMs with Sequential Auto-Generated Characters Yan Yang, Zeguan Xiao, Xin Lu, Hongru Wang, Xuetao Wei, Hailiang Huang, Guanhua Chen, Yun Chen*. In Proceedings of NAACL 2025.  (CCF B) [PDF] FinEval: A Chinese Financial Domain Knowledge Evaluation Benchmark for Large Language Models Xin Guo,…, Yun Chen, Weining Shen, Liwen Zhang. In Proceedings of NAACL 2025.  (CCF B) [PDF] LayAlign: Enhancing Multilingual Reasoning in Large Language Models via Layer-Wise Adaptive Fusion and Alignment Strategy Zhiwen Ruan, Yixia Li, He Zhu, Longyue Wang, Weihua Luo, Kaifu Zhang, Yun Chen, Guanhua Chen. In Findings of NAACL 2025.  (CCF B) [PDF] SeTAR: Out-of-Distribution Detection with Selective Low-Rank Approximation Yixia Li, Boya Xiong, Guanhua Chen, Yun Chen*. In Proceedings of NeurIPS 2024. (CCF A) [PDF] Delta-CoMe: Training-Free Delta-Compression with Mixed-Precision for Large Language Models Bowen Ping, Shuo Wang, Hanqing Wang, Xu Han, Yuzhuang Xu, Yukun Yan, Yun Chen, Baobao Chang, Zhiyuan Liu, Maosong Sun. In Proceedings of NeurIPS 2024. (CCF A) [PDF] Distract Large Language Models for Automatic Jailbreak Attack Zeguan Xiao, Yan Yang, Guanhua Chen, Yun Chen*. In Proceedings of EMNLP 2024. (CCF B) [PDF] LoRA-Flow: Dynamic LoRA Fusion for Large Language Models in Generative Tasks Hanqing Wang, Bowen Ping, Shuo Wang, Xu Han, Yun Chen*, Ziyuan Liu, Maosong Sun.  In Proceedings of ACL 2024. (CCF A) [PDF] PACIT: Unlocking the Power of Examples for Better In-Context Tianci Xue,  Ziqi Wang, Yixia Li, Yun Chen, Guanhua Chen.  In Findings of ACL 2024. (CCF A) StyleBART: Decorate Pretrained Model with Style Adapters for Unsupervised Stylistic Headline Generation Hanqing Wang, Yajing Luo, Boya Xiong, Guanhua Chen, Yun Chen*. In Findings of EMNLP 2023. (CCF B) [PDF] mCLIP: Multilingual CLIP via Cross-lingual Transfer Guanhua Chen, Lu Hou, Yun Chen, Wenliang Dai, Lifeng Shang, Xin Jiang, Qun Liu, Jia Pan, Wenping Wang. In Proceedings of ACL 2023. (CCF A) [PDF] Lexical Complexity Controlled Sentence Generation for Language Learning Jinran Nie, Liner Yang, Yun Chen, Cunliang Kong, Junhui Zhu, Erhong Yang. In Proceedings of CCL 2023. (Best English paper) [PDF] XLM-D: Decorate Cross-lingual Pre-training Model as Non-Autoregressive Neural Machine Translation Yong Wang, Shilin He, Guanhua Chen, Yun Chen, Daxin Jiang. In Proceedings of EMNLP 2022. (CCF B) [PDF] Multilingual Sentence Transformer as A Multilingual Word Aligner Weikang Wang, Guanhua Chen, Hanqing Wang, Yue Han, Yun Chen*. In Findings of EMNLP 2022. (short, CCF B) [PDF] Towards Making the Most of Cross-Lingual Transfer for Zero-Shot Neural Machine Translation Guanhua Chen, Shuming Ma, Yun Chen*, Li Dong, Dongdong Zhang, Jia Pan, Wenping Wang, Furu Wei. In Proceedings of ACL 2022. (CCF A) [PDF] Multitasking Framework for Unsupervised Simple Definition Generation Cunliang Kong, Yun Chen, Hengyuan Zhang, Liner Yang, Erhong Yang. In Proceedings of ACL 2022. (CCF A) [PDF] Zero-shot Cross-lingual Transfer of Neural Machine Translation with Multilingual Pretrained Encoders Guanhua Chen, Shuming Ma, Yun Chen*, Li Dong, Dongdong Zhang, Jia Pan, Wenping Wang, Furu Wei. In Proceedings of EMNLP 2021. (CCF B) [PDF] Lexically Constrained Neural Machine Translation with Explicit Alignment Guidance Guanhua Chen, Yun Chen*, Victor O.K. Li. In Proceedings of AAAI 2021. (CCF A) [PDF] Accurate Word Alignment Induction from Neural Machine Translation Yun Chen, Yang Liu, Guanhua Chen, Xin Jiang, Qun Liu. In Proceedings of EMNLP 2020. (CCF B) [PDF] Lexical-Constraint-Aware Neural Machine Translation via Data Augmentation Guanhua Chen, Yun Chen*, Yong Wang, Victor O.K. Li. In Proceedings of IJCAI 2020. (CCF A) [PDF] Perturbed Masking: Parameter-free Probing for Analyzing and Interpreting BERT Zhiyong Wu, Yun Chen, Ben Kao, Qun Liu. In Proceedings of ACL 2020. (CCF A) [PDF] Reinforced Zero-shot Cross-lingual Neural Headline Generation Yana A, Yun Chen, Cheng Yang, Zhiyuan Liu, Maosong Sun. In IEEE Trans. on Audio, Speech and Language Processing (IEEE TASLP) 2020. (CCF B) [LINK] Incorporating Sememes into Chinese Definition Modeling. Liner Yang, Cunliang Kong, Yun Chen, Yang Liu, Qinan Fan, Erhong Yang. In IEEE Trans. on Audio, Speech and Language Processing (IEEE TASLP) 2020. (CCF B) [LINK] A Stable and Effective Learning Strategy for Trainable Greedy Decoding. Yun Chen, Victor O.K. Li, Kyunghyun Cho, and Samuel R. Bowman. In Proceedings of EMNLP 2018. (CCF B) [PDF] Meta-Learning for Low-Resource Neural Machine Translation. Jiatao Gu, Yong Wang, Yun Chen, Victor O.K. Li, and Kyunghyun Cho. In Proceedings of EMNLP 2018. (CCF B) [PDF] Zero-Resource Neural Machine Translation with Multi-Agent Communication Game. Yun Chen, Yang Liu, and Victor O.K. Li. In Proceedings of AAAI 2018. (CCF A) [PDF] Stable and Effective Trainable Greedy Decoding for Sequence to Sequence Learning. Yun Chen, Kyunghyun Cho, Samuel R. Bowman, and Victor O.K. Li. ICLR workshop, 2018. [PDF] Zero-shot cross-lingual neural headline generation. Ayana, Shen Shiqi, Yun Chen, Cheng Yang, Zhiyuan Liu, and Maosong Sun. In IEEE Trans. on Audio, Speech and Language Processing (IEEE TASLP) 2018. (CCF B) [LINK] A Teacher-Student Framework for Zero-Resource Neural Machine Translation. Yun Chen, Yang Liu, Yong Cheng and Victor O.K. Li. In Proceedings of ACL 2017. (CCF A) [PDF] Last updated at Feb-2025 33,418 views",
  "content_length": 9971,
  "method": "requests",
  "crawl_time": "2025-12-01 14:53:45"
}