{
  "name": "Yun Wu 0003",
  "homepage": "https://pure.qub.ac.uk/en/persons/yun-wu-2",
  "status": "success",
  "content": "Yun Wu - Queen's University Belfast View Scopus Profile Yun Wu Dr Lecturer, School of Electronics, Electrical Engineering and Computer Science https://orcid.org/0000-0001-9332-2858 Emailyun.wuqub.acuk Accepting PhD StudentsPhD projectsI am accepting PhD applicantions for resilient efficient embedded systems; reliable edge AI; energy-aware autonomy. 20112025 Research activity per year Personal profile Research InterestsApproximate ComputingEmbedded Systems & Reconfigurable ArchitecturesEnergy-Efficient System DesignComputer Vision & Machine LearningAutonomous Vehicles & Sensor FusionHardware SecurityResearch StatementMy research aims to improve how edge autonomy functions by developing new accelerator architectures, approximate computing techniques, and software/hardware co-designs. I focus on adaptive approximation methods that boost energy efficiency and fault tolerance without sacrificing accuracy. I also work on creating low-power accelerators and ML/AI frameworks for real-world platforms. I study new vulnerabilities in modern embedded systems, such as fault injections, and create effective, simple defenses to protect edge computation on devices with limited capacity. Looking forward, my goal is to build reliable approximate accelerators in embedded systems and investigate how ML/AI can help identify and address issues related to hardware efficiency, ultimately improving robustness and resilience at the edge.Research FocusApproximate Computing – designing adaptive approximation techniques for resource-constrained edge computing systems. Edge Autonomy – building and testing energy-efficient accelerators and autonomy frameworks on real platforms. Hardware Resilience – modelling emerging hardware vulnerability and developing mitigation hardware architectures. KeywordsQA75 Electronic computers. Computer scienceEmbedded SystemsApproximate ComputingComputer ArchitectureReconfigurable AcceleratorComputer VisionMachine LearningAutonomous Systems Fingerprint Dive into the research topics where Yun Wu is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 12 Similar Profiles Detection Computer Science 100% Field Programmable Gate Arrays Computer Science 95% Application Computer Science 89% Algorithms Computer Science 83% multiple-input-multiple-output Computer Science 67% MIMO Computer Science 67% Complexity Computer Science 67% Computation Computer Science 53% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output Research output per year 2011 2013 2016 2017 2020 2021 2022 2025 2025 20 Conference contribution 6 Paper 6 Article Research output per year Research output per year AxRA: approximate Rowhammer attack for modern DRAM systemsHao, Y., Wu, Y., Ni, Z., Miskelly, J., O'Neill, M. & Gu, C., 27 Jun 2025, IEEE International Symposium on Circuits and Systems (ISCAS) 2025: Proceedings. Institute of Electrical and Electronics Engineers Inc., (IEEE International Symposium on Circuits and Systems: Proceedings).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open AccessFile Approximate Computing 100% Neural Network 100% Fault Tolerant 50% Power Consumption 50% Image Processing 50% 19 Downloads (Pure) Efficient co-approximate parallel compressive depth reconstruction on FPGAWu, Y. & McAllister, J., 07 Mar 2025, IEEE International Conference on Acoustics, Speech, and Signal Processing (ICASSP 2025): Proceedings. Institute of Electrical and Electronics Engineers Inc., 5 p. (IEEE International Conference on Acoustics, Speech and Signal Processing: Proceedings).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open AccessFile Field Programmable Gate Arrays 100% Image Reconstruction 66% Speed-up 33% Parallel Processing 33% Process Optimization 33% 12 Downloads (Pure) Emerging scope and design challenges for approximate computing: optimizing accuracy-PPA trade-offs and beyondSahoo, S. S., Deveautour, B., Traiola, M., Gu, C., Wu, Y., Japa, A., Ullah, S. & Kumar, A., 05 Jun 2025, (Accepted) In: ACM Transactions on Embedded Computing Systems.Research output: Contribution to journal › Article › peer-review Rowhammer mitigation by approximate computing: a compressed sensing case studyHao, Y., Wu, Y., Jiang, M., O'Neill, M. & Gu, C., 20 Nov 2025, 2025 IEEE/ACM International Conference On Computer Aided Design (ICCAD): Proceedings . IEEE, 8 p. (EEE/ACM International Conference On Computer Aided Design (ICCAD)).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open AccessFile Dynamic Random Access Memory 100% Memory Frequency 66% Sensor Signal Processing 66% Universal approximated real-valued fast fourier transform for image blur detectionWang, X. & Wu, Y., 05 May 2025, (Accepted) Proceedings of the 2025 36th Irish Signals and Systems Conference (ISSC). Institute of Electrical and Electronics Engineers Inc., (Proceedings of the Irish Systems and Signals Conference, ISSC ).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Fast Fourier Transform 100% Artificial Neural Network 100% Hidden Layer 40% Computational Complexity 40% Complexity Reduction 40% View all 32 research outputs Prizes Associate Fellowship of Higher Education AcademyWu, Y. (Recipient), Aug 2025Prize: Other distinction EPS Innovation in Teaching Funding 2023Wu, Y. (Recipient), 2023Prize: Other distinction Activities Activities per year 2023 2024 2025 2025 12 Publication peer-review 8 Participation in conference 3 Participation in workshop, seminar, course 2 Other 3 More 1 Membership of peer review panel or committee 1 Membership of national or international committees and working groups 1 Visiting an external academic institution Activities per year IEEE Transactions on Computers (Journal)Wu, Y. (Peer reviewer)Aug 2025Activity: Publication peer-review and editorial work types › Publication peer-review IEEE Nanotechnology Magazine (Journal)Wu, Y. (Peer reviewer)Jul 2025Activity: Publication peer-review and editorial work types › Publication peer-review Irish Signals and System Conference 2025Wu, Y. (Participant)09 Jun 2025Activity: Participating in or organising an event types › Participation in conference EPSRC Peer Review College (External organisation)Wu, Y. (Advisor)Jun 2025 → …Activity: Membership types › Membership of peer review panel or committee EPS Summer InternshipWu, Y. (Recipient)Jun 2025 → Aug 2025Activity: Other activity types › Other View all 28 activities",
  "content_length": 6880,
  "method": "requests",
  "crawl_time": "2025-12-01 14:53:51"
}