{
  "name": "Yun Lu 0001",
  "homepage": "https://yunlupage.wordpress.com",
  "status": "success",
  "content": "Yun Lu Personal Homepage Email: yunlu[at]uvic.ca Office: ECS 518 I am an assistant professor at University of Victoria. I received my PhD from the School of Informatics at the University of Edinburgh, supervised by Professor Vassilis Zikas. My research interests include differential privacy, secure MPC, rational cryptography, and provable security.I received my BSc and MSc in Computer Science from University of California, Los Angeles (UCLA). I am looking for PhD students, *particular in the area of differential privacy*! If you are interested in working with me at UVic, please don’t hesitate to contact me with your CV, transcript(s), and (if applicable) your IELTS/TOEFL scores. Please also let me about your research interests and research background, so we can determine if we are a good fit. My current students (alphabetical order by last name): Mahboubeh Bahari, Yanchen Fan, Tyler Makaro, Tiger Wu (graduated) *Note on emails: If you are a student in my class: For non-urgent emails (administrative questions, non-urgent requests, questions about the course content), please allow me up to 2 business days to respond. Afterwards, feel free to send a reminder (yours might have been buried under a pile of other emails!). Please mark urgent emails with “Urgent [Course Title]:” in the subject line so I can more quickly respond to them. Prospective students: Please allow me up to 5 business days to respond before sending a reminder. Research 2025202420232022Önder Askin, Holger Dette, Martin Dunsche, Tim Kutta, Yun Lu, Yu Wei, Vassilis Zikas. General-Purpose f-DP Estimation and Auditing in a Black-Box Setting. To appear in USENIX 2025.Ahmed Musa Awon, Yun Lu, Shera Potka, Alex Thomo. CluSanT: Differentially Private and Semantically Coherent Text Sanitization. Nations of the Americas Chapter of the Association for Computational Linguistics (NAACL) 2025. Link.Juan Garay, Yun Lu, Julien Prat, Brady Testa, Vassilis Zikas. A Composability Treatment of Bitcoin’s Transaction Ledger with Variable Difficulty. Financial Cryptography (FC) 2025.Yun Lu, Malik Magdon-Ismail, Yu Wei, Vassilis Zikas. Eureka: A General Framework for Black-box Differential Privacy Estimators. Security and Privacy (SP) 2024. Link to ePrint.Rui Liu, Yun Lu, Jianping Pan. Flexible Non-interactive Short-term Implicit Certificate Generation for VANETs, 2023. (In submission). Link to ePrint.Michele Ciampi, Yun Lu, and Vassilis Zikas. Collusion-preserving computation without a mediator. Published in CSF 2022. Link to ePrint. Link to preliminary version talk.2021Christian Badertscher, Yun Lu, and Vassilis Zikas. A Rational Protocol Treatment of 51% Attacks. Published in CRYPTO 2021. Link to ePrint.2020Ao Liu, Yun Lu, Lirong Xia, Vassilis Zikas. How Private Are Commonly-Used Voting Rules? Published in Proceedings UAI 2020. Link to arXiv. Link to talk.2018Yun Lu, Konstantinos Mitropoulos, Rafail Ostrovsky, Avraham Weinstock, and Vassilis Zikas. Cryptographically secure detection of injection attacks. Published as poster in Proceedings CCS 2018. Teaching 20252024202320222019CS 429/529: CryptographyCS 110: Fundamentals of ProgrammingCS 110: Fundamentals of ProgrammingCS 429/529: CryptographyCS 588A: Topics on Data PrivacyCS 110: Fundamentals of ProgrammingCS 588A: Topics on Data PrivacyDuring my visit to Simons Institute, I led a session teaching differential privacy at the Berkeley Math Circle (BMC) to high school students.2016-2017Teaching assistant at RPI for courses: (1) Foundations of Computer Science and (2) Cryptography II. Responsibilities included grading, conducting office hours, exam proctoring, and leading recitation sessions.Co-supervisor: Connor Hadley (MSc.) at RPI; Thesis: “Secure Multiparty Differentially Private Mechanisms”2014-2016Teaching assistant at UCLA for courses: (1) Computer Organization (for two quarters), (2) Mathematical Modeling for Computer Science, (3) Software Engineering (for two quarters), and (4) Programming Languages. Responsibilities included grading, office hours, exam proctoring, and leading weekly discussion sessions. Teaching evaluations from students are available upon request. CV cvDownload Privacy & Cookies: This site uses cookies. By continuing to use this website, you agree to their use. To find out more, including how to control cookies, see here: Cookie Policy Loading Comments... Write a Comment... Email (Required) Name (Required) Website Yun Lu Personal Homepage Sign up Log in Copy shortlink Report this content Manage subscriptions",
  "content_length": 4510,
  "method": "requests",
  "crawl_time": "2025-12-01 14:53:46"
}