{
  "name": "Yun Lin 0001",
  "homepage": "http://linyun.info",
  "status": "success",
  "content": "LIN Yun's Blog Email: lin_yun ~ sjtu DOT edu DOT cn Office: SEIEE Building, No.3, 526A Dr. LIN, Yun (æäº) I am an Associate Professor and the Deputy Head of the Department of Computer Science and Technology, School of Computer Science, Shanghai Jiao Tong University. Before joining SJTU, I was a Research Assistant Professor working with Prof. Dong Jin Song in National University of Singapore. My expertise ranges from automatic programming, explainble AI, and web misinformation (see research profile). A Chinese version of introduction is available here. If you are interested in joining our CoPhi group, please read the advice. News [2025/10/16] Our work \"MINES: Explainable Anomaly Detection through Web API Invariant\tInference\" is to appear in ICSE'26. Congratulations to Wenjie and Xiwen! [2025/09/26] Our work \"Learning Project-wise Subsequent Code Edits via Interleaving Neural-based Induction and Tool-based Deduction\" are to appear in ASE'25. Congratulations to Chenyan, Yuhuan, Jiaxin, Binhang, and Bo! [2025/06/16] Our co-supervised FYP student Silas Yeo Shuen Yu and Li Siqi won the OURP (Outstanding Undergraduate Research Prize) in School of Computing, National University of Singapore. Congratulationsï¼ [2025/06/08]   Our work on general CAPTCHA solving agent is to apper in USENIX Security'25. Congratulations to Xiwen, Ruofan, and Siqi! [2025/05/05]   I receive the Distinguished Reviewer Award in FSE'25, thanks the community for the recognition! [2025/04/18]   I join the Program Commitee of USENIX Security'26, please consider to submit your work and attend the conference. [2025/03/30]   Our work on design-to-action agents for GUI testing are to apper in ISSTA'25. Congratulations to Ruofan, Xiwen, Guanjie, and Ruofei! [2024/12/29]   I join the Program Commitee of ASE'25, please consider to submit your work and attend the conference. [2024/12/29]   I join the Program Commitee of ICSE'26, please consider to submit your work and attend the conference. [2024/12/27]   I join the Program Commitee of ICML'25, please consider to submit your work and attend the conference. [2024/11/17]   Our student Chenyan and Yuhuan won 2nd prize Research Prototype Award in ChinaSoft'24 (3 out of 77) with our interactive code editing project. Congratulations! [2024/08/15]   I join the Program Commitee of The Web Conference'25 (security track), please consider to submit your work and attend the conference. [2024/08/07]   Our work on log anomaly detection on web application is to appear in ASE'24. Congratulations to Yifan, Xu Ming, and Xiwen! [2024/07/08]   I join the Program Commitee of USENIX Security'25, please consider to submit your work and attend the conference. [2024/06/05]   Our work on LLM agent for detecting phishing websites is to appear in USENIX Security'24. Congratulations to Ruofan and Xiwen! [2024/05/08]   Our work on decloaking and detecting CAPTCHA-cloaked phishing websites is to appear in USENIX Security'24. Congratulations to Xiwen and Ruofan! [2024/04/17]   I join the Program Commitee of FSE'25, please consider to submit your work and attend the conference. [2024/03/02]   Our work on LLM-based code editing and delta debugging are to apper in ISSTA'24. Congratulations to Chenyan, Yufan, Yuhuan, Yunrui, and Xuezhi! [2023/12/23]   I join the Program Commitee of ICML'24, please consider to submit your work and attend the conference. [2023/11/09]   I join the Program Commitee of ICSE'25, please consider to submit your work and attend the conference. [2023/10/24]   I join the Program Commitee of WWW'24, please consider to submit your work and attend the conference. [2023/10/03]   I join the Program Commitee of USENIX Security'24, please consider to submit your work and attend the conference. [2023/09/22]   Our work \"On-the-Fly Adapting Code Summarization on Trainable Cost-Effective Language Models\" are to apper in NeurIPS'23. Congratulations to Yufan, Chenyan, Jinglian, and Yiming! [2023/07/28]   Two papers on time-travelling debugger for deep classifier and software testing are to apper in ESEC/FSE'23. Congratulations to Xianglin, Yifan, and Xiaoxue! [2023/06/16]   I join the Program Commitee of FSE'24, please consider to submit your work and attend the conference. [2023/05/17]   Two papers on graph representation learning and graph learning explanation are to apper in KDD'23. Congratulations to Mengyue and Jihong! [2023/05/09]   I join the Program Commitee of ISSTA'24, please consider to submit your work and attend the conference. [2023/05/05]   I join the Program Commitee of SEETA'23, please consider to submit your work and attend the conference. [2023/05/01]   Our work \"Knowledge Expansion and Counterfactual Interaction for Reference-Based Phishing Detection\" has been accepted by USENIX Security'23. Congratuations to Ruofan and Yifan! [2023/03/09]   I serve as the Challenge Advisor for the Phishing Intention Detection Prize Challenge in AISG. [2023/01/08]   I serve as the Program Co-chair in the 28th IEEE Pacific Rim International Symposium on Dependable Computing (PRDC 2023). Please submit your work and see you in Singapore! [2022/12/09]   Our work \"DeepArc: Modularizing Neural Networks for the Model Maintenance\" has been accepted by ICSE'23. Congratuations to Xiaoning! [2022/11/28]   We won the first prize in the Research Prototype Competition in ChinaSoft with \"Deep Classifier Oriented Interactive Debugger\". Congratuations to Xianglin and Yifan! [2022/09/15] Our work \"Debugging and Explaining Metric Learning Approaches: An Influence Function Based Perspective\" has been accepted by NeurIPS'22. Congratuations to Ruofan and Xianglin! [2022/08/11]   Our work \"RegMiner: Mining Replicable Regression Dataset from Code Repositories\" has been accepted by FSE'22 (demo track), Congratuations to Xuezhi and Yifan! [2022/08/03]   I join the Program Commitee of AAAI'23, please consider to submit your work and attend the conference. [2022/07/21]   Our work \"Repairing Failure-inducing Inputs with Input Reflection\" has been accepted by ASE'22, Congratuations to Yan, Ivan, and Changsheng! [2022/07/17]   Three papers are to apper in TDSC journal, Congratuations to Yan, Siqi, Huasong, and Rajdeep! [2022/06/23]   I join the Program Commitee of ESEC/FSE'23, please consider to submit your work and attend the conference. [2022/06/22]   I am invited as a representative alumni in Software Engineering School, ECNU, to give a speech in the graduation ceremony. Congratuations to all the graduates! [2022/06/13]   Our FYP student Ng Siang Hwee (topic: automated software debugging) is awarded with the NUS SoC Outstanding Computing Project Prize for AY2021/22. Congratuations to Siang Hwee! [2022/06/05]   I accept the interview from the Singapore Zaobao (https://www.zaobao.com.sg/), introducing the social impact of phishing attack and our continuous monitoring defense solution (link). [2022/05/16]   Our work \"RegMiner: Towards Constructing a Large Regression Dataset from Code Evolution History\" is to appear by ISSTA'22. Congratuations to Xuezhi and Siang Hwee! [2022/04/21]   Our work \"Temporality Spatialization: A Scalable and Faithful Time-Travelling Visualization for Deep Classifier Training\" is to appear by IJCAI'22. Congratuations to Xianglin and Ruofan! [2022/02/17]   Our work \"Inferring Phishing Intention via Webpage Appearance and Dynamics: A Deep Vision Based Approach\" is to appear by USENIX Security'22. Congratuations to Ruofan and Xianglin! [2021/01/30]   I am invited to serve as reviewer in ICML 2022. [2021/01/20]   Our work \"gDefect4DL: A Dataset of General Real-World Deep Learning Program Defects\" is to appear by ICSE'22 (Demonstration Track). Congratuations to Yunkai and Xuezhi! [2021/12/01]   Our work \"DeepVisualInsight: Time-Travelling Visualization for Spatio-Temporal Causality of Deep Classification Training\" is to appear by AAAI'22. Congratuations to Xianglin and Ruofan! [2021/08/01]   Our proposal \"An Explainable Framework for Network Anomaly Detection Based on Graph-based Neural Network\" (PI: Prof. Dong Jin Song, Collaborator: Dr. Lin Yun) has been awarded by Cisco-NUS Lab Grant, S$435,500 (based on our malware traffic analysis project.). [2021/07/22]   I am invited to give a talk on our Phishpedia work in 1st Huawei Innovation Workshop on Artificial Intelligence for Cyber-Security. [2021/06/02]   Our work \"Graph-based Seed Object Synthesis for Search-Based Unit Testing\" is to appear by ESEC/FSE'21. [2021/02/23]   Our work \"Phishpedia: A Hybrid Deep Learning Based Approach to Visually Identify Phishing Webpages\" is to appear by USENIX Security'21. Congratuations to Rofan! [2020/09/16]   Our proposal \"An Execution Trace Alignment Based Approach to Locating Regression Bug with Explanation\" (PI: Prof. Dong Jin Song, Collaborator: Dr. Lin Yun) has been awarded by MOE T2 Grant (No. T2EP20120-0019), S$657,828 (based on ICSE'17, ASE'18, and TSE'19 work). The news link can be checked here. [2020/07/30]   Our work \"Cross-Contract Static Analysis for Detecting Practical Reentrancy Vulnerabilities in Smart Contracts\" is to appear by ASE'20. [2020/07/21]   I gave a talk on our gradient-recovering testing work on ISSTA'20 research track (online stream video (with Q&A)ï¼ prepared media). [2020/07/08]   I gave a talk on our trace-alignment based regression localization work on ICSE'20 journal-frst track (online video). [2020/04/16]   Our work \"Recovering Fitness Gradients for Interprocedural Boolean Flags in Search-Based Testing\" is to appear by ISSTA'20. [2020/04/13]   I am invited to serve as a PC member of OOPSLA AEC 2020. Please consider submitting your work. [2020/02/20]   I am invited to serve as a PC member of ICECCS 2020. Please consider submitting your work. [2020/02/03]   Our Journal-First TSE paper \"Explaining Regressions via Alignment Slicing and Mending\" is to appear in Journal First Track in ICSE'2020. [2019/11/18]   I am invited to serve as a PC member of COMPSAC 2020. Please consider submitting your work. [2019/11/18]   I ",
  "content_length": 12719,
  "method": "requests",
  "crawl_time": "2025-12-01 14:53:46"
}