{
  "name": "Yunan Luo",
  "homepage": "https://faculty.cc.gatech.edu/~yunan",
  "status": "success",
  "content": "Yunan Luo I am an Assistant Professor in the School of Computational Science and Engineering (CSE), Georgia Institute of Technology since January 2022. I received my PhD in 2021 from the Department of Computer Science at the University of Illinois Urbana-Champaign, advised by Prof. Jian Peng. Prior to that, I received my bachelor’s degree in Computer Science from Yao Class at Tsinghua University in 2016. I am broadly interested in computational biology and machine learning, with a focus on developing AI and data science methods to reveal core scientific insights into biology and medicine. Recent interests include machine learning, geometric deep learning, generative AI, large language models, network and system biology, functional genomics, cancer genomics, drug repositioning and discovery, and AI-guided protein engineering. Recent News [2024/12] Two papers accepted by RECOMB 2025. [2024/07] MODIFY paper published in Nature Communications. [2023/12] Our paper on contrastive fitness learning accpeted by RECOMB 2024. [2023/11] KDBNet paper published in Nature Machine Intelligence. [2023/09] Received an Azure grant from Microsoft’s Accelerating Foundation Models Research Initiative. [2023/09] We received the NIH MIRA award! [2023/09] We received the Seed Grant Award from the NSF AI Institute MMLI. [2023/04] We received the Amazon Research Award. [2023/04] One paper on network alignment accepted to ISMB 2023. [2023/03] Our enzyme function prediction paper published at Science! Selected Awards NSF CAREER Award, 2025 NIH Maximizing Investigators’ Research Award (MIRA) (R35 for ESI), 2023 Top-10 Reviewer Award, LOG Conference, 2023 Amazon Research Award, 2022 Top-20 Reviewer Award, LOG Conference, 2022 Teaching CSE8803 MLG, Machine Learning with Graphs, Fall 2025 CSE7850/CX4803, Machine Learning for Computational Biology, Spring 2025 CSE7850/CX4803, Machine Learning for Computational Biology, Spring 2024 CSE8803 MLG, Machine Learning with Graphs, Fall 2023 CSE8803/CX4803, Machine Learning for Computational Biology, Spring 2023 CSE8803/CX4803, Machine Learning for Computational Biology, Spring 2022 (with Xiuwei Zhang)",
  "content_length": 2147,
  "method": "requests",
  "crawl_time": "2025-12-01 14:53:54"
}