{
  "name": "Yunbo Zhang",
  "homepage": "http://www.willyunbozhang.com",
  "status": "success",
  "content": "Yunbo \"Will\" Zhang's Homepage Yunbo \"Will\" Zhang, Ph.DAssistant Professor Department of Industrial & Systems Engineering School of Information (Affiliated) Golisano College of Computing and Information Sciences Ph.D. Program Rochester Institute of Technology Education:Ph.D  in Mechanical and Automation Engineering at The Chinese University of Hong Kong, Hong Kong, 2012.Master in Digital Design and Manufacturing at Huazhong University of Science and Technology, Wuhan, China, 2007.Bachelor in Electronics and Information Engineering at Shandong University, Jinan, China, 2004. Appointment: Associate Professor with tenure at the Rochester Institute of Technology, effective September 2025Assistant Professor (Affiliated) in School of Information (iSchool) in Golisano College of Computing and Information Sciences at Rochester Institute of Technology, Aug 2021 ~ Present Assistant Professor in Golisano College of Computing and Information Sciences Ph.D. Program at Rochester Institute of Technology, Sep 2019 ~ Present Assistant Professor in Department of Industrial & Systems Engineering at Rochester Institute of Technology, Jan 2019 ~ PresentAssistant Professor in Department of Mechanical Engineering at Tennessee Technological University, Aug 2017 ~ Dec 2018. Postdoc Research Associate in School of Mechanical Engineering at Purdue University, May 2014 ~ Jul 2017.Research Scientist in Department of Mechanical and Aerospace Engineering at University at Buffalo, SUNY, Jul 2013 ~ Apr 2014. News: [Guest Editting] 2024: Dr. Zhang will serve as a guest editor, along with my peer editors, Pai Zheng at HKPolyU, Tao Peng at ZJU, Ang Liu at UNSW, Xi Gu at Rutgers, Hyun-Jung Kim at KAIST, and Yongjing Wang at Birmingham, for a paper collection on \"Human-Machine Symbiotic Manufacturing Systems\" (Deadline: July-31-2025) with npj Advanced Manufacturing. [Paper] 2024: A new paper \"RADAR: Robotics Assembly by Demonstration via Augmented Reality\" has been accepted by The 2024 IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS 2024), 14-18 October 2024, Abu Dhabi, UAE. (IROS2024). [Paper] 2024: A new paper \"Self-supervised 6-DoF Robot Grasping by Demonstration via Augmented Reality Teleoperation System\" has been accepted by 2024 IEEE International Conference on Robotics and Automation (ICRA 2024), 13-17 May 2024, Yokohama, Japan. (ICRA2024). [Editorship] 2024: Dr. Zhang was appointed as an Associate Editor of the Frontiers in Robotics and AI. [Guest Editting] 2024: Dr. Zhang will serve as a guest editor on a special Issue on \"Human-Robot Collaboration in Industry 5.0\" (Deadline: June-01-2024) in the ASME Journal of Computing and Information Science in Engineering (JCISE) together with Dr. Chih-Hsing Chu at National Tsing Hua University, Dr. Francesco Ferrise at Politecnico di Milano, Italy, Dr. Pai Zheng at The Hong Kong Polytechnic University, China, and Dr. Qing (Cindy) Chang at University of Virginia, USA. [Paper] 2024: A new paper \"Multi-scale Progressive Fusion-based Depth Image Completion and Enhancement for Industrial Collaborative Robot Applications\" has been accepted by Journal of Intelligent Manufacturing.[Paper] 2024: A new paper \"A Global Correction Framework for Camera Registration in Video See-Through Augmented Reality Systems\" has been accepted by ASME Journal of Computing and Information Science in Engineering. [Funding] 2024: Dr. Zhang received a funding grant with $59,995.00 from NYS Empire State Development Program, titled “Establishing a Multi-modal Data Fusion Framework for Acquiring Tacit Knowledge from Machinists ”, as the PI in collaboration with Co-PIs: Rui Li (RIT). [Paper] 2024: A new paper \"'I Can See Your Password': A Case Study about Cybersecurity Risks in Mid-air Interactions of Mixed Reality-based Smart Manufacturing Applications\" has been accepted by ASME Journal of Computing and Information Science in Engineering. [Paper] 2023: A new paper \"HAR2bot: A Human-centered Augmented Reality Robot Programming Method with the Awareness of Cognitive Load\" has been accepted by Journal of Intelligent Manufacturing.[Interview] 2023: Dr. Zhang was interviewed by Peggy Smedley on The Peggy Smedley Show to talk about the immersive technology and its applications in manufacturing (Link to the Episode). [Guest Editting] 2022: Dr. Zhang will serve as a guest editor on a special issue on \"Extended Reality in Design and Manufacturing\" (Deadline: February-15-2023) in the ASME Journal of Computing and Information Science in Engineering (JCISE) together with Dr. Chih-Hsing Chu at National Tsing Hua University, Dr. Vinayak R. Krishnamurthy at Texas A&M University, Dr. William Bernstein at Air Force Research Laboratory, and Dr. Junfeng Ma at Mississippi State University. [Funding] 2022: Dr. Zhang received a National Science Foundation grant with $149,999, titled “FW-HTF-P: Towards Preparing Future Machinists: Exploring Tacit Knowledge in Machining with Artificial Intelligence and Extended Reality”, as the PI in collaboration with Co-PIs: Rui Liu (RIT), Esa Rantanen (RIT) , Chao Peng (RIT), and Kylie Peppler (UC Irvine). [Guest Editting] 2022: Dr. Zhang will serve as a guest editor on a special issue on \"Smart and Advanced Manufacturing\" (Deadline: March-31-2023) in the Journal of Manufacturing and Materials Processing together with Dr. Azadeh Haghighi at University of Illinois at Chicago, and Dr. Prahalada Rao at Virginia Tech . [Paper] 2022: A new paper \"Visualization Error Analysis for Augmented Reality Stereo Video See-Through Head-Mounted Displays in Industry 4.0 Applications \" has been accepted by ASME MSEC 2022.[Paper] 2022: A new paper \"Immersive Virtual Reality Training With Error Management for Cnc Milling Set-Up \" has been accepted by ASME MSEC 2022.[Paper] 2022: A new paper \"Investigating the Role of Auditory Perception of Cutting Process Conditions in CNC Machining\" has been accepted by ASME MSEC 2022.[Funding] 2022: Dr. Zhang received a National Science Foundation grant with $649,257, titled “Improving and Modernizing Machinist Training and Education for Machining Workforce Preparation in the Finger Lakes Region of New York”, as a Co-PI in collaboration with Dr. Rui Liu (PI, Rochester Institue of technology), and John Troy (Co-PI, Monroe Community College). [Editorship] 2022: Dr. Zhang was appointed as an Associate Editor of the Journal of Intelligent Manufacturing. [Paper] 2021: A new paper \"A Survey of Immersive Technologies and Applications for Industrial Product Development\" has been accepted by Computer & Graphics. [Paper] 2021: A new paper \"FabHandWear : An End-to-End Pipeline from Design to Fabrication of Customized Functional Hand Wearables\" has been accepted by ACM IMWUT, and presented at UbiComp2021.[Paper] 2021: A new paper \"An Augmented-Reality Based Human-Robot Interface for Robotics Programming in the Complex Environment\" has been accepted by ASME MSEC 2021[Paper] 2020: A new paper \"Extrusion bioprinting: Recent progress, challenges, and future opportunities\" has been accepted by Bioprinting. [Funding] 2020: Dr. Zhang (PI) and Dr. Chao Peng (Co-PI)'s project \"B2: Skillearn: Affordable and Intelligent Augmented Reality Platform for Manufacturing Workforce and Education\" was funded with $ 169,981 by National Science Foundation (NSF) through Purdue University. This project is a part of NSF funded project \"B1 (Future Jobs and AI): Skill-XR: An Affordable and Scalable X-Reality (XR) Platform for Skills Training and Analytics in Manufacturing Workforce Education\". [Paper] 2020: A new paper \"3D Hand Mesh Reconstruction from a Monocular RGB Image\" has been accepted by Computer Graphics International (CGI) 2020, and conditionally accepted by The Visual Computer Journal. [Paper] 2020: A new review paper \"The Influence of Smart Manufacturing towards Energy Conservation: A Review\" has been accepted by MDPI Technologies. [Paper] 2020: A new paper \"iMold: Enabling Interactive Design Optimization for In-Mold Electronics\" has been accepted by ACM CHI Extended Abstract. [Paper] 2019: A new paper \"Customization and Topology Optimization of Compression Casts/Braces on Two-Manifold Surfaces\" has been accepted by Computer-Aid Design, Special issue on Computer-Aided Design on Advances in Generative Design. [Paper] 2019: A new paper \"Shape Structuralizer: Design, Fabrication, and User-driven Iterative Refinement of 3D Mesh Models\" has been accepted by ACM CHI 2019 with an acceptance rate 23.8%.[Appointment] 2019: Dr. Zhang joined Department of Industrial & Systems Engineering at Rochester Institute of Technology as an Assistant Professor on Jan-02. [Funding] 2018: Dr. Zhang received a National Science Foundation grant, titled “Smart Manufacturing for America's Revolutionizing Technological Transformation”, as a Co-PI in collaboration with Dr. Khalid Tantawi (PI, Motlow Community College), Dr. Karen Wosczyna-Birch (Co-PI, Tunxis Community College), and Dr. Ismail Fidan (Co-PI, Tennessee Tech University). [Paper] 2018: A new paper \"Design and Interaction Interface using Augmented Reality for Smart Manufacturing\" has been accepted by The 46th North American Research Conference (NAMRC 46) at College State, TX.[Paper] 2017: A new paper \"iSoft: A Customizable Soft Sensor with Real-time Continuous Contact and Stretching Sensing\" has been accepted by ACM UIST 2017 with an acceptance rate 22.5%. [Talk] 2017: Dr. Zhang was invited by The Millard Oakley STEM Center to give a talk about his emerging researches on \"Computational Support for Personal Design & Manufacturing\". [Appointment] 2017: Dr. Yunbo \"Will\" Zhang joined Department of Mechanical Engineering at Tennessee Technological University as an Assistant Professor on Aug-01.",
  "content_length": 9710,
  "method": "requests",
  "crawl_time": "2025-12-01 14:53:54"
}