{
  "name": "Yunbo Rao",
  "homepage": "http://www.raoyunbo.cn",
  "status": "success",
  "content": "ï»¿ Yunbo Rao Yunbo Rao Associate Professor,Doctoral Supervisor School of Information and Software Engineering University of Electronic Science and Technology of China(UESTC) Address: Shahe Campus:No.4,Section 2,North Jianshe Road,610054|Qingshuihe Campus:No.2006,Xiyuan Ave,West Hi-Tech Zone, 611731|Chengdu,Sichuan, P.R.China Email: uestc2008 AT 126 DOT com Phone: +(86)-83207543 University of Electronic Science and Technology of China, Chengdu 2012 PhD University of Washington, Seattle Oct 2009-Oct 2011 Visiting student University of Electronic Science and Technology of China2006 MS Sichuan Normal University2003 BS Biosketch Yunbo Rao received his B.S. degree and M.E. degree from Sichuan Normal University and University of Electronic Science and Technology of China in 2003 and 2006, respectively, and Ph.D. degree from University of Electronic Science and Technology of China,Chengdu in 2012, both in School of Computer Science and Engineering (SCSE). His Ph.D advisor is Prof. LeiTing Chen. He has been as a visiting scholar of Electrical Engineering of the University of Washington from Oct 2009 to Oct 2011, Seattle, USA. and his supervisor is Prof.Mingting Sun. His research interests include video enhancement, computer vision, three-dimensional reconstruction,Virtual Reality,Augmented reality,and crowd animation. He also worked as research interns at Neusoft Inc.during 2004-2008. Since May.2012,he joined School of Information and Software Engineering, University of Electronic Science and Technology of China. Currently, he is an associate professor at University of Electronic Science and Technology of China(UESTC).He is a supervisor of Ph.D student in Dec.2017. å·¥å­¦åå£«ï¼çµå­ç§æå¤§å­¦å¯ææãåå£«çå¯¼å¸ãåå·çå¤©åºå³¨çè®¡åä¸å®¶ãåå·çå­¦æ¯ä¸ææ¯å¸¦å¤´äººåå¤äººéãç§æé¨éå¤§é¡¹ç®è¯å®¡ä¸å®¶ãå½å®¶åºéå§é¡¹ç®è¯å®¡ä¸å®¶ãåå·çç§æå é¡¹ç®è¯å®¡ä¸å®¶ï¼CCF YOCSEFæé½å¯ä¸»å¸­(2019.6â20 20.6)ï¼CCFèæç°å®ä¸å¯è§åææ¯ä¸å§ç§ä¹¦é¿(2020.1-2021.12)ï¼CCF ä¸å§å·¥å§å§å(2020.1-2021.12)ã ç ç©¶æ¹åä¸ºäººå·¥æºè½ãå¾å/è§é¢å¤çãèæç°å®(3Dç¹äº)ï¼å»çå¾åå¤çãä¸»ææåä¸å½å®¶èªç¶ç§å­¦åºéãèååºéãç§æé¨é¡¹ç®ãåå·¥é¢ç åºéãåå·çç§æå ç­å¤ä¸ªå½å®¶é¡¹ç®ï¼åæ¶ä¸»ææé½éè·¯å±ï¼åå·é¿è¹éå¢ï¼åå·çå»é¢ç­å¤ä¸ªæ¨ªåé¡¹ç®ãåè¡¨è®ºæ118ç¯ï¼å ¶ä¸­72ç¯è¢«SCI/EIæ£ç´¢ï¼å¨å½é æåå¦ IEEE Transactions on Instrumentation and Measurementï¼IEEE Transactions on Multimedia, ACM Transactions on Multimedia Computing Communications and Applications, IEEE Transactions on Circuits and Systems for Video Technology, Knowledge-Based System, World Wide Webç­ä¸åè¡¨é«æ¡£æ¬¡æåæç« åé¡¶çº§ä¼è®®ICDE, COMPSAC, MMM, VCIP; ç³è¯·ä¸å©52é¡¹(ææ26é¡¹)ï¼åºçä¸­ææ¬ç§/ä¸ç§ææ10é¨[ç±åäº¬èªç©ºèªå¤©å¤§å­¦åºçç¤¾åæ°´å©æ°´çµåºçç¤¾åºç]ï¼åºçè±æä¹¦ç±ä¸æ¬[ç±Springeråºç]ï¼è·å¾åå·çç§æè¿æ­¥å¥ä¸ç­å¥1é¡¹(2022)ï¼æ±èçç§æè¿æ­¥å¥ä¸ç­å¥1é¡¹(2019)ï¼ä¸­å½æµç»å­¦ä¼ç§æè¿æ­¥å¥äºç­å¥2é¡¹(2020,2022)ï¼åå·çæµç»å­¦ä¼ç§æè¿æ­¥å¥ä¸ç­å¥1é¡¹(2021)ï¼åå·çè®¡ç®æºå­¦ä¼ç§æè¿æ­¥å¥ä¸ç­å¥1é¡¹(2022)ï¼ä¸­å½äº§å­¦ç ä¿è¿ä¼åæ°ææå¥ä¼ç§å¥1é¡¹(2022)ã æ¾æ ä»»ç¬¬äºå±PRAI2022å¤§ä¼ä¸»å¸­, ç¬¬åå± PRAI2021å¤§ä¼ä¸»å¸­, ç¬¬ä¸å±PRAI2020ç¨åºå§åä¼ä¸»å¸­, ICVRV2020ç¨åºå§åä¼ä¸»å¸­ï¼China VR2020 ç«èµå§åä¼ä¸»å¸­, ICGIP 2020ç¨åºå§åä¼ä¸»å¸­ç­ãåºéæ ä»»IEEE Transactions on Image Processingï¼IEEE Transactions on Multimediaï¼Multimedia Tools and Applicationsï¼Applied Mathematicsï¼International Journal of Systems Scienceï¼Optic Engineeringï¼Optics and Photonics Journalï¼ä¸­å½å¾åå¾å½¢å­¦æ¥ï¼å çµå·¥ç¨ï¼è®¡ç®æºç§å­¦ï¼è®¡ç®æºåºç¨, CVPR, ICCV,ICME, CVPR, VCIPç­å¤ä¸ªå½é æååä¼è®®çå®¡ç¨¿äººãæ¯CCFé«çº§ä¼åãIEEEä¼åãCCFå¤åªä½ææ¯ä¸ä¸ä¸å§å§åãCSIGé«çº§ä¼åã http://www.is.uestc.edu.cn/teachers.do?id=1055 (Chinese) Research Interests Video & Image Processing; Virtual Reality(Based on HTC vive,oculus rift) and Related Application; Video Content Analysis, Pattern Recognition; Artificial Intelligence; 3D segmentation & Reconstruction; Video Enhancement; Recent Research Projects Principle Investigator: Sichuan Science Foundation, \"Research on co-segmentation algorithm in image retrieval,\" Grant No.2017JY0229, 2017-2018. Principle Investigator: Fundamental Research Funds for the Central Universities, \"Key technique of VR and naked eye 3D,\" Grant No.A03013023001050, 2017-2018. Principle Investigator: National Science Foundation of China, \"Image-based enhancement ACL 3D reconstruction,\" Grant No.61300092, 2014-2017. Principle Investigator: Fundamental Research Funds for the Central Universities, \"Research on ACL-based 3D reconstruction,\" Grant No.A03010023801068, 2014-2016. Principle Investigator: Chengdu Railway Bureau,\"Electrical service integrated management syste\"Grant No.2013006348, 2013-2014. Principle Investigator: Video Surveillance System, Information Technology Research Institute (ITRI) in Taiwan 2010-2011. Principle Investigator: National Research Program in China, Grant No.9140A06060208DZ0207 2009-2012. Principle Investigator: National High-Tech Program 863 in China, Grant No. 2007AA010407 and 2009GZ0017, 2009-2011. Teaching Undergraduate Courses: CS310 Computer network (English class), 2007-2008 Digital logic design, 2013-2020 Fundamentals of programming(C), 2020-Now Graduate Courses: Digital Image Processing (Chinese class), 2013-2017 Software Engineering (Android) (Chinese class), 2017-Now International Graduate Courses: Software Engineering (Android) (International student), 2016-Now Recent Journal Papers 2024 Yunbo Rao, Qingsong Lv, Andrei Sharf, Zhanglin Cheng, RWS: Refined weak slice for semantic segmentation enhancement, IEEE Transactions on Circuits and Systems for Video Technology, Januray.23th, 2024.http://DOI 10.1109/TCSVT.2024.3361463. Yunbo Rao,Tan, Tian; Zeng, Shaoning; Chen, Zhanglin; Sun, Jihong, A dual path encoder-decoder network for placental vessel segmentation in fetoscopic surgery, KSII Transactions on Internet and Information Systems, Januray.23th, 2024.public. Yunbo Rao,Hangrui Guo, Dalang Liu, Shaoning Zeng, Robust meter reading detection via differentiable binarization, Applied Intelligence. Januray.19th, 2024.https://doi.org/10.1007/s10489-024-05278-4. Junjun Wu,Yunbo Rao, Shaoning Zeng, Bob Zhang, Pre-trained SAM as data augmentation for image segmentation,CAAI Transactions on Intelligence Technology, February,8th, 2024, Accept. 2023 Yunbo Rao, Yuling Yi, Relevance Gradient Descent for Parameter Optimization of Image Enhancement, Computers & Graphics, October.19th, 2023. Hongyu Zhang, Yunbo Rao, Jie Shao, Fanman Meng, and Naveed Ahmad, GAB-Net: A Robust Detector for Remote Sensing Object Detection under Dramatic Sacle Variation and Complex Backgroundsï¼IEEE Geoscience and Remote Sensing Letters, DOIï¼10.1109/LGRS.2023.3325410, October. 20th, 2023. Obed Tettey Nartey,Kwabena Sarpong,Yunbo Rao, Daniel Addo, Zhiguang Qin, PiCovS: Pixel-level with covariance pooling feature and superpixel-level feature fusion for hyperspectral image classification, IEEE Transactions on Geoscience and Remote Sensing, DOI:10.1109 /TGRS. 2023.3322641, October.5th, 2023. Volume: 61. Hongyu Zhang, Yunbo Rao, Jie Shao, Jiansu Puï¼Reading various types of pointer meters under extreme motion blur, EEE Transactions on Instrumentation and Measurement, 10.1109/TIM.2023.3290962, TIM-23- 00327, 2023.6 Yunbo Rao, Wang Zhou, Shaoning Zeng, Junmin Xue, Deep hashing via multi scale and multi directional pooling for image retrieval, International Journal of Machine Learning and Cybernetics https:// doi.org/10.1007/s13042-023-01819-4,2023.3 Yunbo Rao, Ping Xu, Shaoning Zeng,Jianping Gou, Point completion by a stack-style folding network with multi-scaled graphical features, IET Computer Vision, IET Comput. Vis. 2023;1â10 Yunbo Rao, Tongze Mu, Shaoning Zeng, Jinhua Liu, Junmin Xue, Multi-session aware hypergraph neural network for session-based recommendation, Multimedia Tools and Applications, 10.1007 /s11042 -023-15894-W, 2023.5. Lei Zhao, Junlin Li, Lianli Gao, Yunbo Rao, Jinkuan Song ,HengTao Shen,Heterogeneous knowledge network for visual dialog, IEEE Transactions on Circuits and Systems for Video Technology ,Volume: 33, Issue: 2, February 2023, DOI: 10.1109 /TCSVT. 2022.3207228, pp:861-871 Yunbo Rao, Qingsong Lv, Shaoning Zeng,Yuling Yi,Cheng Huang, Yun Gao, Zhanglin Cheng, Jihong Sun, COVID-19 CT Ground-glass opacity segmentation based on attention mechanism threshold, Biomedical Signal Processing and Controlï¼https://doi.org/10.1016/j.bspc.2022.104486, Volume 81, March 2023. 2022 Shaoning Zeng, Yunbo Rao, Bob Zhang, Yong Xuï¼Joint augmented and compressed dictionaries for robust dictionary-based classificationï¼ACM Transactions on Multimedia Computing, Communications and Applications, https://doi.org/10.1145/3572910, Dec 1,2022 Qingsong Lv, Yunbo Rao, Shaoning Zeng, Small-scale robust digital recognition of meters under unstable and complex conditions, IEEE Transactions on Instrumentation and Measurement, DOI:10.1109/TIM.2022.3195244. Vol. 14, No. 8, May 2022 Abdullah Aman Khan, Yunbo Rao, Jie Shao, ENet: event-based highlight generation network for broadcast sports videos, Multimedia Systems, https://doi.org/10.1007/s00530-022-00978-8, 2022 Abdullah Aman Khan, Shaojie,Yunbo Rao,LeiShe, HenTao Shen LRDNet: Lightweight LiDAR aided cascaded feature pools for free road space detection, IEEE Transactions on Multimedia, 2022.12.9, DOI: 10.1109 /TMM.2022.3230330, pp1-13 Jiansu Pu, Hui Shao, Boyang Gao, Zhengguo Zhu, Yanlin Zhu, Yunbo Rao, Yong Xiang, matExplorer: Visual Exploration on Predicting Ionic Conductivity for Solid-state Electrolytes, IEEE Transactions on Visualization and Com",
  "content_length": 51018,
  "method": "requests",
  "crawl_time": "2025-12-01 14:53:52"
}