{
  "name": "Yunchao Wei",
  "homepage": "https://weiyc.github.io",
  "status": "success",
  "content": "Yunchao Wei's homepage Yunchao Wei 魏云超 Professor, Center of Digital Media Information Processing Institute of Information Science | Beijing Jiaotong University Office: 1013-B08, Science & Technology Innovation Mansion of BJTU, Beijing 100044 Email: yunchao.wei AT bjtu.edu.cn | wychao1987 AT gmail.com Prospective Students : Contact me. Research Interests My research interests include computer vision and machine learning. In particular, I have recently worked in: Computer Vision: classification, object detection, segmentation, vision & language, etc. Machine Learning: unsupervised/weakly-supervised/semi-supervised learning, few-shot learning, domain adaptive learning, active learning, etc. More details can be found here. News [ PAPER ] Three papers are accepted to NeurIPS 2023, congrats to Siyu, Mengxue, and Mengyu. [ PAPER ] We have eight accepted papers, including five ICCV 2023，two ACM MM 2023 and one TPAMI. [SERVICE] Will serve as Area Chairs for NeurIPS 2023 Track Datasets & Benchmarks and CVPR 2024. [ PAPER ] We have seven accepted papers, including one AAAI 2023, four CVPR 2023，one IJCV and one TPAMI. [ PAPER ] The extension of IOG is accepted by TPAMI, congrats to Shiyin & Kunyang. [ PAPER ] Two papers are accepted to NeurIPS 2022, congrats to Siyu & Gengwei, and Zekang. [ PAPER ] Three papers are accepted to ECCV 2022, congrats to Feng, Kunyang and Mengxue. [ DATASET ] We release VIPSeg, the first large-scale dataset for VIdeo Panoptic Segmentation. [ DATASET ] We release M5Product, a large-scale multi-modal pre-training dataset with 5 modalities. [ PAPER ] Three papers are accepted to CVPR 2022, congrats to Jiaxu, Xiao and Pengtao. [ AWARD ] I was selected as MIT TR35 - MIT Technology Review, 35 Innovators Under 35, China. [ PAPER ] Our work on video object segmentation (AOT) and few-shot segmentation (CyCTR) are accepted to NeurIPS 2021. Congrats Zongxin and Gengwei! [ TEAM ] I joined Beijing Jiaotong University as a full professor on Aug 2021! Selected Honors & Awards MIT TR35 China by MIT Technology Review (2021) The 1st place of the video object segmentation track in CVPR Youtube VOS Challenge (2021) Early Career Researcher Award (Honorable Mention) by Australian Pattern Recognition Society (2020) Top 40 early-career researchers in Australia by The Australian (2020) The 2nd place of the video object segmentation track in CVPR DAVIS Challenge (2020) The 1st prize in science and technology awarded by China Society of Image and Graphics (2019) Early Career Researcher Award (DECRA) by Australian Research Council (2019) The 1st place of human parsing tracks in the 2nd CVPR Look Into Person Challenge (2018) The 2nd place of video object detection/tracking tracks in ImageNet Challenge (2017) Excellent Doctoral Dissertation Award of CIE (2016) The 1st place of object detection track in ImageNet Challenge (2014) Copyright © 2021.Company name All rights reserved.",
  "content_length": 2917,
  "method": "requests",
  "crawl_time": "2025-12-01 14:53:53"
}