{
  "name": "Yuncheng Wu",
  "homepage": "https://lemonviv.github.io",
  "status": "success",
  "content": "Yuncheng Wu | School of Information, Renmin University of China About Me I am currently an associate professor at School of Information, Renmin University of China. Prior to that, I was a research assistant professor in School of Computing (SoC), National University of Singapore (NUS), and worked in the Singapore Blockchain Innovation Programme (SBIP). I was part of the Database Systems Research Group, working with Prof. Beng Chin Ooi and Prof. Xiaokui Xiao. I obtained my PhD degree in Computer Science from Renmin University of China (RUC) in 2018, under the supervision of Prof. Hong Chen. I was a visiting PhD student in Simon Fraser University (SFU), supervised by Prof. Ke Wang. I received my Master’s degree from Nanjing University of Science and Technology (NJUST), advised by Prof. Yongli Wang, and Bachelor’s degree from Southwest University of Science and Technology (SWUST). I also worked in Ant Financial as a senior developer and 724 Research Institute of China Shipbuilding Industry Corporation as a software engineer. I am looking for highly motivated students to work with me. Please drop me an email if you are interested. Research Interests Data Collaboration: federated learning, data security and privacy, incentive mechanism Serverless Computing: performance evaluation, elasticity News [Jul. 2025] One paper about differentially private SGD is accepted by MM 2025. [Mar. 2025] One paper about Secure Serverless Model Server is accepted by ICDE 2025. [Mar. 2025] One paper about Verifiable Federated Learning is accepted by TKDE 2025. [Oct. 2024] One paper about AI-powered Autonomous Database is accepted by CIDR 2025. [Aug. 2024] One paper about passive inference attacks is accepted by NDSS 2025. [Aug. 2024] One paper about in-database model slicing is accepted by VLDB 2025. [Aug. 2024] One paper about privacy risks in sharing diffusion models is accepted by TIFS 2024. [Jul. 2024] One position paper about AI-powered autonomous data system is accepted by SCIS 2024. [Apr. 2024] One paper about cost-aware caching framework for cloud databases is awarded as Best Runner Up Paper by IEEE ICDE 2024. [Apr. 2024] One paper about verifiable data collaboration with zero-knowledge proofs is accepted by VLDB 2024. [Feb. 2024] One vision paper about large language models from data management perspective is accepted by IEEE ICDE 2024. [Jan. 2024] I join the School of Information at Renmin University of China as an associate professor. Selected Publications Differentially Private Visual Learning with Public Subspace Augmented by Synthetic Data Haichao Sha, Yuncheng Wu*, Ruixuan Liu, Yang Cao, Hong Chen* ACM Multimedia (MM), 2025 Accepted, Outstanding Papers in Generation Theme SeSeMI: Secure Serverless Model Inference on Sensitive Data Guoyu Hu, Yuncheng Wu, Gang Chen, Tien Tuan Anh Dinh, Beng Chin Ooi Proceedings of the IEEE International Conference on Data Engineering (ICDE), 2025. PDF Best Student Paper Award Zkfhed: A Verifiable and Scalable Blockchain-Enhanced Federated Learning System Bingxue Zhang, Guangguang Lu, Yuncheng Wu, Kunpeng Ren, Feida Zhu IEEE Transactions on Knowledge and Data Engineering (TKDE), 2025. PDF NeurDB: On the Design and Implementation of an AI-powered Autonomous Database Zhanhao Zhao, Shaofeng Cai, Haotian Gao, Hexiang Pan, Siqi Xiang, Naili Xing, Gang Chen, Beng Chin Ooi, Yanyan Shen, Yuncheng Wu, Meihui Zhang The Conference on Innovative Data Systems Research (CIDR), 2025. PDF Passive Inference Attacks on Split Learning via Adversarial Regularization Xiaochen Zhu, Xinjian Luo, Yuncheng Wu*, Yangfan Jiang, Xiaokui Xiao, Beng Chin Ooi The Network and Distributed System Security (NDSS), 2025. PDF Powering In-Database Dynamic Model Slicing for Structured Data Analytics Lingze Zeng, Naili Xing, Shaofeng Cai, Gang Chen, Beng Chin Ooi, Jian Pei, Yuncheng Wu Proceedings of the VLDB Endowment (PVLDB), 2025. PDF Exploring Privacy and Fairness Risks in Sharing Diffusion Models: An Adversarial Perspective Xinjian Luo, Yangfan Jiang, Fei Wei, Yuncheng Wu*, Xiaokui Xiao, Beng Chin Ooi IEEE Transactions on Information Forensics and Security (TIFS), 2024. PDF NeurDB: An AI-powered Autonomous Data System Beng Chin Ooi, Shaofeng Cai, Gang Chen, Yanyan Shen, Kian-Lee Tan, Yuncheng Wu, Xiaokui Xiao, Naili Xing, Cong Yue, Lingze Zeng, Meihui Zhang, Zhanhao Zhao Science China Information Sciences (SCIS), 2024. PDF Secure and Verifiable Data Collaboration with Low-Cost Zero-Knowledge Proofs Yizheng Zhu, Yuncheng Wu*, Zhaojing Luo, Beng Chin Ooi, Xiaokui Xiao Proceedings of the VLDB Endowment (PVLDB), 2024. PDF Applications and Challenges for Large Language Models: From Data Management Perspective Meihui Zhang, Zhaoxuan Ji, Zhaojing Luo, Yuncheng Wu, Chengliang Chai Proceedings of the IEEE International Conference on Data Engineering (ICDE), 2024. PDF LBSC: A Cost-aware Caching Framework for Cloud Databases Zhaoxuan Ji, Zhongle Xie, Yuncheng Wu, Meihui Zhang Proceedings of the IEEE International Conference on Data Engineering (ICDE), 2024. PDF Best Paper Runner Up Award Protecting Label Distribution in Cross-Silo Federated Learning Yangfan Jiang, Xinjian Luo, Yuncheng Wu, Xiaokui Xiao, Beng Chin Ooi IEEE Symposium on Security and Privacy (IEEE S&P), 2024. PDF On Data Distribution Leakage in Cross-Silo Federated Learning Yangfan Jiang, Xinjian Luo, Yuncheng Wu, Xiaochen Zhu, Xiaokui Xiao, Beng Chin Ooi IEEE Transactions on Knowledge and Data Engineering (TKDE), 2024. PDF Falcon: A Privacy-Preserving and Interpretable Vertical Federated Learning System Yuncheng Wu, Naili Xing, Gang Chen, Tien Tuan Anh Dinh, Zhaojing Luo, Beng Chin Ooi, Xiaokui Xiao, Meihui Zhang Proceedings of the VLDB Endowment (PVLDB), 2023. PDF MINT: Detecting Fraudulent Behaviors from Time-series Relational Data Fei Xiao, Yuncheng Wu*, Meihui Zhang, Gang Chen, Beng Chin Ooi Proceedings of the VLDB Endowment (PVLDB), 2023. PDF Incentive-Aware Decentralized Data Collaboration Yatong Wang, Yuncheng Wu*, Xincheng Chen, Gang Feng, Beng Chin Ooi ACM Special Interest Group in Management Of Data (SIGMOD), 2023. PDF FEAST: A Communication-efficient Federated Feature Selection Framework for Relational Data Rui Fu, Yuncheng Wu, Quanqing Xu, Meihui Zhang ACM Special Interest Group in Management Of Data (SIGMOD), 2023. PDF LuxGeo: Efficient and Secure Enhanced Geometric Range Queries Ruoyang Guo, Bo Qin, Yuncheng Wu, Ruixuan Liu, Hong Chen, Cuiping Li IEEE Transactions on Knowledge and Data Engineering (TKDE), 2023. PDF Serverless Data Science - Are We There Yet? A Case Study of Model Serving Yuncheng Wu, Tien Tuan Anh Dinh, Guoyu Hu, Meihui Zhang, Yeow Meng Chee, Beng Chin Ooi ACM Special Interest Group in Management Of Data (SIGMOD), 2022. PDF A Fusion-Denoising Attack on InstaHide with Data Augmentation Xinjian Luo, Xiaokui Xiao, Yuncheng Wu, Juncheng Liu, Beng Chin Ooi AAAI Conference on Artificial Intelligence (AAAI), 2022. PDF Feature inference attack on model predictions in vertical federated learning Xinjian Luo, Yuncheng Wu*, Xiaokui Xiao, Beng Chin Ooi Proceedings of the IEEE International Conference on Data Engineering (ICDE), 2021. PDF Communication-efficient decentralized machine learning over heterogeneous networks Pan Zhou, Qian Lin, Dumitrel Loghin, Beng Chin Ooi, Yuncheng Wu, Hongfang Yu Proceedings of the IEEE International Conference on Data Engineering (ICDE), 2021. PDF Enhanced privacy preserving group nearest neighbor search Yuncheng Wu, Ke Wang, Ruoyang Guo, Zhilin Zhang, Dan Zhao, Hong Chen, Cuiping Li IEEE Transactions on Knowledge and Data Engineering (TKDE), 2021. PDF Privacy preserving vertical federated learning for tree-based models Yuncheng Wu, Shaofeng Cai, Xiaokui Xiao, Gang Chen, Beng Chin Ooi Proceedings of the VLDB Endowment (PVLDB), 2020. PDF A Pufferfish privacy mechanism for monitoring web browsing behavior under temporal correlations Wenjuan Liang, Hong Chen, Ruixuan Liu, Yuncheng Wu, Cuiping Li Computers & Security, 2020. PDF MixGeo: efficient secure range queries on encrypted dense spatial data in the cloud Ruoyang Guo, Bo Qin, Yuncheng Wu, Ruixuan Liu, Hong Chen, Cuiping Li IEEE/ACM International Symposium on Quality of Service (IWQoS), 2019. PDF Privacy preserving group nearest neighbor search Yuncheng Wu, Ke Wang, Zhilin Zhang, Weipeng Lin, Hong Chen, Cuiping Li International Conference on Extending Database Technology (EDBT), 2018. PDF Patents Yuncheng Wu, Wenxiang Wang, Le Zhang, and Li Lin. Data processing method and devices. Chinese Patent. Authorized Announcement No.: CN 110162981 B. Hong Chen, Cuiping Li, Yuncheng Wu, Ruoyang Guo, Dan Zhao, Wenjuan Liang, and Yao Wu. Privacy-preserving group nearest neighbor query method and devices. Chinese Patent. Authorized Announcement No.: CN 109688545 B. Teaching Co-Lecturer of CS6203 (Advanced Topics in Database Management Systems) in Fall 2022, School of Computing, National University of Singapore. Professional Services Conference Services Demonstration Co-chair of VLDB 2024 Workshop Co-chair of BigComp 2023 Conference PC Members 2026: VLDB (Associate Editor) 2025: VLDB, CIKM (SPC) 2024: VLDB, ICDE, CIKM (SPC) 2023: VLDB, ICDE, EDBT 2022: VLDB, ICDE Journal Reviewers IEEE Transactions on Dependable and Secure Computing (TDSC) Transactions on Information Forensics & Security (TIFS) IEEE Transactions on Knowledge and Data Engineering (TKDE) ACM Transactions on Data Science (TDS) Journal of Computer Science and Technology (JCST) Transactions on Big Data (TBD) Big Data Research Chinese Journal of Computers (CJC) Invited Talks \"Learning Over Heterogeneous Multi-Party Data: Vertical Federated Learning Concepts, Applications, and Data Privacy Protection\", invited talk at Rakuten Institute of Technology, Japan (virtual), January 2022. \"Secure and interpretable vertical federated learning\", invited talk at the KDD'21 Trust Day, Singapore, Auguest 2021. \"Privacy-preserving and incentive-aware vertical federated learning\", invited talk at the SBIP seminar, Singapore, June 2021. Aw",
  "content_length": 10499,
  "method": "requests",
  "crawl_time": "2025-12-01 14:53:53"
}