{
  "name": "Yunhuai Liu",
  "homepage": "http://www.yunhuai.net/Yunhuai.htm",
  "status": "success",
  "content": "Yunhuai Liu Dr. Yunhuai Liu Professor Academy for Advanced Interdisciplinary Study Affiliated with Big Data Research Center National Engineering Laboratory for Big Data Analysis and Applications Beijing Insitute of Big Data Research Peking University RM 111, No.6 Jingyuan, No.5 Yiheyuan Rd., Beijing 100871 Email: Yunhuai.liu@pku.edu.cn Mobile: 18616021531 Home Research Publication Teaching Service Release News and Events I am hosting The 27th IEEE International Conference on Parallel and Distributed Systems (ICPADS 2021), which will be held in Beijing in Dec. 2021. Our work won the best paper award for SANER 2018 with paper titled \"SMARTLOG: Place Error Log Statement by Deep Understanding of Log Intention\". This is a co-authored work with Dr. Zhouyang, Jia, Prof. Shanshan Li, Xiaodong Liu, and Xiangke Liao. I am recruiting both undergraduate and postgraduate intership students. If you are an undergraduate student and Self-motivated, diligent, and responsible Major in computer science or computer engineering Interested in research (of course you have to) In particularly to pursuit a MS or PhD degree in the future, domestically or internationally (U.S for most of the cases) or if you are a postgraduate student and Seeking a job in the near future with great potentials Major in IT related areas (computer science/engineering, software, communications, etc.) Strong coding capability on software systems (C, C++, Python, Matlab, etc.) Again self-motivated, diligent, and responsible please send me email by yunhuai.liu@pku.edu.cn. More information about my recent research works can be found in below. Thanks! Short Biography Dr. Yunhuai Liu is currently a professor in the Big Data Research Center at Peking University. He received his B.E degree in Computer Science and Technology from Tsinghua University, Beijing in 2000, and PhD degree in Computer Science and Engineering from Hong Kong University of Science and Technology in 2008. From 2008 to 2010 he worked in Hong Kong University of Science and Technology as a research assistant professor. In the year 2010, he joined Shenzhen Institutes of Advanced Technology, Chinese Academy of Sciences as an associate professor. From 2011 to 2016, he was with the Third Research Institute of Ministry of Public Security, China. Dr. Liu is the author and co-author of over 100 papers in premier network and system journals and conferences with over 3,700 citations (H-index 31). Dr. Liu is the receipient of the NSFC Outstanding Youth Foundation (2013). He serves as the TPC member of IEEE Mobile Ad-hoc Networks and IEEE SUTC, and reviewer for many international conferences such as ACM SIGCOMM, ACM Mobicom, IEEE INFOCOM, IEEE Percom, IEEE ICDCS, and international journals such as IEEE Transactions on Networks (TON), IEEE Transactions on Parallel and Distributed Systems (TPDS), ACM Transactions on Sensor Networks (TOSN), and etc. His research papers have been published in many prestigious conferences and journals such as ACM Mobicom, IEEE INFOCOM, IEEE ICDCS, IEEE ICPADS, and IEEE TPDS, IEEE Transactions on Mobile Computing (TMC). The paper titled “Opportunity-based topology control in wireless sensor networks” obtained the only Best Paper Award in ICDCS 2008 (1 out of 638). He is an ACM and IEEE member. Research Funds NSFC General Program, PI, Sensorless Sensing for Micro-mobility in Complex Indoor Environment, 2018-2021, On-going National \"10,000\" Young Talents Program, PI, 2016-2018, On-going NSFC Key Project, co-PI, Selectively Attention Based Cognitive Information Computing, 2014-2018, On-going NSFC Outstanding Youth Foundation, PI, Lossy Link Self-organized Wireless Networks, 2014-2016, Completed NSFC General Program, PI, Bits over Interence: Interference Management in WLANs, 2012-2015, Completed NSFC Key Project, co-PI, Mobile Delay Tolerent Networks, 2009-2013, Completed",
  "content_length": 3868,
  "method": "requests",
  "crawl_time": "2025-12-01 14:53:58"
}