{
  "name": "Yunho Oh",
  "homepage": "https://yunho-oh.github.io",
  "status": "success",
  "content": "Yunho Oh ` I am recruiting Ph.D. students. Please contact me if you are interested in research on computer architecture. I am an associate professor in the School of Electrical Engineering at Korea University. I lead Computer Architecture and System Software Lab (ComSys). My research interests focus on designing next-generation computing systems, including hardware and software architectures for energy-efficient datacenters, processor architectures (CPUs, GPUs, and neural network accelerators), in-storage processing, memory system, and high-performance computing. Prior to joining Korea University, I was an assistant professor in the Department of Electronic and Electrical Engineering at SungKyunKwan University (SKKU). From March 2019 to Feburary 2021, I worked as a postdoctoral researcher in PARSA at EPFL (PI: Professor Babak Falsafi). I completed Ph.D. in the School of Electrical and Electronic Engineering at Yonsei University (Advisor: Professor Won Woo Ro). From August 2016 to August 2017, I worked as a visiting graduate scholar at the University of Southern California (Faculty Sponsor: Professor Murali Annavaram). From 2011 to 2014, I worked as a software engineer at Mobile Communications Buniness, Samsung Electronics. News Sep. 2025: I will be serving as an organization committee at ISPASS 2026. Sep. 2025: I will be serving as a program committee at ISPASS 2026. Sep. 2025: I have been promoted to Associate Professor at Korea University. Aug. 2025: A paper titled \"HALO: Hybrid Systolic Arrays via Logical Partitioning for Acceleration of Complex-Valued Neural Networks\" has been accepted at IISWC 2025. Aug. 2025: A paper titled \"FINEA: An Efficient Neural Network Accelerator Exploiting Factorized Input Features\" has been accepted at ICCD 2025. July 2025: I will be serving as a TPC co-chair at ICEIC 2026. July 2025: I will be serving as a program committee at HPCA 2026. June 2025: I will be serving as a session chair at LCTES 2025. June 2025: A papers titled \"MOST: Memory Oversubscription-aware Scheduling for Tensor Migration on GPU Unified Storage\" has been accepted at IEEE CAL. Apr. 2025: Two papers titled \"SSFFT: Energy-Efficient Selective Scaling for Fast Fourier Transform in Embedded GPUs\" and \"Kubism: Disassembling and Reassembling K-Means Clustering for Mobile Heterogeneous Platforms\" have been accepted at LCTES 2025. Mar. 2025: A paper titled \"Avant-Garde: Empowering GPUs with Scaled Numeric Formats\" has been accepted at ISCA 2025. Mar. 2025: A paper titled \"Hierarchical Traversal Stack Design Using Shared Memory for GPU Ray Tracing\" has been accepted at ISPASS 2025. Feb. 2025: I will be serving as a program committee at MICRO 2025. Feb. 2025: I will be serving as a organization committee at MICRO 2025. Feb. 2025: A paper titled \"Beyond VABlock: Improving Transformer Workloads through Aggressive Prefetching\" has been accepted at JSA. Feb. 2025: A paper titled \"TM-Training: An Energy-Efficient Tiered Memory System for Deep Learning Training in NPUs\" has been accepted at ACM TOS. Feb. 2025: A paper titled \"An Entropy Model for GPU Register Compression\" has been accepted at Journal of Semiconductor Technology and Science. Jan. 2025: A paper titled \"Effective Interplay between Sparsity and Quantization: From Theory to Practice\" has been accepted at ICLR (Spotlight). Jan. 2025: A paper titled \"A Low-latency On-chip Cache Hierarchy for Load-to-use Stall Reduction in GPUs\" has been accepted at ACM TACO. Dec. 2024: I will be serving as a program committee at ISPASS 2025. Nov. 2024: A paper titled \"HyMM: A Hybrid Sparse-Dense Matrix Multiplication Accelerator for GCNs\" has been accepted at DATE 2025. Nov. 2024: A paper titled \"Marching Page Walks: Batching and Concurrent Page Table Walks for Enhancing GPU Throughput\" has been accepted at HPCA 2025. Oct. 2024: A paper titled \"TLP Balancer: Predictive Thread Allocation for Multi-Tenant Inference in Embedded GPUs\" has been accepted at IEEE Embedded Systems Letters. Aug. 2024: I will be serving as a program committee at MLSys 2025. June 2024: A paper titled \"VitBit: Enhancing Embedded GPU Performance for AI Workloads through Register Operand Packing\" has been accepted at ICPP 2024. Apr. 2024: I will be serving as an external review committee at MICRO 2024. Mar. 2024: A paper titled \"SAVector: Vectored Systolic Arrays\" has been accepted at IEEE Access. Feb. 2024: A paper titled \"Conflict-Aware Compiler for Hierarchical Register File on GPUs\" has been accepted at Journal of Systems Architecture. Feb. 2024: I will be serving as a technical program committee at 17th IEEE International Symposium on Embedded Multicore/Manycore SoCs (MCSoC-2024). Dec. 2023: A paper titled \"Adaptive Kernel Merge and Fusion for Multi-Tenant Inference in Embedded GPUs\" has been accepted at IEEE Embedded Systems Letters. Oct. 2023: I will be serving as an organization committee at Fall Conference of IEIE 2023. Oct. 2023: I will be serving as an organization committee at the 5th Workshop on Future and Challenges of Memory-Centric Computing. Oct. 2023: I will be serving as a program committee at MLSys 2024. Oct. 2023: I will be serving as a program committee at GPGPU 2024. July 2023: I will be serving as a light program committee at HPCA 2024. June 2023: A paper titled \"Warped-MC: An Efficient Memory Controller Scheme for Massively Parallel Processors\" has been accepted at ICPP 2023. Mar. 2023: Two papers titled \"R2D2: Removing ReDunDancy Utilizing Linearity of Address Generation in GPUs\" and \"Imprecise Store Exceptions\" have been accepted at ISCA 2023. Oct. 2022: Two papers titled \"AstriFlash: A Flash-Based System for Online Services\" and \"SnakeByte: A TLB Design with Adaptive and Recursive Page Merging in GPUs\" have been accepted at HPCA 2023. Oct. 2022: A paper titled \"Analyzing GCN Aggregation on GPU\" has been accepted at IEEE Access. Oct. 2022: A paper titled \"GhostLeg: Selective Memory Coalescing for Secure GPU Architecture\" has been accepted at IEEE Access. Oct. 2022: A paper titled \"Scale-Out Systolic Arrays\" has been accepted at ACM Transactions on Architecture and Code Optimization. Sep. 2022: I will be serving as a program committee at MLSYS 2023. Sep. 2022: I have joined the School of Electrical Engineering and the School of Semiconductor Engineering at Korea University as an assistant professor. Aug. 2022: I have given a talk at the AI-SRC Summer Camp at Seoul National University. July 2022: A paper titled \"TEA-RC: Thread Context-Aware Register Cache for GPUs\" has been accepted at IEEE Access. Apr. 2022: I will be serving as an external review committee at MICRO 2022. Apr. 2022: I will be serving as a local arrangement chair at HPCA 2022. Mar. 2022: A paper titled \"CASH-RF: A Compiler-Assisted Hierarchical Register File in GPUs\" has been accepted at IEEE Embedded Systems Letters. Mar. 2022: I will be serving as a program committee at ACM Student Research Competition (ACM SRC) Grand Finals. Mar. 2022: I will be serving as a session chair (Session 2A: GPU and Data Analytics) at ASPLOS 2022. Feb. 2022: A paper titled \"FLIXR: Embedding Index into Flash Translation Layer in SSDs\" has been accepted at IEEE Transactions on Computers. Feb. 2022: I will be serving as a tutorial chair at ICEIC 2022. Jan. 2022: I have given a talk at Seoul National University. July 2021: I will be serving as a program committee at MLSYS 2022. June 2021: I will be serving as the poster session chair at ASPLOS 2022. Mar. 2021: A paper titled \"Rebooting Virtual Memory with Midgard\" has been accepted at ISCA 2021. Big congrats, Sid! Mar. 2021: I will be serving as an external review committee at MICRO 2021. Education Aug. 2018 Ph.D. in the School of Electrical and Electronic Engineering, Yonsei University, Seoul, Korea Feb. 2011 M.S. in the School of Electrical and Electronic Engineering, Yonsei University, Seoul, Korea Feb. 2009 B.S. in the School of Electrical and Electronic Engineering, Yonsei University, Seoul, Korea Publications Conferences and Journals IISWC 2025 HALO: Hybrid Systolic Arrays via Logical Partitioning for Acceleration of Complex-Valued Neural Networks Ji Yeong Yi, Eunbi Jeong, SungHee Yum, Jane Rhee, Sangun Choi, Gunjae Koo, Yunho Oh, Myung Kuk Yoon Accepted at IEEE International Symposium on Workload Characterization (IISWC 2025), Irvine, California, USA, 2025. ICCD 2025 FINEA: An Efficient Neural Network Accelerator Exploiting Factorized Input Features Yujin Kim, Chanhun Jeong, Yunho Oh, Myung Kuk Yoon and Gunjae Koo Accepted at IEEE International Conference on Computer Design (ICCD 2025), Dallas, USA, 2025. IEEE CAL MOST: Memory Oversubscription-aware Scheduling for Tensor Migration on GPU Unified Storage Junsu Kim, Jaebeom Jeon, Jaeyong Park, Sangun Choi, Minseong Gil, Seokin Hong, Gunjae Koo, Myung Kuk Yoon, and Yunho Oh Accepted at IEEE Computer Architecture Letters. LCTES 2025 SSFFT: Energy-Efficient Selective Scaling for Fast Fourier Transform in Embedded GPUs Dongwon Yang, Jaebeom Jeon, Minseong Gil, Junsu Kim, Seondeok Kim, Gunjae Koo, Myung Kuk Yoon, and Yunho Oh The 26th ACM SIGPLAN/SIGBED International Conference on Languages, Compilers, and Tools for Embedded Systems (LCTES 2025), Seoul, Korea, 2025. LCTES 2025 Kubism: Disassembling and Reassembling K-Means Clustering for Mobile Heterogeneous Platforms Seondeok Kim*, Sangun Choi*, Jaebeom Jeon, Junsu Kim, Minseong Gil, Jaehyeok Ryu, and Yunho Oh (*: Co-first authors) The 26th ACM SIGPLAN/SIGBED International Conference on Languages, Compilers, and Tools for Embedded Systems (LCTES 2025), Seoul, Korea, 2025. ISCA 2025 Avant-Garde: Empowering GPUs with Scaled Numeric Formats Minseong Gil, Dongho Ha, Simla Burcu Harma, Myung Kuk Yoon, Babak Falsafi, Won Woo Ro, and Yunho Oh The 52nd IEEE/ACM IInternational Symposium on Computer Architecture (ISCA 2025). ISPASS 2025 (Best Paper Honorable Mention) Hierarchical Traversal Stack Design Using Shared Memory for GPU Ray Tracing Eunsoo Jung, Eunbi Jeong, Gunjae Koo, Yunho Oh*, and Myung K",
  "content_length": 28552,
  "method": "requests",
  "crawl_time": "2025-12-01 14:53:57"
}