{
  "name": "Yunhui Guo",
  "homepage": "https://yunhuiguo.github.io",
  "status": "success",
  "content": "Yunhui Guo Yunhui Guo, Assistant Professor | yunhuiguo.github.io Yunhui Guo, Assistant Professor | yunhuiguo.github.io Yunhui Guo Research Publication Teaching Group Sponsors I am an assistant professor in the Department of Computer Science in the University of Texas at Dallas. I was a postdoc at UC Berkeley/ICSI working with Prof. Stella Yu. Previously, I completed my PhD at the University of California San Diego advised by Prof. Tajana Rosing. During my PhD, I had the pleasure to spent time at Qualcomm AI research and IBM Thomas J. Watson Research Center. Scholar CV Email: yunhui.guo (at) utdallas.edu I am looking for self-motivated PhD students and Research Interns. If you have experience in computer vision or machine learning and are interested in solving challenging research problems in these areas, please send me your CV and transcripts. Recent News (09/2025) One paper on multimodal robustness has been accepted to NeurIPS 2025 (D&B track)! (08/2025) I will be serving as an Area Chair for CVPR 2026. (06/2025) One paper accepted by ICCV 2025 and one paper accepted by IROS 2025. Congratulations to all co-authors! (05/2025) Our 1st Workshop on Multimodal Continual Learning will be held at ICCV ’25 in Honolulu, Hawai‘i. Please consider submitting your work! (04/2025) Our 2nd Workshop on Test-Time Adaptation: Putting Updates to the Test! (PUT) will be held on July 18–19, 2025, at ICML '25 in Vancouver. Please consider submitting your work! (02/2025) Our paper on continual out-of-distribution detection accepted at CVPR 2025. (12/2024) Our project has been selected by the Nvidia Academic Grant Program. (12/2024) One paper on test-time adaptation has been accepted for an Oral Presentation at AAAI 2025. Congratulations to Sarthak! (09/2024) Two papers were accepted by NeurIPS 2024. Congratulations to my students! (09/2024) I will be serving as an Area Chair for CVPR 2025. (07/2024) One paper about deep neural network watermarking was accepted by ECCV 2024. Congratulations to my students! (05/2024) One paper is early accepted (top 11%) by MICCAI 2024. (02/2024) Unsupervised Hyperbolic Feature Learning and Segment Every Out-of-Distribution Object are accepted by CVPR 2024. (01/2024) I will be serving as an Area Chair for ECCV 2024. Research My research is at the intersection of machine learning and computer vision. The goal of my lab is to investigate, design, and develop intelligent vision systems capable of reliable deployment in real-world scenarios. Currently, my research focuses on constructing intelligent agents that can continuously learn, dynamically adapt to evolving environments without forgetting previously acquired knowledge, and repurpose existing knowledge to adapt to novel scenarios. Our work paves the way for building intelligent and reliable systems in IoT, mobile computing, and autonomous driving, with the long-term goal of making AI more accessible and robust. Group Ph.D. Students Ouyang Xu (Fall 2022. B.S. from Southeast University, M.S. from University of Wisconsin–Madison.) Wenjie Zhao (Fall 2023. B.S. from Sichuan University, M.S. from Xi'an Jiaotong University.) Sarthak Kumar Maharana (Fall 2023. B.S. from International Institute of Information Technology Bhubaneswar, M.S. from the University of Southern California.) Ruiyu Mao (B.S from Case Western Reserve University, M.S. from the University of Texas at Dallas.) Master Students Subhrangsu Bose (UT Dallas) Undergraduate Students Nhi Le (UT Dallas) Zhixuan Wu (UMich) Intern Haoran Guo (UC Berkeley) Yuxuan Li (Harbin Institute of Technology) Selected Publications AVROBUSTBENCH: Benchmarking the Robustness of Audio-Visual Recognition Models at Test-Time Sarthak Kumar Maharana, Saksham Singh Kushwaha, Baoming Zhang, Adrian Rodriguez, Songtao Wei, Yapeng Tian, Yunhui Guo NeurIPS (D&B) 2025 [pdf] [code] BATCLIP: Bimodal Online Test-Time Adaptation for CLIP Sarthak Kumar Maharana, Baoming Zhang, Leonid Karlinsky, Rogerio Feris, Yunhui Guo ICCV 2025 [pdf] [code] Adapting Pre-Trained Vision Models for Novel Instance Detection and Segmentation Yangxiao Lu, Jishnu Jaykumar P, Yunhui Guo, Nicholas Ruozzi, Yu Xiang IROS 2025 [pdf] [code] H2ST: Hierarchical Two-Sample Tests for Continual Out-of-Distribution Detection Yuhang Liu, Wenjie Zhao, Yunhui Guo CVPR 2025 [pdf] [code] PALM: Pushing Adaptive Learning Rate Mechanisms for Continual Test-Time Adaptation Sarthak Kumar Maharana, Baoming Zhang, Yunhui Guo AAAI 2025Oral presentation [pdf] [code] STONE: A Submodular Optimization Framework for Active 3D Object Detection Ruiyu Mao, Sarthak Kumar Maharana, Rishabh K Iyer, Yunhui Guo NeurIPS 2024 [pdf] [code] Continual Audio-Visual Sound Separation Weiguo Pian, Yiyang Nan, Shijian Deng, Shentong Mo, Yunhui Guo, Yapeng Tian NeurIPS 2024 [pdf] [code] Not Just Change the Labels, Learn the Features: Watermarking Deep Neural Networks with Multi-View Data Yuxuan Li, Sarthak Kumar Maharana, Yunhui Guo ECCV 2024 [pdf] [code] SkinCON: Towards consensus for the uncertainty of skin cancer sub-typing through distribution regularized adaptive predictive sets (DRAPS) Zhihang Ren*, Yunqi Li*, Xinyu Li*, Xinrong Xie, Erik P. Duhaime, Kathy Fang, Tapabrata Chakraborty, Yunhui Guo, Stella X. Yu, David Whitney MICCAI 2024 [pdf] Unsupervised Feature Learning with Emergent Data-Driven Prototypicality Yunhui Guo, Youren Zhang, Yubei Chen, Stella X. Yu CVPR 2024 [pdf] [code] Segment Every Out-of-Distribution Object Wenjie Zhao, Jia Li, Xin Dong, Yu Xiang, Yunhui Guo CVPR 2024 [pdf] [code] Inconsistency-Based Data-Centric Active Open-Set Annotation Ruiyu Mao, Ouyang Xu, Yunhui Guo AAAI 2024 [pdf] [code] EVOLVE: Enhancing Unsupervised Continual Learning with Multiple Experts Xiaofan Yu, Tajana Rosing, Yunhui Guo WACV 2024 [pdf] [code] VEATIC: Video-based Emotion and Affect Tracking in Context Dataset Zhihang Ren*, Jefferson Ortega*, Yifan Wang*, Zhimin Chen, Yunhui Guo, Stella X. Yu, David Whitney WACV 2024 [pdf] [code] Audio-Visual Class-Incremental Learning Weiguo Pian, Shentong Mo, Yunhui Guo, Yapeng Tian ICCV 2023 [pdf] [code] Imbalanced Lifelong Learning with AUC Maximization Xiangyu Zhu, Jie Hao, Yunhui Guo, Mingrui Liu UAI 2023 [pdf] [code] SCALE: Online Self-Supervised Lifelong Learning without Prior Knowledge Xiaofan Yu, Yunhui Guo, Sicun Gao, Tajana Rosing CLVision Workshop@CVPR 2023 [pdf] [code] Self-Supervised Unseen Object Instance Segmentation via Long-Term Robot Interaction Yangxiao Lu, Ninad Khargonkar, Zesheng Xu, Charles Averill, Kamalesh Palanisamy, Kaiyu Hang, Yunhui Guo, Nicholas Ruozzi, Yu Xiang RSS 2023 [pdf] Modeling Semantic Correlation and Hierarchy for Real-world Wildlife Recognition Dong-Jin Kim, Zhongqi Miao, Yunhui Guo, Stella X. Yu, Kyle Landolt, Mark Koneff, Travis Harrison SPL 2023 [pdf] Unsupervised Hierarchical Semantic Segmentation with Multiview Cosegmentation and Clustering Transformers Tsung-Wei Ke, Jyh-Jing Hwang, Yunhui Guo, Xudong Wang, Stella Yu CVPR 2022Oral presentation [pdf] [code] [bibtex] CO-SNE: Dimensionality Reduction and Visualization for Hyperbolic Data Yunhui Guo, Haoran Guo, Stella Yu CVPR 2022 [pdf] [code] [bibtex] Clipped Hyperbolic Classifiers Are Super-Hyperbolic Classifiers Yunhui Guo, Xudong Wang, Yubei Chen, Stella Yu CVPR 2022 [pdf] [bibtex] Improve Image-based Skin Cancer Diagnosis with Generative Self-Supervised Learning Zhihang Ren, Yunhui Guo, Stella X. Yu, David Whitney CHASE 2021 [pdf] [bibtex] MAT: Processing In-Memory Acceleration for Long-Sequence Attention Minxuan Zhou, Yunhui Guo, Weihong Xu, Bin Li, Kevin W. Eliceiri, Tajana Rosing DAC 2021 [pdf] [bibtex] Improved Schemes for Episodic Memory-based Lifelong Learning Yunhui Guo*, Mingrui Liu*, Tianbao Yang, Tajana Rosing. (*equal contribution) NeurIPS 2020 Spotlight, top 4% submissions [pdf] [code] [bibtex] A Broader Study of Cross-Domain Few-Shot Learning Yunhui Guo, Noel C. Codella, Leonid Karlinsky, James V. Codella, John R. Smith, Kate Saenko, Tajana Rosing, Rogerio Feris ECCV 2020 [pdf] [code and data] [bibtex] AdaFilter: Adaptive Filter Fine-tuning for Deep Transfer Learning Yunhui Guo, Yandong Li, Liqiang Wang, Tajana Rosing AAAI 2020 [pdf] [bibtex] SpotTune: Transfer Learning through Adaptive Fine-tuning Yunhui Guo, Honghui Shi, Abhishek Kumar, Kristen Grauman, Tajana Rosing, Rogério Schmidt Feris CVPR 2019 [pdf] [code] [bibtex] Depthwise Convolution is All You Need for Learning Multiple Visual Domains. Yunhui Guo*, Yandong Li*, Liqiang Wang, Tajana Rosing *Equal Contribution AAAI 2019 [pdf] [code] [bibtex] A Survey on Methods and Theories of Quantized Neural Networks Yunhui Guo [pdf] [bibtex] Understanding Users’ Budgets for Recommendation with Hierarchical Poisson Factorization Yunhui Guo, Congfu Xu, Hanzhang Song, Xin Wang IJCAI 2017 [pdf] [bibtex] Collaborative Expert Recommendation for Community-Based Question Answering Congfu Xu, Xin Wang, Yunhui Guo ECML/PKDD 2016 [pdf] [bibtex] Constrained Preference Embedding for Item Recommendation Xin Wang, CongFu Xu, Yunhui Guo, Hui Qian IJCAI 2016 [pdf] [bibtex] Recommendation Algorithms for Optimizing Hit Rate, User Satisfaction and Website Revenue Xin Wang, Yunhui Guo, Congfu Xu IJCAI 2015 [pdf] [bibtex] Teaching Instructor: UT Dallas CS 4365 Artificial Intellgence (Fall 2022, Spring 2023, Fall 2023, Fall 2024), Computer Vision (Spring 2025) Sponsors © Yunhui Guo 2017",
  "content_length": 9348,
  "method": "requests",
  "crawl_time": "2025-12-01 14:53:57"
}