{
  "name": "Yunhe Feng",
  "homepage": "https://computerscience.engineering.unt.edu/people/faculty/yunhe-feng",
  "status": "success",
  "content": "Yunhe Feng | University of North Texas Yunhe Feng Computer Science and Engineering Assistant Professor Discovery Park F251 Office Hours:Thu 3:00 - 5:00 pm Yunhe.Feng@unt.edu About Faculty Info | Research Profile | Website | Education Ph.D. in Computer Science, University of Tennessee, Knoxville, 2020 M.E. in Computer Technology, Beijing University of Technology, 2014 B.E. in Computer Science & Technology, Beijing University of Technology, 2011 Biography Dr. Yunhe Feng is an Assistant Professor in the Department of Computer Science and Engineering (CSE), University of North Texas (UNT), Denton, TX; a Tier-One (R1) Research University as per Carnegie Classification, where he directs the Responsible AI Laboratory (RAIL). His research interest lies in Responsible AI, Mobile Security and Privacy, and Social Media. Dr. Feng is particularly interested in: Designing algorithms and models to enhance fairness, accountability, transparency, ethics, security, and privacy in AI. Investigating the societal impacts of AI by putting humans and society in the loop. Applying AI in cross-domain applications (e.g., smart manufacturing and smart agriculture). Dr. Feng's research has been sponsored by both academic and industrial grants, including Kaggle's Open Data Research Grant, Google Cloud & Harvard Global Health Institute COVID-19 Research Credits, UW-Microsoft Azure Cloud Computing Credits, UW Strategic Research Fund, and NSF-funded XSEDE (Extreme Science and Engineering Discovery Environment) Startup Allocation. He has received several fellowships and awards, including UW Data Science Fellowship, UTK Min H. Kao Fellowship (the highest departmental award), UTK EECS Department Excellence Fellowship, a Best Paper Award by IEEE BigDataSecurity'18, and two Best Paper/Presentation Nominations by IEEE CloudCom'17 and ACM UbiComp'20. Dr. Feng's research has been covered internationally by news outlets, including Financial Times, Business Insider, Yahoo! Finance, UW News, AAAS EurekAlert, and ACM Tech News. Before joining UNT, Dr. Feng was a Postdoctoral Fellow/Scholar with Dr. Chirag Shah at the University of Washington (UW), Seattle (2020-2022). He received his Ph.D. in Computer Science in 2020 from the University of Tennessee, Knoxville (UTK). Dr. Feng also worked as a deep learning research intern (Summer 2018) and research assistant (Dec. 2018 - Sep. 2019) at Oak Ridge National Laboratory, where he led the interdisciplinary research project of DeepWelding. Dr. Feng obtained his B.E. in Computer Science & Technology and M.E. in Computer Technology from Beijing University of Technology in 2011 and 2014, respectively. Dr. Feng is affiliated with UW Responsibility in AI Systems and Experiences (RAISE) and serves as Associated Editor for Information Matters. He also serves as PC for AAAI, TPC for ICWSM, GLOBECOM, HPCC, etc. Publications Please visit Faculty Info page and click \"Publications\" tab. ©",
  "content_length": 2928,
  "method": "requests",
  "crawl_time": "2025-12-01 14:54:00"
}