{
  "name": "Yunming Xiao",
  "homepage": "https://sds.cuhk.edu.cn/en/teacher/2127",
  "status": "success",
  "content": "XIAO, Yunming | School of Data Science SEARCH SDSÂ Portal Search SEARCH CUHK-Shenzhen ç®ä½ä¸­æ About SDS Overview Academic Area Deanâs Message Publications Brochure SchoolÂ Newsletter Annual Report FAQ Contact Us Programmes Introduction Undergraduate Data Science and Big Data Technology Statistics Computer Science and Engineering Financial Engineering 2+2 Double Major Programme Interdisciplinary Data Analytics +Â X Double Major Programme Aerospace Science and Earth InformaticsÂ + X Double Major Programme Columbia University 3+2 Initiative (Columbia Class) Taught Postgraduate M.Sc in Data Science M.Sc in Financial Engineering(Full-time/Part-time) M.Sc in Artificial Intelligence and Robotics M.Sc in Computer Science M.Sc in Statistics M.Sc in Bioinformatics Research Postgraduate M.Phil.-Ph.D. Programme in Data Science M.Phil.-Ph.D. Programme in Computer Science Faculty Faculty Emeritus Faculty Affiliated Appointments Researchers/Visitors Students UG Academic Advisory System Ph.D. Students Student Interviews News & Announcements News Announcements School Events Academic Conferences DDTOR 2025 CSAMSE 2023 RMTA 2023 ICASSP 2022 Mostly OM 2019 Academic Activities SDS Colloquium Series Other Events Research Jobs Faculty Positions Postdoctoral Fellowships Career Graduate Placements International Programmes About SDS Overview Academic Area Deanâs Message Publications Brochure SchoolÂ Newsletter Annual Report FAQ Contact Us Programmes Introduction Undergraduate Data Science and Big Data Technology Statistics Computer Science and Engineering Financial Engineering 2+2 Double Major Programme Interdisciplinary Data Analytics +Â X Double Major Programme Aerospace Science and Earth InformaticsÂ + X Double Major Programme Columbia University 3+2 Initiative (Columbia Class) Taught Postgraduate M.Sc in Data Science M.Sc in Financial Engineering(Full-time/Part-time) M.Sc in Artificial Intelligence and Robotics M.Sc in Computer Science M.Sc in Statistics M.Sc in Bioinformatics Research Postgraduate M.Phil.-Ph.D. Programme in Data Science M.Phil.-Ph.D. Programme in Computer Science Faculty Faculty Emeritus Faculty Affiliated Appointments Researchers/Visitors Students UG Academic Advisory System Ph.D. Students Student Interviews News & Announcements News Announcements School Events Academic Conferences DDTOR 2025 CSAMSE 2023 RMTA 2023 ICASSP 2022 Mostly OM 2019 Academic Activities SDS Colloquium Series Other Events Research Jobs Faculty Positions Postdoctoral Fellowships Career Graduate Placements International Programmes SDSÂ Portal CUHK-Shenzhen ç®ä½ä¸­æ XIAO, Yunming Assistant Professor Education Background Ph.D. in Computer Science, Northwestern University (2019-2024) B.Eng. in Computer Science, Beijing University of Posts and Telecommunications (2015-2019) Academic Area Computer Science, Computer Systems and Cloud Computing Research Field Computer Systems, Computer Networks, Security and Privacy, Cloud Infrastructure Personal Website https://yunmingxiao.github.io/ Email yunmingxiao@cuhk.edu.cn Office Room 403a, Zhi Xin Building Biography Dr. Yunming Xiao is an Assistant Professor at the School of Data Science, The Chinese University of Hong Kong, Shenzhen. Before joining CUHK Shenzhen, he was a Research Fellow at the University of Michigan. He received his Ph.D. in Computer Science from Northwestern University in 2024 and B.Eng. in Computer Science from Beijing University of Posts and Telecommunications in 2019. He was an intern at Google, Hewlett Packard Labs, Nokia Bell Labs, and ByteDance, and was a visiting student at KAUST.His research interests lie in computer systems and networks, with a focus on improving the security and privacy of online services and improving the efficiency and reliability of cloud infrastructure. He has authored publications in leading conferences such as SIGCOMM, NSDI, SIGMETRICS, EuroSys, USENIX ATC. Some of his work has been deployed at production environment. He has received the Best Student Paper Award from ACM EuroSys. Academic Publications 1. Shihan Lin, Suting Chen, Yunming Xiao#, Yanqi Gu, Aleksandar Kuzmanovic, Xiaowei Yang, âPreAcher: Secure and Practical Password Pre-Authentication by Content Delivery Networksâ, USENIX Symposium on Networked Systems Design and Implementation (NSDI), 2025. (CCF-A)2. Yadong Liu*, Yunming Xiao*, Xuan Zhang, Weizhen Dang, Huihui Liu, Xiang Li, Zekun He, Jilong Wang, Aleksandar Kuzmanovic, Ang Chen, Congcong Miao, âUnlocking ECMP Programmability for Precise Traffic Control,â USENIX Symposium on Networked Systems Design and Implementation (NSDI), 2025. (CCF-A)3. Congcong Miao*, Zhizhen Zhong*, Yunming Xiao*, Feng Yang*, Senkuo Zhang*, Chaodong Lu, Jingyi Geng, Yachen Wang, Xianneng Zou, Yinan Jiang, Zizhuo Bai, Chuanchuan Yang, âMegaTE: Extending WAN Traffic Engineering to Millions of Endpoints in Virtualized Cloudâ, ACM SIGCOMM, 2024. (CCF-A)4. Yunming Xiao, Diman Zad Tootaghaj, Aditya Dhakal, Lianjie Cao, Puneet Sharma, Aleksandar Kuzmanovic, âConspirator: SmartNIC-Aided Control Plane for Distributed ML Workloadsâ, USENIX Annual Technical Conference (ATC), 2024. (CCF-A)5. Yunming Xiao, Yibo Zhao, Sen Lin, Aleksandar Kuzmanovic, âSnatch: Online Streaming Analytics at the Network Edgeâ, ACM European Conference on Computer Systems (EuroSys), 2024. Best Student Paper Award. (CCF-A)6. Congcong Miao*, Yunming Xiao*, Marco Canini, Ruiqiang Dai, Shengli Zheng, Jilong Wang, Jiwu Bu, Aleksandar Kuzmanovic, Yachen Wang, âTENSOR: Lightweight BGP Non-Stop Routingâ, ACM SIGCOMM, 2023. (CCF-A)7. Yunming Xiao, Matteo Varvello, Marc Anthony Warrior, Aleksandar Kuzmanovic, âDecoding the Kodi Ecosystemâ, ACM Transactions on the Web, 2023. (CCF-B)8. Yunming Xiao, Matteo Varvello, âFIAT: Frictionless Authentication of IoT Trafficâ, ACM Conference on Emerging Network Experiment and Technology (CoNEXT), 2022. (CCF-B)9. Yunming Xiao, Sarit Markovich, Aleksandar Kuzmanovic, âBlockchain Mining: Optimal Resource Allocationâ, ACM Advances in Financial Technologies (AFT), 2022.10. Yunming Xiao, Matteo Varvello, Aleksandar Kuzmanovic, âMonetizing Spare Bandwidth: the Case of Distributed VPNsâ, ACM SIGMETRICS, 2022. (CCF-B) A complete list of publications can be found at https://yunmingxiao.github.io/ Address: 3 - 6 Floor, Dao Yuan Building, 2001 Longxiang Road, Longgang District, ShenzhenE-mail: sds@cuhk.edu.cnWechat Account: cuhksz-sdssds.cuhk.edu.cnCopyright Â© CUHK-Shenzhen School of Data Science",
  "content_length": 6495,
  "method": "requests",
  "crawl_time": "2025-12-01 14:54:01"
}