{
  "name": "Yupeng Hu",
  "homepage": "http://www.yphu.cn/publications",
  "status": "success",
  "content": "我的学习分享(SysSec Lab) 我的学习分享(SysSec Lab) 胡玉鹏 教授, Professor Yupeng Hu, College of Computer Science and Electronic Engineering Hunan University email: yphu@hnu.edu.cn tel: 0731-88821513 Publications Papers: Jing Huang, Min Wang, Yupeng Hu*. FIRMCCF: Detecting Custom Cryptographic Function Vulnerabilities Through Query-driven Approaches. IEEE Internet of Things Journal, 2025, forthcoming. Yupeng Hu, Huilin Chen, Hongrui Pan, Wenqiang Jin, Zhenyu Ye, Chenxi Liu, Kaiyi Wang. Sound Eavesdropping on Mobile Device via Audio-Induced EMR. IEEE Transactions on Dependable and Secure Computing (TDSC) 2025, forthcoming. Jing Huang, Jiongyi Chen, Yuting Xiao, Zheng Qin, Yupeng Hu*. FIRMPASS: Identifying Broken Password Management in Linux-Based IoT Firmware Through Query-Driven Approaches. IEEE Internet of Things Journal, 2025, 12(14): 26911-26922, DOI: 10.1109/JIOT.2025.3561520. Wenxin Kuang, Fengxiao Tang, Jiayang Liu, Yupeng Hu*, Keqin Li. FGAA: Enhancing adversarial robustness in AIoT-enabled smart systems via Fine-Grained Activation Alignment. Journal of Systems Architecture, 2025, forthcoming. Wenxin Kuang, Qizhuang Liang, Peng Sun, Wei Fu, Qiao Hu, Yupeng Hu*. Unveiling the Pruning Risks on Privacy Vulnerabilities of Deep Neural Networks. 2025 IEEE International Conference on Acoustics, Speech, and Signal Processing (ICASSP 2025). Zhenyu Ye, Lei Zhou, Fengwei Zhang, Wenqiang Jin, Zhenyu Ning*, Yupeng Hu*, Zheng Qin. FortifyPatch: Towards Tamper-resistant Live Patching in Linux-based Hypervisor. ACM SIGSOFT International Symposium on Software Testing and Analysis (ISSTA), 16-20 September 2024, Vienna, Austria, pp.38-50. Yuting Xiao, Jiongyi Chen*, Yupeng Hu*, Jing Huang. FIRMRES: Exposing Broken Device-Cloud Access Control in IoT Through Static Firmware Analysis. The 54th Annual IEEE/IFIP International Conference on Dependable Systems and Networks (DSN 2024), Brisbane, Australia, June 24-27, pp.495-506. Huiling Chen, Wenqiang Jin*, Yupeng Hu*, Zhenyu Ning, Kenli Li, Zheng Qin, Mingxing Duan, Yong Xie, Daibo Liu, Ming Li. Eavesdropping on Black-box Mobile Devices via Audio Amplifier's EMR. Network and Distributed System Security (NDSS) Symposium, 26 February-1 March 2024, San Diego, CA, USA. Bihui Liu, Zhenyu Ye, Qiao Hu*, Yupeng Hu*, Yuchong Hu, Yang Xu, Keqin Li. HPDK: A Hybrid PM-DRAM Key-Value Store for High l/O Throughput. IEEE Transactions on Computers, 2024, 73(6):1575-1587, DOI: 10.1109/TC.2024.3377914. Yupeng Hu, Wenxin Kuang, Zhe Jin, Wenjia Li, Keqin Li, Jiliang Zhang, Qiao Hu*. SIAT: A Systematic Inter-Component Communication Real-time Analysis Technique for Detecting Data Leak Threats on Android.  Journal of Computer Security, 2024, 32(3):291-317. Lantao Zheng, Wenxin Kuang*, Qizhuang Liang, Wei Liang, Qiao Hu, Wei Fu, Xiashu Ding, Bijiang Xu, Yupeng Hu*. Reducing the Length Divergence Bias for Textual Matching Models via Alternating Adversarial Training. IEEE CSCLOUD 2023, pp.186-191. [Best Creative Paper] Ye Xiao, Xingchen Li, Jiangjin Yin, Wei Liang, Yupeng Hu*. Adaptive multi-source data fusion vessel trajectory prediction model for intelligent maritime traffic. Knowledge-Based Systems (中科院1区Top), 2023, vol.277, 110799, https://doi.org/10.1016/j.knosys.2023.110799 Linjun Wu, Yupeng Hu*, Kehuan Zhang, Wenjia Li, Xiaolin Xu, Wanli Chang*. FLAM-PUF: A Response Feedback-based Lightweight Anti-Machine Learning-Attack PUF. IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems, 2022, 41(11):4433-4444, DOI:10.1109/TCAD.2022.3197696 Linjun Wu, Yupeng Hu*, Kehuan Zhang, Wenjia Li, Xiaolin Xu, Wanli Chang*. FLAM-PUF: A Response Feedback-based Lightweight Anti-Machine Learning-Attack PUF. CODES+ISSS, ESWEEK 2022, Shanghai, China (Best paper candidate, Top 2%) Ye Xiao, Xingchen Li*, Wen Yao, Jin Chen, Yupeng Hu*. Bidirectional Data-Driven Trajectory Prediction for Intelligent Maritime Traffic. IEEE Transactions on Intelligent Transportation Systems (中科院1区Top), 2022, 42(2):1773-1785, DOI:10.1109/TITS.2022.3219998 Wei Liang, Songyou Xie, Jiahong Cai, Jianbo Xu, Yupeng Hu*, Yang Xu, and Meikang Qiu. Deep Neural Network Security Collaborative Filtering Scheme for Service Recommendation in Intelligent Cyber-Physical Systems. IEEE Internet of Things Journal, 2022, 9(22):22123-22132, DOI:10.1109/JIOT.2021.3086845 Z. Tang, Q. Hu*, Y. Hu*, W. Kuang, J. Chen. SEVulDet: A Semantics-Enhanced Learnable Vulnerability Detector. The 52nd Annual IEEE/IFIP International Conference on Dependable Systems and Networks (DSN'22), Baltimore, Maryland, USA, Jun. 27-30, 2022, 150-162 Hua Deng, Zheng Qin, Qianhong Wu, Robert Deng, Zhenyu Guan, Yupeng Hu, Fangmin Li. Achieving Fine-grained Data Sharing for Hierarchical Organizations in Clouds. IEEE Transactions on Dependable and Secure Computing, 2022, DOI:10.1109/TDSC.2022.3153467 Yupeng Hu, Wenxin Kuang, Zheng Qin, Kenli Li, Jiliang Zhang, Yansong Gao, Wenjia Li, and Keqin Li. 2021. Artificial Intelligence Security: Threats and Countermeasures. ACM Comput. Surv. 55, 1, Article 20 (November 2021), 36 pages. DOI:10.1145/3487890 Yupeng Hu, Linjun Wu, Zhuojun Chen, Yun Huang, Xiaolin Xu, Keqin Li, Jiliang Zhang. STT-MRAM-based Reliable Weak PUF. IEEE Transactions on Computers, 2022, 71(7):1564-1574, DOI:10.1109/TC.2021.3095657 Wei Liang, Zuoting Ning, Songyou Xie, Yupeng Hu, Shao fei Lu, Dafang Zhang. Secure fusion approach for the Internet of Things in smart autonomous multi-robot systems. Information Sciences, Nov. 2021, 579, 468-482 Qiao Hu, Jingyi Zhang,Gerhard Hancke,Yupeng Hu*,Wenjia Li,Hongbo Jiang, Zheng Qin. Half-duplex mode based secure key generation method for resource-constrained IoT devices. IEEE Internet of Things Journal, 2022, 9(2):1326-1338, DOI:10.1109/JIOT.2021.3086847 Yupeng Hu*, Yonghe Liu, Wenjia Li, Keqin Li, Kenli Li, Nong Xiao, Zheng Qin. Unequal Failure Protection Coding Technique for Distributed Cloud Storage Systems. IEEE Transactions on Cloud Computing, Jan.-March 1 2021, 9(1):386-400 Cheng Zhang, Yang Xu, Yupeng Hu, J. Wu, Ju Ren, Yaoxue Zhang. A Blockchain-Based Multi-Cloud Storage Data Auditing Scheme to Locate Faults. IEEE Transactions on Cloud Computing, 2022, 10(4):2252-2263, DOI:10.1109/TCC.2021.3057771 (ESI高被引) 李乾, 胡玉鹏*, 叶振宇, 肖叶, 秦拯. 基于蚁群优化算法的纠删码存储系统数据更新方案. 计算机研究与发展, 2021, 58(2):305-318 (获第六届中国科协优秀科技论文奖) Yang Xu, Xiaodan Yan, Yulei Wu, Yupeng Hu, Wei Liang, Jixin Zhang. Hierarchical Bidirectional RNN for Safety-enhanced B5G Heterogeneous Networks. IEEE Transactions on Network Science and Engineering, 2021, 8(4):2946-2957, DOI:10.1109/TNSE.2021.3055762 Jiliang Zhang, Shuang Peng, Yupeng Hu, Fei Peng, Wei Hu, Jinmei Lai, Jing Ye, Xiangqi Wang. HRAE: Hardware-assisted Randomization against Adversarial Example Attacks. IEEE 29th Asian Test Symposium (ATS), 2020 Chenyue Zhang, Wenjia Li, Yuansheng Luo, Yupeng Hu. AIT: An AI-enabled Trust Management System For Vehicular Networks Using Blockchain Technology, IEEE Internet of Things Journal, 2020, 8(5):3157-3169, DOI:10.1109/JIOT.2020.3044296 Haotian Wang, Huigui Rong, Qun Zhang, Daibo Liu, Chunhua Hu, Yupeng Hu. Good or Mediocre? A Deep Reinforcement Learning Approach for Taxi Revenue Efﬁciency Optimization. IEEE Transactions on Network Science and Engineering, 2020, 7(4):3018-3027, DOI: 10.1109/TNSE.2020.3009855 Zhu Xiao, Fancheng Li, Ronghui Wu, Hongbo Jiang, Yupeng Hu, Ju Ren, Chenglin Cai, Arun Iyengar. TrajData: On Vehicle Trajectory Collection with Commodity Plug-and-Play OBU Devices. IEEE Internet of Things Journal, 2020, 7(9):9066-9079, DOI: 10.1109/JIOT.2020.3001566 Yupeng Hu, Qian Li, Wei Xie, Wenjia Li, An Ant Colony Optimization based Data Update Scheme for Erasure-Coded Storage Systems. In 37th IEEE International Conference on Computer Design, ICCD 2019, Poster Session (CCF B) Yupeng Hu*, Yonghe Liu, Wenjia Li, Keqin Li, Kenli Li, Nong Xiao, Zheng Qin. Unequal Failure Protection Coding Technique for Distributed Cloud Storage Systems. IEEE Transactions on Cloud Computing, 2017, DOI:10.1109/TCC.2017.2785396 (IF:7.928) Wei Li, Tianyu Zhang, Dafang Zhang, Yupeng Hu, Kun Xie, Ting Zhu. Data Temperature-Aware Bloom Filters for Flash-Based Storage. 2019 IEEE HPCC, DOI: 10.1109/HPCC/SmartCity/DSS.2019.00197. Lantao Zheng, Wenxin Kuang*, Qizhuang Liang, Wei Liang, Qiao Hu, Wei Fu, Xiashu Ding, Bijiang Xu, Yupeng Hu*. Reducing the Length Divergence Bias for Textual Matching Models via Alternating Adversarial Training. IEEE CSCloud 2023 (Best Creative Paper) Xin Ren ; Yupeng Hu* ; Wenxin Kuang ; Mohamadou Ballo Souleymanou. A Web Attack Detection Technology Based on Bag of Words and Hidden Markov Model. 2018 IEEE 15th International Conference on Mobile Ad Hoc and Sensor Systems (MASS), 2018, 526-531 (CCF C类会议) Yupeng Hu*, Wenjia Li, Mengyi Ma, Na Cao, Yonghe Liu, Zheng Qin, Jia Wang. Toward Complex Search for Encrypted Cloud Data via Index Blind Storage. 15th IEEE ISPA (International Symposium on Parallel and Distributed Processing with Applications), 2017, 1-8, (CCF C类会议) Guanchao Wen, Yupeng Hu*, Chen Jiang, Na Cao, Zheng Qin. An Image Texture and BP neural network based Malicious Files Detection Technique for Cloud Storage Systems. MobiSec 2017, in In conjunction with INFOCOM2017, 426-431 Yupeng Hu*, Yonghe Liu, Wenjia Li, Nong Xiao, Zheng Qin, Shu Yin. Unequal Failure Protection Coding Technology for Cloud Storage Systems. In Proc. of IEEE International Conference on Cluster Computing, Taipei, Taiwan, 2016, pp. 231-240 (CCF B类会议, Acceptance rate: 24%, SCI Index) Sheheryar Arshad, Chunhai Feng, Yonghe Liu, Yupeng Hu, Ruiyun Yu, Siwang Zhou, Heng Li. Wi-Chase: A WiFi based Human Activity Recognition System for Sensorless Environments. In Proc. of IEEE WoWMoM 2017, 1-6 You Liao, Yupeng Hu*, Linjun Wu, Zheng Qin. A Weighted Frequency Based Cache Memory Replacement Policy for Named Data Networking. Lecture Notes in Computer Science (LNCS), vol 10067, 2016, 361-370 Linjun Wu, Yupeng Hu*, Chen Jiang, Junjie Deng, Guanchao Wen. The Design and Implementation of an Erasure-Coded Cloud Storage Syst",
  "content_length": 20264,
  "method": "requests",
  "crawl_time": "2025-12-01 14:54:03"
}