{
  "name": "Yuqing Kong",
  "homepage": "https://cfcs.pku.edu.cn/yuqkong",
  "status": "success",
  "content": "Yuqing Kong Yuqing Kong Tenured Associate Professor the Center on Frontiers of Computing Studies (CFCS) Peking University Courtyard No.5, Jing Yuan, Beijing, P.R.China, 100871 yuqing.kong[at]pku.edu.cn I am currently an associate professor at the Center on Frontiers of Computing Studies (CFCS), Peking University. I obtained my Ph.D. degree from the Computer Science and Engineering Department at University of Michigan in 2018 and my bachelor degree in mathematics from University of Science and Technology of China in 2013. My research interests lie in the intersection of theoretical computer science and the areas of economics: information elicitation/evaluation, prediction markets, mechanism design, and the applications of these areas to crowdsourcing and machine learning. Publications 2025 Y. Guo, J. D. Hartline, Z. Huang, Y. Kong, A. Shah, F.-Y. Yu, âAlgorithmic Robust Forecast Aggregation,â in Proceedings of the ACM Conference on Economics and Computation (EC), 2025 S. Xu, Y. Lu, G. Schoenebeck, Y. Kong, âBenchmarking LLMs' Judgments with No Gold Standardâ in Proceedings of the 13th International Conference on Learning Representations (ICLR), 2025 Y. Guo, Y. Kong, J. Liu, âMitigating the Participation Bias by Balancing Extreme Ratingsâ in Proceedings of the ACM Web conference (WWW), 2025, oral presentation Y. Guo, Y. Kong, âRobust Aggregation with Adversarial Expertsâ in Proceedings of the ACM Web conference (WWW), 2025 Q. Wang, X. Xia, Z. Yang, X. Deng, Y. Kong, Z. Zhang, L. Wang, C. Yu, J. Xu, B. Zheng âLearning against Non-credible Second-Price Auctionsâ in Proceedings of the ACM Web conference (WWW), 2025 2024 Y. Kong, S. Wang, Y. Wang, âThe Surprising Benefits of Base Rate Neglect in Robust Aggregationâ in Proceedings of ACM Conference on Econ and Computation (EC), 2024 Y. Lu, S. Xu, Y. Zhang, Y. Kong, G. Schoenebeck, âEliciting Informative Text Evaluations with Large Language Modelsâ in Proceedings of ACM Conference on Econ and Computation (EC), 2024 Y. Kong, \"Dominantly Truthful Peer Prediction Mechanisms with a Finite Number of Tasks\" J. ACM 71, 2, Article 9 (April 2024), 49 pages. https://doi.org/10.1145/3638239 Extends the work presented in SODA 2020, ITCS 2022 Y. Pan, Z. Chen, Y. Kongâ , âRobust Decision Aggregation with Second-order Informationâ in Proceedings of the ACM Web conference (WWW), 2024 2023 Y. Kong, G. Schoenebeck, \"False Consensus, Information Theory, and Prediction Markets\" in Proceedings of The 13th Innovations in Theoretical Computer Science (ITCS), 2023. Y. Lu, Y. Kong, âCalibrating 'Cheap Signals' in Peer Review without a Prior.â in Proceedings of the Thirty-seventh Conference on Neural Information Processing Systems (NeurIPS), 2023 Y. Guo, Y. Yuan, J. Zhang, Y. Kong, Z. Zhu, & Z. Cai, \"Near-optimal experimental design under the budget constraint in online platformsâ in Proceedings of the ACM Web conference (WWW), 2023 Q. Wang, Z. Yang, X. Deng, Y. Kong, âLearning to bid in repeated first-price auctions with budgetsâ in Proceedings of the 40th International Conference on Machine Learning (ICML), 2023 2022 Y. Kong, Y. Li, Y. Zhang, Z. Huang, J. Wu, \"Eliciting Thinking Hierarchy without a Prior\" in Proceedings of Thirty-sixth Conference on Neural Information Processing Systems (NeurIPS), 2022 [Blog] [å ¬ä¼å·] Z. Huang, Y. Kong, X. Liu, G. Schoenebeck, S. Xu, \"BONUS! Maximizing Surprise\" in Proceedings of The Web Conference (WWW), 2022. Y. Kong, âMore Dominantly Truthful Multi-task Peer Prediction with a Finite Number of Tasksâ in Proceedings of The 13th Innovations in Theoretical Computer Science (ITCS), 2022. 2021 Z. Huang*, S. Xu*, Y. Shan, Y. Lu, Y. Kong, X. Liu and G. Schoenebeck, \"SURPRISE! and When to Schedule It.\" in Proceedings of the 30th International Joint Conference on Artificial Intelligence (IJCAI-21) 2020 Y. Kong, âDominantly Truthful Multi-task Peer Prediction with a Constant Number of Tasksâ in Proceedings of the ACM-SIAM Symposium on Discrete Algorithms  (SODA), 2020. [Talk] [Blog] X. Sun*, Y. Xu*, P. Cao, Y. Kong, L. Hu, S. Zhang, Y. Wang, âTCGM: An Information-Theoretic Framework for Semi-Supervised Multi-Modality Learningâ in proceeding of  European Conference on Computer Vision (ECCV), Oral (2%), 2020. Y. Kong, G. Schoenebeck, B. Tao, F. Yu, âInformation Elicitation Mechanisms for Statistical Estimationâ in Proceedings of the 34th AAAI Conference on Artificial Intelligence (AAAI), 2020. 2019 Y. Kong, C. Peikert, G. Schoenebeck, B. Tao, âOutsourcing Computation: the Minimal Refereed Mechanismâ in Proceedings of The 15th Conference on Web and Internet Economics (WINE), 2019. Y. Xu*, P. Cao*, Y. Kong, Y. Wang, âLDMI: A Novel Information-theoretic Loss Function for Training Deep Nets Robust to Label Noiseâ in Proceedings of the Thirty-third Conference on Neural Information Processing Systems (NeurIPS), 2019. [Blog] P. Cao*, Y. Xu*, Y. Kong, Y. Wang, \"Max-MIG: an Information-Theoretic Approach for Joint Learning from Crowds,\" in Proceedings of the 7th International Conference on Learning Representations (ICLR), New Orleans, Louisiana, USA, May 6-9, 2019. B. Zhang*, Y. Kong*, G. Essl, E. M. Provost, \"f-Similarity Preservation Loss for Soft Labels: A Demonstration on Cross-Corpus Speech Emotion Recognition,\" in Proceedings of the 33rd AAAI Conference on Artificial Intelligence (AAAI), 5725-5732, Honolulu, Hawaii, USA, January 27-February 1, 2019. Y. Kong, G. Schoenebeck, \"An Information-Theoretic Framework For Designing Information Elicitation Mechanisms That Reward Truth-telling,\" in Proceedings of the ACM Transactions on Economics and Computation (TEAC), 2:1-2:33, Volume 7 Issue 1, February 2019. 2018 Y. Kong, G. Schoenebeck, âEliciting Expertise without Verificationâ in Proceedings of the 2018 ACM Conference on Economics and Computation (EC), 195-212. Cornell in Ithaca, New York, USA, June 18-22, 2018. Y. Kong, G. Schoenebeck, âWater from Two Rocks: Maximizing the Mutual Informationâ in Proceedings of the 2018 ACM Conference on Economics and Computation (EC), 177-194. Cornell in Ithaca, New York, USA, June 18-22, 2018. Y. Kong, G. Schoenebeck, âEquilibrium Selection in Information Elicitation without Verification via Information Monotonicityâ in Proceedings the 9th Innovations in Theoretical Computer Science (ITCS), 2018. Cambridge, Massachusetts, USA, January 11-14, 2018. Y. Kong, G. Schoenebeck, âOptimizing Bayesian Information Revelation Strategy in Prediction Markets: the Alice Bob Alice Case â in Proceedings the 9th Innovations in Theoretical Computer Science (ITCS), 2018. Cambridge, Massachusetts, USA, January 11-14, 2018. 2016 Y. Kong, K. Ligett, G. Schoenebeck, âPutting Peer Prediction Under the Micro(economic)scope and Making Truth-telling Focalâ in Proceedings of the 2016 International Conference on Web and Internet Economics (WINE), 251-264. Montreal, Canada, December 11-14, 2016. Tutorials and Talks Tutorial \"Eliciting Information without Verificationâ invited talk in IJTCS-FAW 2022 âDominantly Truthful Multi-task Peer Prediction with a Constant Number of Tasksâ invited talk in Incentives in Machine Learning Workshop, ICML, 2020. âEliciting Information by Information Theoryâ invited talk in Women in EconCS, WINE, 2020. âAn Information Theoretic View of Information Elicitation Mechanismsâ joint organize with Grant Schoenebeck, in EC, 2017 Teaching Randomness and Computation, Spring 2019, 2020, 2021, 2022, 2023 Mathematics for the Information Age, Fall 2020, 2021, 2022, 2023 Algorithmic Game Theory, Fall 2019 People Coming soon!",
  "content_length": 7630,
  "method": "requests",
  "crawl_time": "2025-12-01 14:54:03"
}