{
  "name": "Yuriy Brun",
  "homepage": "https://people.cs.umass.edu/~brun",
  "status": "success",
  "content": "Yuriy Brun: Professor, University of Massachusetts Amherst Yuriy Brun Professor Manning College of    Information & Computer Sciences 140 Governors Drive University of Massachusetts Amherst, MA 01003-9264 USA Email: Office: 302 Phone: +1-413-577-0233 Fax: +1-413-545-1249 curriculum vitae News Yuriy joined Cyberonix as a software expert witness consultant. Our paper on how visualization affects comprehension and trust of machine learning accepted to VIS'25!. Our ESEC/FSE'15 paper on overfitting in automated program repair won an Test of Time Honorable Mention Award at FSE 2025! Our ESEC/FSE'15 paper on overfitting in automated program repair won an Test of Time Honorable Mention Award at FSE 2025! Our ICSE'25 paper on using LLMs for formal verification won an ACM SIGSOFT Distinguished Paper Award! Yuriy elevated to IEEE Fellow! Our work on using LLMs to synthesize formal verification proofs published at ICSE 2025. Our work on using reinforcement rearning to automate formal verification published at ICSE 2025. Our work on attack-resistent image watermarking published at NeurIPS 2024. Our work on efficient fine-tuning of LLMs on egde networks published at NeurIPS 2024. Our work on whether automated program repair helps developers debug published at ICSE 2024. Our work on using large language models to synthesize proofs of mathematical theorems published at ESEC/FSE 2023 and wins an ACM SIGSOFT Distinguished Paper Award! IEEE Spectrum article. Our work on understanding how bias affects people's trust published at VIS 2023. Manish started a job as an Assistant Professor at Oregon State University! Emily started a job as a postdoc at University of California San Diego! Manish's and Yuriy's work on using tests and bug reports, together, to improve automated program repair published at ICSE 2023. LASER had a total of 6 papers presented at ICSE 2023, including work on making it easier for software engineers to build systems with fair machine learning and automating formal verification. Our work on understing developers published in TOSEM, presented at ICSE 2023. Yuriy received a $616K NSF grant on automating formal verification! Our work on using identifiers to improve proof synthesis for formal verification published at TOPLAS. Presented at PLDI 2023. Yuriy receives a $40K Dolby gift for studying effects of bias in machine learning. Yuriy gave a keynote address at MaLTeSQuE 2022. Emily's and Yuriy's work on diversity-driven automated formal verification published at ICSE 2022 and wins an ACM SIGSOFT Distinguished Paper Award! Google gifts $50,000 for work on mitigating bias in models of ad preferences. Yuriy and Phil receive a Google Inclusion Research Award. Yuriy and Phil receive a Facebook Building Tools to Enhance Transparency in Fairness and Privacy gift. Yuriy receives an Amazon Research Award with $40K funding and $20K AWS credit to support formal verification. Yuriy promoted to Professor. Alex Sanchez-Stern joins UMass as a postdoctoral researcher! Yuriy received the 2021 IEEE Computer Society TCSE New Directions Award. Yixue Zhao joins UMass as a CI Fellow postdoctoral researcher! Fully-automated formal verification paper accepted to OOPSLA 2020: video. Yuriy delivers the ICSSP/ICSSE 2020 Keynote address: video. Distributed, privacy-enforcing paper wins SEAMS 2020 Most Influential Paper award! video Causal testing paper accepted to ICSE 2020. Yuriy promoted to ACM Distinguished Member. Safety and fairness guarantees in machine learning paper published in Science. Quality of automated program repair paper accepted to IEEE TSE. Visualization for system understanding paper accepted to ACM TOSEM. Serverless computing paper published at OOPSLA 2019 and is awarded an ACM SIGPLAN Distinguished Paper Award. Google gifts $50,000 for work on detecting bias in ads. Fair bandits paper published at NeurIPS 2019. Read Fortune summary. Automated program repair paper accepted to IEEE TSE. Oracle labs gifts $100,000 for work on fairness in rankings. Test generation from natural language specifications paper published at ICSE 2019. Software fairness paper and demo published at ESEC/FSE 2018. Security usability paper published at SOUPS 2018. Double blind viewpoint published in Communications of the ACM. News coverage. Repair of hard and important bugs paper published in Empirical Software Engineering and presented at ICSE 2018. Recovering design decisions paper published in ICSA 2018. Our fairness testing paper was the 5th most downloaded SE article in October'17. Fairness testing in the news: EnterpriseTech, Bloomberg, GCN, Co.Design, ACM News, MIT TR Download, UMass. Automated repair paper published in ASE 2017. Fairness Testing paper published in ESEC/FSE 2017 and is awarded an ACM SIGSOFT Distinguished Paper Award. NSF funds grant on software fairness testing. Yuriy promoted to Associate Professor with tenure. Yuriy promoted to Senior Member of both the ACM and the IEEE. Yuriy receives the UMass College of Information and Computer Science Outstanding Teacher Award. Yuriy receives a Lilly Fellowship for Teaching Excellence. Collaborative Design paper published in ICSA 2017 and is awarded the Best Paper Award!. Constraint-Aware Resource Scheduling paper published in IEEE Transactions on Systems, Man, and Cybernetics: Systems. Behavioral Execution Comparison paper published in ICST 2017. Dr. Seung Yeob Shin successfully defended his dissertation. He started at the University of Luxembourg in Fall'16. NSF funds medium grant on improving quality of automated program repair. Distributed system debugging paper published in Communications of the ACM. Performance-aware modeling tool paper presented at ICSE 2016. Eureka! Winter'16 program with local Girls Inc. chapter a success! Yuriy receives a 2015 Google Faculty Research Award. An independent study finds conflict detection work the most industrially relevant of all research published in the top SE conferences in the last five years. Yuriy recognized as a UMass Distinguished Teaching Award finalist. Two papers on automated API violation discovery presented at ISSRE 2015. NSF funds medium grant on improving developer interfaces. “Using Simulation...” published in JSS. “Repairing Programs...” presented at ASE 2015. “Simplifying Development History...” presented at ASE 2015 short paper track. “Is the Cure Worse...” presented at ESEC/FSE 2015. “The ManyBugs and IntroClass Benchmarks...” featured as the Spotlight Paper in December 2015 by IEEE TSE. “Preventing Data Errors...” presented at ISSTA 2015. Yuriy receives an ICSE 2015 Distinguished Reviewer Award. “Self-Adapting Reliability...” published in IEEE TSE. “Reducing feedback delay...” published in IEEE TSE. Yuriy receives the NSF CAREER award! “Resource Specification...” presented at FASE 2015. “Using declarative specification...” published in IEEE TSE. “Behavioral Resource-Aware...” presented at ASE 2014. “Automatic Mining...” presented at FSE 2014. “The Plastic Surgery Hypothesis” presented at FSE 2014. Yuriy receives the 2014 Microsoft Research Software Engineering Innovation Foundation Award. “Inferring Models of Concurrent...” presented at ICSE 2014. “Mining Precise Performance-Aware...” presented at ICSE NIER 2014. Yuriy receives the 2013 IEEE TCSC Young Achiever in Scalable Computing Award. “Early Detection...” featured as the Spotlight Paper in October 2013 by IEEE TSE. “Making Offline Analyses Continuous” presented at ESEC/FSE 2013. “Data Debugging... ” presented at ESEC/FSE NI 2013. Future of Software Engineering 2013 took place in July 2013. “Unifying FSM-Inference...” presented at ICSE 2013. “Entrusting Private Compu...” published in IEEE TDSC. “Understanding Regression...” presented at ICSE NIER 2013. “Speculative Analysis...” presented at OOPSLA 2012. “Proactive Detection of...” published in ESEC/FSE 2011 and is awarded an ACM SIGSOFT Distinguished Paper Award. Watch the talk. Research Publications Teaching and Students Broader Impacts CV Personal I have previously worked with Prof. Leonard Adleman at the USC Laboratory for Molecular Science and with Prof. Michael D. Ernst at the MIT Computer Science and Artificial Intelligence Laboratory Program Analysis Group. Research interests My research aims to improve how we build software systems, focusing on proving system correctness, mitigating bias, and enabling self-adaption and self-repair. I co-direct the LASER and PLASMA laboratories. Impact My lab's research focuses on high-risk, high-impact problems, with the aim of fundamentally improving how engineers build systems. Sometimes we fail. Sometimes we succeed and make a difference in industry, academia, or both. Privacy-preserving distributed computing. On the cloud, our private data live on computers we don't own, under security policies we don't control. To tackle that problem, we developed bio-inspired, self-organizing distributed systems that preserve privacy, even on untrusted machines. This work has won a test of time award and I received an IEEE TCSC Young Achiever in Scalable Computing Award for my contributions to privacy, reliability, and self-adaptation in distributed computing. Fairness and safety in machine learning. Studies have shown that modern software systems can harm humans and exhibit sexist and racist behavior. To build safer and fairer systems, the entire system-building process needs to account for potential harms. We pioneered the foundation of bias as a software engineering concern, founding the field of software fairness, authoring the seminal paper on fairness testing and developing the first machine learning techniques that probabilistically guarantee fairness and safety even when trained on biased data. For this work, I was awarded the IEEE Computer Society TCSE New Directions Award. Automatically repairing programs. Software developers spend more than half their time debugging. Automated repair technology has the potential to save time and significantly reduce costs. Unfortunately, my lab ",
  "content_length": 41187,
  "method": "requests",
  "crawl_time": "2025-12-01 14:54:07"
}