{
  "name": "Yuri Kalnishkan",
  "homepage": "https://pure.royalholloway.ac.uk/portal/en/persons/yuri-kalnishkan_caa6d523-960f-4092-b49a-b5757cba4a9d.html",
  "status": "success",
  "content": "Yuri Kalnishkan - Royal Holloway Research Portal View Scopus Profile Yuri Kalnishkan Dr Centre for Machine LearningReader in Computer Science, Department of Computer ScienceCentre for Intelligent SystemsCentre for Reliable Machine Learning https://orcid.org/0000-0003-1134-8937 Phone+44 1784 414256EmailYuri.Kalnishkanrhul.acuk TW20 0EX Personal profile Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): External positionsVisiting researcher, Moscow Institute of Physics and Technology1 May 2017 → … KeywordsComputer Learningprediction with expert adviceregression methods Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output 25 Conference contribution 14 Article 5 Chapter (peer-reviewed) 2 Working paper 1 More 1 Chapter Research output per year Research output per year Practical investment with the long-short gameAl-Baghdadi, N., Kalnishkan, Y., Lindsay, D. & Lindsay, S., 4 Apr 2023, In: Annals of Mathematics and Artificial Intelligence.Research output: Contribution to journal › Article › peer-review Open AccessFile 60 Downloads (Pure) Equilibrium Resolution for Epoch PartitioningWisniewski, W., Kalnishkan, Y., Lindsay, D. & Lindsay, S., 10 Jun 2022, (E-pub ahead of print) Proceedings of the 18th International Conference on Artificial Intelligence Applications and Innovations. Springer, (SPRINGER IFIP AICT).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution File 28 Downloads (Pure) Online Portfolio Hedging with the Weak Aggregating AlgorithmAl-Baghdadi, N., Kalnishkan, Y., Lindsay, D. & Lindsay, S., Aug 2022, Conformal and Probabilistic Prediction and Applications: COPA 2022. Vol. 179. p. 149-168 20 p. (Proceedings of Machine Learning Research).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open Access Prediction with Expert Advice for a Finite Number of Experts: A Practical IntroductionKalnishkan, Y., Jun 2022, In: Pattern Recognition. 126, 108557.Research output: Contribution to journal › Article › peer-review Open AccessFile 129 Downloads (Pure) A Lower Bound for a Prediction Algorithm under the Kullback-Leibler GameDzhamtyrova, R. & Kalnishkan, Y., Sept 2021, Conformal and Probabilistic Prediction and Applications 2021. Carlsson, L., Luo, Z., Cherubin, G. & An Nguyen, K. (eds.). Proceedings of Machine Learning Research, Vol. 152. p. 39-51 13 p.Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open Access 4 Downloads (Pure) View all 47 research outputs Projects 2 Finished Projects per year On-line Self-Tuning Learning Algorithms for Handling Historical InformationKalnishkan, Y. (PI)Leverhulme Trust1/07/13 → 30/06/16Project: Research PCP: Practical Competitive PredictionVovk, V. (PI), Gammerman, A. (CoI), Kalnishkan, Y. (CoI), Chernov, A. (CoI) & Zhdanov, F. (CoI)Eng & Phys Sci Res Council EPSRC10/10/07 → 22/11/10Project: Research",
  "content_length": 3432,
  "method": "requests",
  "crawl_time": "2025-12-01 14:54:07"
}