{
  "name": "Yuseok Jeon",
  "homepage": "https://s2-lab.github.io",
  "status": "success",
  "content": "S2Lab - home Secure Software Lab (S2 Lab) Our lab is dedicated to addressing various software and systems security problems. In particular, our research focus is designing and implementing advanced bug sanitization and mitigation techniques to protect operating systems and user applications in existing (e.g., mobile or web) and emerging areas (e.g., autonomous driving, drones, or ship) by leveraging compiler-based, fuzzing, and AI techniques. We are always looking for motivated undergraduate/graduate students and postdocs who are excited about software and system security. If you are interested in working with us, please drop an email to Yuseok Jeon (ys_jeon@korea.ac.kr). News [May 2025] AHA-fuzz is accepted to ACM CCS 2025. [Apr 2025] Prof. Yuseok Jeon is serving as a PC at NDSS 2026. [Mar 2025] Type++ is awarded Distinguished Paper Award at NDSS 2025. [Mar 2025] S2 Lab moved to the CSE at Korea University. [Jan 2025] PathFinder is accepted to IEEE/ACM ICSE 2025. [Sep 2024] CMASan is accepted to IEEE S&P 2025. [Sep 2024] Two graduate students joined our group. Welcome Jaeeun Eom and Zeewung Shin ! [Aug 2024] Type++ is accepted to NDSS 2025. [Jul 2024] Prof. Yuseok Jeon is serving as a PC at USENIX Security 2025. [May 2024] Prof. Yuseok Jeon is serving as a PC at IEEE S&P 2025. [Mar 2024] ERASan is accepted to IEEE S&P 2024. [Feb 2024] Two graduate students joined our group. Welcome Wonil Jang and Youngjin Lee! [Jan 2024] Prof. Yuseok Jeon is serving as a PC at ACM CCS 2024. [Aug 2023] One graduate student joined our group. Welcome Seongyun! [Apr 2023] Prof. Yuseok Jeon is serving as a PC at USENIX SECURITY 2024 and NDSS 2024 [Mar 2023] Four graduate students joined our group. Welcome Jiun, Dongyeon, Minseong, and Taeyeong! [Aug 2022] Two graduate students joined our group. Welcome Sunghyun and Sanghoon! [Dec 2022] Perfect Spray is accepted to BlackHat EU 2023. [Jul 2022] Pspray is accepted to USENIX Secrutiy 2023. [Jul 2022] DriveFuzz is accepted to ACM CCS 2022. [Apr 2022] Prof. Yuseok Jeon is serving as a PC at USENIX SECURITY 2023 and NDSS 2023. [Feb 2022] ShadowAuth is accepted to ASIACCS 2022. [Nov 2021] SwarmFlawFinder is accepted to IEEE S&P 2022. [Apr 2021] Prof. Yuseok Jeon is serving as a PC at USENIX SECURITY 2022. [Feb 2021] Our lab has been founded. TOP",
  "content_length": 2307,
  "method": "requests",
  "crawl_time": "2025-12-01 14:54:07"
}