{
  "name": "Yusuke Miyao",
  "homepage": "https://mynlp.github.io/en",
  "status": "success",
  "content": "Home Natural Language Processing and Computational Linguistics The goal of our research group is to make computers understand natural languages. People communicate with each other using natural languages, while they choose words almost unconsciously. To make computers do the same, however, we have to know clearly how natural languages work. That is to say, our research is to unfold the mechanism of natural language, that will eventually lead to the understanding of how people understand the world. We explore step by step how people use words and go on living as people learn the movements of the universe and works of life. We perform research on fundamental technologies and mathematical models of natural language, including syntactic parsing, semantic analysis, natural language generation, semantic understanding in dialog systems, and grounding language into non-linguistic information. Our group is specifically focused on exploring deep understanding of mechanisms of natural language, with the help of linguistics such as syntactic theories and formal semantics, and also with the outcomes of computer science such as formal grammar and machine learning. We also engaged in research projects to develop natural language applications, including dialogue systems, question answering systems, text data analysis over focused domains such as financial and academic documents. Please refer to our Research page for details. At Department of Computer Science, University of Tokyo, we welcome Master/Ph.D. students to work together in our research group. Refer to the page for prospective students for details. Our group has a flat structure allowing researchers/students to go beyond the scope of a specific research theme, and we encourage them to work on multiple projects based on their own free ideas while working collaboratively with other internationally successful researchers. We provide an excellent environment for students to concentrate on their studies, offering various supporting systems including scholarships, research assistant (RA) and technical staff positions, etc. We also have a variety of frameworks for academia-industry cooperation that allow joint research projects in collaboration with private companies. Contact us if you are interested in developing a computer that can fully understand natural language, or pursuing the computational science of natural language. Contact Information Faculty of Science Building 7, 7-3-1 Hongo, Bunkyo-ku, Tokyo 113-0033 JAPAN Department of Information Science, Faculty of Science, University of Tokyo Department of Computer Science, Graduate School of Information Science and Technology, University of Tokyo Map News 2023 Dec 26 This year, our labs papers are accepted in ICLR2023,ACL2023(Findings),EACL2023,CoNLL2023, etc Dec 21 Talk by Sampo Pyysalo (University of Turku) Title: FinGPT: Large Generative Models for a Small Language Dec 7 Talk by Eduardo Sánchez (University College London) Title: The case for LLM-based Machine Translation. Apr 17 Talk by Tim Baldwin (The University of Melbourne) Title: Fair Cop: Measuring and Improving Fairness in NLP 2022 Sep 22 Talk by Li Irene (Zihui), the University of Tokyo Title: Graph-based methods for NLP tasks Sep 15 Talk by Yuchen Jiang (ETH Zurich) Title: An Automatic Evaluation Metric for Document-level Machine Translation Mar 23 Ryo Ueda and Taiga Ishii received the Excellence Award from NLP2022 創発言語でもHarrisの分節原理は成り立つのか？, 上田亮, 石井太河, 宮尾祐介 (東大). 言語処理学会第28回年次大会 (NLP2022) Mar 23 Taiga Ishii and Ryo Ueda received the Special Committee Award from NLP2022 LSTMの無変化性バイアスの実験的分析, 石井太河, 上田亮, 宮尾祐介 (東大). 言語処理学会第28回年次大会 (NLP2022) Mar 23 Takuto Asakura received the Special Committee Award from NLP2022 MioGattoによる数式グラウンディングデータセットの構築, 朝倉卓人, 宮尾祐介 (東大), 相澤彰子 (NII). 言語処理学会第28回年次大会 (NLP2022) Jan 17 Talk by Hiroya Takamura (AI Research Center, AIST) Title: Recent Advances in Natural Language Generation 2021 Nov 4 Online Welcome Party for New Comers New Comers: Rachel Sidney Devianti (M1), Hiromu Matsushima (M1), Hiromasa Sakurai (B4), Taichi Yamamoto (B4), Katô Taisei (B4), and Romain Harang (Research Student) Jun 3 Online Welcome Party for New Comers New Comers: Stephen Fitz (D1), Pratik Sutar (M1), and Yifan Cao (M1) May 27 Talk by Kento Watanabe (National Institute of Advanced Industrial Science and Technology, AIST) Title: Lyrics Information Processing: Analysis, Generation, and Applications Mar 4 Talk by Hitomi Yanaka (RIKEN AIP, Natural language understanding team) Title: Exploring the Generalization Ability of Neural Models through Monotonicity Read More",
  "content_length": 4592,
  "method": "requests",
  "crawl_time": "2025-12-01 14:54:12"
}