{
  "name": "Yusuke Komiyama",
  "homepage": "https://www.nii.ac.jp/en/faculty/digital_content/komiyama_yusuke",
  "status": "success",
  "content": "KOMIYAMA Yusuke - Digital Content and Media Sciences Research Division - Faculty - Research - å½ç«æ å ±å­¦ç ç©¶æ / National Institute of Informatics ACCESS CONTACT æ¥æ¬èª About NII Introduction Greeting from the Director-General Mission & Strategies Overview of NII History Administrative Council Organization Charts Intellectual Properties Staff / Budget Outline and Catalogue of National Institute of Informatics PR Video International Exchange International Exchange based on MOU Conclusion of International Exchange Agreements or MOUs NII International advanced lectures series on ICT NII Shonan Meeting Global Liaison Office (GLO) - DAAD Alumni NII Library NII Library Usage Guide(For General Public) NII Library Accessing databases via GakuNin International Seminar House for Advanced Studies Advanced ICT Center Publications NII Today PR Video Recruitment Access National Institute of Informatics (National Center of Sciences) Kashiwa Annex International Seminar House Contact News Event Link Sitemap Research Research Divisions Research Centers Research and Development Center for Academic Networks Research Center for Knowledge Media and Content Science Research Center for Community Knowledge Center for Cloud Research and Development Center for Dataset Sharing and Collaborative Research Center for Strategic Cyber Resilience Research and Development Research Center for Open Science and Data Platform Center for Research Data Ecosystem Development Center for Trust & Digital Identity Research and Development Global Research Center for Quantum Information Science Global Research Center for Big Data Mathematics Research Center for Mathematical Trust in Software and Systems Research Center for Medical Bigdata Global Research Center for Synthetic Media Research and Development Center for Large Language Models Center for Advanced Mobile Driven Research Faculty Director-General Executives(related to research) Principles of Informatics Research Division Information Systems Architecture Science Research Division Digital Content and Media Sciences Research Division Information and Society Research Division Directory of Faculty and Staff index Professor Emeritus Major Project Involvement Kakenhi Human Resource Development Top SE Experts in Information Science Quantum Technology Education:A New Approach Collaborative Research Promotion Collaboration with Industry, Government, and Academia Research Results Progress in Informatics NII Technical Reports Service Network SINET6 Research Data Cloud GakuNin RDM JAIRO Cloud CiNii Research CiNii Books IRDB Authentication Infrastructure GakuNin eduroam JP UPKI Notice of Authentication Service Maintenance Cloud GakuNin Cloud GakuNin Cloud Adoption Support Service GakuNin Cloud Gateway Service GakuNin Cloud On-Demand Configuration Service SINETStream Information Security NII Security Operation Collaboration Services (NII-SOCS) Princess Rinrin's information security column Scholarly Communication NACSIS-CAT/ILL E-resources Data Sharing Services KAKEN NII-REO Collaboration Collaboration with University Libraries Japan Alliance of University Library Consortia for E-Resources Future Scholarly Information Systems Committee Japan Consortium for Open Access Repository SPARC Japan Research Data Ecosystem Development Project to Promote the Use of AI HPCI mdx Academic Information Infrastructure Open Forum Human Resource Development GakuNin LMS Education and Training Services NII JMOOC | gacco Experts in Information Science Computer Science Park Graduate Program Research Research Faculty Digital Content and Media Sciences Research Division KOMIYAMA Yusuke Digital Content and Media Sciences Research Division KOMIYAMA Yusuke Digital Content and Media Sciences Research Division, Associate Professor Research Fields: Open science; Research data management; Research data infrastructure; Semantic Web; Bioinformatics Degrees: Ph.D. (Agriculture) Detail: https://researchmap.jp/yusuke_komiyama/?lang=en Introduction â  Aiming for \"Open Science\" in its true sense During his time as a Ph.D. student and in his previous role, Komiyama conducted research in data science applied to life sciences (bioinformatics). His work involved gathering papers and research data from international databases to train AI models. However, at that time, the amount of cited research data needed to be expanded to enhance AI accuracy for his purposes significantly. Meanwhile, scientists worldwide were beginning to discuss \"open science\": sharing research data at an early stage to accelerate the research and development cycle. Komiyama recognized that Japan would need an ecosystem for nationwide research data management and sharing to bring this vision to fruition. After joining NII in 2016, Komiyama began to consider whether it would be possible to create a research data management system tailored for Japan based on the Open Science Framework (OSF), an open-source research data management tool developed by the Center for Open Science (COS) in the U.S. As he explored this idea, NII initiated the development of a research data infrastructure to advance open science and uphold research integrity. This evolved into the current NII Research Data Cloud (NII RDC), comprising three platforms dedicated to data management, publication, and discovery. Starting in 2017, Komiyama became involved in the launch of GakuNin RDM, a research data management platform, and has been leading its system development since its inception. â  GakuNin RDM: An ever-evolving data management platform GakuNin RDM is a research data management service that enables researchers to manage and share research data and related materials. In 2022, NII RDC entered its second development phase, and Komiyama's research group began creating new features to enhance convenience and strengthen data governance. Among the seven new features being developed for NII RDC, data governance and data provenance are being developed in collaboration with the GakuNin RDM team. Komiyama's primary research and development work involves organizing and generalizing requests from research institutions and researchers and then integrating new features into GakuNin RDM. He finds this work highly rewarding, as the features he develops enhance GakuNin RDM, making it more user-friendly for researchers. Additionally, he is collaborating internationally with COS to contribute the functions created for GakuNin RDM in Japan back to the open-source tool, OSF. One of the features Komiyama has developed is a research data trail management system. This system attaches a timestamp issued by a time-stamping authority (TSA) to all files on GakuNin RDM, allowing verification of the existence of research data at specific points in time. Additionally, it alerts the project manager if file contents are modified outside of GakuNin RDM, helping to uphold research integrity. As far as we know, similar functions have yet to be implemented in research data management systems in Europe or the United States, making this the first system of its kind worldwide. â  Spreading awareness of the concept of research data management to all researchers Komiyama is currently working on integrating his data management platform with the publication platform, one of the other components of NII RDC. Previously, the three platforms were developed independently, leading to interoperability issues. In the future, core functions within GakuNin RDM will enable researchers to register papers and research data directly in linked library systems. Once the three platforms are fully integrated, papers will be published based on high-quality research data, making it easier for researchers to build upon previous findings. This integration will not only promote data sharing among researchers at top universities but also enable smaller universities, private companies, and the general public to access high-quality research data and publications. As a result, a broader range of research can be conducted, regardless of the research budget available. Although awareness of research data management has undoubtedly grown, Komiyama recognizes that there is still a long way to go before it becomes an established system within research institutions and is fully embraced by researchers in general. Many challenges remain, such as integrating with international research data platforms, managing large-scale datasets, and ensuring compatibility with research tools. By continuously gathering feedback from users--including IT centers, academic libraries, and researchers-- Komiyama aims to make the current system more user-friendly and secure while also developing a research data platform that meets international standards and providing it as a service. PDF Download The above has been translated from Japanese, updated August 2024 View research contents with researchmap ãã¤ã¼ã Research Divisions Research Centers Research and Development Center for Academic Networks Research Center for Knowledge Media and Content Science Research Center for Community Knowledge Center for Cloud Research and Development Center for Dataset Sharing and Collaborative Research Center for Strategic Cyber Resilience Research and Development Research Center for Open Science and Data Platform Center for Research Data Ecosystem Development Center for Trust & Digital Identity Research and Development Global Research Center for Quantum Information Science Global Research Center for Big Data Mathematics Research Center for Mathematical Trust in Software and Systems Research Center for Medical Bigdata Global Research Center for Synthetic Media Research and Development Center for Large Language Models Center for Advanced Mobile Driven Research Faculty Director-General Executives(related to research) Principles of Informatics Research Division FUJII Kaito HIRAHARA Shuichi KAWARABAYASHI Ken-ichi KOBAYASHI Taisuke KUROIWA Ryo MATSUMOTO Keiji SATO Ryoma SHIGAKI Shunsuke SOEDA Akihito SUGIYAMA Mahito",
  "content_length": 11970,
  "method": "requests",
  "crawl_time": "2025-12-01 14:54:09"
}