{
  "name": "Yusu Wang 0001",
  "homepage": "http://yusu.belkin-wang.org",
  "status": "success",
  "content": "Yusu Wang Yusu Wang Contact News Software CV Teaching Research Home I am a Professor in Halιcιoğlu Data Science Institute at University of California, San Diego, as well as an affiliated faculty in the Computer Science and Engineering Department at UCSD. I am also the Director for NSF National AI Institute TILOS, The Institute for Learning Enabled Optimization at Scale, which is a joint effort of an amazing team of researchers from UCSD (lead), MIT, National University, UPenn, UT Austin and Yale. My office is located at HDSI 446. I obtained my M.S and Ph.D degrees from Duke Univ. (where I received the Best PhD Dissertation Award at CS Dept), and B.S. degree from Tsinghua Univ (graduated with First Class Honors). From 2004-2005, I was a post-doctoral researcher at Geometric Computing lab in Stanford Univ. Prior to joining UCSD, I was a Professor in the Computer Science and Engineering Department at the Ohio State University. I co-directed the Foundations of Data Science Research Community of Practice (CoP) at Translational Data Analytics Institute (TDAI@OSU) from 2018-2020. I received DOE (Dept. of Energy) Career award in 2006, and NSF (National Science Foundation) Career award in 2008. I am on the editorial board for SICOMP, JoCG, and CGTA. I am currently on the External Advisory Board of NSF-Simons CosmicAI Institute, as well as the Advisory Committee for AATRN (Applied and Algebraic Topology Research Network). I also serve on SIGACT CATCS Committee, and AWM (Association for Women in Mathematics) Meetings Committee. My book (co-authored with Tamal K. Dey) on Computational Topology for Data Analysis was publised by Cambridge University Press in 2022. I work in geometric and topological deep learning, representation learning, graph learning, and neural algorithmic reasoning. I am particularly interested in integrating algorithmic, geometric, and topological methods with machine learning frameworks, to help tame the complexity in modern data analysis, such as in performing efficient learning and optimization on complex types of data, and in developing effective neural algorithmic modules to tackle hard problems (e.g, combinatorial optimization problems). Recently, I become deeply interested in advancing neural algorithmic design, which aims to integrate AI/ML and the power of data to design better neural algorithmic modules. I believe that the advancement in AI/ML could bring a paradigm shift in how we view and design algorithms. I am also interested in applying methods developed for various practical domains, including chip design, material science, neuroscience, and computational biology. Book Announcement. Together with my collaborator Tamal K. Dey, our book Computational Topology for Data Analysis was published by Cambridge University Press in 2022. You can download a e-copy here. A dedicated website is here . Family: Here is a link to my husband Misha Belkin, and our two wonderful children (picture taken in the good old days when they were still shorter than me!).",
  "content_length": 3021,
  "method": "requests",
  "crawl_time": "2025-12-01 14:54:09"
}