{
  "name": "Yutaka Akiyama",
  "homepage": "http://www.bi.cs.titech.ac.jp/web/top_en.html",
  "status": "success",
  "content": "Akiyama Laboratory, Institute of Science Tokyo In our laboratory, we analyze big data of medical science, pharmacy and biology and research on technologies of a large-scale simulation with a supercomputer and cloud computing.We aim at solving the cause of a disease, supporting drug development and application for analysis of microorganisms in the environment. News 2025.4.1 Two bachelor students joined our lab! 2024.10.31 Kaho Akaki got Like! Poster Award in CBI Annual Meeting 2024. 2024.4.1 One master, two bachelor students joined our lab! 2023.4.1 Two master, three bachelor students joined our lab! 2023.3.20 Investigating the Effects on Amide-to-Ester Substitutions on Membrane Permeability of Cyclic Peptides 2022.10.27 Masatake Sugita got the Oral Presentation Awards in CBI Annual Meeting 2022. 2022.9.26 Illustration of our paper, \"Lipid Composition Is Critical for Accurate Membrane Permeability Prediction of Cyclic Peptides by Molecular Dynamics Simulations\" has been accepted by Journal of Chemical Information and Modeling as Supplemental Cover! 2022.4.1One master, two bachelor students joined our lab! 2021.12.6Kazuki Takabatake got the Best Presentation award in ICBBS 2021. 2021.7.26 Illustration of our paper, \"Large-scale membrane permeability prediction of cyclic peptides crossing a lipid bilayer based on enhanced sampling molecular dynamics simulations\" has been accepted by Journal of Chemical Information and Modeling as Supplemental Cover! 2021.7.13TSUBAME supercomputer predicts cell-membrane permeability of cyclic peptides 2021.4.1One Specially Appointed Assistant Professor, One Researcher joined our lab! 2020.4.1One Assistant Professor, Keisuke Yanagisawa joined our lab! Two researchers joined our lab! 2020.1.6One researcher joined our lab! 2019.12.1One researcher joined our lab! 2019.9.25One bachelor student joined our lab! 2019.4.5Two bachelor students joined our lab! 2019.4.2One master student joined our lab! 2018.1.23The Kickoff Symposium - Tokyo Tech and Kawasaki City are combining forces to conduct R&D, construct an infrastructure and implement a business promotion program for the \"Program to Industrialize an Innovative Middle Molecule Drug Discovery Flow through Fusion of Computational Drug Design and Chemical Synthesis Technology\" will be held at Institute of Industrial Promotion Kawasaki on 22 March, 2018. Link: http://www.midl.titech.ac.jp/symposium2018/ 2017.7.31Tokyo Tech and Kawasaki City are combining forces to conduct R&D, construct an infrastructure and implement a business promotion program for the \"Program to Industrialize an Innovative Middle Molecule Drug Discovery Flow through Fusion of Computational Drug Design and Chemical Synthesis Technology\". Professor Akiyama and Assistant Professor Ohue are joining the program selected for support by the FY2017 Regional Innovation and Ecosystem Formation Program of the Japanese Ministry of Education, Culture, Sports, Science and Technology (MEXT). 2016.10.27Shogo D. Suzuki got the student award in 3rd CADD contest (IPAB). 2016.10.1Marina Yamasawa and Masahito Ohue got the poster prize in IIBMP2016. 2016.9.28Our joint paper got \"Most Original and Most Significant Scientific Findings\" from Journal of Pharmaceutical Sciences. [old news] External Link Institute of Science Tokyo School of ComputingDepartment of Computer ScienceInstitute of Science Tokyo Middle Molecule IT-based Drug Discovery LaboratoryInstitute of Science Tokyo ACLS Gamma Club (Alumni association of the Education Academy of Computational Life Sciences (ACLS)) Tweets by akiyamalab",
  "content_length": 3577,
  "method": "requests",
  "crawl_time": "2025-12-01 14:54:13"
}