{
  "name": "Yutian Tang",
  "homepage": "https://www.chrisyttang.org",
  "status": "success",
  "content": "Yutian Chris Tang's Homepage Toggle navigation Home Projects Publications Teaching Join us/Supervision Services Grants Awards/Patents/Copyright Misc Yutian Tang Short Bio Dr. Yutian Tang is a world-renowned software engineering researcher and academic with a profound impact on the field of Mobile and LLM. He is an Assistant Professor (UK Lecturer) ([University Profile]) at the School of Computing Science, University of Glasgow, United Kingdom (PI, Ph.D. Supervisor). His research interests include AI+SE (Large-language Model+SE), program analysis, empirical software engineering, privacy protection, and software testing. He is a senior member of IEEE, a member of ACM, CCF, European Alliance for Innovation (EAI), and EuroSys. He is also a member of EPSRC Peer Review College, a technical committee member of the IEEE Technical Committee on Software Engineering. He is also affiliated with Trustworthy Digital Identity Interest Group and Interpretation, Verification and Modelling Interest Group, The Alan Turing Institute. He also contributes to the IEEE Standards Association P1633 Working Group (IEEE Recommended Practice on Software Reliability). Yutian has published over 40 peer-reviewed papers with a total citation of at premier software engineering venues such as ICSE, ESEC/FSE, OOPSLA, CCS, TheWebConf (WWW), ASE, ISSTA, SANER, ISSRE, ICPC conferences, and IEEE Transactions on Software Engineering (TSE), ACM Transactions on Software Engineering and Methodology (TOSEM), IEEE Transactions on Reliability (TReli), JSS, IST journals. One work received the Best Industry Paper Award at ISSRE'18. Three works reported defects in the Android OS, which are confirmed by the Google Security Team. He serves as an Editorial Board Member for the Frontiers in Computer Science journal and Scientific Programming. He also serves as the PC member of over 10 international conferences such as PLDI, ICSE, ESEC/FSE, ASE, TheWebConf, ICPC, SANER, CAiSE, EASE, SEKE, MSR, APSEC, MobileSoft, VaMoS, with 40+ total instances of services. His research is partially supported by National Natural Science of China (NSFC), Science and Technology Commission of Shanghai Municipality, OpenAI, Google. His future research plans are directed towards advancing the techniques to automatically test programs and locate bugs, and providing tool support for their applications. Collaborative distances: Dijkstra number of 4. Erdős number of 4. Current Service: ICSE 2026, FSE 2026, MSR 2026, ICPC 2026, WWW 2026, WWW 2025, MSR 2025, ASE 2025, ASE NIER 2025, ICSE 2025, APSEC 2025 I am looking for PhD students who are self-motivated and have a strong background in software engineering, program analysis, or deep learning. Feel free to [contact me] with your CV, academic transcript and publications (if any) if you are interested. For scholarship, please also reference [this page]. University of Glasgow and the School of Computing Science have a number of PhD scholarships available. As part of your application package, you need to submit a research proposal. Please contact me to discuss the topic before submitting your application. Usual deadline: 31st January every year. See the full advertisement here. If there are any funding or collaboration opportunities available, please don't hesitate to reach out to me for my resume (in pdf format). News (all/25/24/23) [10/2025] Our paper titled \"WhisperCatcher: Demystifying Unauthorized and Encrypted Private Data Transmission in Android Applications\" has been accepted to ICSE'26 [09/2025] Dr. Tang was invited to join the Program Committee of WWW 2026. Please consider submitting your high-quality papers! [08/2025] My proposal to OpenAI Cybersecurity Grant has been accepted! Thank you again OpenAI. [07/2025] Dr. Tang was invited to join the Program Committee of ICPC 2026. Please consider submitting your high-quality papers! [06/2025] Dr. Tang was invited to join the Program Committee of MSR 2026. Please consider submitting your high-quality papers! [06/2025] Dr. Tang was invited to join the Program Committee of FSE 2026. Please consider submitting your high-quality papers! [05/2025] Dr. Tang was invited to join the Program Committee of ASE 2025. Please consider submitting your high-quality papers! [05/2025] Our paper titled \"Feedback analysis in software product line forked developments\" has been accepted to SPLC 2025 [04/2025] Our proposal with Prof. Per (Lund University) has been accepted! Looking forward to visiting colleagues in Lund University soon! [04/2025] Our paper titled \"LLM-CompDroid: Repairing Configuration Compatibility Bugs in Android Apps with Pre-trained Large Language Models\" has been accepted by TOSEM [03/2025] Our paper titled \"A Systematic Study on Real-world Android App Bundles\" has been accepted by IEEE Transactions on Software Engineering! My 10th TSE paper! [03/2025] Our paper titled \"KEENHash: Hashing Programs into Function-aware Embeddings for Large-scale Binary Code Similarity Analysis\" has been accepted by ISSTA'25 [03/2025] Reach 1,000+ citations! [03/2025] Our paper titled \"Characterising Bugs in Jupyter Platform\" has been accepted by EASE'25 [03/2025] Dr. Tang was invited to join the Program Committee of APSEC 2025. Please consider submitting your paper! [02/2025] Our paper titled \"Artemis: Toward Accurate Detection of Server-Side Request Forgeries through LLM-Assisted Inter-Procedural Path-Sensitive Taint Analysis\" has been accepted by OOPSLA'25 [01/2025] Our paper titled \"SmartOracle: Generating Smart Contract Oracle via Fine-Grained Invariant Detection\" has been accepted by IEEE Transactions on Software Engineering [12/2024] Dr. Tang was invited to join the Program Committee of ICSE 2026. Please consider submitting your paper! [12/2024] Dr. Tang was invited to join the Program Committee of SEKE 2025. [11/2024] I was invited to review an EPSRC standard research grant proposal. [10/2024] Our paper titled \"Unearthing Gas-Wasting Code Smells in Smart Contracts with Large Language Models\" has been accepted by IEEE Transactions on Software Engineering [09/2024] My proposal to Google Cloud for Researchers Program has been accepted! Thank you Google [08/2024] Dr. Tang was invited to join the Program Committee of TheWebConf (WWW) 2025. Please consider submitting your paper! [08/2024] Dr. Tang was invited to join the Program Committee of MSR 2025. Please consider submitting your paper! [07/2024] I was invited to review an EPSRC proposal for NIA (New Investigator Award). [07/2024] Elevated to Senior Member of IEEE! [07/2024] Our latest research is reported on IEEE Specturm \"How Good Is ChatGPT at Coding, Really? Study finds that while AI can be great, it also struggles due to training limitations\", find more [here] [04/2024] Our paper titled \"No Need to Lift a Finger Anymore? Assessing the Quality of Code Generation by ChatGPT \" has been accepted by IEEE Trans on Software Engineering! [03/2024] Our paper titled \"ChatGPT vs SBST: A Comparative Assessment of Unit Test Suite Generation\" has been accepted by IEEE Trans on Software Engineering! [03/2024] My proposal to OpenAI API Researcher Access Program has been accepted! Thank you OpenAI. [02/2024] Our paper titled \"Coverage Goal Selector for Combining Multiple Criteria in Search-Based Unit Test Generation\" has been accepted by IEEE Trans on Software Engineering! [11/2023] Dr. Tang was invited to join the Program Committee of ASE 2024. Please consider submitting your paper! [11/2023] Dr. Tang was invited to join the Program Committee of ICSE 2025. Please consider submitting your paper! [09/2023] Dr. Tang was invited to join the Program Committee of SEKE 2024. [09/2023] Our paper titled \"Uncovering bugs in code coverage profilers via control flow constraint solving\" has been accepted by IEEE Trans on Software Engineering [08/2023] Dr. Tang was invited to join the Program Committee of CAiSE 2024 (36th International Conference on Advanced Information Systems Engineering). Please consider submitting your paper! [08/2023] The copyright of \"Big Data-Based Mobile Application Malicious Component Detection System V1.0 (No. 2023SR0897296)\" has been authorized. [07/2023] Dr. Tang was invited to join the Program Committee of SANER 2024 ERA Track. [07/2023] Our paper titled \"Enhancing Malware Detection for Android Apps: Detecting Fine-granularity Malicious Components\" has been accepted by ASE'23. [07/2023] Dr. Tang was invited to join the Program Committee of ICPC 2024. [07/2023] Dr. Tang joined University of Glasgow, Scotland, United Kingdom as a Lecturer (~Assistant Professor in US system). Order a bible for free! If you live or study in Glasgow, want to seek Jesus Christ and have your church life here, please feel free to contact me! 如果您在格拉斯哥居住或学习，想要寻求主耶稣欢迎联系我 csytang.uk<@>gmail.com",
  "content_length": 8790,
  "method": "requests",
  "crawl_time": "2025-12-01 14:54:14"
}