{
  "name": "Yuting Chen 0001",
  "homepage": "https://ddst.sjtu.edu.cn/MemberDetail.aspx?id=5",
  "status": "success",
  "content": "陈雨亭-数据驱动软件技术实验室 DDST数据驱动软件技术实验室Data Driven Software Technology 首页 研究内容 教师学生 论文成果 新闻动态 成员登录 个人简介 论文成果 近期项目 学术活动 教学课程 其他 陈雨亭 Research Professor 研究方向：程序分析与测试、数据驱动软件开发 chenyt@sjtu.edu.cn 个人简介 上海交通大学计算机学院研究员、博士生导师。2000年和2003年在南京大学计算机科学与技术系获得本科和硕士学位，2007年在日本法政大学获得博士学位。2008年起在上海交通大学软件学院和计算机系、计算机学院任教至今。曾在美国德州大学达拉斯分校、加州大学戴维斯分校分别进行访问研究。主要研究兴趣包括程序分析及软件测试、数据驱动软件开发、程序构造与转换、形式化建模与验证等。在领域内重要的国际会议与期刊上（包括PLDI、ICSE、FSE、ASE、TSE等）发表多篇学术论文。主持或参与多项科研项目课题，包括国家自然科学基金面上项目、国家973计划项目课题、国家重点研发课题、863计划课题等。获得2018年度东软－NASAC青年软件创新奖。 欢迎对程序分析与测试、程序语言、数据驱动的软件开发等方向感兴趣的同学加入到DDST实验室。 联系方式 **上海市闵行区东川路800号，上海交通大学，200240 **电信群楼3号楼511办公室 **Email: chenyt at(@)sjtu.edu.cn 论文成果 个人研究主要集中在程序分析、软件测试数据生成、程序语言、智能推荐等几方面（完全的论文列表请参考DBLP）： 1. 测试数据智能生成 [1] Yuting Chen, Ting Su, Zhendong Su: Deep differential testing of JVM implementations. ICSE 2019: 1257-1268 [2] Yuting Chen, Ting Su, Chengnian Sun, Zhendong Su, Jianjun Zhao: Coverage-directed differential testing of JVM implementations. PLDI 2016: 85-99 [3] Ting Su, Ke Wu, Weikai Miao, Geguang Pu, Jifeng He, Yuting Chen, Zhendong Su: A Survey on Data-Flow Testing. ACM Comput. Surv. 50(1): 5:1-5:35 (2017) [4] Ting Su, Guozhu Meng, Yuting Chen, Ke Wu, Weiming Yang, Yao Yao, Geguang Pu, Yang Liu, Zhendong Su: Guided, stochastic model-based GUI testing of Android apps. ESEC/SIGSOFT FSE 2017: 245-256 [5] Yuting Chen, Zhendong Su: Guided differential testing of certificate validation in SSL/TLS implementations. ESEC/SIGSOFT FSE 2015: 793-804 [6] Yu Lin, Xucheng Tang, Yuting Chen, Jianjun Zhao: A Divergence-Oriented Approach to Adaptive Random Testing of Java Programs. ASE 2009: 221-232 [7] Shaoying Liu, Yuting Chen: A relation-based method combining functional and structural testing for test case generation. Journal of Systems and Software 81(2): 234-248 (2008) 2. 人工智能支撑的系统分析及缺陷定位 [1] Weizhao Yuan, Hoang H. Nguyen, Lingxiao Jiang, Yuting Chen, Jianjun Zhao, Haibo Yu: API recommendation for event-driven Android application development. Information & Software Technology 107: 30-47 (2019) [2] Weizhao Yuan, Hoang H. Nguyen, Lingxiao Jiang, Yuting Chen: LibraryGuru: API recommendation for Android developers. ICSE (Companion Volume) 2018: 364-365 [3] Xiao Cheng, Hao Zhong, Yuting Chen, Zhenjiang Hu, Jianjun Zhao: Rule-directed code clone synchronization. ICPC 2016: 1-10 [4] Ziyi Lin, Hao Zhong, Yuting Chen, Jianjun Zhao: LockPeeker: detecting latent locks in Java APIs. ASE 2016: 368-378 [5] Xiao Cheng, Yuting Chen, Zhenjiang Hu, Tao Zan, Mengyu Liu, Hao Zhong, Jianjun Zhao: Supporting Selective Undo for Refactoring. SANER 2016: 13-23 [6] Christoph Bockisch, Marnix van't Riet, Haihan Yin, Mehmet Aksit, Ziyi Lin, Yuting Chen, Jianjun Zhao: Trace-based debugging for advanced-dispatching programming languages. ICOOOLPS@ECOOP 2015: 3:1-3:10 [7] Ziyi Lin, Darko Marinov, Hao Zhong, Yuting Chen, Jianjun Zhao: JaConTeBe: A Benchmark Suite of Real-World Java Concurrency Bugs (T). ASE 2015: 178-189 [8] Qiang Sun, Yuting Chen, Jianjun Zhao: Constraint-based locality analysis for X10 programs. PEPM 2013: 137-146 [9] Qi Wang, Jingyu Zhou, Yuting Chen, Yizhou Zhang, Jianjun Zhao: Extracting URLs from JavaScript via program analysis. ESEC/SIGSOFT FSE 2013: 627-630 [10] Qiang Sun, Jianjun Zhao, Yuting Chen: Probabilistic Points-to Analysis for Java. CC 2011: 62-81 [11] Cheng Zhang, Hao Xu, Sai Zhang, Jianjun Zhao, Yuting Chen: Frequency Estimation of Virtual Call Targets for Object-Oriented Programs. ECOOP 2011: 510-532 [12] Cheng Zhang, Dacong Yan, Jianjun Zhao, Yuting Chen, Shengqian Yang: BPGen: an automated breakpoint generator for debugging. ICSE (2) 2010: 271-274 [13] Omar el Ariss, Dianxiang Xu, W. Eric Wong, Yuting Chen, Yann-Hang Lee: A Systematic Approach for Integrating Fault Trees into System Statecharts. COMPSAC 2008: 120-123 3. 可信的系统及软件的开发 - 建模，代码审阅及测试 [1] Shaoying Liu, Yuting Chen, Fumiko Nagoya, John A. McDermid: Formal Specification-Based Inspection for Verification of Programs. IEEE Trans. Software Eng. 38(5): 1100-1122 (2012) [2] Shaoying Liu, John A. McDermid, Yuting Chen: A Rigorous Method for Inspection of Model-Based Formal Specifications. IEEE Transactions on Reliability 59(4): 667-684 (2010) [3] Yuting Chen, Shaoying Liu, W. Eric Wong: A Review Approach to Detecting Violations of Consistency between Specification and Program Structures. International Journal of Software Engineering and Knowledge Engineering 18(8): 1013-1042 (2008) [4] Yuting Chen, Shaoying Liu, Fumiko Nagoya: A Tool-Supported Review Approach to Detecting Structural Consistency Violations. ICECCS 2006: 121-130 [5] Fumiko Nagoya, Shaoying Liu, Yuting Chen: A Tool and Case Study for Specification-Based Program Review. COMPSAC (1) 2005: 375-380 [6] Shaoying Liu, Fumiko Nagoya, Yuting Chen, Masashi Goya, John A. McDermid: An Automated Approach to Specification-Based Program Inspection. ICFEM 2005: 421-434 [7] Yuting Chen, Shaoying Liu, Fumiko Nagoya: An Approach to Integration Testing Based on Data Flow Specifications. ICTAC 2004: 235-249 [8] Yuting Chen, Shaoying Liu: An Approach to Detecting Domain Errors Using Formal Specification-Based Testing. APSEC 2004: 276-283 4．其它 [1] Yuting Chen,Jingyu Zhou, Jianjun Zhao: Programming Languages fo the Internet. Communications of the CCF, 9(4), April 2013 (in Chinese). [2] 沈备军、陈昊鹏、陈雨亭: 软件工程原理，高等教育出版社，2013年（普通高等教育十一五国家级规划教材） [3] 过敏意、吴晨涛、李超、阮娜、陈雨亭： 云计算原理与实践，机械工业出版社，2017年 近期项目 1. 参与北京大学承担的973计划项目\"基于开源生态的网构化软件开发原理和方法\"，所属课题“基于开源生态的网构化软件全生命周期的可信评估与保证方法” 2. 参与北京百度网讯科技有限公司承担的国家重点研发计划项目“基于编程现场大数据的软件智能开发方法和环境”，所属课题“基于代码风格与编程规范的代码现场检测与智能改进技术” 3. 主持国家自然科学基金面上项目\"针对网络安全证书验证代码的测试及测试证书随机性优化技术研究\" 学术活动 1. 中国计算机学会系统软件专委会委员 2. 中国计算机学会形式化方法专委会委员 3. 中国计算机学会会员 4. SATE2019会议程序委员会主席（https://sate2019.github.io/） 5. NASAC 2019优秀博士生论坛程序委员会主席 教学课程 [1] 程序分析与验证 （2019春） [2] 程序设计思想与方法（C++）（2018秋） [3] 问题求解与探索（2019秋） 其他 DDST 数据驱动软件技术实验室 地址：上海市闵行区东川路800号上海交通大学电信群楼东313Email: ddst@sjtu.edu.cn",
  "content_length": 5862,
  "method": "requests",
  "crawl_time": "2025-12-01 14:54:14"
}