{
  "name": "Yutong Wang 0002",
  "homepage": "https://www.iit.edu/directory/people/yutong-wang",
  "status": "success",
  "content": "Yutong Wang | Illinois Institute of Technology Skip to main site navigation Skip to main content Yutong Wang Assistant Professor of Computer Science Tags: Faculty Computer Science Home Office and Department Directory Directory Yutong Wang EducationPh.D. Electrical & Computer Engineering,  University of Michigan, Ann ArborM.A. Mathematics, University of California, DavisB.S.E. Electrical Engineering, University of Michigan, Ann ArborResearch InterestsArtificial Intelligence and Machine LearningTheoryAwardsUM Postdoctoral Association Conference Award, 2023NeurIPS Scholar Award, 2022Honorable Mention for Outstanding Graduate Student Instructors and Instructional Aides NIH-sponsored travel award for NeurIPS Conference workshop, 2021NeurIPS 2019 Conference workshop: “Learning Meaningful Representations of Life,” 2019The Rollin M. Gerstacker Foundation Fellowship, 2016 PublicationsYutong Wang and Clayton Scott. “Unified Binary and Multiclass Margin-Based Classification”. Journal of Machine Learning Research 25.143 (2024) pp. 1–51.Pengyu Li , Xiao Li , Yutong Wang, and Qing Qu. “Neural Collapse in Multi-label Learning with Pick-all-label Loss”. International Conference on Machine Learning. 2024.Yutong Wang, Rishi Sonthalia, and Wei Hu. “Near-Interpolators: Rapid Norm Growth and the Trade-Off be- tween Interpolation and Generalization”. Artificial Intelligence and Statistics. 2024.Zhiwei Xu, Yutong Wang, Spencer Frei, Gal Vardi, and Wei Hu. “Benign Overfitting and Grokking in ReLU Networks for XOR Cluster Data”. International Conference on Learning Representations. 2024.Yutong Wang and Clayton Scott. “On Classification-Calibration of Gamma-Phi Losses”. Conference on Learning Theory. 2023.Yutong Wang and Clayton Scott. “Consistent Interpolating Ensembles via the Manifold-Hilbert Kernel”. Neural Information Processing Systems. 2022.Jianxin Zhang, Yutong Wang, and Clayton Scott. “Learning from Label Proportions by Learning with Label Noise”. Neural Information Processing Systems. 2022.Yutong Wang and Clayton Scott. “VC dimension of partially quantized neural networks in the overparametrized regime”. International Conference on Learning Representations. 2022.Yutong Wang and Clayton Scott. “An exact solver for the Weston-Watkins SVM subproblem”. In: International Conference on Machine Learning. 2021.Yutong Wang and Clayton Scott. “Weston-Watkins Hinge Loss and Ordered Partitions”. In: Neural Informa- tion Processing Systems. 2020.Tasha Thong, Yutong Wang, Michael Brooks, Christopher Lee, Clayton Scott, Laura Balzano, Max Wicha, and Justin Colacino. “Hybrid stem cell states: insights into the relationship between mammary development and breast cancer using single-cell transcriptomics”. In: Frontiers in Cell and Developmental Biology 8 (2020), p. 288.GrantsNSF CISE Medium, Award # 2312842 Collaborative Research: RI: Medium: Principles for Optimization, Generalization, and Transferability via Deep Neural Collapse, Budget: $1,200,000, Period Covered: 10/01/2023 - 09/30/2026 PI: Zhihui Zhu, Co-PI: Jeremias Sulam, Co-PI: Qing Qu, Senior Personnel: Yutong Wang Contact Information ywang562@illinoistech.edu Website SB 208E Learn more... Illinois Tech welcomes you to join our community of people who discover, create, and solve. Apply today, visit us in Chicago, and contact us for more information. Request Info Visit Apply",
  "content_length": 3360,
  "method": "requests",
  "crawl_time": "2025-12-01 14:54:15"
}