{
  "name": "Yuval Peled",
  "homepage": "https://www.cs.huji.ac.il/~yuvalp02",
  "status": "success",
  "content": "Yuval Peled – Homepage Contact Email: yuval.peled@mail.huji.ac.il Office: Ross 67 Papers (arXiv) Zsolt Bartha, Brett Kolesnik, Gal Kronenberg and Yuval Peled. Sharp Fuss--Catalan thresholds in graph bootstrap percolation. Asaf Nachmias and Yuval Peled. Local limits of determinants processes. Submitted. Denys Bulavka, Eran Nevo and Yuval Peled. The typical algebraic shifting of a surface. Submitted. Michael Chapman and Yuval Peled. Cocycle stability in permutations of random simplicial complexes. Submitted. Asaf Cohen Antonir, Yuval Peled, Asaf Shapira, Mykhaylo Tyomkyn and Maksim Zhukovskii. When does a tree activate the random graph? Submitted. Alan Lew, Eran Nevo, Yuval Peled and Orit Raz. On the $k$-volume rigidity of a simplicial complex in $\\mathbb{R}^d$. Forum of Mathematics, Sigma, to appear. Yuval Peled and Niv Peleg. On the rigidity of random graphs in high-dimensional spaces. Submitted. Gil Cohen, Itay Cohen, Gal Maor and Yuval Peled. Derandomized Squaring: an analytical insight into its true behavior. ITCS, 2025. Omer Israeli and Yuval Peled. Noise sensitivity of the minimum spanning tree of the complete graph. Combinatorics, Probability and Computing, 2024. Alan Lew, Eran Nevo, Yuval Peled and Orit Raz. Rigidity expander graphs. Combinatorica, 2025. Denys Bulavka, Eran Nevo and Yuval Peled. Volume rigidity and algebraic shifting. Journal of Combinatorial Theory, Series B, 2025. Alan Lew, Eran Nevo, Yuval Peled and Orit Raz. On the $d$-dimensional algebraic connectivity of graphs. Israel Journal of Mathematics, 2023. Alan Lew, Eran Nevo, Yuval Peled and Orit Raz. Sharp threshold for rigidity of random graphs. Bulletin of the London Mathematical Society, 2022. Eyal Lubetzky and Yuval Peled. The threshold for stacked triangulations. International Mathematics Research Notices, 2022. Eyal Lubetzky and Yuval Peled. Noise sensitivity of critical random graphs. Israel Journal of Mathematics, 2022. Itai Benjamini, Eyal Lubetzky and Yuval Peled. Minimum weight disk triangulations and fillings. Transactions of the American Mathematical Society, 2021. Guillaume Dubach and Yuval Peled. On words of non-Hermitian random matrices. Annals of Probability, 2021. Maya Dotan, Nati Linial and Yuval Peled. Efficient, local and symmetric Markov chains that generate one-factorizations. Acta Mathematica Hungarica, 2020. Michael Chapman, Nati Linial and Yuval Peled. Expander graphs, both local and global. FOCS, 2019 and Combinatorica, 2020. Zur Luria and Yuval Peled. On simple connectivity of random 2-complexes. Discrete and Computational Geometry, 2022. Nati Linial and Yuval Peled. Enumeration and randomized constructions of hypertrees. Random Structures and Algorithms, 2019. Nati Linial and Yuval Peled. Random simplicial complexes -- Around the phase transition. In A Journey Through Discrete Mathematics, 2017. Tomasz Łuczak and Yuval Peled. Integral homology of random simplicial complexes. Discrete and Computational Geometry, 2018. Dániel Korándi, Yuval Peled and Benny Sudakov. A random triadic process. SIAM Journal of Discrete Mathematics, 2016. Nati Linial and Yuval Peled. On the phase transition in random simplicial complexes. Annals of Mathematics, 2016. Nati Linial, Ilan Newman, Yuval Peled and Yuri Rabinovich. Extremal problems on shadows and hypercuts in simplicial complexes. Israel Journal of Mathematics, 2019. Hao Huang, Nati Linial, Humberto Naves, Yuval Peled and Benny Sudakov. On the densities of cliques and independent sets in graphs. Combinatorica, 2016. Hao Huang, Nati Linial, Humberto Naves, Yuval Peled and Benny Sudakov. On the 3-local profiles of graphs. Journal of Graph Theory, 2014. Courant Institute, New York, Dec. 2018 Einstein Institute, Jerusalem, Apr. 2023",
  "content_length": 3736,
  "method": "requests",
  "crawl_time": "2025-12-01 14:54:17"
}