{
  "name": "Yuval Elovici",
  "homepage": "https://cyber.bgu.ac.il/yuval",
  "status": "success",
  "content": "Yuval Elovici Skip to content Welcome to my home page! I am a Professor at the Software and Information Systems Engineering and Director of Deutsche Telekom Laboratories at Ben-Gurion University of the Negev Research Interests Computer and Network SecurityPrivacy and Anonymity in the Electronic SocietySocial Network SecurityComplex NetworksDetection of Malicious Code Using Machine Learning Techniques Scholar: Yuval Elovici DBLP: Yuval Elovici Academic Administration 4/2014-CurrentDirector of The Cyber-Security Research Center at Ben-Gurion University.12/2005-CurrentDirector of Deutsche-Telekom Laboratories at Ben-Gurion University. 9/2008-CurrentMember of the Curriculum committee, Ben-Gurion University, Department of Information Systems Engineering. 12/2003-7/2006Head of the Software Engineering Program, Ben-Gurion University, Faculty of Engineering Sciences. 6/2003-10/2005Member of the Graduate Studies Committee, Ben-Gurion University, Department of Information Systems Engineering. 8/2001-CurrentMember of the University Committee for Information Security, Ben-Gurion University.  10/2000-10/2005Head of the Computing and Infrastructure Committee, Ben-Gurion University, Department of Information Systems Engineering. Educational Activities﻿ - Courses taught File Organization and Processing3rd yearBen-Gurion UniversityData Security3rd yearBen-Gurion UniversityDistributed DB and Client Server Systems4th yearBen-Gurion UniversityComputer and Network Security3rd yearBen-Gurion UniversitySeminar Project4th yearBen-Gurion UniversityApplied CryptographyGraduateBen-Gurion UniversityInformation in Decision MakingGraduateBen-Gurion UniversityPrivacy in the Electronic SocietyGraduateBen-Gurion University Professional Activities Positions in Academic Administration04/2014-NowTitle: Director of BGU Cyber Security Research Center.Institution: Ben-Gurion University.12/2005-NowDirector of Telekom Innovation Laboratories at Ben-Gurion University; Ben-Gurion UniversityThe institute’s focus is applied research and its activities include, among others: specifying, developing, and evaluating emerging Information and Communication Technologies (ICT). Members of the institute are engaged in applied research based on strategic plans outlined by Deutsche Telekom AG (DTAG). The institute’s research areas currently include: Big Data Analytics, Cyber Security, Android Security. The research is conducted by BGU faculty members (about 10), together with graduate students and scientific programmers (approximately 80). The institute submits one patent per month as well as about 60 scientific publications that are accepted to leading conferences and journals per year.10/2012-NowMember of the Doctoral Committee, Ben-Gurion University, Department of Information Systems Engineering.9/2008-NowMember of the Curriculum Committee, Ben-Gurion University, Department of Information Systems Engineering.12/2003-7/2006Head of the Software Engineering Program, Ben-Gurion University, Faculty of Engineering Sciences.The Software Engineering Program is a part of the Department of Information Systems Engineering and the Department of Computer Sciences. This unique Israeli program includes over 240 students, who study for four years toward a B.Sc. in Software Engineering.6/2003-10/2005Member of the Graduate Studies Committee, Ben-Gurion University, Department of Information Systems Engineering.8/2001-Now   Member of the University Committee for Information Security, Ben-Gurion University.This committee is responsible for defining the university’s strategy with regard to computer and network security, as well as ongoing supervision of the compliance of university authorities with the latest privacy laws.10/2000-10/2005Head of the Computing and Infrastructure Committee, Ben-Gurion University, Department of Information Systems Engineering.When the Department of Information Systems Engineering was established, I was responsible for designing four new computer labs and supervised the purchase of the equipment for the labs. I consulted and assisted the technical team in maintaining the department’s computer and communications infrastructure. Professional Functions outside Universities/Institutions09/2014-NowTitle: iTrust Research DirectorInstitution: Singapore University of Technology and Design (SUTD).01/2013-NowTitle: Member of a national committee that advises the Israeli government in the area of cyber security R&D.Institution: State of Israel.1/2012-12/2014Title: Head of the Scientific and Technological Committee of the Cabarnit Consortium.Institution: Cabarnit Consortium.Cabarnit is a consortium of seven computer and network security hi-tech companies and 10 academic groups from various universities in Israel. The consortium’s annual budget is around $7M and is financed by the Israeli Ministry of Trade and Commerce. I was nominated by the consortium to head a scientific and technological committee that is responsible for monitoring scientific and technological developments and identifying new potential members from the industry and academia.09/2008-9/2010Title: Member of a national committee that advises the Israeli government in the area of protection of critical infrastructures.Institution: State of Israel, Prime Minister’s Office. 11/2004-10/2006Title: Member of a committee that advises the Israeli Parliament on new laws for protecting personal information stored in digital repositories.Institution: State of Israel, Ministry of Justice.The Deputy Chief Prosecutor established a committee mandated to recommend modifications to Israeli privacy laws so these can better meet the new challenges of the Information Age. My role in the committee was to present new IT capabilities and their potential impact on matters of privacy. Yuval Elovici © 2025",
  "content_length": 5798,
  "method": "requests",
  "crawl_time": "2025-12-01 14:54:20"
}