{
  "name": "Yuvraj Agarwal",
  "homepage": "http://www.synergylabs.org/yuvraj",
  "status": "success",
  "content": "Yuvraj Agarwal, SCS::Carnegie Mellon University Yuvraj Agarwal Professor of Computer Science School of Computer Science | Software and Societal Systems (S3D) Human-Computer Interaction Institute (HCII) Electrical and Computer Engineeering (Courtesy) UC San Diego, Computer Science and Engineering (Adjunct) Room 327, TCS Hall, Carnegie Mellon University 4665 Forbes Avenue, Pittsburgh, PA 15213 Office: (412) 268-7328 Email: yuvraj@cs.cmu.edu Note: SynergyLabs is located in TCS 235 (2nd Floor). Come Visit! Faculty Assistant: Erin Murray -- erinmurr@andrew.cmu.edu Erin's Office Phone: (412) 268-8997. Location: TCS Hall 231 Home Home About Me | News | Research | People | Publications | Service | Teaching Welcome I am a faculty member in the School of Computer Science at Carnegie Mellon University. My research interests are at the intersection of Systems and Networking and Embedded Systems, and I am particularly excited about research problems that benefit from using hardware insights to build more scalable and energy efficient systems. I am the Founder and the Director of the Systems Networking and Energy Efficiency - SYNERGY Labs. From 2010-2013 I served as the Executive Director of the NSF Expeditions in Variability. At UCSD I was a member of the Microelectronic Embedded Systems Lab (MESL) and the Systems and Networking Group (SysNet). Working with me AY 2024/2025 Update: I am always looking for good students to join our SYNERGYLAB at CMU. We have several projects in the Internet of Things and the Mobile Computing space, particularly looking at privacy and security challenges. We have a *new* project on Computational Decarbonization, investigating methods to reduce computing and societal scale (think buildings, transporation, grid) carbon footprint. We also have a long-running project on EduSense, where we are building the classroom sensing fabric for the future of smart campuses classrooms! We also have a longer running project to build the software stack for IoT and Smart Buildings, and various 'apps' on top of it. The Publications link at the top of the page provide an overview of the current research directions of our lab. If you are awesome and are motivated to work on really exciting and socially relevant projects at the intersection of hardware and software systems, while maintaining security and privacy contact me by email. PhD Applicants: If you are a PhD applicant there are multiple programs at CMU that you can apply to and work with me. Many of my current students are a part of the Societal Computing PhD Program which I strongly encourage you to look at. I also advise students admitted to the ECE and the CSD PhD programs. If you want to work with me, send me an email *after* you have applied to these PhD programs. You can mention that you would like to work with me in the application and your research statement if you like the style of work my students and I do. An Important Note: Admission decisions at CMU, and many other top PhD programs, are done by a separate admission committee. Individual faculty members have no say into who is admitted to the program and are only involved (if at all) once the admission committee bar is met or even when the students come to visit. As such, emailing me your CV and material and asking me whether you have a chance is not going to help *at all* since most faculty members won't respond since we simply cannot answer that question. :-) Students @ CMU If you are a PhD / MS / Undergrad student already at CMU, please email to set up a time or drop by my office. What's New 7/2025 Promoted to Full Professor of Computer Science at Carnegie Mellon! Huge thanks to all my students, collaborators, funding agencies, family, friends -- I could not done this without your support! I am eternally grateful! 10/2024 Absolutely delighted to announce that our Mites paper won the Ubicomp/IMWUT Distinguished Paper Award! Congratulations Sudershan, Chen, Anurag! 05/2024 Absolutely delighted to announce that our team has won an NSF Expeditions Award ($12 Million over 5 years!) to study Computational Decarbonization of Societal Infrastructure (CoDec). [CMU's Press Release] [CoDec Website] . Thank you NSF! 04/2024 Paper on ClassID, a system to attribute classroom behavioral data in a privacy preserving manner is accepted to Ubicomp'24! Congratulations Prasoon, Tricia! 03/2024 Article in Wall Street Journal about techniques to protect your smart home from hackers. Had a good conversation with Bart! 02/2024 Paper studying the efficacy of different IoT label complexity, particularly one with the US Cyber Trust Mark and QR code is accepted to CHI'24! Congratulations Claire, Dillion, Alexandra, Hamsini! 02/2024 Paper on ThingPoll, a system to scaffold privacy negotiation for IoT device settings is accepted to CHI'24! Congratulations Haozhe! 01/2024 Paper on Kirigami, a framework to study the privacy implication of audio based sensing and an edge speech filter accepted to Ubicomp'24! Congratulations Sudershan, Haozhe! 01/2024 Paper on Matcha, an IDE Plugin and system to help devs cereaet accurate mobile privacy lables is accepted to Ubicomp'24! Congratulations Tianshi! 10/2023 Article in Nature about sensing on campuses and important privacy concerns and discussions. They also discuss our Mites system. 10/2023 Thank you NSF to supporting our work on IoT Security and Privacy and writing a nice article about it! 07/2023 I attended the launch event of the \"US Cyber Trust Mark\" for IoT Devices at the White House today. The live streamed event featured our video envisioing the consumer journey for an IoT label, and my statements on camera on our IoT label research at CMU. See the CyLab Article for details! 05/2023 Congratulations to Tianshi Li on her faculty job search! Tianshi will join Northeastern/CS as an Assistant Professor in Fall 2024! 04/2023 Paper on Students Perceptions of Smart Classrooms is accepted to ACM DIS'23! Congratulations Tricia, David, Prasoon! 02/2023 Paper on our Mites.io Ubiquitous sensing stack for Smart Buildings, which outlines our 4+ year design and deployment journey of 300+ sensors in TCS Hall is accepted to Ubicomp'23! Congratulations Sudershan, Chen, Anurag, Mike and the entire team! 12/2022 Paper on analyzing Web Dependencies from the African vantage point accepted to PAM'23! Congratulations Aqsa! 11/2022 I was covered on Nov 22nd on the National Public Radio (NPR) Radio show called \"Tech Tuesday by Ann Fisher\". Ann interviwed me about our IoT Security and Privacy label research for consumers. [Direct Link, 1min - 19min] 10/2022 I was interviewed by a number of news outlets after the IoT labeling summit! Super exciting to share our work on the project. Interviewed by and some followup Articles: [CMU/CyLab] [WhiteHouse Release] [Cyberscoop] [Inside Cybersecurity] [Axios] [Stacey on IoT] [Fierce Electronics] [Ars Technica] [Politico] [Wall Street Journal] 10/2022 I presented our IoT Labels work at the IoT labeling summit organized by the White House! Incredibly grateful to be invited to the event and to present a briefing on our 4 year-long journey on designing an IoT Security and Privacy label ! 09/2022 Paper on consumers willingness to pay for secure and private IoT devices is accepted to USENIX Security '23! Congrats Pardis! 06/2022 Our lab has been working on BuildingDepot, our Building \"OS\", for close to 8 years! Many people have contributed to it over the years -- THANK YOU! While it was always open source with periodic point releases, the GitHub Repo is now public! 06/2022 Congratulations to Haojian Jin on his faculty job search! Haojian will join UCSD/HDSI as an Assistant Professor in Fall 2022! 06/2022 Congratulations to Pardis Emami-Naeni on her faculty job search! Pardis will join Duke CS as an Assistant Professor in Fall 2022! 04/2022 Honored to serve on the ACM BuildSys 2022 TPC! Submit your best work by July 15th, 2022! 03/2022 Congrats Tianshi and Kayla for winning a Best Paper Honorable Mention Award at CHI'22! 03/2022 Paper on Ephemeral Ownership of IoT Devices (TEO) is conditionally accepted to MobiSys 2022! Congrats Han! 03/2022 Paper on Pekaboo, a new programming framework for private IoT apps is accepted to Oakland S&P 2022! Congrats Haojian! 02/2022 Paper on iOS Privacy Nutrition Labels uptake accepted to CHI 2022! Congrats Yucheng, Deyuan, Tianshi! 02/2022 Paper on Privacy Protective Behaviors in Smart Homes accepted to CHI 2022! Congrats Haojian, Boyuan, Rituparna, Yaxing! 01/2022 Paper on Protecting Smart Homes from Unintended Actions has been accepted to ICCPS 2022! Congrats Aqsa! 1/2022 Brick Consortium Members announcement makes the news! [HVAC Informed] . [Canadian Consulting Engineer] . [Commercial Construction and Renovation] . [ACH&R News] 1/2022 Brick Consortium Announces Inaugural Commercial Members: Johnson Controls, Schneider Electric, Mapped, Clockwork Analytics and Carrier! Really proud of the work the core members of our consortium have done over the past several years on Brick! Older News... Publications Recent Publications: Ubicomp'23 | DIS'23 | PAM'23 | USENIX'23 | MobiSys'22 | Oakland'22 | ICCPS'22 | CHI'22 | CHI'22 | CHI'22 | IEEE S&P'22 | Selected Publications: \"ProtectMyPrivacy: Detecting and Mitigating Privacy Leaks on iOS Devices Using Crowdsourcing\" Yuvraj Agarwal, Malcolm Hall. ACM MobiSys 2013 -- International Conference on Mobile Systems, Applications and Services, Taipei, June 2013. \"BuildingDepot: An Extensible and Distributed Architecture for Building Data Storage, Access and Sharing\" Yuvraj Agarwal, Rajesh Gupta, Daisuke Komaki, Thomas Weng. ACM BuildSys 2012 -- Workshop on Embedded Sensing Systems For Energy-Efficiency In Buildings, Toronto, November 2012. (Nominated for best paper) \"Duty-Cycling Buildings Aggressively: The Next Frontier in HVAC Control\" Yuvraj Agarwal, Bharathan Balaji, Seemanta Dutta, Rajesh Gupta, Thomas Weng. IPSN/SPOTS 2011 -- International Conference on Information Processing in Sensor Networks, ",
  "content_length": 11142,
  "method": "requests",
  "crawl_time": "2025-12-01 14:54:20"
}