{
  "name": "Yuvraj Patel",
  "homepage": "https://homepages.inf.ed.ac.uk/ypatel",
  "status": "success",
  "content": "Yuvraj Patel's academic home page Yuvraj Patel Email: yuvraj.patel@ed.ac.uk Phone: +44 (0) 131 6504425 Informatics Forum 10 Crichton St EDINBURGH EH8 9AB United Kingdom My UoE office is IF 1.18A. I am a Lecturer(Assistant Professor) in Computer Science in the School of Informatics at the University of Edinburgh. I am a member of the ICSA – Institute for Computing Systems Architecture institute. Previously, I was a postdoctoral researcher and Associate Lecturer at the University of Wisconsin–Madison. I earned my Ph.D. working with Prof. Andrea Arpaci-Dusseau and Prof. Remzi Arpaci-Dusseau at the University of Wisconsin–Madison. Prior to graduate school, I worked at NetApp for almost eight years building the WAFL (Write Anywhere File Layout) filesystem. I also spent time (8 months) at SanDisk trying to design the FTL for a TLC drive. I am a Systems researcher and interested in building systems. My work spans several areas: Concurrency, Operating Systems, Security, Storage & File Systems, and Distributed Systems. In my dissertation, I introduced two new problems – scheduler subversion and adversarial synchronization and broke the decades-old basic assumption that synchronization is a cooperative entity. Instead, I show that synchronization needs to be viewed as a competitive entity to ensure strong performance isolation. I am interested in studying real-world isolation-related problems that arise in concurrent systems due to sharing of resources. My vision is to build abstractions and techniques that provide near-ideal isolation in a shared environment. I am looking for Ph.D. students to join my group. If you are interested in working with me, please get in touch with me, and see the Informatics Postgraduate pages for information about our postgraduate program and the application procedure. If you are already a student at the University of Edinburgh (Ph.D./MS/MPhil) looking for research opportunities, please schedule a meeting with me. Publications & Patents Dissertation Yuvraj Patel. Fair and Secure Synchronization for Non-Cooperative Concurrent Systems. Doctoral Dissertation, August 2021. Abstract, PDF, BibTex Peer-reviewed Conference Publications Vinay Banakar, Kan Wu, Yuvraj Patel, Kimberly Keeton, Andrea C. Arpaci-Dusseau, and Remzi H. Arpaci-Dusseau WiscSort: External Sorting for Byte Addressable Storage. (To appear) International Conference on Very Large Data Bases (VLDB), 2023. Yuvraj Patel, Chenhao Ye, Akshat Sinha, Abigail Matthews, Andrea C. Arpaci-Dusseau, Remzi H. Arpaci-Dusseau, Michael M. Swift. Using Trātṛ to tame Adversarial Synchronization. In Proceedings of the USENIX Security Symposium, 2022. PDF Kan Wu, Kaiwei Tu, Yuvraj Patel, Rathijit Sen, Kwanghyun Park, Andrea Arpaci-Dusseau, Remzi Arpaci-Dusseau. NyxCache: Flexible and Efficient Multi-tenant Persistent-Memory Caching. In Proceedings of the 20th USENIX Conference on File and Storage Technologies (FAST), 2022. PDF Anthony Rebello, Yuvraj Patel, Ramnatthan Alagappan, Andrea C. Arpaci-Dusseau, Remzi H. Arpaci-Dusseau. Can Applications Recover from fsync Failures? In Proceedings of the USENIX Annual Technical Conference (ATC), 2020. PDF Yuvraj Patel, Leon Yang, Leo Prasath Arulraj, Andrea C. Arpaci-Dusseau, Remzi H. Arpaci-Dusseau, Michael M. Swift. Avoiding Scheduler Subversion using Scheduler-Cooperative Locks. In Proceedings of the Fifteenth European Conference on Computer Systems (EuroSys), 2020. PDF Ram Kesavan, Rohit Singh, Travis Grusecki, Yuvraj Patel. Algorithms and Data Structures for Efficient Free Space Reclamation in WAFL. In Proceedings of the 15th USENIX Conference on File and Storage Technologies (FAST), 2017. PDF Harendra Kumar, Yuvraj Patel, Ram Kesavan, Sumith Makam. High Performance Metadata Integrity Protection in the WAFL Copy-on-Write File System. In Proceedings of the 15th USENIX Conference on File and Storage Technologies (FAST), 2017. PDF Ramnatthan Alagappan, Aishwarya Ganesan, Yuvraj Patel, Thanumalayan Sankaranarayana Pillai, Andrea C. Arpaci-Dusseau, Remzi H. Arpaci-Dusseau. Correlated Crash Vulnerabilities. In Proceedings of the 12th USENIX Symposium on Operating Systems Design and Implementation (OSDI), 2016. PDF Peer-reviewed Workshop Publications Yuvraj Patel, Mohit Verma, Andrea C. Arpaci-Dusseau, Remzi H. Arpaci-Dusseau. Revisiting Concurrency in High-Performance NoSQL Databases. 10th USENIX Workshop on Hot Topics in Storage and File Systems (HotStorage), 2018. PDF Peer-reviewed Journals/Invited Publications Anthony Rebello, Yuvraj Patel, Ramnatthan Alagappan, Andrea C. Arpaci-Dusseau, Remzi H. Arpaci-Dusseau. Can Applications Recover from fsync Failures? ACM Transactions on Storage (ToS), June 2021. Fast-Tracked. PDF Ram Kesavan, Rohit Singh, Travis Grusecki, Yuvraj Patel. Efficient Free Space Reclamation in WAFL. ACM Transactions on Storage (ToS), September, 2017. Fast-Tracked. PDF Timothy Bisson, Yuvraj Patel, Shankar Pasupathy. Designing a fast file system crawler with incremental differencing. ACM SIGOPS Operating Systems Review, December 2012.  Invited - NetApp Special Edition. PDF WIP Posters Haris Volos, Kimberly Keeton, Yupu Zhang, Milind Chabbi, Se Kwon Lee, Mark Lillibridge, Yuvraj Patel, Wei Zhang. Memory-Oriented Distributed Computing at Rack Scale. Proceedings of the ACM Symposium on Cloud Computing (SOCC), 2018. Haris Volos, Kimberly Keeton, Yupu Zhang, Milind Chabbi, Se Kwon Lee, Mark Lillibridge, Yuvraj Patel, Wei Zhang. Software challenges for persistent fabric-attached memory. In Proceedings of the 13th USENIX Symposium on Operating Systems Design and Implementation (OSDI), 2018. Patents US Patent Number 10,705,951 – \"Shared Fabric Attached Memory Allocator\" US Patent Number 10,621,162 – \"Storage Tier Verification Checks\" US Patent Number 8,078,653 – \"Process for Fast File System crawling to support Incremental File System Differencing\" NOTE: I have decided to refrain myself from highlighting the best paper awards. For me, everyone's work is important (and therefore the best) to ensure that Science makes forward progress. Teaching I will be teaching Security Engineering (with Ross Anderson) in Spring 2023. Please enroll if you are interested in Security and Systems. Other courses that I have taught are: Course Venue Year Introduction to Operating Systems (CS537) University of Wisconsin–Madison Summer 21, Fall 21, Spring 22, Summer 22 Guest Lecture on Bw-Tree (Topics in Database Management Systems, CS 764) University of Wisconsin–Madison 2018 Guest Lecture on NFS (Distributed Systems, CS739) University of Wisconsin–Madison 2018 Introduction to Computer Science, WCATY University of Wisconsin–Madison 2018 Students I am currently looking for students to join my group at the University of Edinburgh. I am working with these awesome set of students on various topics. Name Topic Year Leping Li (undergraduate@UW-Madison) Studying fairness aspects of hardware operations 2022- Xuehang Wang (undergraduate@UW-Madison) Consistency aware Concurrency 2022- Aanandita Dhawan (graduate@UW-Madison) Work Conserving Scheduler Cooperative Locks 2022- Gunuru Manoj Taraka Ramarao (undergraduate@IIT-Gandhinagar) Hierarchical lock usage fairness 2022- Anant Patel (graduate@IIT-Gandhinagar) Hierarchical lock usage fairness 2023- In the past, I have had the great pleasure of working with the following students. Name Topic Year Youlin Charles QU (undergraduate@UW-Madison) Work Conserving Scheduler Cooperative Locks 2022-2022 Xiaohan Shen (undergraduate@UW-Madison) Work Conserving Scheduler Cooperative Locks 2022-2022 Vinay Banakar (graduate@UW-Madison) Concurrency Models for NVM 2021-2022 Akshat Sinha (graduate@UW-Madison) Adversarial Synchronization 2021-2021 Shalini Ramakrishna (undergraduate@UW-Madison) Static Analysis of Linux Kernel Critical Sections 2021-2021 Abigail Matthews (graduate@UW-Madison) Static Analysis of Linux Kernel Critical Sections 2021-2021 Ruijian Huang (undergraduate@UW-Madison) Analyzing Linux Kernel Critical Sections 2020-2021 Chenhao Ye (undergraduate@UW-Madison) Synchronization Attacks on Inode Cache 2020-2020 Software 1. Using Trātṛ to tame Adversarial Synchronization 2. CuttleFS – Emulate different filesystem fsync failures 3. Scheduler Cooperative Locks 4. Protocol-Aware Correlated Crash Explorer",
  "content_length": 8276,
  "method": "requests",
  "crawl_time": "2025-12-01 14:54:20"
}