{
  "name": "Yuxin Ma",
  "homepage": "http://cse.sustech.edu.cn/faculty/~mayx",
  "status": "success",
  "content": "Yuxin Ma's Homepage Search Yuxin Ma Tenure-Track Associate Professor Department of Computer Science and Engineering, Southern University of Science and Technology Biography Yuxin Ma is a tenure-track Associate Professor in the Department of Computer Science and Engineering, Southern University of Science and Technology (SUSTech), China. He received B.Eng. and Ph.D. from Zhejiang University, China, supervised by Prof. Wei Chen. Before joining SUSTech, he worked as a Postdoctoral Research Associate in VADER Lab, CIDSE, Arizona State University. His primary research interests are in the areas of visualization and visual analytics, focusing on explainable AI, high-dimensional data, and spatiotemporal data. His work has been published in various top venues in visualization and human-computer interaction (IEEE TVCG, IEEE VIS, ACM CHI, etc.) and recognized through Honorable Mention Awards at ACM CHI (2022) and CVMJ (2018). He has served as a program committee member and reviewer for major conferences and journals in visualization, HCI, and artificial intelligence. He is a Young Advisory Board member of the Visual Informatics journal. For more information about his work, please see the CV. I am recruiting Ph.D. and Master's students, RAs, and Postdocs. Please refer to this post (written in Chinese) for more details. Interests Visual Analytics Information Visualization Explainable AI Education PhD in Computer Science, 2017 Zhejiang University Recent Posts ææ¶å¯è§åä¸å¯è§åææ¹åå­¦çä¸ç ç©¶äººå åæ¹ç§æå¤§å­¦è®¡ç®æºç§å­¦ä¸å·¥ç¨ç³»é©¬æ±æ¬£èå¸è¯¾é¢ç»é¿æææ¶åå£«çãç¡å£«çãç ç©¶å©çåè®¿é®å­¦çã é©¬æ±æ¬£ Last updated on May 31, 2023 1 min read Contact mayx [at] sustech.edu.cn 1088 Xueyuan Avenue, Nanshan District, Shenzhen, Guangdong Province, China Cite × Copy Download",
  "content_length": 1843,
  "method": "requests",
  "crawl_time": "2025-12-01 14:54:21"
}