{
  "name": "Yuxin Chen 0001",
  "homepage": "https://yuxinchen.org",
  "status": "success",
  "content": "Yuxin Chen @ UChicago Yuxin Chen [yiw'shin] Assistant Professor Department of Computer Science University of Chicago Email: chenyuxin@uchicago.edu Office: JCL 317 Phone: please use email instead I am an assistant professor at the Department of Computer Science at the University of Chicago. Previously, I was a postdoctoral scholar in Computing and Mathematical Sciences at Caltech, hosted by Prof. Yisong Yue. I received my Ph.D. degree in Computer Science from ETH Zurich, under the supervision of Prof. Andreas Krause. My research interest lies broadly in probabilistic reasoning and machine learning. I am currently working on developing interactive machine learning systems that involve active learning and sequential decision making. You can find more information in my Google scholar profile. News & Events July 17 - 21, 2023: AI & Science Summer School 2023. January, 2023: New course on Bayesian Optimization and Adaptive Experimental Design. November 9, 2022: Talk at the SILO Seminar Series at UW-Madison. October 20, 2022: JTFI Workshop on AI for Experiments -- Research Collaborations, Part II. August 8 - 12, 2022: Co-organizing the first UChicago AI + Science Summer School. February 17, 2022: Giving a talk at the UChicago CAM Colloquium. January 3, 2022: Giving a talk at ISAIM'22. October 20, 2022: JTFI Webinar on AI + measurements -- Partnering to Advance AI Research & Development, Part I July 6, 2020: Giving an invited talk at the Optimizing Human Learning workshop. May 18, 2020: Giving a talk at the UChicago Statistics Colloquium. January 29, 2020: Giving a talk at Argonne National Laboratory. November 22, 2019: Giving a talk at IPAM Workshop at UCLA. November 4, 2019: Giving a talk at TTIC Colloquium. October 24, 2019: My introductory profile at UChicagoCS by Rob Mitchum. October 4, 2019: New research project opening; apply here. September 4, 2019: Three papers accepted by NeurIPS'19. May 1, 2019: Starting Fall 2019, I will be joining UChicago CS as an assistant professor. February 14, 2019: Co-organizing the 2nd Caltech AI4Science workshop. August 1, 2018: Co-organizing the Caltech AI4Science inaugural workshop. Check out details here.",
  "content_length": 2175,
  "method": "requests",
  "crawl_time": "2025-12-01 14:54:20"
}