{
  "name": "Yuxiang Wang 0003",
  "homepage": "https://cseweb.ucsd.edu/~yuxiangw",
  "status": "success",
  "content": "Yu-Xiang WANG's Homepage Home People Research Publications Resources Photos Miscellaneous Yu-Xiang Wang's Homepage Yu-Xiang Wang 王宇翔 Associate Professor Halıcıoğlu Data Science Institute and Department of Computer Science and Engineering UC San Diego Office: HDSI 352 E-mail: yuxiangw AT ucsd.edu Yu-Xiang is pronounced approximately as ['ju:'ʃi:ʌŋ], namely, y~eu~ee - sh~ih~ah~ng . Follow @yuxiangw_cs Looking for self-motivated students and postdocs. Welcome Hello! Welcome to my homepage. I am a faculty member of the Halıcıoğlu Data Science Institute at UC San Diego, also affliated with the CSE department. Prior to joining UCSD, I was with the Computer Science Department at UCSB from 2018-2023, where I started the S2ML lab and co-founded the Center for Responsible Machine Learning . Even before that I was a scientist at Amazon AI in Palo Alto from 2017-2018 after obtaining my PhD from the Machine Learning department at CMU. So what do we do in S2ML lab? Broadly speaking, my students and I apply math and computing to (1) design faster, stronger and more efficient ML algorithms with provable guarantees (2) solve societal challenges (e.g., data privacy, abuse prevention) that emerge in the AI era. Our recent focus include watermarking generative AI, making differential privacy practical, bridging offline and online RL, developing a theory of adaptivity in deep learning. On the application front, I am particularly interested in healthcare and financial markets. Selected research projects [Publications, Google Scholar profile] NSF SCALE MoDL: Adaptivity of Deep Neural Networks NSF CAREER: Optimal Algorithms in Differential Privacy NSF RI: Offline and Low-Adaptive Reinforcement Learning NSF III: Neural COVID-19 Forecasting Teaching (This quarter!) DSC291 Safety in GenAI (2025 Fall): [course website] DSC240 Machine Learning (2025 Winter): [course website] DSC291 Differential Privacy (2024 Fall): [course website] CS165B Machine Learning (2023 Fall): [course website] CS165A Artificial Intelligence (2023 Spring): [course website] CS291K Machine Learning (2022 Fall): [course website] CS165A Artificial Intelligence (2022 Spring): [course website] CS291A Differential Privacy (2021 Fall): [course website] CS292F Reinforcement Learning (2021 Spring): [course website] CS165A Artificial Intelligence (2020 Fall): [course website] CS292F Convex Optimization (2020 Spring): [course website] News Sep 2025: The \"Neural Shattering Phenomenon\" paper and the \"Purifying Approximate DP\" paper are accepted to NeurIPS'25 as Spotlights. Congratulations to Tongtong, Yingyu, Erchi and coauthors! May 2025: Five papers accepted to ICML'25. Topics include Data-Adaptive Private Learning, Adaptive Knots Selection for Splines, Learning under Temporal Distribution-Shift, 2:4 Structured Sparsity and LLM safety. Congratulations to S2ML students, alumni and collaborators. Jan 2025 Paper \"Permute-And-Flip: An Optimally Robust and Watermarkable Decoder for LLMs\" accepted to ICLR'2024. Congratulations to Xuandong! Jan 2025 Paper \"Adapting to Online Distribution Shifts in Deep Learning: A Black-Box Approach\" accepted to AISTATS'25. Congratulations to Dheeraj and collaborators! Sept 2024: Six papers accepted to NeurIPS'24. Topics include theory of deep learning, watermarking, privacy in multi-agent RL, and online adaptation to distribution shift. Congratulations to S2ML students, alumni and collaborators. May 2024: Six papers accepted to ICML'24, covering new advances in differential privacy (private selection, neural collapse theory, parameter-efficient DP finetuning), multi-agent RL (low-adaptivity, improved sample complexity), and dynamic pricing with with contextual elasticity. Congratulations to S2ML students, alumni and collaborators. Mar 2024: I transferred to UCSD. From Goleta to La Jolla, S2ML Lab will continue to produce good research and nurture the next-generation leaders in ML.",
  "content_length": 3928,
  "method": "requests",
  "crawl_time": "2025-12-01 14:54:21"
}