{
  "name": "Yuzhong Qu",
  "homepage": "http://ws.nju.edu.cn/~yzqu",
  "status": "success",
  "content": "Websoft: Yuzhong Qu apachejspωiki G’day (anonymous guest) User Preferences Log inRegister a new user! For full search, hit enter... Recent Searches Yuzhong Qu ☰ Info 1 Version : 1 Date Modified : 12-Jul-2022 12:45 Author : 程龚 More Info... Attachments1 Reading time: 1.1 mins, 242 words Edit More... View Page Source Show Reader View Email: yzqu#nju.edu.cn Office: Room 808, Building of Computer Science Technology, Nanjing University Xianlin Campus, 163 Xianlin Avenue, Nanjing 210023, China 中文 He is a Professor at the Department of Computer Science and Technology, Nanjing University. He got the Ph.D. in Computer Software from Nanjing University in 1995, M.S. in Mathematics from Fudan University in 1988, and B.S. in Mathematics from Fudan University in 1985. His research interest includes Semantic Web, Web Science and novel software technology for the Web. His research has been supported by New Century Excellent Talents (NCET) in University Program. Currently, he is the principal investigator of several projects supported by National Science Foundation of China. He is leading the \"Websoft Research Group at Nanjing University\" to pursue a science of the Web. The missions of the research group are to conduct cutting-edge research on Web softwares and to make the vision of Semantic Web become reality. Research Interests# At present, his research is focused on Question answering over knowledge graphs Natural language understanding based on knowledge graphs Deep processing technologies of knowledge graphs Publications# DBLP page Roles# Academic organizations# Member of China Computer Federation Technical Committee on Systems Software Member of China Computer Federation Technical Committee on Software Engineering Deputy director of JiangSu Association of Artificial Intelligence Technical Committee on Knowledge Engineering and Intelligent Service Chairing# General Chair of CSWS 2009 PC Chair of JIST 2012 PC member of# WWW，ISWC，AAAI，IJCAI, et al. This page (revision-1) was last changed on 12-Jul-2022 12:45 by 程龚Top /*hide the default jspwiki logo */ a.logo { border:none; text-indent:-99em;} a.logo b:before { content:\"\"; } /* put the new logo, attached to this page */ a.logo { background: url(); background-size: contain; background-repeat: no-repeat; background-position: center; height: 60px; width: 60px; /* add a fancy button like effect */ /* box-shadow:0 0 .25em white; */ /* border-radius:2em; */ /* background-color: rgba(255,255,255,0.15); */ } 首页 成员 项目 论著 内部 Home Members Publications GitHub 欢迎访问万维网软件研究组 Welcome to Websoft JSPWiki v2.11.2",
  "content_length": 2574,
  "method": "requests",
  "crawl_time": "2025-12-01 14:54:22"
}