{
  "name": "Yves Robert",
  "homepage": "http://graal.ens-lyon.fr/~yrobert",
  "status": "success",
  "content": "Yves Robert home page Yves Robert Professor, Ecole Normale Supérieure de Lyon Teaching: CS Department Research: Roma project and CS lab. LIP Fellow of the IEEE Senior Member, Institut Universitaire de France Visiting scientist, University of Tennessee Knoxville Contact: Laboratoire de l'Informatique du Parallélisme UMR CNRS -- ENS Lyon -- INRIA -- UCB Lyon 5668 Ecole Normale Supérieure de Lyon 46, allée d'Italie 69364 Lyon Cedex 07 , France Office: M7-303 E-mail: Yves.Robert@ens-lyon.fr or Yves.Robert@inria.fr or yrobert@icl.utk.edu (Phone: (+33) 4 26 23 38 76, Fax: (+33) 4 72 72 80 80, please use e-mail to contact me) Workshop Report (with Anne Benoit and Andrew A. Chien) Scheduling Variable Capacity Resources for Sustainability, Paris Center of the University of Chicago, Paris, France, March 2023. SLIDES for CloudNet'23 keynote Scheduling for Variable Resources, Hoboken, NJ, October 2023 SLIDES and HANDS-ON for SC'23 full-day tutorial with George Bosilca, Aurelien Bouteiller and Thomas Hérault Fault-Tolerant Techniques for HPC: Theory and Practice, Denver, CO, November 2023 Last books and monographs Springer Monograph (2015): Fault-Tolerance Techniques for High-Performance Computing , Thomas Herault and Yves Robert editors, Springer Verlag 2015. Last book (2013): A Guide to Algorithm Design: Paradigms, Methods, and Complexity Analysis , Anne Benoit, Yves Robert and Frédéric Vivien, Chapman and Hall/CRC Press 2013. Penultimate book (2009): Introduction to Scheduling , Yves Robert and Frédéric Vivien editors, Chapman and Hall/CRC Press 2009. And the 2008 book: Parallel Algorithms , Henri Casanova, Arnaud Legrand and Yves Robert, Chapman and Hall/CRC Press 2008. Curriculum Vitae Research activities Publications Latest work Curriculum Vitae Short CV, 2023 Extended CV, 2019 Research activities I am mainly interested in algorithm design and scheduling techniques for large-scale distributed platforms. Here are some recent work topics: Algorithms for heterogeneous clusters and grid platforms Multi-criteria scheduling for (pipelined) workflows Linear algebra kernels on multicores Fault-tolerant algorithms, resilience Stochastic scheduling ... Publications Lists updated in December 2023 Books, edited proceedings and special issues Books: P. Quinton and Y. Robert, Systolic Algorithms and Architectures, Prentice Hall, 1991 (translated from the French edition, Masson 1989). Y. Robert, The Impact of Vector and Parallel Architectures on the Gaussian Elimination Algorithm, Manchester University Press and John Wiley 1991. A. Darte, Y. Robert and F.Vivien, Scheduling and Automatic Parallelization, Birkhauser 2000. A. Legrand and Y. Robert, Algorithmique parallèle - Cours et exercices corrigés, Dunod 2003 (in French). H. Casanova, A. Legrand and Y. Robert, Parallel Algorithms, Chapman and Hall/CRC Press 2008. A. Benoit, Y. Robert, and F. Vivien, Guide to algorithm design, methods, and complexity analysis., Chapman & Hall/CRC Press 2013. List of 33 books, edited proceedings and special issues, pdf file Books, edited proceedings and special issues (.pdf) List of 33 books, edited proceedings and special issues, source file (.bib) Books, edited proceedings and special issues (.bib) Journals List of 174 journal publications, pdf file Journals (.pdf) List of 174 journal publications, source file (.bib) Journals (.bib) Conferences List of 258 conference publications, pdf file Conferences (.pdf) List of 258 conference publications, source file (.bib) Conferences (.bib) Latest work I am no longer listing recent research reports here. Please check the HAL-INRIA archival server instead. Hal Inria server",
  "content_length": 3642,
  "method": "requests",
  "crawl_time": "2025-12-01 14:54:24"
}