{
  "name": "Yves Le Traon",
  "homepage": "http://wwwen.uni.lu/recherche/fstc/computer_science_and_communications_research_unit/members/yves_le_traon",
  "status": "success",
  "content": "Yves LE TRAON - SnT - University of Luxembourg I Uni.lu Director of the Interdisciplinary Centre for Security, Reliability and Trust Contact yves.letraon@uni.lu (+352) 46 66 44 5262 Details Profile Profile CV Functions Director of the Interdisciplinary Centre for Security, Reliability and Trust In detail Interdisciplinary Centre for Security, Reliability and Trust Interdisciplinary Centre for Security, Reliability and Trust Software Engineering | Software Testing | Model Driven Engineering | Security | Adaptive systems | Resilience 29JFK29, boulevard JF KennedyL-1855 LUXEMBOURG JFK, E04 411 yves.letraon@uni.lu (+352) 46 66 44 5262 Publications on ORBilu Prof. Dr. Yves Le Traon is the Director of the Interdisciplinary Centre for Security, Reliability and Trust (SnT) at the University of Luxembourg, created in 2009. Le Traon is a notable scientist in the field of software engineering (SE), with research focusing on software testing, software security, and AI-based systems. He has been acknowledged by the international journal JSS, ranking him among the top 20 most impactful and experienced SE researchers worldwide in the past decade. Yves Le Traon is one of the recipients of the Facebook Testing and Verification 2019 – Research Award, and in 2022 became an IEEE Fellow, one of the most prestigious awards in engineering. For the three years prior to being appointed the Director of SnT, Le Traon was the Deputy Director of the centre, while also the head of SnT’s SerVal (Security, Reasoning and VALidation) research group. In this position he led a team of more than 40 researchers, supervising 33 doctoral candidates. He is also the Director of Studies of the Master in Information System Security Management (MSSI) at the University of Luxembourg. He has been General Chair of major conferences in the domain, such as ICSME 2021, IEEE ICST 2013, IEEE ISSRE 2004, and Program Chair of IEEE QRS 2016. He has been a founding member and a steering committee member of ICST, the IEEE flagship conference in software testing from 2008-2012 and 2014-2016. He is editor-in-chief of the STVR international journal and serves at the editorial boards of international journals in his domains of expertise (SoSym, IEEE Transactions on Reliability). Since 2012, excluding workshops, he has served in the programme committees of 65 conferences in software engineering, including the flagship ones in software engineering and software testing (ICSE, FSE, ICST, ISSTA).  He has published in major venues in software engineering (IEEE TSE, ACM TOSEM, ICSE, ISSTA, ICST etc.), in software security (S&P, IEEE TIFS, Usenix Security), and in artificial intelligence (ICML, ECCV, IJCAI-ECAI, AAAI, KDD): 88 Rank A/A* conference papers, 72 Rank A/A* journal papers, and 170 peer-reviewed conference papers, 38 journal papers and 11 book chapters. Le Traon began his career in France, earning his engineering degree and his PhD in Computer Science from the Institut National Polytechnique, Grenoble, France, in 1997. From 1998 to 2004, he was associate professor at the University of Rennes, France. He co-founded the Triskell INRIA team, which focused at that time on innovating design, modelling and testing techniques, such as Model-driven Engineering (MDE). From 2004 to 2006, he was an expert in MDE in the EXA team (Requirements Engineering and Applications) at France Télécom R&D. In 2006, he became full professor at Telecom Bretagne (Ecole Nationale des Télécommunications de Bretagne) where he pioneered software testing techniques to find security flaws. Since coming to Luxembourg to join SnT as a professor in 2009, in addition to his academic work he has also co-founded DataThings, a successful spin-off company of University of Luxembourg providing advanced AI software to perform scalable decision-making at runtime. He has also successfully contributed to the evolution of the centre at several levels. He has been instrumental in developing software engineering at SnT, recruiting high-profile scientists and ensuring SnT is among the top institutions worldwide in this domain. Stay connected and subscribe to our newsletter All fields are mandatory Choose among our mailing list(s) Mailing list 0 items selected University of Luxembourg – News and events SnT – News and events Enter your email address Example: contact@uni.lu Please provide a valid email address. Example: jean.dupont@gmail.com I agree to the use of my email address in the context of subscribing to the University of Luxembourg’s newsletters. I am aware that I can unsubscribe or update my profile by clicking the unsubscribe or update profile link in the email communication. More information about data processing. Subscribe now To the top",
  "content_length": 4727,
  "method": "requests",
  "crawl_time": "2025-12-01 14:54:28"
}