{
  "name": "Yvo Desmedt",
  "homepage": "http://www.utdallas.edu/~Yvo.Desmedt",
  "status": "success",
  "content": "Yvo G. Desmedt's Home Page Yvo G. Desmedt Jonsson Distinguished Professor Department of Computer Science The University of Texas at Dallas Member of Cyber Security Research and Education Institute IACR Fellow Member of the Belgium Academy of Science Inventor of e-Passports and e-Visas (jointly with George Davida, 1988) Erdös Number: 2 Course: CS 7301.002 Advanced Cryptography Recent picture Old pictures Recent: Research and slides NIST standards: statement and research Other statements (Co-author list) Scientific achievements How to contact me Research Interests His main interests include cryptography, quantum computing, privacy, network security, critical infrastructure and computer security. Papers (DBLP) Current research: Access Control Anonymity and Internet Voting Bridging theory and practice Combinatorics Critical Infrastructures Cryptanalysis, breaking and hacking of systems Distributed and Network security (including: Reliable and Perfectly Secure Message Transmission Secure Cloud Computing and Storage Secret Sharing Secure Multiparty Computation Secure Outsourcing and Secure Globalization Threshold Cryptography Verifiable Secret Sharing Economic models for information security Privacy in Social Networks Public key cryptography Quantum computing Current Professional Activities editor in Chief IET Information Security Journal Chair of the Steering Committee of the International Conference on Cryptology and Network Security Member of the Steering Committee of the International Workshop on Practice and Theory in Public Key Cryptography (PKC) CataCRYPT Some firsts Yvo Desmedt was the: 1994: first PC Chair of Crypto (Santa Barbara) with final proceedings available at the conference, 1996: Founding Director of the first university wide research center on information security in the USA, 1997: first PI funded by DARPA at the University of Wisconsin -- Milwaukee, 2000-2004: first director of the Laboratory of Security and Assurance in Information Technology (Florida State University), 2003: first PC Chair of PKC (Public Key Conference) under the auspices of IACR. Venues where Yvo Desmedt published Yvo Desmedt has published in conference proceedings of Asiacrypt, CCS, Computer Security Foundations Workshop, Crypto, ESORICS, Eurocrypt, Financial Cryptography, Globecom, ICC, ICITS, INFOCOM, Information Hiding, ISC, ISIT, NATO ASI, PKC, RANDOM, Security and Privacy (Oakland), STOC, and WEIS, among others. Moreover he published in journals as: Communications of the ACM, Computer Networks, Designs Codes and Cryptography, IEEE Computer, IPL, Journal of Cryptology, IEEE Transactions on Information Forensics and Security, IEEE Transactions on Information Theory, SIAM Journal on Discrete Mathematics. Other biographic information Yvo Desmedt received his Ph.D. (Summa cum Laude) from the University of Leuven, Belgium (1984). He was program chair of ICITS 2007, co-program chair of CANS 2005, program chair of PKC 2003, the 2002 ACM Workshop on Scientific Aspects of Cyber Terrorism and Crypto '94. He has authored over 200 refereed papers. He has given invited lectures at several conferences and workshops in 6 different continents. His first Assistant Professor position was at the Universite de Montreal (Canada). Other positions include: University of Wisconsin (Milwaukee), Florida State University and University College London. He declined an offer of Vice President of Citibank (New York, New York). He has held visiting appointments at Technion (Israel), Tokyo Institute of Technology (Japan), University of Karlsruhe (Germany), AIST (Japan), Macquarie University (Australia), etc. He also went on research visits to AT&T Research, Certicom, ETH, IBM Yorktown Heights, Philips Research Laboratory, Technical University Eindhoven (TU/e), University of Waterloo, etc. Downloadable information Short biography Vita Full Papers Last modified: September 18, 2025",
  "content_length": 3906,
  "method": "requests",
  "crawl_time": "2025-12-01 14:54:29"
}