{
  "name": "Yvonne Dittrich",
  "homepage": "https://pure.itu.dk/portal/en/persons/yvonne-dittrich(f2136570-f73c-446f-9fb0-6d9e461e2124).html",
  "status": "success",
  "content": "Yvonne Dittrich - IT-University of Copenhagen Yvonne Dittrich Professor, Software EngineeringHead of Research Group, Software EngineeringThe Maritime Hub https://orcid.org/0000-0003-4757-3394 Emailydiitudk 20012025 Research activity per year Personal profile CurriculumSince my time as a student I am interested in use oriented design and development of software. In the last years i especially focussed on the flexible and adaptable software. Use-orientation cuts across the sub-divisions of software engineering. Process management has to allow for evolution and Participatory Design with users; architectures have to support vertical and horizontal prototyping; requirements are under re-design throughout the life cycle and so on. The product of software development, the processes that lead to it and the context of use respectively its change and development have to be regarded as interlaced domains of reality. Use oriented design has to take all three dimensions into account. To be able to develop relevant guidelines and methods, I focus in empirical research on the actual work practice of software development. I use qualitative social science methods informed by ethnography and ethnomethodology. Cooperative Method Development uses empirical findings to adapt and further develop methods together with practitioners. Under the heading 'Design for Change', we looked e.g. at methods, techniques and tools promoting the design of adaptable software that can be tailored to a developing work practice.  Tailorable software brings design to use. It challenges traditional ways to organise software development. Flexible and agile approaches to software processes allow for a interlace of design activities and use. Find my CV here KeywordsCooperative and human aspects of software engineeringParticipatory designDesigning evolvable software productsEnd user developmentICT for developmentFlexible and adaptable softwareGlobal software engineering Fingerprint Dive into the research topics where Yvonne Dittrich is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Software Engineering Computer Science 100% Software Development Computer Science 94% Participatory Design Computer Science 74% Information Technology Computer Science 34% Global Software Development Computer Science 34% Social Software Computer Science 33% User-Centered Design Computer Science 29% Human Aspects of Software Engineering Keyphrases 28% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output Research output per year 2008 2008 2009 2010 2011 2012 2014 2015 2017 2018 2020 2024 2024 30 Article in proceedings 27 Journal article 12 Book chapter 8 Anthology 24 More 6 Conference article 5 Report 3 Conference abstract in proceedings 3 Paper 3 Editorial 3 Other contribution 1 Conference abstract for conference Research output per year Research output per year Action Research BookletWang, C. (Editor), Juncker-Jensen, L. (Editor), Wang, C., Østerlund, C. S., Nicolajsen, H. W., Christensen, L. R., Juncker-Jensen, L., Nielsen, L., Marttila, S.-M., Finken, S., Jiang, Q., Baka, V., Guo, V. & Dittrich, Y., May 2024, 1 ed. Copenhagen: Really Simple Syndication Press. 114 p.Research output: Book / Anthology / Report › Anthology › Research › peer-review Open AccessFile Action Research 100% Digital Technology 66% Intervention Research 66% Digitization 66% Organizational Context 33% Action Research with Industrial Software Engineering: An Educational PerspectiveDittrich, Y., Bolmsten, J. & Seidelin, C., 2024, Handbook on Teaching Empirical Software Engineering. Mendez, D., Avgeriou, P., Kalinowski, M. & Ali, N. B. (eds.). Cham: Springer, p. 413-461 49 p.Research output: Conference Article in Proceeding or Book/Report chapter › Book chapter › Research › peer-review Educational Perspectives 100% Teaching Action 50% Observational Approach 16% Curious interdisciplinarityDittrich, Y., 2024, A Festschrift in honor of David W. Randall. Harper, R., Rouncefield, M. & Wulf, V. (eds.). Universität Siegen, p. 17-18 2 p.Research output: Conference Article in Proceeding or Book/Report chapter › Book chapter › Research Open Access Design Goals for End-User Development of Robot-Assisted Physical Training Activities: A Participatory Design StudyDe La Rosa Gutierrez, J. P., Silva, T. R., Dittrich, Y. & Sørensen, A. S., 1 Jun 2024, In: Proc. ACM Hum.-Comput. Interact.. 8, EICS, p. 1-31 31 p.Research output: Journal Article or Conference Article in Journal › Journal article › Research › peer-review Open Access Participatory Design 100% End-user Development 100% Design Study 100% Physical Training 100% Robot-assisted 100% Scoping Software Engineering for AI: The TSE PerspectiveUchitel, S., Chechik, M., Penta, M. D., Adams, B., Aguirre, N., Bavota, G., Bianculli, D., Blincoe, K., Cavalcanti, A., Dittrich, Y., Ferrucci, F., Hoda, R., Huang, L., Lo, D., Lyu, M. R., Ma, L., Maletic, J. I., Mariani, L., McMillan, C. & Menzies, T. & 19 others, Monperrus, M., Moreno, A., Nagappan, N., Pasquale, L., Pelliccione, P., Pradel, M., Purandare, R., Ryu, S., Sabetzadeh, M., Serebrenik, A., Sun, J., Tantithamthavorn, K., Treude, C., Wimmer, M., Xiong, Y., Yue, T., Zaidman, A., Zhang, T. & Zhong, H., Nov 2024, In: IEEE Transactions on Software Engineering. 50, 11, p. 2709-2711 3 p.Research output: Journal Article or Conference Article in Journal › Journal article › Research Open Access View all 101 research outputs Projects Projects per year 2001 2014 2017 2024 2026 2 Active 18 Finished Projects per year ROSIN: ROS-Industrial quality-assured robot software componentsWasowski, A. (PI), Brabrand, C. (CoI), Dittrich, Y. (CoI), Alami, A. (CoI) & Fu, Z. (CoI)European Commission01/01/2017 → 31/12/2020Project: Research Robot Operating System 100% Robot 94% Operating Systems 81% Industrial Quality 43% Software Components 43% Systemudvikling med rammesystemer - nye aspekter af analyse og modelleringCarstensen, P. (PI), Dittrich, Y. (CoI) & Pries-Heje, L. (CoI)01/02/2005 → 01/04/2009Project: Research ERP Implementation 100% Enterprise Resource Planning 100% Knowledge Integration 50% Time Attitudes 50% Prior Event 50% SaIAFarm: SustAinable Irrigation Advisories for Mid-Himalayan Farmers using SmartSatellite Image Analytics Dittrich, Y. (PI), Schwetz, B. (CoI) & Keskinen, R. P. (CoI)Innovation Fund Denmark01/03/2021 → 31/08/2024Project: Research Sustainable Irrigation 100% Image Analytics 100% Software Ecosystems 75% Participatory Design 50% Precision Irrigation 50% CFIR: Innovationsnetværket for FinansITSestoft, P. (PI), Dittrich, Y. (CoI), Beck, R. (CoI) & Hildebrandt, T. (CoI)Danish Agency for Higher Education and Science01/09/2014 → 31/12/2018Project: Research GreenITSME: Green IT Research for Impact and Sustainability: Explore A Service-Oriented ModelWang, C. (PI), Ibsen, P. (Admin), Jiang, Q. (CoI), Dittrich, Y. (CoI) & Østerlund, C. S. (CoI)01/08/2025 → 30/05/2026Project: Innovation Sustainable IT 100% High-tech SMEs 100% IT Research 100% Green IT 100% Service-oriented 100% View all 20 projects Press/Media Sådan er dit liv koblet op på Silicon ValleyDittrich, Y. & Galis, V.01/06/20251 Media contributionPress/Media: Press / Media Rundt i dagDittrich, Y.22/10/20241 Media contributionPress/Media: Press / Media IT-UNIVERSITETET UDNÆVNER TRE NYE PROFESSORERHusfeldt, T., Schürmann, C. & Dittrich, Y.28/11/20191 Media contributionPress/Media: Press / Media ITU udnævner tre nye professorer i datalogiHusfeldt, T., Dittrich, Y. & Schürmann, C.01/11/20191 Media contributionPress/Media: Press / Media Ph.d.-forsvar om global softwareudvikling af Stina Matthiesen ved Datalogisk InstitutDittrich, Y.30/10/20191 Media contributionPress/Media: Press / Media View all 8 press/media Prizes Distinguished Reviewer AwardDittrich, Y. (Recipient), May 2019Prize: Prizes, scholarships, distinctions Kauffman Best Paper Award Runner UpWang, C. (Recipient), Østerlund , C. (Recipient), Jiang, Q. (Recipient) & Dittrich, Y. (Recipient), 2022Prize: Prizes, scholarships, distinctions International Conference 100% Best Paper Award 100% Information System 100% Activities Activities per year 2011 2011 2018 2020 2021 2022 2022 2 Editor of Research journal 2 Lecture and oral contribution 1 Organisation and participation in conference Activities per year CHASE – So what?Dittrich, Y. (Speaker) & Sharp, H. C. (Speaker)18 May 2022Activity: Talk or presentation types › Lecture and oral contribution I E E E Transactions on Software Engineering (Journal)Dittrich, Y. (Editor)25 Mar 2021 → …Activity: Publication peer-review and editorial work types › Editor of Research journal › Research International Symposium on End User Development (IS-EUD 2011)Dittrich, Y. (Program co-chair)7 Jun 2011 → 10 Jun 2011Activity: Participating in or organising an event types › Organisation and participation in conference Journal of Systems and Software (Journal)Dittrich, Y. (Reviewer)Oct 2020Activity: Publication peer-review and editorial work types › Editor of Research journal › Research Participatory Design and Sustainability - a literature review of PDC ProceedingsPoderi, G. (Speaker) & Dittrich, Y. (Other)22 Aug 2018Activity: Talk or presentation types › Lecture and oral contribution File",
  "content_length": 9602,
  "method": "requests",
  "crawl_time": "2025-12-01 14:54:28"
}