{
  "name": "Yvonne Coady",
  "homepage": "http://www.cs.uvic.ca/~ycoady",
  "status": "success",
  "content": "the MOD(ularity) Squad – supervised by yvonne coady Skip to content I’m a Professor in the Computer Science Department at the University of Victoria where I work with the MOD(ularity) Squad—the grooviest gang of students to ever attempt to improve the modularity of system infrastructure software!  The group has coauthored over 170 papers and over 40 graduate students have been unleashed on the world. Current research interests include mixed reality systems, citizen science, advanced modularity across the software stack and distributed clouds, and new programming paradigms and pedagogy for immersive applications. Recent MOD Squad adventures, include: scalable systems for Earth Observation and Urban planning (NSERC Collaborative Research and Development grant with IBM; Mitacs Accelerate grant with Urthecast; research grants through MEOPAR and the SALA Lab at UBC) interactive interfaces for exploratory tools (NSERC Discovery grant for deployment tools in distributed clouds; Mitacs Accelerate grant for context-aware language analysis; Mitacs Accelerate grant for accessibility-enhanced interfaces; NSERC Collaborative Research and Development grant with Ericsson for virtual reality based spatial analytics within data centers) 13 additional industry collaborations funded by NSERC and Mitacs over the last 4 years, we were recognized as one of the University of Victoria’s Knowledge Mobilization Award winners in 2015 Recent Fun! Adjunct with the MDM Program RAVR (Research in Augmented and Virtual Reality) SAVR (Software for Augmented and Virtual Reality) BC Stories profiled in the VRAR Association’s Blog on Education Working with Loretta Todd on curriculum for VR within her Indigenous Matriarchs 4 program in 2012… This was progressive!https://www.youtube.com/watch?v=6WegVFJnJKo Subscribe Subscribed the MOD(ularity) Squad Sign me up Already have a WordPress.com account? Log in now. the MOD(ularity) Squad Subscribe Subscribed Sign up Log in Copy shortlink Report this content View post in Reader Manage subscriptions Collapse this bar",
  "content_length": 2056,
  "method": "requests",
  "crawl_time": "2025-12-01 14:54:31"
}