{
  "name": "Z. Berkay Celik",
  "homepage": "https://beerkay.github.io",
  "status": "success",
  "content": "Search Z. Berkay Celik Associate Professor Department of Computer Science Purdue University I am an Associate Professor in the Department of Computer Science at Purdue University and co-director of Purdue Security Laboratory (PurSec Lab). I am also affiliated with the Center for Education and Research in Information Assurance and Security (CERIAS), aiming to broaden interdisciplinary collaboration for security and privacy. I earned my Ph.D. in Computer Science and Engineering from Penn State University, where I was advised by Professor Patrick McDaniel and was the lead graduate student of the Systems and Internet Infrastructure Security Laboratory (SIIS). My research investigates the design and evaluation of security for software and systems, specifically on emerging computing platforms and the complex environments in which they operate. Through systems design, program analysis, and formal methods, my research seeks to improve security and privacy guarantees in commodity computer systems. My research approach is best illustrated by my extensive work in Internet of Things (IoT)/Cyber-Physical Systems (CPS), including robotic vehicles, automobiles, self-driving cars, industrial control systems, and mobile systems, such as smartphones, wearables (e.g., smartwatches, AR/VR headsets). My research group actively publishes at top security conferences (USENIX Security, Oakland, CCS, and NDSS). My group’s work has been sponsored by NSF, ONR, DARPA, USDOT, DOE, United States Military Academy, Google, Apple, Cisco, Rolls Royce, Denso North America Foundation, and Sandia National Laboratories. I am part of the NSF AI Institute ACTION, DARPA FIREFLY, and USDOT National Center TraCR. I’m recipient of multiple awards, including NSF CAREER Award (2022), Google Aspire Award (2021, 2022, and 2023), Amazon Research Award (2024), ACM CCS Distinguished Paper Award (2024), USENIX Security Honorable Mention Paper Award (2025) the Most Influential Professor Award by Purdue CS Graduate Student Board (2020 and 2024), and College of Science Faculty Leadership Award (2024). Current Students: Chandrika Mukherjee (PhD) Hongyu Cai (PhD) Mohammad Areeb (PhD) PhD co-advising: Ruoyu Song (PhD) (co-advised with Antonio Bianchi) Doguhan Yeke (PhD) (co-advised with Antonio Bianchi) Ananth Shreekumar (PhD) (co-advised with Dongyan Xu) Brandon Lee (co-advised with Antonio Bianchi) MSc Students: Dung (Ryan) Doan Undergraduate Student Researchers: Gaurish Lakhanpal Past PhD Students: 5- Raymond Muller (2025) - Signal and Image Processing Engineer for Security at Lawrence Livermore National Laboratory (LLNL) 4- Arjun Arunasalam (2025) - Assistant Professor in the Knight Foundation School of Computing and Information Sciences at Florida International University 3- Reham Aburas (2024) - Assistant Professor in the Department of Computer Science and Engineering at the American University of Sharjah 2- Muslum Ozgur Ozmen (2024) - Assistant Professor in the School of Computing and Augmented Intelligence at Arizona State University 1- Habiba Farrukh (2023) - Assistant Professor in the Department of Computer Science at the University of California, Irvine Past Co-advised PhD Students 3- Hyungsub Kim (2024) - Assistant Professor in the Department of Computer Science at Indiana University (co-advised with Dongyan Xu and Antonio Bianchi) 2- Khaled Serag (2023) - Research Scientist at Qatar Computing Research Institute (QCRI) (co-advised with Dongyan Xu) 1- Abdulellah Alsaheel (2023) - private Security Consultant (co-advised with Dongyan Xu) Prospective Students: [Fall 25, Spring 26] I’m actively looking for motivated PhD students and research interns. If you are a motivated student with an interest in security, I would be interested in speaking with you. If you are not a student at Purdue, please fill the following form for more information. If you are a student at Purdue, there are research opportunities for undergraduate/graduate students interested in security/privacy of Cyber-Physical Systems and Machine Learning Systems, please email me for details. Recent News I am proud to congratulate two of my Ph.D. students who just graduated and are starting their new jobs in Fall 2025: Arjun Arunasalam) is starting as a tenure-track Assistant Professor at Knight Foundation School of Computing & Information Sciences (FIU KFSCIS), and Raymond Muller) is beginning his new role as a Signal and Image Processing Engineer for Security at Lawrence Livermore National Laboratory (LLNL). Congratulations to Chandrika Mukherjee and all authors on receiving the Honorable Mention award for the paper Shadowed Realities: An Investigation of UI Attacks in WebXR paper at USENIX Security Symposium 2025. I promoted to Associate Professor with tenure at Purdue Computer Science, August 2025. Thank you to my mentors, colleagues, and the whole Purdue community for their support. A special thank you goes to my students, past and present; your hard work and curiosity make this career rewarding. Congratulations to my PhD students, Muslum Ozgur Ozmen and Reham Aburas, on their graduation and new faculty positions! Ozgur is heading to Arizona State University as an Assistant Professor; Reham will join American University of Sharjah as an Assistant Professor. My research group has received an Amazon Research Award. Distinguished Paper award at ACM Conference on Computer and Communications Security (CCS), 2024 I gave a talk on Secure Autonomy for Qualcomm AI Lectures. Thank you Jonathan Petit for hosting me! I gave a talk at Lund University (Sweden) for the ELLIIT focus period Symposium on Security and Fault Tolerance of Cyber-Physical Systems. Thank you Martina Maggio and Mikael Asplund for hosting me! I gave a virtual talk at University of California Santa Cruz Baskin School of Engineering, Cyber-Physical Systems Research Center (CPSRC). Thank you Ricardo Sanfelice, Alvaro Cardenas, and Daniel Fremont for hosting me! Congratulations to M. Ozgur Ozmen on receiving the 2024 CERIAS Diamond Award for his outstanding academic achievement. Older news Teaching CS 426: Computer Security (Undergraduate) [Spring 23] [Syllabus] This introductory undergraduate course focuses on the principles and foundations of building secure computer systems, security best practices, and security failures in existing and emerging computer networks and systems. The course covers four key topic areas: basics of cryptography and crypto protocols, network security, systems security, and privacy. Students successfully completing this class will be able to understand and assess security threats, become familiar with security engineering best practices, write better software, protocols, and systems, and have rudimentary skills in security research. CS 590: IoT/CPS Security (Graduate) [Spring 20, Spring 22] [Syllabus] In this course, we will study the latest research in the design of Internet of Things (IoT) and Cyber-Physical Systems (CPS) and methods for securing them. The course will provide foundations of safety and security of IoT/CPS and covers the topics of policy verification, approaches for designing safe and secure systems, techniques for detecting problems in conventional IoT/CPS design and repairing such problems. Example topics include the security of voice-controlled devices, IoT applications, edge computing, industrial control systems, and autonomous vehicles. CS 529: Security Analytics (Graduate) [Fall 24, Fall 22, Fall 21, Fall 20, Fall 19] [Syllabus] This graduate-level course will provide students with materials to discuss the intersection of two ubiquitous concepts: Security and Machine Learning. The course is structured in two parts: (1) Machine Learning for Security and (2) Security of Machine Learning Systems. The focus of the first part will be on building a principled understanding of key learning algorithms and techniques, and their applications within the security domain, as well as general questions related to analyzing and handling datasets. The first part will provide students with the necessary background to understand the second half of the course. The second part covers recently discovered security implications of deploying machine learning algorithms in the physical realm. Students will learn about attacks against computer systems leveraging machine learning algorithms, as well as defense techniques to mitigate such attacks during learning and inference. Full list of courses Selected Publications 2011-2021 Investigating Physical Latency Attacks against Camera-based Perception Raymond Muller, Ruoyu Song, Chenyi Wang, Yuxia Zhan, Jean-Philippe Monteuuis, Yanmao Man, Ming Li, Ryan Gerdes, Jonathan Petit, and Z. Berkay Celik IEEE Symposium on Security and Privacy (IEEE S&P), 2025 Acceptance Rate: 14.7% Automated Discovery of Semantic Attacks in Multi-Robot Navigation Systems Doguhan Yeke, Kartik Anand Pant, Muslum Ozgur Ozmen, Hyungsub Kim, James Goppert, Inseok Hwang, Antonio Bianchi, and Z. Berkay Celik USENIX Security Symposium, 2025/ Acceptance Rate: 17.1% From Threat to Trust: Exploiting Attention Mechanisms for Attacks and Defenses in Cooperative Perception Chenyi Wang, Ming Li, Raymond Muller, Ruoyu Song, Jean-Philippe Monteuuis, Yanmao Man, Jonathan Petit, Ryan Gerdes, and Z. Berkay Celik USENIX Security Symposium, 2025 Acceptance Rate: 17.1% Shadowed Realities: An Investigation of UI Attacks in WebXR Chandrika Mukherjee, Reham Mohamed, Arjun Arunasalam, Habiba Farrukh, and Z. Berkay Celik USENIX Security Symposium, 2025 Acceptance Rate: 17.1% Speak Up, I’m Listening: Extracting Speech from Zero-Permission VR Sensors Derin Cayir, Reham Mohamed Aburas, Riccardo Lazzeretti, Marco Angelini, Abbas Acar, Mauro Conti, Z. Berkay Celik, and Selcuk Uluagac Network and Distributed System Security (NDSS) Symposium, 2025 Acceptance Rate: 16.1% ScopeVerif: Analyzing the Security of Android’s Scoped Storage via Differential Analysis Zeyu Lei, Guliz Seray Tuncay, Beatrice Carissa Williem, Z. Berkay Celik, a",
  "content_length": 13562,
  "method": "requests",
  "crawl_time": "2025-12-01 14:54:29"
}