{
  "name": "Zachary Wartell",
  "homepage": "http://webpages.uncc.edu/zwartell",
  "status": "success",
  "content": "homepage Zachary Justin Wartell, Ph.D. Associate Professor, Department of Computer Science co-Director, Ribarsky Center for Visual Analytics zwartell@uncc.edu Office Hours: Tuesday, Thursday, 2:30 - 4:00 pm Zoom: Instructions  | Appointment Slot Sign-up Woodward 435B Rendering in 1525, Dürer Revised: 11/3/2025 Teaching Classes Fall 2025: ITCS 3120 Canvas Course: #244369 WWW: ITCS 3120-Introduction to Computer Graphics Course Rotation: ITCS 5122/4122 - Visual Analytics [Spring 2025] ITCS 4121-5121 Information Visualization [Spring 2021] LMS: Canvas Course ITCS 6125/8125 Virtual and Augmented Reality [Spring 2020] ITCS 6120/8120 Computer Graphics ITCS 4325/5235 - Game Engine Construction [On Demand: Last Offered Spring 2019] Teaching Materials ITCS 3120 Tutorial: Git Tutorial and Usage Conventions Tutorial: VS Code Tutorial Tutorial: HTML, CSS and Event Tutorial Tutorial: Javascript Tutorial Project: WebGL 2D Drawing ITCS 6125/8125 Tutorial: MSVS_CSharp_Tutorial General Tutorials: Unix Primer - Basic Commands In the Unix Shell Proofreading Marks Research Virtual Reality and Mixed Reality User Interfaces Stereoscopic 3D Display: Distortion, Perception, and Algorithms - this work research and develops algorithms and analysis of 3D distortion of the stereoscopic 3D image in 3D displays Publications: [Cho14b][Cho12b][Cho12a][Wartell09][Wartell02][Wartell01][Wartell99a] 3D Interaction Techniques - this work researches and develops various 2-handed 3D interaction techniques often with a focus on volume data. Videos: Hybrid User Interface Publications: [Li18][Cho14a][Cho13][Wang12][Ulinski09, Ulinski07a, Ulinski07b] Multi-Scale Virtual Environment Interaction Techniques - this work researches interaction techniques for multi-scale virtual environments where travel requires adjusting 7 degrees-of-freedom, the 6 Euclidean ones plus scale. Videos: Cursor-Offsets Spindle+Wheel Multi-Scale Navigation Two-handed Decision VR Publications: [Cho18] [Feng15] [Li15a][Cho15a][Cho14c][Wartell09][Houtgast05][Wartell99c][Durbin98] Exergames - this work researches and develops full-bodied virtual reality games that require measurable physical exertion. Videos: AstroJumper - Music AstroJumper - NarratedAstrojumper - Kinect Publications: [Finkelstein13][Nickel12] [Finkelstein11] Redirected Walking Interaction Techniques - this work research and develops techniques that allows a person to physically walk through a virtual space that is much larger than the physical space. Publications: [Suma11][Suma10][Suma09] Multi-touch Interaction Techniques - this work research and develops interaction techniques on our custom multi-touch table. Videos: Hardware Overview Multi-touch Urban Growth Visualization Publications: [Butkiewicz09] [Butkiewicz08a] Visualization and Interactive Computer Graphics Geospatial Rendering and Visualization Algorithms - these works develop geometric algorithms for rendering and visualization of geo-spatial data. Publications: [Chang08][Butkiewicz07a][Wartell03][Wartell99b] Geospatial Interaction Techniques - these works develop interaction techniques for global, geospatial data that are applicable to desktop user interfaces as well as VR UI's. Publications: [Butkiewicz10][Butkiewicz08c][Butkiewicz07b][Ribarsky03][Ribarsky02]. Curriculum Vitae CV - May 2010 v2 Publications Journal Publications I. Cho, J. Li and Z. Wartell, \"Multi-Scale 7DOF View Adjustment,\" in IEEE Transactions on Visualization and Computer Graphics, vol. 24, no. 3, pp. 1331-1344, 1 March 2018. [doi: 10.1109/TVCG.2017.2668405] [IEEE URL] Bernier, C., Petrov, A.S., Waterbury, C., Jett, J., Li, F., Freil, L.E., Xiong, b., Wang, L., Le, A., Milhouse, B.L., Hershkovitz, E., Grover, M., Xue, Y., Hsiao, C., Bowman, J.C., Harvey, S.C., Wartel, J.Z., and Williams, L.D. (2014)  \"Ribovision: Visualization and Analysis of Ribosomes\", The Royal Society of Chemister: Faraday Discussion. 169, 1-12. [PDF] Finkelstein, S.; Nickel, A.; Lipps, Z.; Barnes, T.; Wartell, Z. & Suma, E. A. (2011), 'Astrojumper: Motivating Exercise with an Immersive Virtual Reality Exergame', Presence: Teleoperators and Virtual Environments 20(1), 78-92. [PDF, Bibtex] [Video: AstroJumper - Narrated,vimeo-astrojumper-Kinect] Butkiewicz, T., Meentemeyer, R.K., Shoemaker, D.A., Chang, R., Wartell, Z. & Ribarsky, W, Alleviating the Modifiable Areal Unit Problem within Probe-Based Geospatial Analyses, Computer Graphics Forum, Blackwell Publishing Ltd, 2010, Vol. 29(3), pp. 923-932. [PDF, Bibtex] Thomas Butkiewicz, Wenwen Dou, Zachary Wartell, William Ribarsky, Remco Chang (2008). \"Multi-Focused Geospatial Analysis Using Probes\". IEEE Transactions on Visualization and Computer Graphics (TVCG)/ InfoVis 2008, vol. 14, no 6. pp. 1165-1172, Nov/Dec, 2008. [PDF , IEEE DOI] (acceptance rate 26%) Thomas Butkiewicz, Remco Chang, Zachary Wartell, William Ribarsky (2008). \"Visual Analysis and Semantic Exploration of Urban LIDAR Change Detection,\" Computer Graphics Forum (EuroVis 2008), vol. 27, num. 3, September 2008. [PDF] (acceptance rate 31%) Remco Chang, Thomas Butkiewicz, Caroline Ziemkiewicz, Zachary Wartell, Nancy Pollard, William Ribarsky (2008). \"Legible Simplification of Textured Urban Models,\" IEEE Computer Graphics and Applications (CG&A) Special Issue on Procedural Urban Modeling, pp. 27-36, May/June 2008. [PDF , IEEE DOI] Zachary Wartell, Larry F. Hodges, William Ribarsky (2002). \"An Analytic Comparison of Alpha-False Eye Separation, Image Scaling and Image Shifting in Stereoscopic Displays,\" IEEE Transactions on Visualization and Computer Graphics, Volume 8, Number 2, pp. 129-143, April-June 2002. [PDF , IEEE DOI] Bastian Leibe, Thad Starner, William Ribarsky, Zachary Wartell, David Krum, Justin Weeks, Bradley Singletary, and Larry Hodges (2000). \"Toward Spontaneous Interaction with the Perceptive Workbench.\" IEEE Computer Graphics and Applications, pp. 2-12, November/December 2000. [PDF , IEEE DOI] Conference Publications (Peer Reviewed) Jialei Li, Isaac Cho, and Zachary Wartell. Evaluation of Cursor Offset on 3D Selection in VR. In Proceedings of the Symposium on Spatial User Interaction (SUI '18). ACM, New York, NY, USA, 120-129. 2018. [doi: https://doi.org/10.1145/3267782.3267797] T. Lawanson, R. Karandeh, V. Cecchi, Z. Wartell and I. Cho, \"Improving Power Distribution System Situational Awareness Using Visual Analytics,\" SoutheastCon 2018, St. Petersburg, FL, USA, 2018, pp. 1-6. [PDF] [doi: 10.1109/SECON.2018.8479204] [IEEE URL] Jinbo Feng, Isaac Cho, Zachary Wartell. \"Comparison of Device-Based, One and Two-Handed 7DOF Manipulation Techniques,\" Proceedings of the 3rd ACM Symposium on Spatial User Interaction, ACM, pages 2-9, August 2015. [doi: 10.1145/2788940.2788942]. [PDF] [Video] Isaac Cho, Zachary Wartell. Evaluation of a Bimanual Simultaneous 7DOF Interaction Technique in Virtual Environments. In IEEE 10th Symp. on 3D User Interfaces, pages 133-136, March 2015. [doi: 10.1109/3DUI.2015.7131738] [PDF] [Video] Jialei Li, Isaac Cho, Zachary Wartell. Evaluation of 3D Virtual Cursor Off set Techniques for Navigation Tasks in a Multi-DisplayVirtual Environment. In IEEE 10th Symp. on 3D User Interfaces, pages 59-66, March 2015. [doi: 10.1109/3DUI.2015.7131727] [PDF] [Video] Isaac Cho, Jialei Li, Zachary Wartell. \"Evaluating Dynamic Stereo View Parameters in a Multi-Scale Virtual Environment\".  IEEE Symposium on 3D User Interfaces (3DUI), 29-30 March 2014, pp. 91-98. [PDF] [Video] Isaac Cho, Xiaoyu Wang, Zachary Wartell. \"HyFinBall: A Two-Handed, Hybrid 2D/3D Desktop VR Interface for Multi-Dimensional Visualization\". Proc. SPIE 9017, Visualization and Data Analysis 2014, 90170E (December 23, 2013). [PDF] [Video] Andrea Nickel, Hugh Kinsey, Tiffany Barnes, Zachary Wartell. Supporting an Interval Training Program with the Astrojumper Video Game. In electronic proceedings of Meaningful Play 2012. October 18 - 20, East Lansing, MI, USA, 2012. [PDF] [Video: AstroJumper - Music, AstroJumper - NarratedAstrojumper - Kinect (original) Isaac Cho, Wenwen Dou, Zachary Wartell, William Ribarsky, and Xiaoyu Wang. 2012. Evaluating depth perception of volumetric data in semi-immersive VR. In Proceedings of the International Working Conference on Advanced Visual Interfaces (AVI '12), Genny Tortora, Stefano Levialdi, and Maurizio Tucci (Eds.). ACM, New York, NY, USA, 266-269. [PDF] [ACM DOI]. William Ribarsky, Eric Sauda, Zachary Wartell, Jeffery Balmer, \"The Whole Story: Building the Complete History of a Place,\" Hawaii International Conference on System Sciences, pp. 1864-1873, 2012 45th Hawaii International Conference on System Sciences, 2012. [PDF] Suma, E.A., Clark, S., Krum, D.M., Finkelstein, S.L., Bolas, M.T. & Wartell, Z. Leveraging change blindness for redirection in virtual environments, Virtual Reality Conference (VR), 2011 IEEE, 2011, pp. 159 -166. [PDF, IEEE DOI, Bibtex] Amy C. Ulinski, Zachary Wartell, Paula Goolkasian, Evan A. Suma, and Larry F. Hodges (2009), \"Selection performance based on classes of bimanual actions,\" 3D User Interfaces, 2009. 3DUI 2009. IEEE Symposium on, vol., no., pp.51-58, March 14-15 2009. [PDF, IEEE DOI] (26.5% acceptance rate) Amy Ulinski, Catherine Zanbaka, Zachary Wartell, Paula Goolkasian, Larry F. Hodges (2007). Two Handed Selection Techniques for Volumetric Data. IEEE Symposium on 3D User Interfaces 2007. Charlotte, North Carolina, pg 107-114. March 10-11, 2007. [PDF , IEEE DOI] (23% acceptance rate) Zachary Wartell, Eunjung Kang, Tony Wasilewski, William Ribarsky, and Nickolas Faust (2003). Rendering Vector Data over Global, Multiresolution 3D Terrain. Eurographics-IEEE Visualization Symposium 2003, pp. 213-222, 2003. [PDF] (48% acceptance rate) Zachary Wartell and Larry Hodges and William Ribarsky (2001). \"Characterizing Image Fusion Techniques in Stereoscopic HTDs.\" Proceedings of Graphics Interface 2001, Ottawa, Canada, pp. 223-232, June 2001. [PDF] (48% acceptance rate) Bastian Leibe, Thad Starner, William Ribarksy, Zachary Wartell, David Krum, Brad Single",
  "content_length": 19237,
  "method": "requests",
  "crawl_time": "2025-12-01 14:54:37"
}