{
  "name": "Zachari Swiecki",
  "homepage": "https://research.monash.edu/en/persons/zach-swiecki",
  "status": "success",
  "content": "Zachari Swiecki - Monash University View Scopus Profile Zachari Swiecki Dr Senior Lecturer, Department of Data Science & AI https://orcid.org/0000-0002-7414-5507 EmailZach.Swieckimonashedu Accepting PhD Students 20152026 Research activity per year Personal profile BiographyZachari Swiecki is a Lecturer of Learning Analytics in the Faculty of Information Technology at Monash University.  He received his master's and Ph.D. in Educational Psychology from the University of Wisconsin-Madison where he was a member of the Epistemic Analytics lab. He graduated summa cum laude from the University of Alabama with a bachelor's degree in Mathematics and Physics. He has played a central role in the development and dissemination of Quantitative Ethnography, an emerging methodology that combines qualitative analysis, statistics, and data science into a single framework. Research interestsZachari's current work focuses on learning analytics—the application of data science techniques to learning contexts—with an emphasis on collaborative settings. This work includes developing novel techniques for modelling collaborative processes, applying these models in domains such as engineering design, medicine, and the military, and designing real-time systems for monitoring teams. Past projects include the research and development of innovative educational simulations, automated assessment techniques, and simulation authoring tools for educators. Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Education/Academic qualificationEducational Psychology, Doctor of Philosophy , University of Wisconsin MadisonAug 2013 → Aug 2020Award Date: 23 Aug 2020Educational Psychology, Master of Science, University of Wisconsin MadisonAug 2013 → Dec 2015Award Date: 24 Dec 2015Mathematics & Physics, Bachelor of Science, University of Alabama, TuscaloosaAug 2008 → May 2013Award Date: 11 May 2013 Research area keywordsLearning AnalyticsCollaborative LearningQuantitative EthnographyLearning Sciences Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Projects Projects per year 2020 2020 2021 2022 2023 2024 2027 2 Finished 3 Active Projects per year An Assessment Framework: An Assessment Framework: Assessments for writing with generative artificial intelligenceGasevic, D. (Primary Chief Investigator (PCI)), Swiecki, Z. (Chief Investigator (CI)), Tsai, Y.-S. (Chief Investigator (CI)), Rong, J. (Chief Investigator (CI)), Rakovic, M. (Chief Investigator (CI)), Nagtzaam, G. (Chief Investigator (CI)), Jovanović, J. (Partner Investigator (PI)) & Järvelä, S. (Partner Investigator (PI))1/08/24 → 31/07/27Project: Research HARNESS: Hierarchical Abstractions and Reasoning for Neuro-Symbolic SystemsRezatofighi, H. (Primary Chief Investigator (PCI)), Garcia De La Banda Garcia, M. (Chief Investigator (CI)), Li, Y.-F. (Chief Investigator (CI)), Stuckey, P. (Chief Investigator (CI)), Gasevic, D. (Chief Investigator (CI)), Gutierrez, J. (Chief Investigator (CI)), Qu, L. (Chief Investigator (CI)), Ignatiev , A. (Chief Investigator (CI)), Swiecki, Z. (Chief Investigator (CI)), Vered, M. (Chief Investigator (CI)), Chen, G. (Chief Investigator (CI)), Haffari, R. (Chief Investigator (CI)) & Say, B. (Chief Investigator (CI))20/06/23 → 20/02/27Project: Research CELLA 2 CERES: CELLA 2 CERES: Connecting the Center for Learning and Living with Artificial Intelligence to CERESJärvelä, S. (Primary Chief Investigator (PCI)), Molenaar, I. (Chief Investigator (CI)), Bannert, M. (Chief Investigator (CI)), Gasevic, D. (Chief Investigator (CI)), Azevedo, R. (Chief Investigator (CI)), Martinez-Maldonado, R. (Associate Investigator (AI)), Tsai, Y.-S. (Associate Investigator (AI)), Swiecki, Z. (Associate Investigator (AI)) & Chen, G. (Associate Investigator (AI))Jacobs Foundation17/12/21 → 31/12/26Project: Research Large-scale multimodal knowledge management: From organization and user modeling to fast contextual presentationGasevic, D. (Primary Chief Investigator (PCI)), Swiecki, Z. (Chief Investigator (CI)), Li, Y.-F. (Chief Investigator (CI)), Haffari, R. (Chief Investigator (CI)), Hayat, M. (Chief Investigator (CI)), Chen, G. (Chief Investigator (CI)), Tsai, Y.-S. (Chief Investigator (CI)), Do, T. (Chief Investigator (CI)), Zhuang, B. (Chief Investigator (CI)) & Wang, T. (Chief Investigator (CI))2/09/22 → 1/09/25Project: Research Leading Virtual Learning Teacher CoursePhillips, M. (Primary Chief Investigator (PCI)), Henderson, M. (Chief Investigator (CI)) & Swiecki, Z. (Chief Investigator (CI))22/06/20 → 30/06/23Project: Research Research output Research output per year 2015 2023 2024 2025 2026 48 Conference Paper 18 Article 3 Chapter (Book) 1 Review Article Research output per year Research output per year Towards reliable generative AI-driven scaffolding: Reducing hallucinations and enhancing quality in self-regulated learning supportQian, K., Liu, S., Li, T., Raković, M., Li, X., Guan, R., Molenaar, I., Nawaz, S., Swiecki, Z., Yan, L. & Gašević, D., Jan 2026, In: Computers and Education. 240, 19 p., 105448.Research output: Contribution to journal › Article › Research › peer-review Open AccessFile 2 Citations (Scopus) Analytics of self-regulated learning strategies and scaffolding: Associations with learning performanceLi, T., Yan, L., Iqbal, S., Srivastava, N., Singh, S., Raković, M., Swiecki, Z., Tsai, Y.-S., Gašević, D., Fan, Y. & Li, X., Jun 2025, In: Computers and Education: Artificial Intelligence. 8, 16 p., 100410.Research output: Contribution to journal › Article › Research › peer-review Open AccessFile 2 Citations (Scopus) Asking generative artificial intelligence the right questions improves writing performanceCheng, Y., Fan, Y., Li, X., Chen, G., Gašević, D. & Swiecki, Z., Jun 2025, In: Computers and Education: Artificial Intelligence. 8, 18 p., 100374.Research output: Contribution to journal › Article › Research › peer-review Open AccessFile 2 Citations (Scopus) Dissecting the Temporal Dynamics of Embodied Collaborative Learning Using Multimodal Learning AnalyticsYan, L., Martinez-Maldonado, R., Swiecki, Z., Zhao, L., Li, X. & Gašević, D., 2025, In: Journal of Educational Psychology. 117, 1, p. 106–133 28 p.Research output: Contribution to journal › Article › Research › peer-review Open AccessFile 7 Citations (Scopus) Investigating the Effect of Visualization Literacy and Guidance on Teachers’ Dashboard InterpretationPozdniakov, S., Martinez-Maldonado, R., Tsai, Y. S., Echeverria, V., Swiecki, Z. & Gašević, D., 27 Mar 2025, In: Journal of Learning Analytics. 12, 1, p. 367-390 24 p.Research output: Contribution to journal › Article › Research › peer-review Open AccessFile View all 70 research outputs",
  "content_length": 7183,
  "method": "requests",
  "crawl_time": "2025-12-01 14:54:33"
}