{
  "name": "Zahra Montazeri",
  "homepage": "https://research.manchester.ac.uk/en/persons/zahra.montazeri",
  "status": "success",
  "content": "Zahra Montazeri - Research Explorer The University of Manchester Zahra Montazeri Dr Lecturer in Graphics and Virtual Environ, Human Computer Systems https://orcid.org/0000-0003-0398-3105 Phone+44 161 275 6209Emailzahra.montazerimanchester.acuk Room 2.34, Kilburn Building, Oxford RdM13 9PL ManchesterUnited Kingdom Personal profile Research interestsComputer Graphics, Physics-based Rendering, Material Modeling. Personal page BiographyZahra is a lecturer (Assistant Professor) at the University of Manchester in the department of Computer Science. Her field of research is physics-based computer graphics with a focus on photorealistic rendering and appearance modeling for complex materials such as cloth, hair, and fur. She worked as a research consultant at Disney Research and collaborates with WetaDigital on joint research projects. She received Star Wars movie credit for The Mandalorian and her research paper was used in the production of Avatar, The Way of Water. Before joining academia, she was a Research and Development at Industrial Light & Magic (ILM). She holds a PhD in Computer Science from University of California, Irvine (UCI), advised by Shuang Zhao, and worked under the supervision of Professor Henrik Wann Jensen. During her studies, she interned at Pixar Animation Studios, DreamWorks Animation, and for two years at Luxion (makers of KeyShot). She received her M.Sc. in Computer Science from UCI in 2017 and her B.Sc. in Computer Engineering from the Sharif University of Technology in 2015, Iran.My groupI am honored to work with these exceptional researchers: Current PhDs: Apoorv Khattar – started in Sep 2022Bowen Xue - started in Sep 202Fengxi Jin - started in Sep 2022Chenghao Wu - started in March 2023 Alumni: PhD: (2024) David Petrescu, next: Lecturer at University of Manchester MSc: (2022) Hazhen Bai(2023) Mengtong Feng TeachingCOMP37111 - Computer Graphics and Virtual Environment (2022, 2023) COMP1INTRO Computer Science - Welcome Week (2023) Comp10120 - First Year Tutorials (2021/2022, 2022/2023, 2023/2024) Comp30040&30030 - Third Year Project (2022/2023, 2023/2024) Social responsibilityPublic Engagement Coordinator Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Education/Academic qualificationDoctor of Philosophy, Computer Science, Computer Graphics, University of California, Irvine16 Sept 2015 → 11 May 2021Award Date: 8 Sept 2021Master of Science, Computer Science, University of California, Irvine15 Sept 2015 → 11 Jun 2017Award Date: 8 Sept 2018Bachelor of Science, Computer Engineering, Sharif University of Technology21 Sept 2010 → 29 Dec 2014Award Date: 3 Mar 2015 External positionsConsultancy, Disney Research1 Apr 2022 → 30 Nov 2022Research & Development, Industrial Light & MagicAug 2021 → Dec 2021Research Assistant, Luxion (Makers of KeyShot)Jun 2019 → Jan 2021Research & Development Intern, Pixar Animation StudiosJun 2018 → Sept 2018Research & Development Intern, DreamWorks Animation SKGJun 2017 → Sept 2017Research Assistant, Koc UniversityJun 2014 → Aug 2015 Areas of expertiseQA75 Electronic computers. Computer scienceComputer GraphicsKeywordsComputer GraghicsRenderingAppearance ModelingNeural RenderingPhysics-based renderingPhotorealistic renderingVisual Computing Fingerprint Dive into the research topics where Zahra Montazeri is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Virtual Reality Computer Science 100% User Experience Computer Science 100% Appearance Model Engineering 83% Neural Network Computer Science 66% Level Detail Engineering 50% Models Computer Science 33% Alternative Version Computer Science 33% Continuous Space Computer Science 33% View full fingerprint Research output 9 Article 8 Conference contribution 6 Preprint 1 Patent 1 More 1 Doctoral Thesis Research output per year Research output per year A Texture-Free Practical Model for Realistic Surface-Based Rendering ofWoven FabricsKhattar, A., Zhu, J., Yan, L.-Q. & Montazeri, Z., 27 Feb 2025, In: Computer Graphics Forum. 44, 1, e15283.Research output: Contribution to journal › Article › peer-review Open AccessFile Double Layer 100% Microlevel 100% Masking Effect 100% Level Detail 100% Mathematical Equation 100% 47 Downloads (Pure) Automatic Reconstruction of Woven Cloth from a Single Close‐up ImageWu, C., Khattar, A., Zhu, J., Pettifer, S., Yan, L. & Montazeri, Z., 8 Oct 2025, In: Computer Graphics Forum.Research output: Contribution to journal › Article › peer-review Open Access Light Condition 100% Perfect Matching 100% Processing Step 50% Fine Detail 50% Gaussians 50% Motion aware video generative modelXue, B., Guarnera, G. C., Zhao, S. & Montazeri, Z., 2 Jun 2025, arXiv, p. 1-10, 10 p.Research output: Preprint/Working paper › Preprint File Spectral Signature 100% Enhancement Module 100% Video Synthesis 100% 10 Downloads (Pure) The Effects of Visual Behavior and Ego-Movement on Foveated Rendering Performance in Virtual RealityPetrescu, D., Warren, P., Montazeri, Z. (Collaborator), Strain, G. & Pettifer, S., 15 Apr 2025, In: SN Computer Science. 6, 386.Research output: Contribution to journal › Article › peer-review Open Access Virtual Reality 100% Complex Task 100% User Experience 100% Computational Resource 100% Visual Search Behavior 100% Towards Comprehensive Neural Materials: Dynamic Structure-Preserving Synthesis with Accurate Silhouette at Instant Inference SpeedXu, Z., Cheng, X., Liu, C., Wang, B., Wang, L., Montazeri, Z. & Yan, L., 27 Jul 2025, SIGGRAPH Conference Papers '25: Proceedings of the Special Interest Group on Computer Graphics and Interactive Techniques Conference Conference Papers. Alford, G., Zhang, H. & Schulz, A. (eds.). Danvers, MA: Association for Computing Machinery, p. 1-11 11 p.Research output: Chapter in Book/Conference proceeding › Conference contribution › peer-review Open Access Essential Aspect 100% Dynamic Structure 100% Traditional Method 50% Neural Network 50% Photorealistic Rendering 50% View all 25 research outputs Prizes Best Paper Award at EGSRMontazeri, Z. (Recipient), 2023Prize: Prize (including medals and awards) Yarn 100% Paper 100% Models 100% Best Visuals Award at EGSRMontazeri, Z. (Recipient), 2023Prize: Prize (including medals and awards) Models 100% Doctral Fellowship at UCI (Fully Funded)Montazeri, Z. (Recipient), 2015Prize: Fellowship awarded competitively LightSpeed Venture Partners Summer Fellowship Montazeri, Z. (Recipient), 2016Prize: Fellowship awarded competitively United States of America 100% Scientific and Technological Research Council of Turkey (TUBITAK)Montazeri, Z. (Recipient), 2015Prize: Fellowship awarded competitively Research Councils 100% Activities 11 Invited talk 1 Organising a conference, workshop, exhibition, performance, inquiry, course etc 1 Consultancy &amp; Services Activities per year Invited talk at CoSTARMontazeri, Z. (Speaker)3 Jul 2025Activity: Talk or presentation › Invited talk › Research Invited talk at EPFLMontazeri, Z. (Speaker)Feb 2023Activity: Talk or presentation › Invited talk › Research Invited talk at University of California San Diego (at Pixel Cafe)Montazeri, Z. (Speaker)18 Nov 2022Activity: Talk or presentation › Invited talk › Research Invited talk at University of California IrvineMontazeri, Z. (Speaker)16 Nov 2022Activity: Talk or presentation › Invited talk › Research Invited talk at University of Santa BarbaraMontazeri, Z. (Speaker)15 Nov 2022Activity: Talk or presentation › Invited talk › Research View all 13 activities Impacts Advancements of Cloth Rendering Montazeri, Z. (Participant)Impact: Technological, Economic Press/Media Women in Computer ScienceMontazeri, Z.5/12/22 → 21/01/233 Media contributionsPress/Media: Blogs and social media Opportunities after PhDMontazeri, Z.12/07/221 Media contributionPress/Media: Expert comment Computer Science Research Showcase 2017Montazeri, Z.3/03/171 Media contributionPress/Media: Research",
  "content_length": 8159,
  "method": "requests",
  "crawl_time": "2025-12-01 14:54:36"
}