{
  "name": "Zak Kincaid",
  "homepage": "http://www.cs.princeton.edu/~zkincaid",
  "status": "success",
  "content": "research Zak Kincaid I'm an associate professor at Princeton University. Email: zkincaid@cs.princeton.edu Office: 194 Nassau St, Room 230 (Second floor) Address: 194 Nassau Street, Princeton, NJ 08540 research | teaching | students | etc research¶ My main research interests are in program analysis, logic, and programming languages. I have active research projects that aim to make program analysis compositional and robust. See full list of publications; some recent ones are recent publications¶ Nikhil Pimpalkhare, Zachary Kincaid: Monotone Procedure Summarization via Vector Addition Systems and Inductive Potentials. OOPSLA 2024. PDF Charlie Murphy, Zachary Kincaid: Quantified Linear Arithmetic Satisfiability via Fine-Grained Strategy Improvement. CAV 2024. PDF Shaowei Zhu, Zachary Kincaid: Breaking the Mold: Nonlinear Ranking Function Synthesis Without Templates. CAV 2024. PDF Nikhil Pimpalkhare, Zachary Kincaid: Semi-linear VASR for Over-Approximate Semi-linear Transition System Reachability. RP 2024. PDF Xieyang Xu, Yifei Yuan, Zachary Kincaid, Arvind Krishnamurthy, Ratul Mahajan, David Walker, Ennan Zhai: Relational Network Verification. SIGCOMM 2024. PDF students¶ current¶ Jake Silverman Nicolas Koh Nikhil Pimpalkhare graduated¶ Shaowei Zhu (PhD 2024, Researcher at Amazon) Charlie Murphy (PhD 2023, Postdoc at University of Wisconsin–Madison) teaching¶ COS 320 – Compiling Techniques: Spring 2024, Spring 2022, Spring 2020, Spring 2019 COS 516 / ELE 516 – Automated Reasoning about Software: Fall 2025, Fall 2022, Fall 2018 COS 217 – Introduction to Programming Systems: Fall 2024 COS IW – Practical Solutions to Intractable Problems Fall 2023, Spring 2023, Spring 2018, Spring 2017. COS IW – Little Languages Spring 2018 COS 597D – Reasoning about concurrent systems: Fall 2016 etc¶ Links: GitHub, DBLP, Google Scholar Slides for POPL’18 tutorial on algebraic program analysis: background | intraprocedural analysis | interprocedural analysis | iteration domain I received my PhD from the University of Toronto. My adviser was Azadeh Farzan. Some of my work is implemented in the Duet program analyzer. Erdős number is 3. Chinmay Narayan has typeset a FAQ for our POPL12 paper.",
  "content_length": 2202,
  "method": "requests",
  "crawl_time": "2025-12-01 14:54:39"
}