{
  "name": "Zbigniew Stachniak",
  "homepage": "http://www.cse.yorku.ca/~zbigniew",
  "status": "success",
  "content": "Zbigniew Stachniak ZBIGNIEW STACHNIAK Zbigniew Stachniak Senior Scholar Department of Electrical Engineering and Computer Science York University, Toronto Curator, York University Computer Museum Research Interests Artificial Intelligence, History of Computing, and History of Mathematics. Specifically: Automated Reasoning Propositional Satisfiability History of Computing in Canada History of Logic Please consult the Research Projects page. Books in Progress Currently working on two history of computing book projects. Computing at York, 1965-1980 York University was founded in 1959 during a time when Ontario faced an unexpected surge in demand for higher education, driven by the rapid growth of its postwar population and economy. At that time, the landscape of technology was vastly different. Only 40 electronic digital computers were operational throughout Canada, with merely three of them installed at Canadian universities. There were no established guidelines for building academic computer resources, nor for their effective management and use in administration, research, and education. Instead, academic computing environments were developing at a unique pace, reflecting local conditions and the need to optimize administrative operations as well as to expand support for research and educational programs. This book is a historical account of the introduction of computing to York University. Computing in the Clouds: The rise and fall of IPSANET This book is a corporate history of I.P. Sharp Assoc. -- one of the world's most significant time sharing companies of the 1970s and 1980s. What's New The MCM/70 @ 50 exhibit opened on November 14th, 2023 in Steacie Science and Engineering Library, York University. The exhibit is organized by the York University Computer Museum in collaboration with York University Libraries. It celebrates the momentous appearance of the MCM/70 computer - a technological marvel that offered an early glimpse of a new digital reality. It pays tribute to the makers of the MCM/70 for their contributions to personal computing. To learn more about the exhibit, please visit the MCM/70 @ 50 exhibit site. YUCoM Museum In December 2002, the Department of Computer Science and Engineering, York University, established the York University Computer Museum (YUCoM) -- Canada's first physical museum dedicated exclusively to the history of the Canadian computer industry. The main motivation behind this decision has been to create an academically significant research collection that would provide scholars, students, writers, and the media with primary historical sources to research the development of computer technologies in Canada and their impact on Canadian society. Follow this link for more information on YUCoM. © ZBIGNIEW STACHNIAK 2024",
  "content_length": 2794,
  "method": "requests",
  "crawl_time": "2025-12-01 14:54:38"
}