{
  "name": "Zear Ibrahim",
  "homepage": "https://www.brunel.ac.uk/people/zear-ibrahim",
  "status": "success",
  "content": "Dr Zear Ibrahim | Introduction | Brunel University London Skip to Content Home People Dr Zear Ibrahim Dr Zear IbrahimAssociate Lecturer (Education) Wilfred Brown 203 Email: zear.ibrahim@brunel.ac.uk Tel: +44 (0)1895 268574 Google Scholar ORCID - 0000-0001-7385-7329 Scopus - 57205514405 HCI Research Group Computer Science College of Engineering, Design and Physical Sciences Summary Dr Zear Ibrahim is an associate lecturer in the Department of Computer Science at Brunel University London, where he also received his Ph.D. and B.Sc. respectively. Prior to embarking on a fully funded EPSRC Doctoral Training Partnership in 2017, he worked as developer and analyst implementing Oracle Enterprise Business solutions at the National Physical Laboratory. Zear’s research focuses on exploiting recent developments in the open-sourced 3D/AR/IR structure sensor research domain to enable accurate, efficient and non-invasive Assistive Technologies for Health Care Provision in older-adults. Zear has extensive lecturing experience across various undergraduate modules, primarily focusing on the programming fundamentals. He currently serves as the module lead for CS1603 - Introductory Programming and leads the SAS Base Programmer Certification Training at the postgraduate level. Zear also holds roles as the Academic Admission Tutor and Designated Safeguard Officer within the department. As the SwiftBot Infrastructure Technology Lead, Zear also maintains the SwiftBot-Connect App available on Google Play and Apple App Stores. Qualifications PhD - Computer Science - Computer Vision & Biomedical Engineering BSc - Computer Science - Software Engineering SAS - Certified Base Programmer for SAS 9 Responsibility Computer Science - CS1603 - Introductory Programming Module Lead Computer Science - PGT - SAS Certified Base Programmer Certification Training Lead Computer Science - Academic Admission Tutor CEDPS - Designated Safeguard Officer Computer Science - Swiftbot Infrastructure Technology Lead Computer Science - SwiftBot Connect Apple and Google Play App Maintainer",
  "content_length": 2071,
  "method": "requests",
  "crawl_time": "2025-12-01 14:54:39"
}