{
  "name": "Zehui Xiong",
  "homepage": "https://pure.qub.ac.uk/en/persons/zehui-xiong",
  "status": "success",
  "content": "Zehui Xiong - Queen's University Belfast View Scopus Profile Zehui Xiong Professor Professor, School of Electronics, Electrical Engineering and Computer Science https://orcid.org/0000-0002-4440-941X Emailz.xiongqub.acuk Accepting PhD StudentsPhD projectsPhD opportunities open in following areas: Edge Generative AI; Mobile On-device LLM; Semantic Networking and Communications. 20152025 Research activity per year Personal profile Research FocusAt iConnect Lab (Intelligent Computing and Networking Innovation Lab), our name embodies our mission: integrating 'Intelligent' solutions with seamless 'Connectivity' to address the challenges of modern computing and networking. The 'i' emphasizes its intelligent, innovative, and inclusive research scope, while 'Connect' highlights our commitment to fostering connectivity and collaboration in a rapidly evolving technological landscape. Our research explores areas like AI, edge computing, IoT, and next-generation networking, creating smarter, more efficient technologies for a connected world. We tackle critical challenges such as scaling intelligent systems, enhancing network efficiency, and enabling secure, ubiquitous connectivity. From foundational research to practical applications, our work aims to shape the technologies of tomorrow. If you are passionate about advancing intelligent computing and networking, join us at iConnect Lab and be part of building the future. ParticularsZehui Xiong is currently a Full Professor with the School of Electronics, Electrical Engineering and Computer Science, Queen's University Belfast, United Kingdom. Prior to that, he was with Singapore University of Technology and Design, and Nanyang Technological University (NTU). He received the Ph.D. degree in Computer Science and Engineering at NTU, Singapore. He was a visiting scholar with Department of Electrical Engineering at Princeton University and a visiting scholar with Broadband Communications Research (BBCR) Lab in Department of Electrical and Computer Engineering at University of Waterloo. His research interests include wireless networks, Internet of Things, edge intelligence, semantic communications, generative AI, and Metaverse. Recognized as a Highly Cited Researcher, he has published more than 250 peer-reviewed research papers in leading journals, with numerous Best Paper Awards from international flagship conferences. He serves as an Editor or Guest Editor for many leading journals such as IEEE Journal on Selected Areas in Communications, IEEE Transactions on Vehicular Technology, IEEE Internet of Things Journal, IEEE Transactions on Cognitive Communications and Networking, IEEE Transactions on Network Science and Engineering. Featured in Forbes Asia 30U30, he serves as the Chair for numerous international conferences. His honors include the IEEE Asia Pacific Outstanding Young Researcher Award, IEEE VTS Early Career Award, IEEE Early Career Award for Excellence in Scalable Computing, IEEE Technical Committee on Blockchain and Distributed Ledger Technologies Early Career Award, IEEE Internet Technical Committee Early Achievement Award, IEEE TCSVC Rising Star Award, IEEE TCI Rising Star Award, IEEE TCCLD Rising Star Award, IEEE ComSoc Outstanding Paper Award, IEEE Best Land Transport Paper Award, IEEE Asia Pacific Outstanding Paper Award, IEEE CSIM Technical Committee Best Journal Paper Award, IEEE SPCC Technical Committee Best Paper Award, and IEEE Big Data Best Influential Conference Paper Award. Fingerprint Dive into the research topics where Zehui Xiong is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 2 Similar Profiles Blockchain Computer Science 100% Unmanned Aerial Vehicle Computer Science 88% Artificial Intelligence Computer Science 82% Federated Learning Computer Science 72% Federated machine learning Computer Science 61% Deep Reinforcement Learning Computer Science 60% Resource Allocation Computer Science 59% Incentive Mechanism Computer Science 58% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output Research output per year 2015 2022 2023 2024 2025 2025 306 Article 153 Conference contribution 18 Working paper 12 Chapter 16 More 7 Editorial 4 Review article 2 Book 2 Letter 1 Comment/debate Research output per year Research output per year Adaptive contextual caching for mobile-edge large language model service: a proposed frameworkLiu, G., Liu, Y., Wang, J., Du, H., Niyato, D., Kang, J. & Xiong, Z., 29 Sept 2025, (Early online date) In: IEEE Vehicular Technology Magazine. 11 p.Research output: Contribution to journal › Article › peer-review Open AccessFile First-in-First-Out 100% Cache Replacement Policy 100% Retrieval-Augmented Generation 100% Caching Framework 100% Document Context 100% 9 Downloads (Pure) Advancing end-to-end programmable networks: exploring the interplay of Generative AI with opportunities and challengesHe, W., Yao, H., Ren, X., Liu, Y., Xiong, Z. & Niyato, D., 13 Feb 2025, (Early online date) In: IEEE Network.Research output: Contribution to journal › Article › peer-review Programmable Network 100% Generative Artificial Intelligence 100% Artificial Intelligence Model 33% Constrained Environment 16% Detection Accuracy 16% Agent-driven generative semantic communication with cross-modality and predictionYang, W., Xiong, Z., Yuan, Y., Jiang, W., Quek, T. Q. S. & Debbah, M., Mar 2025, In: IEEE Transactions on Wireless Communications. 24, 3, p. 2233-2248 16 p.Research output: Contribution to journal › Article › peer-review Generative Semantics 100% Performance Gain 33% Reinforcement Learning 33% Reconstruction Accuracy 33% Contextual Information 33% 5 Citations (Scopus) Anti-jamming resource allocation for integrated sensing and communications based on game-guided reinforcement learningChen, Y., Yang, H., Ou, X., Jiang, Y. & Xiong, Z., Jan 2025, In: IEEE Wireless Communications Letters. 14, 1, p. 223-227 5 p.Research output: Contribution to journal › Article › peer-review Reinforcement Learning 100% Communication System 66% Joints (Structural Components) 33% Simulation Result 33% Power Control 33% 5 Citations (Scopus) A privacy-enhanced method for privacy-preserving and verifiable federated learningWang, X., Chen, T., Dai, H. N., Long, P., Yang, H., Xiong, Z. & Susilo, W., 16 Apr 2025, (Early online date) In: IEEE Internet of Things Journal.Research output: Contribution to journal › Article › peer-review Homomorphic Encryption 100% Privacy Preserving 100% Federated Learning 100% Decryption 80% Encryption Scheme 60% 1 Citation (Scopus) View all 505 research outputs",
  "content_length": 6949,
  "method": "requests",
  "crawl_time": "2025-12-01 14:54:42"
}