{
  "name": "Zeki Erkin",
  "homepage": "https://www.tudelft.nl/staff/z.erkin",
  "status": "success",
  "content": "Staff Zoeken Sluit zoek Dr. Z. (Zeki) Erkin Dr. Z. (Zeki) Erkin Elektrotechniek, Wiskunde en Informatica Intelligent Systems Cyber Security Pure-profiel Contact Z.Erkin@tudelft.nl +31 15 27 86283 Ruimte: 29.02.250 Profiel Zeki Erkin is an Associate Professor in the Cyber Security Group at Delft University of Technology (TU Delft), specializing in privacy-preserving technologies, secure computation, and applied cryptography. His research focuses on developing cryptographic techniques that enable secure data processing in untrusted environments, with particular emphasis on homomorphic encryption, secure multi-party computation, and privacy in machine learning. Dr. Erkin has authored numerous publications in leading journals and conferences, including IEEE Security & Privacy, USENIX Security, IEEE TIFS, PETS, ESORICS, and FC, and has served on the program committees of top-tier venues in security and cryptography. He actively collaborates with academia and industry on research projects addressing privacy challenges in sectors such as healthcare, finance, and law enforcement. He has taken on several professional service roles in the scientific community, including serving as past Chair of the IEEE Information Forensics and Security Technical Committee (IFS TC), Editor-in-Chief of the Eurasip Journal of Information Security, and Vice Chair of the Academic Cyber Security Society (ACCSS). These roles reflect his ongoing commitment to strengthening the global cryptography and cybersecurity research ecosystem. Beyond research and service, Zeki Erkin is passionate about fostering personal development and nurturing a positive, inclusive academic environment. As a researcher and educator, he is committed to making meaningful contributions to both science and society by empowering the next generation of thinkers and innovators. Expertise Data Privacy Preserving Cryptography Chains User Blockchain Solutions Calculation methods Information Publicaties 2025 Dataset Watermarking Using the Discrete Wavelet Transform Mike P. Raave / Devri İş Ler / Zekeriya Erkin 2025 Extending Null Embedding for Deep Neural Network (DNN) Watermarking Kaan Altınay / Devri İş Ler / Zekeriya Erkin 2025 Optimal Graph Stretching for Distributed Averaging Florine W. Dekker / Z. Erkin / M. Conti 2025 Topology-Based Reconstruction Prevention for Decentralised Learning Florine W. Dekker / Z. Erkin / M. Conti 2024 Auditable Medical Data Sharing through Recoverable Key Agreement Jorrit Van Assen / Roland Kromes / Zekeriya Erkin Meer publicaties Onderwijs 2025 Security and Cryptography Privacy Enhancing… Onderwijs 2024 Security and Cryptography Privacy Enhancing… Nevenwerkzaamheden (Bestuurs)lid commissie/stichting/vereniging/stuur- of klankbordgroep - ACCSS 2023-01-02 - 2026-12-31 Onderwijs Redacteur/Colomnist/Journalist/Publicist - Springer 2023-01-02 - 2026-12-31 Onderwijs Elektrotechniek, Wiskunde en Informatica Intelligent Systems Cyber Security Pure-profiel Contact Z.Erkin@tudelft.nl +31 15 27 86283 Ruimte: 29.02.250",
  "content_length": 3030,
  "method": "requests",
  "crawl_time": "2025-12-01 14:54:42"
}