{
  "name": "Zengchang Qin",
  "homepage": "https://dblp.org/pid/05/1860.html",
  "status": "success",
  "content": "dblp: Zengchang Qin Your feedback is essential – not only for improving dblp, but also for demonstrating its impact to our public funders, who rely on our community input when evaluating our work. That’s why we warmly invite you to take part in our 2025 user survey. Your insights help us understand how the community uses dblp and directly shape its future development. Thank you for contributing to dblp’s future! For some months now, the dblp team has been receiving an exceptionally high number of support and error correction requests from the community. While we are grateful and happy to process all incoming emails, please assume that it will currently take us several weeks, if not months, to read and address your request. Most importantly, please refrain from sending your request multiple times. This will not advance your issue and will only complicate and extend the time required to address it. Thank you for your understanding. default search actioncombined dblp searchauthor searchvenue searchpublication searchAuthors:no matchesVenues:no matchesPublications:no matchesask othersGoogleGoogle ScholarSemantic ScholarInternet Archive ScholarCiteSeerXORCID > Home > Persons run query for this personhighly cited coauthorsco-cited other authorsnon-coauthors with many coauthors in commonhighly cited publicationsco-cited publicationsauthors citing this authornumber of authors per paperor build your own? showing all ?? records 2025[c83]Qianhao Han, Daniel Ding, Junyi Liu, Zengchang Qin, Zheng Zheng: Radgen: A Cross-Modal Fusion System for Automated Radiology Report Generation. CBMS 2025: 111-112[c82]Zijie Zhong, Linqing Zhong, Zhaoze Sun, Qingyun Jin, Zengchang Qin, Xiaofan Zhang: SyntheT2C: Generating Synthetic Data for Fine-Tuning Large Language Models on the Text2Cypher Task. COLING 2025: 672-692[c81]Zijie Zhong, Hanwen Liu, Xiaoya Cui, Xiaofan Zhang, Zengchang Qin: Mix-of-Granularity: Optimize the Chunking Granularity for Retrieval-Augmented Generation. COLING 2025: 5756-5774[c80]Ming Shan Hee, Zihan Gao, Yinglong Wang, Xiangxiang Chu, Roy Ka-Wei Lee, Zengchang Qin: Contrastive Instruction Fine-Tuning Large Multimodal Model for Hateful Meme Classification. ICWSM 2025: 760-773[c79]Junyi Liu, Tao Wan, Zengchang Qin: MCA: Multimodal Contrastive Augmentation for Medical Report Generation. PAKDD (7) 2025: 309-321[c78]Zijie Zhong, Yunhui Zhang, Ziyi Chang, Zengchang Qin: CADReN: Contextual Anchor-Driven Relational Network for Controllable Cross-Graphs Node Importance Estimation. PAKDD (1) 2025: 359-3712024[c77]Qianhao Han, Junyi Liu, Zengchang Qin, Zheng Zheng: Integrating MedCLIP and Cross-Modal Fusion for Automatic Radiology Report Generation. IEEE Big Data 2024: 7313-7317[c76]Zihan Gao, Peng Gao, Wei Yin, Yifan Liu, Zengchang Qin: Robust Lightweight Depth Estimation Model via Data-Free Distillation. ICASSP 2024: 4160-4164[c75]Yuxi Lu, Zhuming Zhang, Shiming Lin, Dengpan Zhang, Haibin Ma, Zengchang Qin: S3GCN: Sport Scoring Siamese Graph Convolution Network. ICIP 2024: 1364-1370[c74]Suyuan Huang, Haoxin Zhang, Yanyu Xu, Yan Gao, Yao Hu, Zengchang Qin: Caseg: Clip-Based Action Segmentation With Learnable Text Prompt. ICIP 2024: 2201-2207[i30]Zijie Zhong, Yunhui Zhang, Ziyi Chang, Zengchang Qin: CADReN: Contextual Anchor-Driven Relational Network for Controllable Cross-Graphs Node Importance Estimation. CoRR abs/2402.05135 (2024)[i29]Yuhe Liu, Mengxue Kang, Zengchang Qin, Xiangxiang Chu: LogicalDefender: Discovering, Extracting, and Utilizing Common-Sense Knowledge. CoRR abs/2403.11570 (2024)[i28]Suyuan Huang, Haoxin Zhang, Yan Gao, Yao Hu, Zengchang Qin: From Image to Video, what do we need in multimodal LLMs? CoRR abs/2404.11865 (2024)[i27]Zijie Zhong, Hanwen Liu, Xiaoya Cui, Xiaofan Zhang, Zengchang Qin: Mix-of-Granularity: Optimize the Chunking Granularity for Retrieval-Augmented Generation. CoRR abs/2406.00456 (2024)[i26]Ziije Zhong, Linqing Zhong, Zhaoze Sun, Qingyun Jin, Zengchang Qin, Xiaofan Zhang: SyntheT2C: Generating Synthetic Data for Fine-Tuning Large Language Models on the Text2Cypher Task. CoRR abs/2406.10710 (2024)[i25]Suyuan Huang, Chao Zhang, Yuanyuan Wu, Haoxin Zhang, Yuan Wang, Maolin Wang, Shaosheng Cao, Tong Xu, Xiangyu Zhao, Zengchang Qin, Yan Gao, Yunhan Bai, Jun Fan, Yao Hu, Enhong Chen: ScalingNote: Scaling up Retrievers with Large Language Models for Real-World Dense Retrieval. CoRR abs/2411.15766 (2024)[i24]Qianhao Han, Junyi Liu, Zengchang Qin, Zheng Zheng: Integrating MedCLIP and Cross-Modal Fusion for Automatic Radiology Report Generation. CoRR abs/2412.07141 (2024)[i23]Qingyun Jin, Xiaohui Song, Feng Zhou, Zengchang Qin: Align Attention Heads Before Merging Them: An Effective Way for Converting MHA to GQA. CoRR abs/2412.20677 (2024)2023[c73]Yuhe Liu, Chuanjian Liu, Kai Han, Quan Tang, Zengchang Qin: Boosting Semantic Segmentation from the Perspective of Explicit Class Embeddings. ICCV 2023: 821-831[i22]Yuhe Liu, Chuanjian Liu, Kai Han, Quan Tang, Zengchang Qin: Boosting Semantic Segmentation from the Perspective of Explicit Class Embeddings. CoRR abs/2308.12894 (2023)2022[j26]Junyu Ji, Tao Wan, Dong Chen, Hao Wang, Menghan Zheng, Zengchang Qin: A deep learning method for automatic evaluation of diagnostic information from multi-stained histopathological images. Knowl. Based Syst. 256: 109820 (2022)[c72]Shunyu Zhang, Xiaoze Jiang, Zequn Yang, Tao Wan, Zengchang Qin: Reasoning with Multi-Structure Commonsense Knowledge in Visual Dialog. CVPR Workshops 2022: 4599-4608[c71]Zheng He, Zeke Xie, Quanzhi Zhu, Zengchang Qin: Sparse Double Descent: Where Network Pruning Aggravates Overfitting. ICML 2022: 8635-8659[c70]Yifan Luo, Tao Wan, Zengchang Qin: Topic Modeling of Political Dynamics with Shifted Cosine Similarity. IUKM 2022: 267-278[i21]Shunyu Zhang, Xiaoze Jiang, Zequn Yang, Tao Wan, Zengchang Qin: Reasoning with Multi-Structure Commonsense Knowledge in Visual Dialog. CoRR abs/2204.04680 (2022)[i20]Zheng He, Zeke Xie, Quanzhi Zhu, Zengchang Qin: Sparse Double Descent: Where Network Pruning Aggravates Overfitting. CoRR abs/2206.08684 (2022)2021[j25]Tao Wan, Jianhui Chen, Zhonghua Zhang, Deyu Li, Zengchang Qin: Automatic vessel segmentation in X-ray angiogram using spatio-temporal fully-convolutional neural network. Biomed. Signal Process. Control. 68: 102646 (2021)[j24]Jing Yu, Xiaoze Jiang, Zengchang Qin, Weifeng Zhang, Yue Hu, Qi Wu: Learning Dual Encoding Model for Adaptive Visual Understanding in Visual Dialogue. IEEE Trans. Image Process. 30: 220-233 (2021)[c69]Yuguang Zhou, Zheng He, Tao Wan, Zengchang Qin: Random Neural Graph Generation with Structure Evolution. ICONIP (2) 2021: 87-982020[j23]Tao Wan, Lei Zhao, Hongxiang Feng, Deyu Li, Chao Tong, Zengchang Qin: Robust nuclei segmentation in histopathology using ASPPU-Net and boundary refinement. Neurocomputing 408: 144-156 (2020)[j22]Weifeng Zhang, Jing Yu, Hua Hu, Haiyang Hu, Zengchang Qin: Multimodal feature fusion by relational reasoning and attention for visual question answering. Inf. Fusion 55: 116-126 (2020)[j21]Jing Yu, Weifeng Zhang, Zhuoqian Yang, Zengchang Qin, Yue Hu: Cross-modal learning with prior visual relation knowledge. Knowl. Based Syst. 203: 106150 (2020)[j20]Jing Yu, Yuhang Lu, Weifeng Zhang, Zengchang Qin, Yanbing Liu, Yue Hu: Learning cross-modal correlations by exploring inter-word semantics and stacked co-attention. Pattern Recognit. Lett. 130: 189-198 (2020)[j19]Jing Yu, Weifeng Zhang, Yuhang Lu, Zengchang Qin, Yue Hu, Jianlong Tan, Qi Wu: Reasoning on the Relation: Enhancing Visual Representation for Visual Question Answering and Cross-Modal Retrieval. IEEE Trans. Multim. 22(12): 3196-3209 (2020)[c68]Xiaoze Jiang, Jing Yu, Zengchang Qin, Yingying Zhuang, Xingxing Zhang, Yue Hu, Qi Wu: DualVD: An Adaptive Dual Encoding Model for Deep Visual Understanding in Visual Dialogue. AAAI 2020: 11125-11132[c67]Jiankai Zhuang, Zengchang Qin, Jialu Chen, Tao Wan: A Lightweight Network Model For Video Frame Interpolation Using Spatial Pyramids. ICIP 2020: 543-547[c66]Zhuoqian Yang, Zengchang Qin, Jing Yu, Tao Wan: Prior Visual Relationship Reasoning For Visual Question Answering. ICIP 2020: 1411-1415[c65]Rui Zhao, Tao Wan, Deyu Li, Zhengbo Zhang, Zengchang Qin: A Deep Learning Model for Early Prediction of Sepsis from Intensive Care Unit Records. ICONIP (4) 2020: 791-798[c64]Ke Dong, Zengchang Qin, Tao Wan: Many-to-One Stable Matching for Prediction in Social Networks. IEA/AIE 2020: 345-356[c63]Xiaoze Jiang, Jing Yu, Yajing Sun, Zengchang Qin, Zihao Zhu, Yue Hu, Qi Wu: DAM: Deliberation, Abandon and Memory Networks for Generating Detailed and Non-repetitive Responses in Visual Dialogue. IJCAI 2020: 687-693[c62]Xiaoze Jiang, Siyi Du, Zengchang Qin, Yajing Sun, Jing Yu: KBGN: Knowledge-Bridge Graph Network for Adaptive Vision-Text Reasoning in Visual Dialogue. ACM Multimedia 2020: 1265-1273[i19]Xiaoze Jiang, Jing Yu, Yajing Sun, Zengchang Qin, Zihao Zhu, Yue Hu, Qi Wu: DAM: Deliberation, Abandon and Memory Networks for Generating Detailed and Non-repetitive Responses in Visual Dialogue. CoRR abs/2007.03310 (2020)[i18]Xiaoze Jiang, Siyi Du, Zengchang Qin, Yajing Sun, Jing Yu: KBGN: Knowledge-Bridge Graph Network for Adaptive Vision-Text Reasoning in Visual Dialogue. CoRR abs/2008.04858 (2020)2019[j18]Tao Wan, Shusong Xu, Chen Sang, Yulan Jin, Zengchang Qin: Accurate segmentation of overlapping cells in cervical cytology with deep convolutional neural networks. Neurocomputing 365: 157-170 (2019)[c61]Jie Zheng, Andi Xia, Lin Shao, Tao Wan, Zengchang Qin: Stock Volatility Prediction Based on Self-attention Networks with Social Information. CIFEr 2019: 1-7[c60]Yifan Liu, Ke Chen, Chris Liu, Zengchang Qin, Zhenbo Luo, Jingdong Wang: Structured Knowledge Distillation for Semantic Segmentation. CVPR 2019: 2604-2613[c59]Shuangting Liu, Jiaqi Zhang, Yuxin Chen, Yifan Liu, Zengchang Qin, Tao Wan: Pixel Level Data Augmentation for Semantic Image Segmentation Using Generative Adversarial Networks. ICASSP 2019: 1902-1906[c58]Daouda Sow, Z",
  "content_length": 32889,
  "method": "requests",
  "crawl_time": "2025-12-01 14:54:44"
}