{
  "name": "Zeyu Guo 0001",
  "homepage": "https://zeyuguo.bitbucket.io",
  "status": "success",
  "content": "Zeyu Guo Homepage I am an Assistant Professor in the Department of Computer Science and Engineering at the Ohio State University. Before joining OSU, I did postdocs at UT Austin, University of Haifa, and IIT Kanpur. I completed my Ph.D. in computer science at Caltech in 2017, under Chris Umans. My research interests include pseudorandomness, coding theory, algebraic complexity theory, and applications of algebraic methods in theoretical computer science. My work is supported by the NSF CAREER Award. Research Debordering Closure Results in Determinantal and Pfaffian Ideals Anakin Dey and Zeyu Guo To appear in ITCS 2026. Also available on ECCC and arXiv. Random Reed-Solomon Codes Achieve List-Decoding Capacity With Linear-Sized Alphabets Omar Alrabiah, Zeyu Guo, Venkatesan Guruswami, Ray Li, and Zihan Zhang Advances in Combinatorics, 2025. Merged journal version of [Alrabiah–Guruswami–Li '24] and [Guo–Zhang '23]. Deterministic Depth-4 PIT and Normalization Zeyu Guo and Siki Wang Manuscript. Also available on ECCC and arXiv. Gabidulin Codes Achieve List Decoding Capacity with an Order-Optimal Column-To-Row Ratio Zeyu Guo, Chaoping Xing, Chen Yuan, and Zihan Zhang The 29th International Workshop on Randomization and Computation (RANDOM), 2025. Improved Decoding of Tanner Codes Zhaienhe Zhou and Zeyu Guo The 2025 IEEE International Symposium on Information Theory (ISIT), 2025. Also available on arXiv. Random Reed–Solomon Codes Achieve the Half-Singleton Bound for Insertions and Deletions over Linear-Sized Alphabets Roni Con, Zeyu Guo, Ray Li, and Zihan Zhang The 52nd EATCS International Colloquium on Automata, Languages, and Programming (ICALP), 2025. Also available on arXiv. Hilbert Functions and Low-Degree Randomness Extractors Alexander Golovnev, Zeyu Guo, Pooya Hatami, Satyajeet Nagargoje, and Chao Yan The 28th International Workshop on Randomization and Computation (RANDOM), 2024. Also available on ECCC and arXiv. Optimal Pseudorandom Generators for Low-Degree Polynomials Over Moderately Large Fields Ashish Dwivedi, Zeyu Guo, and Ben Lee Volk The 28th International Workshop on Randomization and Computation (RANDOM), 2024. Also available on ECCC and arXiv. Random Gabidulin Codes Achieve List Decoding Capacity in the Rank Metric Zeyu Guo, Chaoping Xing, Chen Yuan, and Zihan Zhang The 65th Annual IEEE Symposium on Foundations of Computer Science (FOCS), 2024. Also available on arXiv. Randomly Punctured Reed–Solomon Codes Achieve the List Decoding Capacity over Polynomial-Size Alphabets Zeyu Guo and Zihan Zhang The 64th Annual IEEE Symposium on Foundations of Computer Science (FOCS), 2023. Also available on arXiv. Extractors for Images of Varieties Zeyu Guo, Ben Lee Volk, Akhil Jalan, and David Zuckerman The 55th Annual ACM Symposium on Theory of Computing (STOC), 2023. Also available on ECCC and arXiv. Fast Multivariate Multipoint Evaluation Over All Finite Fields Vishwas Bhargava, Sumanta Ghosh, Zeyu Guo, Mrinal Kumar, and Chris Umans The 63rd Annual IEEE Symposium on Foundations of Computer Science (FOCS), 2022. Also available on ECCC and arXiv. Journal version in the Journal of the ACM, 2024. Improved List-Decodability and List-Recoverability of Reed–Solomon Codes via Tree Packings Zeyu Guo, Ray Li, Chong Shangguan, Itzhak Tamo, and Mary Wootters The 62nd Annual IEEE Symposium on Foundations of Computer Science (FOCS), 2021. Journal version in SIAM Journal on Computing, 2024. Variety Evasive Subspace Families Zeyu Guo Journal version in computational complexity, 2024. A previous version appears in the 36th Computational Complexity Conference (CCC), 2021. Also available on ECCC and arXiv. Efficient List-Decoding with Constant Alphabet and List Sizes Zeyu Guo and Noga Ron-Zewi The 53rd Annual ACM Symposium on Theory of Computing (STOC), 2021. Also available on ECCC and arXiv. Journal version in IEEE Transactions on Information Theory, 2022. Factoring Polynomials over Finite Fields with Linear Galois Groups: An Additive Combinatorics Approach Zeyu Guo The 45th International Symposium on Mathematical Foundations of Computer Science (MFCS), 2020. Also available on arXiv. Improved Explicit Hitting-Sets for ROABPs Zeyu Guo and Rohit Gurjar The 24th International Workshop on Randomization and Computation (RANDOM), 2020. Derandomization from Algebraic Hardness Zeyu Guo, Mrinal Kumar, Ramprasad Saptharishi, and Noam Solomon SIAM Journal on Computing, 2022. Also available on ECCC and arXiv. An earlier version appears in the 60th Annual IEEE Symposium on Foundations of Computer Science (FOCS), 2019. Deterministic Polynomial Factoring over Finite Fields: A Uniform Approach via P-Schemes Zeyu Guo Journal of Symbolic Computation, 2020. Manuscript version. Algebraic Dependencies and PSPACE Algorithms in Approximative Complexity Zeyu Guo, Nitin Saxena, and Amit Sinhababu The 33rd Computational Complexity Conference (CCC), 2018. Journal version invited to and published in the CCC 2018 special issue of Theory of Computing. Also available on ECCC and arXiv. Algebraic Problems Equivalent to Beating Exponent 3/2 for Polynomial Factorization over Finite Fields Zeyu Guo, Anand Kumar Narayanan, and Chris Umans The 41st International Symposium on Mathematical Foundations of Computer Science (MFCS), 2016. Gossip vs. Markov Chains, and Randomness-Efficient Rumor Spreading Zeyu Guo and He Sun The 26th ACM-SIAM Symposium on Discrete Algorithms (SODA), 2015. Full version on arXiv. Randomness-Efficient Curve Samplers Zeyu Guo The 17th International Workshop on Randomization and Computation (RANDOM), 2013. Also available on ECCC. Minimum Manhattan Network is NP-Complete Francis Y. L. Chin, Zeyu Guo, and He Sun The 25th Annual Symposium on Computational Geometry (SoCG), 2009. Journal version in Discrete and Computational Geometry, 2011. Other Selected Publications by My Students Explicit Folded Reed-Solomon and Multiplicity Codes Achieve Relaxed Generalized Singleton Bounds Yeyuan Chen and Zihan Zhang STOC '25 Best Student Paper Award. The 57th Annual ACM Symposium on Theory of Computing (STOC), 2025. Also available on arXiv. AG Codes Achieve List-decoding Capacity over Constant-sized Fields Joshua Brakensiek, Manik Dhar, Sivakanth Gopi, and Zihan Zhang The 56th Annual ACM Symposium on Theory of Computing (STOC), 2024. Journal version in IEEE Transactions on Information Theory, 2025. Also available on arXiv. Teaching CSE 5329 – Intermediate Studies in Computation Theory: Error-Correcting Codes. Autumn 2025. CSE 6891 – Departmental Research Seminar (Guest Lecturer). Autumn 2025. CSE 6331 – Algorithms. Spring 2025. CSE 2331 – Foundations II: Data Structures and Algorithms. Autumn 2024. CSE 2331 – Foundations II: Data Structures and Algorithms. Autumn 2023. CSE 5329 – Intermediate Studies in Computation Theory: Algebraic Complexity Theory. Autumn 2023. Notes for the Course. CSE 6891 – Departmental Research Seminar (Guest Lecturer). Autumn 2023. CSE 6321 – Computability and Complexity. Spring 2023. Advising PhD students Zihan Zhang Anakin Dey (math) Postdocs Roshan Raj (incoming) Ashish Dwivedi (2023–2024) Contact Information zguotcs@gmail.com 487 Dreese Lab 2015 Neil Avenue Columbus, OH 43210-1277 Last updated on: November 21, 2025",
  "content_length": 7262,
  "method": "requests",
  "crawl_time": "2025-12-01 14:54:44"
}