{
  "name": "Zhanchuan Cai",
  "homepage": "https://fie.must.edu.mo/id-1444/person/view/id-11446.html",
  "status": "success",
  "content": "創新工程學院 - 學院團隊 - 教研團隊 蔡占川 院長/教授 所在部門： 計算機科學與工程學院 聯繫電話： 8897 2329 辦公室： A323 電子信箱： zccai@must.edu.mo Academic QualificationPh.D. in Computer Software and Theory, Sun Yat-sen University Teaching AreaComputer Language and ProgrammingFundamentals of advanced engineering mathematicsNumerical analysis Research AreaIntelligent Information ProcessingComputer Graphics and Image ProcessingMultimedia Information SecurityRemote Sensing Data Processing and AnalysisApplied Mathematics and Scientific Computing Working Experience2007 - 2008, Visiting Scholar, University of Nevada, Las Vegas, USA2008 - Feb 2022, Assistant Professor/ Associate Professor/ Professor, Faculty of Information Technology, Macau University of Science and Technology, Macau, ChinaMar 2022 - Present. Professor, School of Computer Science and Engineering, Faculty of Innovation Engineering, Macau University of Science and Technology, Macau, China Academic Publication (selected)1.          F.L. Sun, Z.C. Cai, A Family of Generalized Cardinal Polishing Splines, IEEE Transactions on Image Processing, 33: 1952-1964 (2024)2.          F.L. Sun, Z.C. Cai, Cubic Polishing Spline-Based Algorithms for Industrial Image Processing, IEEE Transactions on Industrial Informatics, 20(1): 314-326 (2024)3.          Y.Y. Chen, J.Y. Yuan, Z.C. Cai, ACCE: An Adaptive Color Compensation and Enhancement Algorithm for Underwater Image, IEEE Transactions on Geoscience and Remote Sensing, 62: 1-13 (2024)4.          Y. Guo, H. Wu, S.J. Yang, Z.C. Cai, Crater-DETR: A Novel Transformer Network for Crater Detection Based on Dense Supervision and Multiscale Fusion, IEEE Transactions on Geoscience and Remote Sensing, 62: 1-12 (2024)5.          J.Y. Yuan, Z.C. Cai, S.Y. Wang, X.X. Kong, A Multitype Feature Perception and Refined Network for Spaceborne Infrared Ship Detection, IEEE Transactions on Geoscience and Remote Sensing, 62: 1-11 (2024)6.          P.L. Lyu, J.Z. Liu, Y.H. Zhang, Y. Ben, T. Lan, L.P. Bai, Z.C. Cai, Z.H. Jiang, A Novel Feature Fusion Framework for Industrial Automation Single-Multiple Object Detection, IEEE Transactions on Industrial Informatics, 20(5): 7686-7697 (2024)7.          Y.H. Wang, B. Ye, Z.C. Cai, Dynamic Template Updating Using Spatial-temporal Information in Siamese Trackers, IEEE Transactions on Multimedia, 26: 2006-2015 (2024)8.          S.J. Yang, Z.C. Cai, Cross Domain Lifelong Learning Based on Task Similarity, IEEE Transactions on Pattern Analysis and Machine Intelligence, 45(10): 11612-11623 (2023)9.          R.Z. Chen, Z.C. Cai, UIESC: An Underwater Image Enhancement Framework via Self-attention and Contrastive Learning, IEEE Transactions on Industrial Informatics, 19(12): 11701-11711 (2023)10.      Y.L. Zhang, Z.C. Cai, CE-RetinaNet: A Channel Enhancement Method for Infrared Wildlife Detection in UAV Images, IEEE Transactions on Geoscience and Remote Sensing, 61(99):1-12(2023)11.      S.Y. Wang, Z.C. Cai, J.Y Yuan, Automatic SAR Ship Detection Based on Multifeature Fusion Network in Spatial and Frequency Domains, IEEE Transactions on Geoscience and Remote Sensing, 61: 1-11 (2023)12.      H.Q. Huang, Z.C. Cai, Duple Color Image Encryption System Based on 3-D Nonequilateral Arnold Transform for IIoT, IEEE Transactions on Industrial Informatics, 19(7): 8285-8294 (2023)13.      R.Z. Chen, Z.C. Cai, W. Cao, MFFN: An Underwater Sensing Scene Image Enhancement Method Based on Multiscale Feature Fusion Network, IEEE Transactions on Geoscience and Remote Sensing, 60: 1-12 (2022)14.      S.J. Yang, Z.C. Cai, High-Resolution Feature Pyramid Network for Automatic Crater Detection on Mars, IEEE Transactions on Geoscience and Remote Sensing, 60: 1-12 (2022)15.      S.J. Yang, Z.C. Cai, Progressive Domain Adaptive Network for Crater Detection, IEEE Transactions on Geoscience and Remote Sensing, 60: 1-12 (2022)16.      B. Ye, Z.C. Cai, T. Lan, W. Cao, Modeling of Crater Group Representation Based on V-System, IEEE Transactions on Geoscience and Remote Sensing, 60: 1-12 (2022)17.      J.Y. Yuan, Z.C. Cai, W. Cao, TEBCF: Real-World Underwater Image Texture Enhancement Model Based on Blurriness and Color Fusion, IEEE Transactions on Geoscience and Remote Sensing, 60: 1-15 (2022)18.      X.X. Yuan, Z.C. Cai, ICHV: A New Compression Approach for Industrial Images, IEEE Transactions on Industrial Informatics, 18(7): 4427-4435 (2022)19.      Y.M. Zhang, Z.C. Cai, B. Ye, An Image Importance Partition-Based Compression Method for COVID-19 Computed Tomography Scan, IEEE Transactions on Industrial Informatics, 18(7): 4596-4607 (2022)20.      T. Lan, Z.C. Cai, B. Ye, A Novel Spline Algorithm Applied to COVID-19 Computed Tomography Image Reconstruction, IEEE Transactions on Industrial Informatics, 18(11): 7804-7813 (2022)21.      X.X. Kong, Z.C. Cai, An Information Security Method Based on Optimized High-Fidelity Reversible Data Hiding, IEEE Transactions on Industrial Informatics, 18(12): 8529-8539 (2022)22.      T. Lan, Z.C. Cai, B. Ye, Modeling of Lunar Digital Terrain Entropy and Terrain Entropy Distribution Model, IEEE Transactions on Geoscience and Remote Sensing, 59(2): 1052-1066 (2021)23.      J.Y Yuan, W. Cao, Z.C. Cai, B.H. Su, An Underwater Image Vision Enhancement Algorithm Based on Contour Bougie Morphology, IEEE Transactions on Geoscience and Remote Sensing, 59(10): 8117-8128 (2021)24.      T. Lan, Z.C. Cai, Efficient Reconstruction of Industrial Images Using Optimized HMK Splines, IEEE Transactions on Industrial Informatics, 17(7): 4657-4668 (2021)25.      B. Ye, X.X. Yuan, Z.C. Cai, T. Lan, Severity Assessment of COVID-19 Based on Feature Extraction and V-Descriptors, IEEE Transactions on Industrial Informatics, 17(11): 7456-7467 (2021)26.      W.G. He, Z.C. Cai, Reversible Data Hiding Based on Dual Pairwise Prediction-Error Expansion, IEEE Transactions on Image Processing,30:5045-5055( 2021).27.      W.G. He, Z.C. Cai, and Y.M. Wang, High-fidelity Reversible Image Watermarking Based on Effective Prediction Error-Pairs Modification, IEEE Transactions on Multimedia, 23: 52-63 (2021)28.      Y.M. Zhang, Z.C. Cai, and G.Q.Xiong, A New Image Compression Algorithm Based on Non-uniform Partition and U-System, IEEE Transactions on Multimedia, 23: 1069-1082 (2021)29.      T. Lan, Z.C. Cai, A Novel Image Representation Method Under a Non-Standard Positional Numeral System, IEEE Transactions on Multimedia,23: 1301-1315 (2021)30.      Y.M. Wang, Z.C. Cai,W.G. He, High-Capacity Reversible Data Hiding in Encrypted Image Based on Intra-block Lossless Compression, IEEE Transactions on Multimedia, 23: 1466-1473 (2021)31.      Y.Q. Xiao, Z.C. Cai, X.X. Yuan, YuvConv: Multi-Scale Non-Uniform Convolution Structure Based on YUV Color Model, IEEE Transactions on Multimedia, 23: 2533-2544 (2021)32.      Q.Y. Huang, Z.C. Cai, T. Lan, A New Approach for Character Recognition of Multi-Style Vehicle License Plates, IEEE Transactions on Multimedia, 23: 3768-3777 (2021)33.      X.X. Yuan, Z.C. Cai, A Generalized Walsh System and Its Fast Algorithm, IEEE Transactions on Signal Processing, 69: 5222-5233 (2021)34.      W.G.He , Z.C. Cai, An Insight Into Pixel Value Ordering Prediction-Based Prediction-Error Expansion, IEEE Transactions on Information Forensics and Security,15:3859-3871(2020)35.      J.J. Chen, Z. C. Cai, A New Class of Explicit Interpolatory Splines and Related Measurement Estimation, IEEE Transactions on Signal Processing, 68:2799-2813(2020)36.      X.X. Yuan, Z.C. Cai, An Adaptive Triangular Partition Algorithm for Digital Images, IEEE Transactions on Multimedia, 21(6): 1372-1383(2019)37.      W. Cao, Z.C. Cai, B. Ye, Measuring Multiresolution Surface Roughness Using V-System, IEEE Transactions on Geoscience and Remote Sensing, 56(3): 1497-1506 (2018)38.      T. Lan, Z.C. Cai, Lunar Brightness Temperature Map and TB Distribution Model, IEEE Transactions on Geoscience and Remote Sensing, 56(12): 7310-7323 (2018)39.      Z.C. Cai, T. Lan, Lunar Brightness Temperature Model Based on the Microwave Radiometer Data of Chang’e-2, IEEE Transactions on Geoscience and Remote Sensing, 55(10): 5944-5955(2017)40.      Z.C. Cai, T. Lan, C.M. Zheng, Hierarchical MK Splines: Algorithm and Applications to Data Fitting, IEEE Transactions on Multimedia, 19(5): 921-934(2017) BooksZ.C. Cai, Fundamentals of Engineering Mathematics, Science Press, 2018, ISBN-13: 978-7030568632. (in Chinese)J. Huang, Z.C. Cai, K.Y. U, Y.Y. Liang, Local Interpolation Explicit Algorithm and Its Application, Science Press, 2016, ISBN-13:  978-7030462947.  (in Chinese) PatentsZ.C. Cai and T. Lan, Methods and Apparatus for Encrypting Multimedia Information, US patent, Grant No. 10635786 B2, April 2020.Z.C. Cai and W. Cao, Method for Improving Calculations of Surface Roughness, US patent, Grant No. 10580150 B2, March 2020.Z.C. Cai and T. Lan, Methods and Apparatus for Image Construction, US patent, Grant No. 10332279 B2, June 2019.Z.C. Cai, Methods and Apparatus for Color Image Watermarking, US patent, Grant No. 10296999 B2, May 2019.Z.C. Cai and W. Cao, Omnidirectional Roughness Algorithm for Topographic Signature Analysis of Lunar Craters,US patent, Grant No. 10354398 B2, July 2019.Z.C. Cai, Lunar Brightness Temperature Modeling Based on the Microwave Radiometer Data, US patent, Grant No. 10346565 B2, July 2019.Z.C. Cai, Computer System that Executes Hierarchical MK Splines Scheme for Scattered Data Interpolation, US patent, Grant No. 9990334 B2, June 2018.Z.C. Cai, B. Ye, T. Lan, and Y.Q. Xiao, Systems and Methods for Reducing Computer Resources Consumption to Reconstruct Shape of Multi-Object Image, US patent, Grant No. 10062187 B1, August 2018.Z.C. Cai and Z. Li, Image Stitching, US patent, Grant No. 9990753 B1, June 2018.Z.C. Cai, Color Image Watermarking, US patent, Grant No. 10037587 B2, July 2018.Z.C. Cai and T. Lan, Method for Coding Data, US patent, Grant No. 9755661 B1, September 2017. Professional Certification and AwardsSecond Prize of 2022 National Teaching Achievement Award,2023.Advanced Individual Award",
  "content_length": 12826,
  "method": "requests",
  "crawl_time": "2025-12-01 14:54:45"
}