{
  "name": "Zhanyang Zhang",
  "homepage": "http://www.cs.csi.cuny.edu/~zhangz",
  "status": "success",
  "content": "Professor Zhanyang Zhang's Homepage Dr. Zhanyang Zhang Department of Computer Science College of Staten Island The Graduate Center City University of New York 2800 Victory Blvd Staten Island, NY 10314 Office: 1N-206 (718) 982-3175 Zhanyang.zhang@csi.cuny.edu Teaching | Research | Publications | Presentations | Grants | Projects | Students | Short Bio | Links Teaching Spring 2022 : CSC430 - Software Engineering CSC799 - Graduate Thesis Study CSC893 - Graduate Independent Study COURSES TAUGHT at CSI/Graduate Center: Undergraduate Level: CSC126 - Introduction to Computer Science CSC211 - Intermediate Programming CSC223 - Computer Hacking Revealed CSC326 - Information Structures CSC346 - Switching and Automata Theory CSC347 - Digital Circuit Labs CSC424 - Database Management Systems CSC430 - Software Engineering CSC435 - Advance Data Communications CSC450 - Computer Science Honors Workshop CSC490 - Seminar in Computer Science Graduate Level: CSC710 - Software Engineering CSC713 - Advanced System Programming CSC715 - Database Theory CSC718 - Operating Systems CSC727 - Algorithm Analysis and Design CSC747 - Digital Signal Processing CSC754 - Topics in System Simulation CSC757 - Telecommunication Networks CSC762 - Fundamental Wireless Communications CSC799 - Master Thesis: Deep Learning in 5G Wireless Networks: Anomaly Detections CSC893 - Deep Learning for Audio Signal Processing in Music Applications CSC82100 - Wireless Communication and Mobile Computing (Graduate Center/CUNY) Research Interests Wireless Communication and networks Cyber-Physical Systems and IoT/Sensor Networks Numerical Modelling and Simulation Information Theory and Data Science High Performance and Cloud Computing Publications Books, Book Chapters and Journal Papers S. Chu, Z. Fang, S. Song, Z. Zhang, C. Gao and C. Xu, \"Efficient Multi-Channel Computation Offloading for Mobile Edge Computing: A Game-Theoretic Approach,\" in IEEE Transactions on Cloud Computing, 2020. S. Song, Z. Fang, Z. Zhang, C. Chen and H. Sun, \"Semi-Online Computational Offloading by Dueling Deep-Q Network for User Behavior Prediction,\" in IEEE Access, vol. 8, 2020. Martin Goldberg, Zhigang Zhu, Zhanyang Zhang, \"How do We Aid Visually Impaired People Safely Manage Unfamiliar Environments?\" Journal on Technology and Persons with Disabilities, Volume 6(30), 2018. Zhanyang Zhang, \"A Unified Framework toward Solving Sensor Localization, Coverage and Network Life Span Estimation Problems in Cyber Physical Systems.\" A chapter in the book of \"Cyber Physical Systems: From Theory to Practice,\" edited by Danda Rawat, Joel Rodrigues, Ivan Stojmenovic. Published by CRC press in October of 2015, page 417-436 Zhanyang Zhang, \"An Improved Delay-Tolerant Protocol for Underwater Wireless Sensor Networks.\" Journal of Science and Technology, Vietnam Academy of Science and Technology. 51 (1A), March 2013, pp. 1- 16. X. Zhang, Z. Zhang, X. Wei, 'An Improved Lightweight RFID Authentication Protocol'. International Journal of Applied Logistics, 2011, Volume 2, No.1. March, 2011. Pp.76-83. Zhanyang Zhang, \"A Cluster Based Approach Towards Sensor Localization, K-Coverage and Network Life Span Estimation Problems.\" Journal of Science and Technology, Vietnam Academy of Science and Technology, Special Issue on Electronics, Communications, and Information, 2010, Vol. 1, No. 1. Pp. 15-34. Zhanyang Zhang, Olga Berger, Shane Sorbello, \"A Cluster Based Approach Toward Sensor Localization and K-Coverage Problems\", Ubiquitous Computing and Communication Journal, Volume 2, Number 4, 2007. pp. 15 - 23. M. Tausner, Z. Zhang, and N. Bashias, \"Using Systemic Knowledge Engineering to Represent Complex Knowledge\", Systems Research, John Wiley, Vol. 12.2, July 1995. M. Tausner, N. Bashias, Z. Zhang, \"General System Problem Solving: A Basis for Systemic knowledge Engineering\". International Journal of General System, Special Issue on General System Problem Solving (GSPS), Gordon & Breach Science Publish, October, 1995. pp. 17-31. Zhanyang Zhang, \"Apple II and Programming in BASIC\". Textbook co-authored with Shujun Zhang, and Zhenjie Dai, Hebei University Press. Baoding, China. 1985. Conference Papers Z. Zhang, T. Sheafer, M. Kress, \"A Lattice Boltzmann Advection Diffusion Model for Ocean Oil Spill Surface Transport Prediction,\" Winter Simulation Conference 2020 (WSC2020), Virtual Conference, USA, December 14th-18th, 2020, pp. 680-691. M. Doan and Z. Zhang, \"Deep Learning in 5G Wireless Networks - Anomaly Detections,\" 29th Wireless and Optical Communications Conference (WOCC2020), Newark, NJ, USA, April 30th - May 1st, 2020. Z. Zhang, T. Sheafer and M. Kress, \"The Lattice Boltzmann Method for Ocean Oil Spill Propagation Modeling and Simulation—A Comparison Study of the Navier–Stokes Model and the Advection Diffusion Model.\" American Meteorology Society 100th Annual Meeting, January 12th-17th, 2020. Boston, USA. X. Dong, Z. Fang, H. Dong, Z. Zhang and D. Feng, \"Tree-Based Sentiment Dictionary for Affective Computing: A New Approach,\" 2018 IEEE 20th International Conference on High Performance Computing and Communications. Exeter, United Kingdom, 2018, pp. 1704-1709 M. Goldberg and Z. Zhang, \"A cyber-physical system framework towards smart city and urban computing to aid people with disabilities,\" 27th Wireless and Optical Communication Conference (WOCC2018), Hualien, Taiwan, April 28th-29th, 2018. Z. Zhang, L. Blanco, \"A Self Adaptive MAC Layer Protocol for Delay-Tolerant Underwater Sensor Networks\", the 23rd Wireless and Optical Communication Conference (WOCC 2014). Newark, New Jersey May 9-10, 2014. Z. Zhang, L. Blanco, \"A Cluster Based Smart MAC Layer Protocol for Delay- Tolerant Underwater Sensor Networks\". Proceeding of the 5th International Conference on Cyber-Enabled Distributed Computing and Knowledge Discovery (CyberC2013), IEEE CPS. Beijing, China, Oct. 10-12, 2013. Z. Zhang, \"A Improved Delay-Tolerant Protocol for Underwater Sensor Networks,\" Proceedings of 2013 International Conference of Wireless Networks (ICWN2013), CSREA press, pp. 85-91. Las Vegas, July 22-25, 2013. Z. Zhang, S. Lin, K. Sung, \"A Prediction-Based Delay Tolerant Protocol for Underwater Wireless Sensor Networks\". Proceeding of IEEE Wireless Communication and Signal Processing Conference (IEEE WCSP2010). Suzhou, China, October 11-23, 2010. Zhanyang Zhang, Miriam Tausner, \"Markov Process Modeling and Simulation for Wireless Sensor Network Life Estimation with QoS Constraints\". Proceeding of 2010 Summer Computer Simulation Conference (SCSC 2010). Ottawa, Canada, July 11-14, 2010. E. Chi, R. Klibaner, Z. Zhang, \"Assessment Using the Hierarchy Model with Feedback to Implement Quality Assurance in ODL\". Proceeding of AAOU 2010 Annual Conference. Hanoi, Vietnam. October 26-28, 2010. Xiaowen Zhang, Zhanyang Zhang, Xinzhou Wei, \"Enhancements to a Lightweight RFID Authentication Protocol.\"Proceeding of IEEE International Conference on e-Business Engineering (ICEBE2009). Macau, China, October 21-23, 2009, pp. 454-459. Z. Zhang, \"Towards Cluster Based Wireless Sensor Network Deployment Management and Network Coverage Verification\". Proceeding of the 11th IEEE Asia-Pacific Network Operations and Management Symposium (APNOMS 2008). Beijing, China. October 22-24, 2008. Zhanyang Zhang, Miriam Tausner, \"Using Markov Processes to Model Wireless Sensor Network Life Expectancy with Quality of Service Constraints\". Proceeding of the 11th IEEE Asia-Pacific Network Operations and Management Symposium (APNOMS 2008). Beijing, China. October 22-24, 2008. E. Chi, R. Klibaner, Z. Zhang, \"MOBIDEC: The Tablet PC as a Mobile Desktop for Distance Education\". Proceeding of the 22nd Asian Association of Open Universities (AAOU2008). Tianjin,China, October 14-16, 2008. Z. Zhang, O. Berger, \"Cluster Based Data Query Analysis and Optimization For Wireless Sensor Networks\". Proceeding of the 10th IEEE International Conference on Advanced Communication Technology (IEEE ICACT2008). Phoenix Park, Republic of Korea. Feb. 17-20, 2008. Z. Zhang, \"Using Sensors Sensibility Toward Sensor Localization and K-Coverage Problems\". Proceeding of the 6th IASTED International Conference on Communication Systems and Networks (IASTED CSN2007). Palma de Mallorca, Spain, August 29-31, 2007. Z.Zhang, S. Sorbello, A. Uribe, \"REBECCA: A Robust Cluster Based Energy Conservation and Coordination Protocol to Sustain Wireless Sensor network Life.\" Proceeding of the 2007 International Conference on Wireless Networks (ICWN2007). Las Vegas, June 25-28, 2007, pp 110-117. E. Chi, Z. Zhang, R. Klibaner, \"A Hierarchy Model of Assessment to Improve Quality and Cost-Effectiveness of ODL.\" The 20th Annual Conference on Open and Distance Learning, Asian Association of Open Universities (AAOU). Kunming, China, October 11-14, 2006. Z. Zhang. \"A Robust Energy Efficient Query Protocol for Spatial Data in Wireless Sensor Networks.\" Proceeding of the 2006 International Conference on Pervasive Systems and Computing (PSC2006), Las Vegas, June 26-29, 2006, pp 61-70. Z. Zhang, Emile Chi, Roberta Klibaner. \"A Hierarchy Model of Assessment for Curriculum Improvement.\" Proceeding of the 2006 International Conference on Frontiers in Education: Computer Science and Computer Engineering (FECS2006), Las Vegas, June 26-29, 2006, pp. 277-283. Z. Zhang, G. Zheng. \"A Cluster Based Query Protocol for Wireless Sensor Networks\". Proceeding of the 8th IEEE International Conference on Advanced Communication Technology (ICACT2006), Phoenix Park, Republic of Korea, February 20-22, 2006, pp. 140-145. Z. Zhang, W. J. Gavin. \"A Cluster based Feedback Model for Sensor Deployment Management and Coverage Verification in Wireless Sensor Network Applications\". Proceeding of the 2005 International Conference on Wireless Networks. Las Vegas, USA. June 27-30, 2005. pp. 441-447. Z. Zhang, W. J. Gavin. \"Using Stimulation Signal to Locate Sensor Clusters\". Proceeding of the 11th European Wireless Conference. Nicosia, Cyprus. April 10-13, 2005, pp. 719-724. E",
  "content_length": 14612,
  "method": "requests",
  "crawl_time": "2025-12-01 14:54:48"
}