{
  "name": "Zhaolin Chen",
  "homepage": "https://research.monash.edu/en/persons/zhaolin-chen",
  "status": "success",
  "content": "Zhaolin Chen - Monash University View Scopus Profile Zhaolin Chen Assoc Professor Associate Professor (Research), Department of Data Science & AIVictorian Heart Institute (VHI) https://orcid.org/0000-0002-0173-6090 EmailZhaolin.Chenmonashedu Accepting PhD Students 20052025 Research activity per year Personal profile BiographyDr Zhaolin Chen is currently an Associate Professor at the Department of Data Science and AI, Faculty of Information Technology, Monash University, Australia. He completed his PhD in the Biomedical Imaging field at the Faculty of Engineering, Monash University. His PhD work was awarded the ‘Douglas Lampard Research Prize and Medal’. He was then Research Fellow at the University of Melbourne and Florey Neuroscience Institutes, and a staff scientist in the medical imaging device industry in Europe. Dr Chen is currently an Australian Research Council MCR Industry Fellow, and he has led the establishment of the first Australian Point of Care MRI network at National Imaging Facility. He provides leadership at Monash Biomedical Imaging in image analysis. He was Associate Editor for IEEE International Symposium on Biomedical Imaging (ISBI) 2022 and 2023 conferences, a program committee member for the International Society for Magnetic Resonance in Medicine (ISMRM) (’18-‘21), previously a co-organiser of ISMRM-MICCAI workshops. Dr Chen has an internationally recognised track record of achievement and research outputs with real-world impacts - He is the author & co-author of more than 100 peer reviewed publications/books/book chapters with recent publications in Nature Machine Intelligence, EJNMMI, NeuroImage, Medical Image Analysis, Brain, IEEE TNNLS, MRM, JMRI. According to SciVal 2021, 90% of his publications are in the top 10% of journals across all disciplines. He has five papers in the top 10% most cited in 2021 worldwide. Furthermore, he has made translational impacts with ten patents, five of which are commercialised in the current generation of medical imaging devices. He was a Network Expert for the US FDA (’20-‘21). Dr Chen has secured over $8M in research funding and he holds leadership roles in major projects - five as Primary Chief Investigator out of total seven current projects; ~70% of total funding received as Primary Chief Investigator, including ARC Discovery Project 'Biophysics-informed deep learning framework for magnetic resonance imaging'. Dr Chen is dedicated to the supervision and mentorship of PhD candidates and junior academics - his PhD students have been awarded Cum Laude at ISMRM, won Visualised Your Thesis challenge at Monash, prestigious university level best PhD thesis award, international MICCAI challenge winner, and highly competitive VBIC Early Career Award.Research interestsMachine learning and deep learning-based medical imaging Methods development including acquisition and reconstruction for Magnetic Resonance Imaging and Positron Emission TomographyMultimodal imaging and data analysis including simultaneous MR-PETSupervision interestsAccepting PhD students in the above research areas. I currently have scholarships and top-ups available.Community servicePresident Elect, ANZ Chapter, International Society for Magnetic Resoance in Medicine, 2024 - Area Chair, IEEE International Symposium on Biomedical Imaging, 2021 - Program committee, International Society for Magnetic Resoance in Medicine, 2018 - 2020 Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Projects Projects per year 2016 2016 2018 2019 2022 2024 2025 2028 3 Active 4 Finished Projects per year ASPIRE: ASPIRE – A new scalable and sustainable platform to improve survivorship care for assault victims living with severe physical and psychological deficitsCaeyensberghs, K. (Primary Chief Investigator (PCI)), Domínguez, J. (Chief Investigator (CI)), Berk, M. (Chief Investigator (CI)), Satyen, L. (Chief Investigator (CI)), Chen, Z. (Chief Investigator (CI)), Law, M. (Chief Investigator (CI)), Fitzgerald, M. (Chief Investigator (CI)), Hellewell, S. C. (Chief Investigator (CI)), Parizel, P. M. (Chief Investigator (CI)), Mychasiuk, R. (Chief Investigator (CI)), McMahon, K. (Chief Investigator (CI)), Akhlaghi, H. (Chief Investigator (CI)), Stella, J. B. (Chief Investigator (CI)), Gates, P. (Chief Investigator (CI)), Lee, J. (Chief Investigator (CI)), Burmester, A. (Associate Investigator (AI)), Rushworth, N. (Associate Investigator (AI)), Dwyer, A. (Associate Investigator (AI)), Brotchie, P. (Associate Investigator (AI)), Smyth, T. (Associate Investigator (AI)), Lannin, N. (Associate Investigator (AI)), Orellana, L. (Associate Investigator (AI)), Islam, K. T. (Associate Investigator (AI)), Schubach, R. (Associate Investigator (AI)), Hollow, T. (Associate Investigator (AI)), Hinton, D. (Associate Investigator (AI)) & Farquharson, S. (Associate Investigator (AI))1/10/25 → 30/09/28Project: Research Development of multi-modal biomedical imaging using AI: Artificial intelligence empowered multi-modal biomedical imagingChen, Z. (Primary Chief Investigator (PCI))ARC - Australian Research Council1/02/24 → 31/01/28Project: Research Biophysics-informed deep learning framework for magnetic resonance imagingChen, Z. (Primary Chief Investigator (PCI)), Egan, G. (Chief Investigator (CI)), Law, M. (Chief Investigator (CI)) & Shah, N. (Partner Investigator (PI))1/01/22 → 31/12/25Project: Research National Mobile Magnetic Resonance Imaging Network Chen, Z. (Primary Chief Investigator (PCI)), Egan, G. (Chief Investigator (CI)), Pawar, K. (Chief Investigator (CI)), Zhong, S. (Chief Investigator (CI)), Morris, A. (Chief Investigator (CI)), Barth, M. (Chief Investigator (CI)), Dwyer, A. (Chief Investigator (CI)), Verjans, J. W. (Chief Investigator (CI)), Law, M. (Chief Investigator (CI)) & Parizel, P. M. (Chief Investigator (CI))Hyperfine Inc, University of Queensland , Alfred Hospital, Australian Stroke Alliance Limited, Monash University – Internal University Contribution1/01/22 → 30/06/23Project: Research Integrative brain imaging technologiesEgan, G. (Primary Chief Investigator (PCI)), Jamadar, S. (Chief Investigator (CI)), Chen, Z. (Chief Investigator (CI)), Premaratne, M. (Chief Investigator (CI)), Fornito, A. (Chief Investigator (CI)) & Shah, J. (Partner Investigator (PI))17/01/19 → 31/12/22Project: Research View all 7 projects Research output Research output per year 2005 2018 2019 2020 2021 2022 2024 2025 2025 45 Article 35 Conference Paper 14 Abstract 6 Review Article 9 More 3 Dataset / Database 2 Poster 2 Comment / Debate 1 Meeting Abstract 1 Editorial Research output per year Research output per year AI improves consistency in regional brain volumes measured in ultra-low-field MRI and 3T MRIIslam, K. T., Zhong, S., Zakavi, P., Kavnoudias, H., Farquharson, S., Durbridge, G., Barth, M., Dwyer, A., McMahon, K. L., Parizel, P. M., McIntyre, R., Egan, G. F., Law, M. & Chen, Z., 2025, In: Frontiers in Neuroimaging. 4, 14 p., 1588487.Research output: Contribution to journal › Article › Research › peer-review Open AccessFile 2 Citations (Scopus) Bilateral Hippocampi Segmentation in Low Field MRIs Using Mutual Feature Learning via Dual-ViewsPeiris, H. & Chen, Z., 2025, Low Field Pediatric Brain Magnetic Resonance Image Segmentation and Quality Assurance - First MICCAI Challenge, LISA 2024 Held in Conjunction with MICCAI 2024 Marrakesh, Morocco, October 10, 2024 Proceedings . Lepore, N. & Linguraru, M. G. (eds.). Cham Switzerland: Springer, p. 15-27 13 p. (Lecture Notes in Computer Science; vol. 15515).Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review Open AccessFile CL-MRI: self-supervised contrastive learning to improve the accuracy of undersampled MRI reconstructionEkanayake, M., Chen, Z., Harandi, M., Egan, G. & Chen, Z., Feb 2025, In: Biomedical Signal Processing and Control. 100, 12 p., 107185.Research output: Contribution to journal › Article › Research › peer-review Open AccessFile 5 Citations (Scopus) Co-Manifold learning for semi-supervised medical image segmentationPeiris, H., Chen, Z., Egan, G. & Harandi, M., 28 Jul 2025, In: Neurocomputing. 639, 14 p., 130208.Research output: Contribution to journal › Article › Research › peer-review Open AccessFile 2 Citations (Scopus) Correction to: PixCUE: Joint Uncertainty Estimation and Image Reconstruction in MRI using Deep Pixel Classification (Journal of Imaging Informatics in Medicine, (2024), 10.1007/s10278-024-01250-3)Ekanayake, M., Pawar, K., Chen, Z., Egan, G. & Chen, Z., 2025, (Accepted/In press) In: Journal of Imaging Informatics in Medicine. 1 p.Research output: Contribution to journal › Comment / Debate › Other › peer-review View all 109 research outputs Prizes Committee memberChen, Z. (Recipient), 2018Prize: Election to learned society ISMRM Magna Cum Laude Chen, Z. (Recipient), 2018Prize: Prize (including medals and awards) ISMRM Magna Cum Laude Chen, Z. (Recipient), 2020Prize: Prize (including medals and awards) The Douglas Lampard Research Prize and MedalChen, Z. (Recipient), 2007Prize: Prize (including medals and awards) WFNMB Best Poster Finalist Chen, Z. (Recipient), 2018Prize: Prize (including medals and awards) Activities Activities per year 2008 2016 2018 2019 2022 10 Patents 2 Editorial responsibility 1 Contribution to conference 1 Committees and working groups Activities per year Associate Editor - IEEE ISBIChen, Z. (Fellow)2022 → ",
  "content_length": 11044,
  "method": "requests",
  "crawl_time": "2025-12-01 14:54:49"
}