{
  "name": "Zhaozheng Yin",
  "homepage": "https://www3.cs.stonybrook.edu/~zyin/index.htm",
  "status": "success",
  "content": "Zhaozheng Yin Zhaozheng Yin SUNY Empire Innovation Associate Professor Computer Vision Lab AI Institute Department of Computer Science Department of Biomedical Informatics Contact: Office: 2313B Computer Science Building Phone: 631-632-2592 (O) Email: zyin AT cs DOT stonybrook DOT edu [Students] [Publication]        [Teaching]        [Service]        [Bio] Openings: I am looking for talented graduate students to join my research group in fall 2026 to work in the fields of Computer Vision, Machine Learning, Biomedical Image Analysis, and Human Robot Collaboration. News: ·       September 2025: Congratulations for the recent paper acceptances: Ø  Hritam Basak: “VisPLA: Visual Iterative Self-Prompting for Language-Guided 3D Affordance Learning,” the 39th Annual Conference on Neural Information Processing Systems (NeurIPS), 2025 Ø  Hritam Basak: “D^4Recon: Dual-stage Deformation and Dual-scale Depth Guidance for Endoscopic Reconstruction,” the 28th International Conference on Medical Image Computing and Computer Assisted Intervention (MICCAI), 2025. Ø  Jignesh Gutta: “RANDose: A Region-aware Attention Network for Accurate Radiation Dose Prediction,” the 28th International Conference on Medical Image Computing and Computer Assisted Intervention (MICCAI), 2025. Ø  Hritam Basak, “Enhancing Single Image to 3D Generation using Gaussian Splatting and Hybrid Diffusion Priors,” IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS), 2025. Ø  Jianxiang Dong: “Annotation-efficient Hybrid Learning for Temporal Sentence Grounding,” IEEE Transactions on Circuits and Systems for Video Technology (TCSVT). 2025. Ø  Jianxiang Dong: “Weakly Semi-supervised Temporal Sentence Grounding in Videos with Point Annotations,\" IEEE Transactions on Multimedia (TMM). 2025. ·       February 2025: Congratulations for the paper acceptances: Ø   Hritam Basak: “SemiDAViL: Semi-supervised Domain Adaptation with Vision-Language Guidance for Semantic Segmentation,” CVPR. Ø  Yuanhao Zou (a volunteer master researcher from U-Michigan), “Alignment, Mining and Fusion: Representation Alignment with Hard Negative Mining and Selective Knowledge Fusion for Medical Visual Question Answering,” CVPR. Ø  Jianxiang Dong: “Graph-based Dense Event Grounding with Relative Positional Encoding,” Computer Vision and Image Understanding (CVIU). ·       January 2025: Yin will be an Area Chair of ICCV2025 and MICCAI2025. ·       October 2024: Congratulations to Md Moniruzzaman on a successful PhD defense! He will be the founding AI Research Scientist of a startup working on generative AI at Silicon Valley. ·       October 2024: Congratulations to the group members for the recent paper acceptances: Ø  Md Moniruzzaman: “Progressive Knowledge Distillation from Different Levels of Teachers for Online Action Detection,” IEEE Transactions on Multimedia (TMM). Ø  Jamalia Sultana: “Seeing Through Expert’s Eyes: Leveraging Radiologist Eye Gaze and Speech Report with Graph Neural Networks for Chest X-ray Image Classification,” Asian Conference on Computer Vision (ACCV). Ø  Chenyu Zhang: “Weakly-supervised Structural Component Segmentation via Scribble Annotation,” Computer-Aided Civil and Infrastructure Engineering. ·       August 2024: Welcome new PhD students, Rishav Pramanik and Zikai Liao, joining our group. ·       July 2024: Congratulations to the group members for the recent paper acceptances: Ø  Hritam Basak: “Domain-specific Feature Unlearning for Semi-supervised and Unsupervised Domain Adaptation,” ECCV. Ø  Hritam Basak: “Quest for Clone: Test-time Domain Adaptation for Medical Image Segmentation by Searching the Closest Clone in Latent Space,” MICCAI. Ø  Jignesh Gutta: “Med-Former: A Transformer based Architecture for Medical Image Classification,” MICCAI. Ø  Chenyu Zhang: “Attention-Enhanced Co-Interactive Fusion Network (AECIF-Net) for Automated Structural Condition Assessment in Visual Inspection,” Automation in Construction. Ø  Jianxiang Dong: “Bragg Spot Finder (BSF): A New Machine-Learning Aided Approach to Deal with Spot Finding for Rapidly Filtering Diffraction Pattern Images,” Journal of Applied Crystallography. Ø  Hritam Basak: “Fusion of Radiomics and Deep-learning Features for Improved Myocardial Scar Identification for Hypertrophic Cardiomyopathy from CINE Images,” Journal of Cardiovascular Magnetic Resonance. ·       February 2024: Yin will be an Area Chair of MICCAI 2024. ·       November 2023: congratulations to Roshan Kenia on his paper “Robust TRISO-Fueled Pebble Identification by Digit Recognition” being accepted by WACV. ·       August 2023: Ø Welcome new PhD students, Shreya Biswas and Jamalia Sultana, joining our group! Ø Congratulations to Md Moniruzzaman on his paper “Wearable Motion Capture: Reconstructing and Predicting 3D Human Poses from Wearable Sensors” being accepted by IEEE Journal of Biomedical and Health Informatics (J-BHI)! Ø Our project on human pose analysis and walking environment analysis via wearable sensors was funded by NSF (2023-2027)! ·       June 2023: Ø Congratulations to Monjurul on his PhD defense! He will join University of Washington as a Postdoc. Ø Congratulations to Liang Han to join HIT-Shenzhen as an Assistance Professor. ·       May 2023: congratulations to Roshan Kenia wining Researchers of the Month from Undergraduate Research & Creativity Activities program at Stony Brook University, as a graduating senior. Roshan will pursue his MS degree in Computer Science at Columbia University in fall 2023. ·       May 2023: Congratulations to the group members for the recent paper acceptances: Ø  Hritam Basak: “Semi-supervised Domain Adaptive Medical Image Segmentation through Consistency Regularized Disentangled Contrastive Learning,” MICCAI. Ø  Jignesh Gutta: “Diffusion Transformer U-Net for Medical Image Segmentation,” MICCAI. Ø  Muhamad Monjurul Karim: “An Attention-guided Multistream Feature Fusion Network for Early Localization of Risky Traffic Agents in Driving Videos,” IEEE Transactions on Intelligent Vehicles (TIV). Ø  Md Moniruzzaman: “Collaborative Foreground, Background, and Action Modeling Network for Weakly Supervised Temporal Action Localization,” IEEE Transactions on Circuits and Systems for Video Technology (TCSVT). Ø  Md Moniruzzaman: “Feature Weakening, Contextualization, and Discrimination for Weakly Supervised Temporal Action Localization,” IEEE Transactions on Multimedia (TMM). ·       March 2023: Congratulations to the group members for the recent paper acceptances: Ø  Hritam Basak: “Pseudo-label Guided Contrastive Learning for Semi-supervised Medical Image Segmentation,” CVPR. Ø  Md Moniruzzaman: “Jointly-Learnt Networks for Future Action Anticipation via Self-Knowledge Distillation and Cycle Consistency,” IEEE Transactions on Circuits and Systems for Video Technology (TCSVT). Ø  Liang Han: “Phase Contrast Image Restoration by Mathematically Formulating Its Imaging Principle and Reversing the Formulation with Deep Neural Networks,” IEEE Transactions on Medical Imaging (TMI). ·       Sep 2022: Congratulations to the group members for the recent paper acceptances: Ø Jianxiang Dong: “Boundary-aware Temporal Sentence Grounding with Adaptive Proposal Refinement,” ACCV. Ø Liang Han: “Global Memory and Local Continuity for Video Object Detection,” IEEE Transactions on Multimedia (TMM). Ø Muhammad Monjurul Karim: “Dynamic Spatial-temporal Attention Network for Early Anticipation of Traffic Accidents,\" IEEE Transactions on Intelligent Transportation Systems (ITS). ·       August 2022: Congratulations to Liang for his PhD defense! He will continue in our lab as a Postdoc Fellow. ·       August 2022: Welcome new Ph.D. students, Hritam Basak and Jignesh Gutta, joining our group! Archived News.",
  "content_length": 7757,
  "method": "requests",
  "crawl_time": "2025-12-01 14:54:50"
}