{
  "name": "Zhaofei Yu",
  "homepage": "https://yuzhaofei.github.io",
  "status": "success",
  "content": "Zhaofei Yu Zhaofei Yu Assistant Professor School of Artificial Intelligence National Engineering Research Center of Visual Technology Peking University Beijing, China. 100871. Office: Room 2728, Science 2 Buildings Email: yuzf12 αt pku dοt edu dοt cn Biography I'm an Assistant Professor of the School of Artificial Intelligence at Peking University, and I am heading the Brain-inspired Vision Lab. I received the B.S. degree from the Hong Shen Honors School, College of Optoelectronic Engineering, Chongqing University, China, in 2012 and the Ph.D. degree from the Automation Department, Tsinghua University, China, in 2017. From Sep. 2015 to Sep. 2016, I visited Prof. Wolfgang Maass's group at Graz University of Technology as a visiting student. Research Interests My research interests cover biological and computer vision, neuromorphic computation, and computational neuroscience. I am interested in learning and inference of spiking neural networks, and vision information processing based on neuromorphic visual sensors. I am also interested in extracting meaningful information embedded in high-dimensional neuroscience data and explaining how the visual system implements encoding and decoding. Opening We are looking for highly motivated students to join our group. Our group has opening positions for Ph.D. and Undergraduate Internship. If you are interested in researching on brain-like computing, please send me an email with your CV. We are hiring highly motivated postdocs to join our group through the Boya Postdoctoral Fellowship at Peking University. Please send an email with your CV and Research Statement. News [2023.03] One paper was accepted by CVPR 2023. Congratulations to Tong Bu! [2023.01] Two papers were accepted by ICLR 2023. Congratulations to Yanqi and Zecheng! [2023.01] One paper was accepted by IEEE Transactions on Pattern Analysis and Machine Intelligence. Congratulations to Yajing! [2022.11] Three papers were accepted by AAAI 2023. Congratulations to Zecheng, Jiyuan, Shanshan, and Shiyan! [2022.10] One paper was accepted by IEEE Transactions on Image Processing. Congratulations to Yajing! [2022.09] Congratulate Shanshan Jia for the National Scholarship! [2022.09] Four papers were accepted by NeurIPS 2022. Congratulations to Jianhao, Yaoyu, Chaoteng, Rui Zhao, Tong Bu, and Wei Fang! [2022.07] One paper was accepted by ECCV 2022. Congratulations to Jiyuan! [2022.07] Congratulate Tong Bu for \"Top Ten Best Undergraduate Thesis\"! [2022.05] One paper was accepted by ICML 2022. Congratulations to Yanqi! [2022.04] One paper was accepted by IJCAI 2022. Congratulations to Shiyan! [2022.01] One paper was accepted by ICASSP 2022. Congratulations to Junwei! [2022.01] One paper was accepted by ICLR 2022. Congratulations to Bu Tong! [2022.01] One paper on Vidar camera was accepted by Engineering! [2021.12] One paper was accepted by Neural Computation. Congratulations to Yijun! [2021.12] One paper was accepted by IEEE Transactions on Computational Imaging. Congratulations to Zhao Jing! [2021.12] One paper on the dimensionality reduction of neural spikes was accepted by Cell Patterns! Congratulations to Shanshan! [2021.12] Two papers were accepted by AAAI 2022. Congratulations to Ding Gang and Bu Tong! [2021.11] One paper on dissecting dynamical circuits of the brain was accepted by PLOS Computational Biology! Congratulations to Shanshan! [2021.09] One paper on learning of SNNs was accepted by NeurIPS 2021. Congratulations to Fang Wei! [2021.08] One paper on visual neural coding was accepted by Cell patterns! Congratulations to Yajing! [2021.07] Two papers were accepted by ICCV 2021. Congratulations to Fang Wei and Zhao Jing! [2021.04] Two papers were accepted by IJCAI 2021. Congratulations to Jianhao and Yanqi! [2021.03] One paper was accepted by CVPR 2021. Congratulations to Yajing! [2021.01] One papers was accepted by IEEE Transactions on Cybernetics. Congratulations to Shanshan! Publications In press 2023 Capture the Moment: High-speed Imaging with Spiking Cameras through Short-term Plasticity Yajing Zheng, Lingxiao Zheng, Zhaofei Yu*, Tiejun Huang, Song Wang IEEE Transactions on Pattern Analysis and Machine Intelligence [pdf] 1000× Faster Camera and Machine Vision with Ordinary Devices Tiejun Huang, Yajing Zheng, Zhaofei Yu*, Rui Chen, Yuan Li, Ruiqin Xiong, Lei Ma, Junwei Zhao, Siwei Dong, Lin Zhu, Jianing Li, Shanshan Jia, Yihua Fu, Boxin Shi, Si Wu, and Yonghong Tian Engineering [pdf] Spike-Based Motion Estimation for Object Tracking Through Bio-Inspired Unsupervised Learning Yajing Zheng, Zhaofei Yu*, Song Wang, Tiejun Huang IEEE Transactions on Image Processing [pdf] Asynchronous Spatiotemporal Spike Metric for Event Cameras Jianing Li, Yihua Fu, Siwei Dong, Zhaofei Yu, Tiejun Huang, Yonghong Tian* IEEE Transactions on Neural Networks and Learning Systems [pdf] Deep Spike Learning with Local Classifiers Chenxiang Ma, Rui Yan, Zhaofei Yu, Qiang Yu IEEE Transactions on Cybernetics [pdf] Spike Calibration: Bridging the Gap between ANNs and SNNs in ANN-SNN Conversion Zecheng Hao, Jianhao Ding, Tong Bu, Tiejun Huang, Zhaofei Yu* ICLR [pdf] A Unified Framework of Soft Threshold Pruning Yanqi Chen, Zhaofei Yu, Wei Fang, Zhengyu Ma, Xiawu Zheng, Yonghong Tian* ICLR [pdf] Reducing ANN-SNN Conversion Error through Residual Membrane Potential Zecheng Hao, Tong Bu, Jianhao Ding, Tiejun Huang, Zhaofei Yu* AAAI (oral) [pdf] Learning Temporal-ordered Representation for Spike Streams Based on Discrete Wavelet Transforms Jiyuan Zhang†, Shanshan Jia†, Zhaofei Yu*, Tiejun Huang AAAI [pdf] Self-Supervised Joint Dynamic Scene Reconstruction and Optical Flow Estimation for Spiking Camera Shiyan Chen, Zhaofei Yu*, Tiejun Huang AAAI [pdf] 2022 Zooming in on the Brain via Data Science Shanshan Jia, Zhaofei Yu* Cell Patterns [pdf] Representing the Dynamics of High-Dimensional Data with Non-Redundant Wavelets Shanshan Jia, Xingyi Li, Tiejun Huang, Jian K. Liu*, Zhaofei Yu* Cell Patterns [pdf] [code] Decoding Pixel-Level Image Features from Two-Photon Calcium Signals of Macaque Visual Cortex Yijun Zhang, Tong Bu, Jiyuan Zhang, Shiming Tang, Zhaofei Yu*, Jian K. Liu, Tiejun Huang Neural Computation [pdf] Revealing Fine Structures of the Retinal Receptive Field by Deep Learning Networks Qi Yan†, Yajing Zheng†, Shanshan Jia, Zhaofei Yu*, Feng Chen, Yonghong Tian, Tiejun Huang, Jian K. Liu* IEEE Transactions on Cybernetics [pdf] Reconstructing Clear Image for High-Speed Motion Scene With a Retina-Inspired Spike Camera Jing Zhao, Ruiqin Xiong*, Jiyu Xie, Boxin Shi, Zhaofei Yu, Wen Gao, Tiejun Huang IEEE Transactions on Computational Imaging [pdf] Neural System Identification with Spike-Triggered Non-Negative Matrix Factorization Shanshan Jia, Zhaofei Yu*, Arno Onken, Yonghong Tian, Tiejun Huang, Jian K. Liu* IEEE Transactions on Cybernetics [pdf] A Probabilistic Approach for Cooperative Computation Offloading in MEC-Assisted Vehicular Networks Penglin Dai, Kaiwen Hu, Xiao Wu, Huanlai Xing, Fei Teng, Zhaofei Yu IEEE Transactions on Intelligent Transportation Systems [pdf] Neural Decoding of Visual Information Across Different Neural Recording Modalities and Approaches Yijun Zhang, Zhaofei Yu*, Jian K. Liu, Tiejun Huang Machine Intelligence Research [pdf] SNN-RAT: Robustness-enhanced Spiking Neural Network through Regularized Adversarial Jianhao Ding, Tong Bu, Zhaofei Yu*, Jian K. Liu, Tiejun Huang NeurIPS (Spotlight) [pdf] [code] Training Spiking Neural Networks with Event-driven Backpropagation Yaoyu Zhu, Zhaofei Yu*, Wei Fang, Xiaodong Xie, Tiejun Huang, Timothée Masquelier NeurIPS (Spotlight) [pdf][code] Temporal Effective Batch Normalization in Spiking Neural Networks Chaoteng Duan†, Jianhao Ding†, Shiyan Chen, Zhaofei Yu*, Tiejun Huang NeurIPS [pdf] Learning Optical Flow From Continuous Spike Streams Rui Zhao, Ruiqin Xiong*, Jing Zhao, Zhaofei Yu, Xiaopeng Fan, Tiejun Huang NeurIPS [pdf] [code] Spike Transformer: Monocular Depth Estimation for Spiking Camera Jiyuan Zhang, Lulu Tang, Zhaofei Yu*, Jiwen Lu, Tiejun Huang ECCV [pdf] State Transition of Dendritic Spines Improves Learning of Sparse Spiking Neural Networks Yanqi Chen, Zhaofei Yu*, Wei Fang, Zhengyu Ma, Tiejun Huang, Yonghong Tian* ICML [pdf] Self-Supervised Mutual Learning for Dynamic Scene Reconstruction of Spiking Camera Shiyan Chen, Chaoteng Duan, Zhaofei Yu*, Ruiqin Xiong, Tiejun Huang IJCAI [pdf] SpikingSIM: A Bio-Inspired Spiking Simulator Junwei Zhao, Shiliang Zhang, Lei Ma, Zhaofei Yu, Tiejun Huang ISCAS [pdf] Modeling the Detection Capability of High-Speed Spiking Cameras Junwei Zhao, Zhaofei Yu*, Lei Ma*, Ziluo Ding, Shiliang Zhang, Yonghong Tian, Tiejun Huang ICASSP [pdf] Optimal ANN-SNN Conversion for High-accuracy and Ultra-low-latency Spiking Neural Networks Tong Bu, Wei Fang, Jianhao Ding, Penglin Dai, Zhaofei Yu*, Tiejun Huang ICLR [pdf] Spatio-Temporal Recurrent Networks for Event-Based Optical Flow Estimation Ziluo Ding, Rui Zhao, Jiyuan Zhang, Tianxiao Gao, Ruiqin Xiong, Zhaofei Yu*, Tiejun Huang AAAI [pdf] Optimized Potential Initialization for Low-latency Spiking Neural Networks Tong Bu, Jianhao Ding, Zhaofei Yu*, Tiejun Huang AAAI [pdf] 2021 Dissecting Cascade Computational Components in Spiking Neural Networks Shanshan Jia, Dajun Xing, Zhaofei Yu*, Jian K. Liu* PLoS Computational Biology [pdf] Unraveling Neural Coding of Dynamic Natural Visual Scenes via Convolutional Recurrent Neural Networks Yajing Zheng, Shanshan Jia, Zhaofei Yu*, Jian K. Liu*, Tiejun Huang Cell Patterns [pdf] Deep Residual Learning in Spiking Neural Networks Wei Fang, Zhaofei Yu*, Yanqi Chen, Tiejun Huang, Timothee Masquelier, Yonghong Tian* NeurIPS [pdf] Incorporating Learnable Membrane Time Constant to Enhance Learning of Spiking Neural Networks Wei Fang, Zhaofei Yu*, Yanqi Chen, Timothee Masquelier, Tiejun Huang, Yonghong Tian* ICCV [pdf] Super Resolve Dynamic Scene From Continuous Spike Streams Jing Zhao, Jiyu Xie, Ruiqin Xiong*, Jian Zhang, Zhaofei Yu, Tiejun Huang ICCV [pdf] Opt",
  "content_length": 12838,
  "method": "requests",
  "crawl_time": "2025-12-01 14:54:48"
}