{
  "name": "Zhao Han",
  "homepage": "https://zhaohanphd.com",
  "status": "success",
  "content": "Zhao Han - HRI, AR, AI - University of South Florida Skip to content Human-Robot Interaction (HRI) · AI · Augmented Reality (AR) · Robotics Developing capable robotic systems & understandable robot interactions *Shown is a mobile manipulation testbed to evaluate my research Meet Zhao Han he/him · /’jau̇-‘hän/ · 韩昭 Zhao Han is an Assistant Professor in the Bellini College of Artificial Intelligence, Cybersecurity and Computing at the University of South Florida (USF). He leads the Reality, Autonomy, and Robot Experience (RARE) Lab. Conducting interdisciplinary and collaborative research, Dr. Han also co-directs the USF Human-Centered AI and Robotics Consortium (HARC) and is affiliated with the Center for Innovation, Technology, and Aging (CITA) and the Center for Biological and Food Innovations in AI and Robotics for Children’s Nutrition and Health (Bio-FAIRCH) at USF. Dr. Han’s research lies broadly in human-robot interaction (HRI), AI, augmented reality (AR), and robotics. He focuses on designing and developing novel, AI-powered robotic systems and interactions to make them more capable and preferred while collaborating and engaging with humans. To advance this work, Dr. Han takes an interdisciplinary and human-centered approach, developing broad expertise in robot explanations for trust, projector-based and head-worn AR for communication, mobile manipulation for real-world evaluation, cognitive status-informed references, robot failures for robustness, and more. His research is in part funded by the U.S. National Science Foundation. Research Overview → Dr. Han has published over 40 peer-reviewed papers. He received the best long-paper award at INLG 2022, the best late-breaking report third prize at HRI 2022, and a best late-breaking report nominee at HRI 2023. He also led teams to win multiple international and national robot competitions. Publications → Awards → Competitions → He believes professional service benefits academic life by fostering friendship, collaboration, leadership, and communities, serving as publications co-chair of HRI 2024 and 2026, program committee member of HRI 2023–2025 and ICRA 2026, and general co-chair of AI-HRI 2022. He also co-organizes multiple workshops, chairs paper sessions, and edits journal special issues. Professional Service and Leadership → For mentorship, Dr. Han received the university-wide Excellence in Mentoring Undergraduate Research Award (Faculty) at USF in 2024. For teaching, Dr. Han’s Augmented Reality course was rated 4.72/5.0, confirming his real-world and student-focused approach. He and his lab are also active in outreach to promote equal access and opportunities. Teaching Experience → Teaching Statement → Outreach → Prior to USF, Dr. Han was a Post-Doctoral Fellow at Colorado School of Mines, mentored by Dr. Tom Williams, and received a Ph.D. in Computer Science from UMass Lowell, advised by AAAI & AAAS Fellow Dr. Holly Yanco. He holds M.S. and B.S. degrees in Computer Science from the University of Manitoba in Canada. CV → Excellence in Mentoring Undergraduate Research Award → Mines Diversity, Inclusion & Access Award → INLG ’22 Best Long-Paper Award → HRI ’22 Best LBR Award 3rd Prize → 1st place, Panasonic Challenge → 2nd place, Fetchit Mobile Manipulation Challenge → Newsfrom Zhao Han Follow him on LinkedIn→ Read recent news on the RARE Lab website → Sep 14, 2024 [HRI ’25] I will serve on the program committee of HRI 2025 to help the community grow! Jun 13, 2024 I will serve as an associate editor (AE) for RO-MAN 2024! May 1, 2024 I received the university-wide Excellence in Mentoring Undergraduate Research Award – Faculty today! Mar 16, 2024 I gave a keynote talk at the VAM-HRI workshop at HRI ’24! Feb 5, 2024 We had two papers [1, 2] accepted to the VAM-HRI 2024 workshop! Dec 1, 2023 We had a short contribution paper accepted to HRI 2024! Read RARE Lab news → Read more news → His Research Human-Robot Interaction(HRI) Augmented Reality(AR) Robotics Artificial Intelligence(AI) See research → See expertise → Recent Publications Adrian Lozada, Uthman Tijani, Villa Keth, Hong Wang and Zhao Han Anywhere Projected AR for Robot Communication: A Mid-Air Fog Screen-Robot System HRI 2025 Xiangfei Kong and Zhao Han Do Results in Experiments with Virtual Robots in Augmented Reality Transfer To Physical Robots? An Experiment Design WYSD 2024 Hong Wang, Tam Do, and Zhao Han To Understand Indicators of Robots’ Vision Capabilities VAM-HRI 2024 Hong Wang, Tam Do, and Zhao Han Designing Indicators to Show a Robot’s Physical Vision Capability IEEE VR 2024 Poster Gregory LeMasurier, Alvika Gautam, Zhao Han, Jacob Crandall, and Holly Yanco Reactive or Proactive? How Robots Should Explain Failures HRI 2024 Jiaee Cheong, Nikhil Churamani, Luke Guerdan, Tabitha Edith Lee, Zhao Han, and Hatice Gunes Causal-HRI: Causal Learning for Human-Robot Interaction HRI 2024 Workshop Abstract See more publications → Search Dark Mode:",
  "content_length": 4948,
  "method": "requests",
  "crawl_time": "2025-12-01 14:54:47"
}