{
  "name": "Zhaohui Luo",
  "homepage": "https://pure.royalholloway.ac.uk/portal/en/persons/zhaohui-luo_217b224d-b244-464d-a29b-16e05b764ce7.html",
  "status": "success",
  "content": "Zhaohui Luo - Royal Holloway Research Portal Zhaohui Luo Professor Professor of Computer Science, Department of Computer ScienceCentre for Software Language EngineeringCentre for Intelligent SystemsCentre for Programming Languages and Systems Phone+44 1784 443431EmailZhaohui.Luorhul.acukWebsitehttp://www.cs.rhul.ac.uk/home/zhaohui/ TW20 0EX Research output 35 Conference contribution 18 Article 12 Chapter (peer-reviewed) 8 Other contribution 10 More 5 Book 2 Chapter 1 Abstract 1 Paper 1 Doctoral Thesis Research output per year Research output per year Modern Type Theories: Their Development and ApplicationsLuo, Z., 2024, Tsinghua University Press.Research output: Book/Report › Book A Metatheoretic Analysis of Subtype UniversesBradley, F. & Luo, Z., 28 Jul 2023, (Accepted/In press) 28th International Conference on Types for Proofs and Programs (TYPES 2022): Leibniz International Proceedings in Informatics. Dagstuhl, Germany: Schloss Dagstuhl –Leibniz Center for Informatics, Vol. 269. 21 p.Research output: Chapter in Book/Report/Conference proceeding › Chapter Open Access Propositional Forms of Judgemental InterpretationsXue, T., Luo, Z. & Chatzikyriakidis, S., Oct 2023, In: Journal of Logic, Language and Information. 32, 4, p. 733-758 26 p.Research output: Contribution to journal › Article › peer-review Universes in Type-Theoretical Semantics (paper accompanying an invited talk)Luo, Z., 15 Jun 2022, (Accepted/In press) LACompLing 2021. (Studies in Computational Intelligence).Research output: Chapter in Book/Report/Conference proceeding › Chapter 15 Downloads (Pure) Identity Criteria of Common Nouns and dot-types for CopredicationChatzikyriakidis, S. & Luo, Z., 2018, In: Oslo Studies in Language. 10, 2, p. 121-141 21 p.Research output: Contribution to journal › Article › peer-review Open Access View all 83 research outputs Projects 12 Finished Projects per year HoTT-based Computer-Assisted ReasoningLuo, Z. (PI)Royal Academy of Engineering1/07/14 → 30/06/15Project: Research Lexical Semantics in Type Theory with Coercive SubtypingLuo, Z. (PI)Leverhulme Trust1/06/11 → 31/05/14Project: Research Type-theoretic foundation of mathematical pluralismLuo, Z. (PI)Leverhulme Trust1/10/06 → 30/09/09Project: Research Epigram II: Innovative programming via inductive familiesLuo, Z. (PI)Eng & Phys Sci Res Council EPSRC1/10/04 → 31/08/05Project: Research Pythagoras II: Pythagoras II: Machine support for semi-formalised proof oriented mathematicsLuo, Z. (PI)Eng & Phys Sci Res Council EPSRC1/10/04 → 31/12/06Project: Research View all 12 projects Activities 1 Membership of research network Activities per year Member of TYPES steering committee (External organisation)Luo, Z. (Participant)25 Apr 2013Activity: Membership › Membership of research network",
  "content_length": 2777,
  "method": "requests",
  "crawl_time": "2025-12-01 14:54:49"
}