{
  "name": "Zhaoguo Wang",
  "homepage": "https://ipads.se.sjtu.edu.cn/zhaoguo_wang",
  "status": "success",
  "content": "Zhaoguo Wang (王肇国) [IPADS] zhaoguo_wang Table of Contents Zhaoguo Wang (王肇国) Professor About Me Recent Projects Honors and Awards Publications Academic Services Teaching Zhaoguo Wang (王肇国) Professor Email: zhaoguowang@sjtu.edu.cn Institute of Parallel and Distributed Systems Chinese Web Site About Me I am a full professor in the School of Computer Science, Shanghai Jiao Tong University, where I am a part of the Institute of Parallel and Distributed Systems. Before joining SJTU, I was an assistant professor (non-tenure track) at New York University. I am interested in fundamental theory and system building. A common thread of my research is improving the performance and reliability of parallel and distributed database systems. Recent Projects SQLSolver is an automated prover for the equivalence of SQL queries. It proposes a new linear integer arithmetic theory to model the semantics of SQL queries and achieve automated verification via SMT solvers. Compared to prior provers, it can support more SQL features and has a stronger verification capability. We also build a demo. You can try SQLSolver online with the demo. WeTune is a rule generator that can automatically discover new rewrite rules for SQL statements. It leverages the formal methods to craft the rules instead of relying on human experts. The rules discovered by WeTune are more suitable for web applications than the rules used by MS SQL Server, MYSQL, Calcite e.t.c. We also build a demo which is an online SQL rewriter. It uses the rules automatically generated by WeTune. XIndex is a scalable key value store for the multicore machine. It leverages the machine learning models to improve both search and space efficiency. Compared with the Learned Index proposed by Google, XIndex has a much better performance by avoiding queries being blocked by concurrent updates. PolyJuice is a scalable storage system for running database transactions. It uses the machine learning models to synthesize the concurrency control policy at runtime, which enables its high scalability regardless of the contention in the workload. Paxos2Raft is a distributed key value store based on ETCD. Compared with the original ETCD, it is optimized for reading heavy and geo-distributed environments. Such optimization is enabled by porting two Paxos variants, Paxos Quorum Lease and Mencius, to the Raft protocol used in ETCD. Instead of manually porting, we can automatically port these Paxos variants by formalizing the relationship between Paxos and Raft. Honors and Awards [2025] CACM Research Highlight [2023] 2023 ACM SIGMOD Research Highlight Award [2022] ACM SIGMOD 2022 Best Paper Honorable Mention [2022] Huawei Spark Award (2 times) [2021] ACM ChinaSys Rising Star Award [2020] Huawei OlympusMons Pioneer Award [2017] ACM APSys 2017 Best Paper Award Publications 2025 [VLDB] GRewriter: Practical Query Rewriting with Automatic Rule Set Expansion in GaussDB. Zhe Jiang, Zhaoguo Wang*, Haoning Lan, Chuzhe Tang, Haoran Ding, Lefeng Wang, Songyun Zou, Zhuoran Wei, Yongcun Liu, Xiang Yu, Yang Ren, Guoliang Li, and Haibo Chen. To appear in Proceedings of the 51st International Conference on Very Large Data Bases, London, United Kingdom, September 1-5, 2025. (Industry Track) [VLDB] Sonata: Multi-Database Transactions Made Fast and Serializable. Chuzhe Tang, Zhaoguo Wang*, Jinyang Li, and Haibo Chen. To appear in Proceedings of the 51st International Conference on Very Large Data Bases, London, United Kingdom, September 1-5, 2025. [SIGMOD] Automated Validating and Fixing of Text-to-SQL Translation with Execution Consistency. Yicun Yang, Zhaoguo Wang*, Yu Xia, Zhuoran Wei, Haoran Ding, Ruzica Piskac, Haibo Chen, Jinyang Li. Proceedings of the 2025 ACM SIGMOD International Conference on Management of Data, Berlin, Germany, June 22-27, 2025 (Paper) [CACM] Many Faces of Ad Hoc Transactions. Chuzhe Tang, Zhaoguo Wang, Xiaodong Zhang, Qianmian Yu, Binyu Zang, Haibing Guan, and Haibo Chen. Communications of the ACM (Research Highlight & Cover Article). 68, 4. (Paper), 2024 [TODS] Ad Hoc Transactions through the Looking Glass: An Empirical Study of Application-Level Transactions in Web Applications. Zhaoguo Wang*, Chuzhe Tang, Xiaodong Zhang, Qianmian Yu, Binyu Zang, Haibing Guan, Haibo Chen. ACM Transactions on Database Systems, 49, 1. (Paper), [SIGMOD] WeBridge: Synthesizing Stored Procedures for Large-Scale Real-World Web Applications. Gansen Hu, Zhaoguo Wang*, Chuzhe Tang, Jiahuan Shen, Zhiyuan Dong, Sheng Yao, Haibo Chen. Proceedings of the 2024 ACM SIGMOD International Conference on Management of Data, Santiago, Chile, June 9-15, 2024 (Paper) [SIGMOD] Proving Query Equivalence Using Linear Integer Arithmetic. Haoran Ding, Zhaoguo Wang*, Yicun Yang, Dexin Zhang, Zhenglin Xu, Haibo Chen, Ruzica Piskac, Jinyang Li. Proceedings of the 2024 ACM SIGMOD International Conference on Management of Data, Santiago, Chile, June 9-15, 2024 (PaperCodeDemo) 2023 [OSDI] Automated Verification of Idempotence for Stateful Serverless Applications. Haoran Ding, Zhaoguo Wang*, Zhuohao Shen, Rong Chen, Haibo Chen. The 17th USENIX Symposium on Operating Systems Design and Implementation, Boston, MA, US, July 2023 (Paper) [VLDB] Fine-Grained Re-Execution for Efficient Batched Commit of Distributed Transactions. Zhiyuan Dong, Zhaoguo Wang*, Xiaodong Zhang, Xian Xu, Changgeng Zhao⋄, Haibo Chen, Aurojit Panda⋄, Jinyang Li. The 49th International Conference on Very Large Data Bases, Vancouver, Canada, August 28 - September 1, 2023 (Paper) [SIGMOD Record] Ad Hoc Transactions: What They Are and Why We Should Care. Chuzhe Tang, Zhaoguo Wang*, Xiaodong Zhang, Qianmian Yu, Binyu Zang, Haibing Guan, and Haibo Chen. ACM SIGMOD Record 52, no. 1 (2023): 7-15. (2023 ACM SIGMOD Research Highlight Award) (Paper) [ICDE] Database Deadlock Diagnosis for Large-Scale ORM-Based Web Applications. Zhiyuan Dong, Zhaoguo Wang*, Chuanwei Yi, Xian Xu, Jinyuan Zhang, Jinyang Li, Haibo Chen. The 39th IEEE International Conference on Data Engineering, Anaheim, California, USA, April 3 – 7, 2023 (Paper) [ASPLOS] BeeHive: Sub-second Elasticity for Web Services with Semi-FaaS Execution. Ziming Zhao, Mingyu Wu, Jiawei Tang, Binyu Zang, Zhaoguo Wang , and Haibo Chen. The 28th ACM International Conference on Architectural Support for Programming Languages and Operating Systems, Vancouver, Canada, March 25-29, 2023 (Paper) 2022 [SIGMOD] WeTune: Automatic Discovery and Verification of Query Rewrite Rules. Zhaoguo Wang*, Zhou Zhou, Yicun Yang, Haoran Ding, Gansen Hu, Ding Ding, Chuzhe Tang, Haibo Chen, Jinyang Li. In Proceedings of the 2022 ACM SIGMOD International Conference on Management of Data. (Paper, Extend Ver., code) [SIGMOD] Ad Hoc Transactions in Web Applications: The Good, the Bad, and the Ugly. Chuzhe Tang, Zhaoguo Wang*, Xiaodong Zhang, Qianmian Yu, Binyu Zang, Haibing Guan, Haibo Chen. In Proceedings of the 2022 ACM SIGMOD International Conference on Management of Data. (Best Paper Honorable Mention)(paper, Extend Ver.) [TOS] The Concurrent Learned Indexes for Multicore Data Storage. Zhaoguo Wang, Haibo Chen, Youyun Wang, Chuzhe Tang, and Huan Wang. ACM Trans. Storage 18, 1. (paper, code) 2021 [OSDI] Polyjuice: High-Performance Transactions via Learned Concurrency Control. Jiachen Wang, Ding Ding, Huan Wang, Conrad Christensen, Zhaoguo Wang*, Haibo Chen, Jinyang Li. In Proceedings of the 15th USENIX Symposium on Operating Systems Design and Implementation. (paper, Extend Ver., code, slides, video) [NSDI] Unifying Timestamp with Transaction Ordering for MVCC with Decentralized Scalar Timestamp. Xingda Wei, Rong Chen, Haibo Chen, Zhaoguo Wang, Zhenhan Gong, and Binyu Zang. In Proceedings of 18th USENIX Symposium on Networked Systems Design and Implementation. (paper) 2020 [APSys] SIndex: A Scalable Learned Index for String Keys. Youyun Wang, Chuzhe Tang, Zhaoguo Wang*, Haibo Chen. In Proceedings of the 11th ACM SIGOPS Asia-Pacific Workshop on Systems. (paper, code, slides, video) [PPoPP] XIndex: A Scalable Learned Index for Multicore Data Storage. Chuzhe Tang, Youyun Wang, Zhiyuan Dong, Gansen Hu, Zhaoguo Wang*, Minjie Wang, and Haibo Chen. In Proceedings of the 25th ACM SIGPLAN Symposium on Principles and Practice of Parallel Programming. (paper, extended ver., code, slides, video) [JCST] Optimistic Transaction Processing in Deterministic Database. Zhiyuan Dong, Chuzhe Tang, Jiachen Wang, Zhaoguo Wang*, Haibo Chen and Binyu Zang. J Comput Sci Technol 35, 2. (paper) 2019 [PODC] On the Parallels between Paxos and Raft, and how to Port Optimizations. Zhaoguo Wang, Changgeng Zhao, Shuai Mu, Haibo Chen and Jinyang Li. In Proceedings of the 38th Annual ACM Symposium on Principles of Distributed Computing. [paper] [Usenix ATC] Pisces: A Scalable and Efficient Persistent Transactional Memory. Jinyu Gu, Qianqian Yu, Xiayang Wang, Zhaoguo Wang*, Binyu Zang, Haibing Guan and Haibo Chen. In Proceedings of the 2019 USENIX Annual Technical Conference. [paper, proof] 2017 [TPDS] Eunomia: Scaling Concurrent Index Structures Under Contention Using HTM. Weihua Zhang, Xin Wang, Shiyu Ji, Ziyun Wei, Zhaoguo Wang*, Haibo Chen. IEEE Transactions on Parallel and Distributed Systems. (paper) [APSys] Extracting More Intra-transaction Parallelism with Work Stealing for OLTP Workloads. Xiaozhou Zhou, Zhaoguo Wang*, Rong Chen, Haibo Chen, and Jinyang Li. Proceedings of 8th ACM Asia-Pacific Workshop on Systems. Bombay, India, Sep, 2017. (Best Paper Award) (paper) [PPoPP] Eunomia: Scaling Concurrent Search Trees under Contention Using HTM. Xin Wang, Weihua Zhang, Zhaoguo Wang, Ziyun Wei, Haibo Chen, Wenyun Zhao. PPoPP 2017. (paper) [TPDS] Replication-based Fault-tolerance for Large-scale Graph Processing. Rong Chen, Youyang Yao, Peng Wang, Kaiyuan Zhang, Zhaoguo Wang, Haibing Guan, Binyu Zang, Haibo Chen. IEEE Transactions on Parallel and Distributed Systems. Accepted, 2017. (paper) [TOCS] Fast In-memory Transaction Processing using RDMA and HTM. Haibo Chen, Rong Chen, Xingda Wei, Ji",
  "content_length": 12721,
  "method": "requests",
  "crawl_time": "2025-12-01 14:54:47"
}