{
  "name": "Zhaoping Li 0001",
  "homepage": "https://webdav.tuebingen.mpg.de/u/zli/bio.html",
  "status": "success",
  "content": "Prof. Dr. Li Zhaoping - Bio and CV Home Research Interests Publications Presentations/Tutorials/Teaching Positions Bio and CV Press Web Links This Academic Bio of Prof. Li Zhaoping I obtained my B.S. in Physics in 1984 from Fudan University, Shanghai, and Ph.D. in Physics in 1989 from California Institute of Technology. I was a postdoctoral researcher in Fermi National Laboratory in Batavia, Illinois USA, Institute for Advanced Study in Princeton New Jersey, USA, and Rockefeller University in New York USA. I have been a faculty member in Computer Science in Hong Kong University of Science and Technology, and was a visiting scientist at various academic institutions. In 1998, my colleagues and I co-founded the Gatsby Computational Neuroscience Unit in University College London. From Oct. 2018, I am a professor in University of Tuebingen and the head of the Department of Sensory and Sensorimotor Systems at the Max Planck Institute for Biological Cybernetics in Tuebingen, Germany. My research experience throughout the years ranges from areas in high energy physics to neurophysiology and marine biology, with most experience in understanding the brain functions in vision, olfaction, and in nonlinear neural dynamics. In late 90s and early 2000s, I proposed a theory (which is being extensively tested) that the primary visual cortex in the primate brain creates a saliency map to automatically attract visual attention to salient visual locations. This theory, and the supporting experimental evidence, have led me to propose a new framework for understanding vision. I am the author of Understanding Vision: theory, models, and data , Oxford University Press, 2014. Zhaoping's CV Selected Publications: (under author name \"Zhaoping L.\" after late 2002, and under name \"Li Z\" before). Zhaoping, L. (2019) A new framework for understanding vision from the perspective of the primary visual cortex Current Opinion in Neurobiology, volume 58, page 1-10. Yan Y., Zhaoping L., and Li W. (2018) Bottom-up saliency and top-down learning in the primary visual cortex of monkeys PNAS, 115 (41) 10499-10504 Zhaoping L. and Ackermann J. (2018) Reversed Depth in Anticorrelated Random-Dot Stereograms and the Central-Peripheral Difference in Visual Inference Perception, https://doi.org/10.1177/0301006618758571 Zhaoping L. (2017) Feedback from higher to lower visual areas for visual recognition may be weaker in the periphery: glimpses from the perception of brief dichoptic stimuli. Vision Research, 136: 32--49. Zhaoping L. (2016) From the optic tectum to the primary visual cortex: migration through evolution of the saliency map for exogenous attentional guidance, Current Opinion in Neurobiology, 40:94--102. Zhaoping L. (2016) Olfactory object recognition, segmentation, adaptation, target seeking, and discrimination by the network of the olfactory bulb and cortex: computational model and experimental data Volume 11, Pages 30 to 39, Current Opinion in Behavioral Sciences. Zhaoping L. (2016) Brains studying brains: look before you think in vision, Physical Biology, 13(2016)035002. Zhaoping L. (2014) Understanding Vision: theory, models, and data , Oxford University Press. Zhaoping L. (2008) Attention capture by eye of origin singletons even without awareness --- a hallmark of a bottom-up saliency map in the primary visual cortex. Journal of Vision, 8(5):1, 1-18, http://journalofvision.org/8/5/1/, doi:10.1167/8.5.1 Zhaoping L. Theoretical Understanding of the early visual processes by data compression and data selection in Network: Computation in neural systems 17(4):301-334 (2006). Zhaoping L. (2005) Border Ownership from Intracortical Interactions in Visual Area V2 , in NEURON, Vol. 47, 143-153 Li Z. (2002) A saliency map in primary visual cortex in Trends in Cognitive Sciences Vol 6. No.1. Jan. 2002, page 9-16 Li Z.(1999) Contextual influences in V1 as a basis for pop out and asymmetry in visual search In Proceedings of National Academy of Science, USA Volume 96, 1999. Page 10530-10535. Li Z. (1999) Visual segmentation by contextual influences via intracortical interactions in primary visual cortex. In Network: Computation in Neural Systems Volume 10, Number 2, May 1999. Page 187-212 Li Z. and Dayan P. (1999) Computational differences between asymmetrical and symmetrical networks Network: Computation in Neural Systems 10. 1 59-77, 1999 Li Z.(1998) A neural model of contour integration in the primary visual cortex In Neural Computation. 10. 903-940, 1998 Li Z. and J.J. Atick (1994) Efficient stereo coding in the multiscale representation or postscript version Network: Computations in neural systems Vol.5 157-174. [abstract] Li Z. and Atick J. J. (1994) Towards a theory of striate cortex Published in Neural Computation Vol.6, p. 127-146. Li Z. (1992) Different retinal ganglion cells have different functional goals, International Journal of Neural Systems, Vol. 3, No. 3, (1992) 237-248 Atick, J.J., Li, Z. and Redlich A. N. (1992) Understanding retinal color coding from first principles. Neural Computation 4 559-572. Li, Z., Hopfield, J.J. (1989) Modeling the Olfactory Bulb and Its Neural Oscillatory Processings. Biol. Cybern. 61 (5) 379-392. Li, Z. (1990) A model of olfactory adaptation and sensitivity enhancement in the olfactory bulb. Biol. Cybern. 62 (4) 349-361. This page was last modified on Oct. 2018",
  "content_length": 5364,
  "method": "requests",
  "crawl_time": "2025-12-01 14:54:49"
}