{
  "name": "Zhe Hou",
  "homepage": "https://zhehou.github.io",
  "status": "success",
  "content": "Zhe Hou's Home Page Zhe Hou's Home Page Senior Lecturer at the School of Information and Communication Technology (ICT), Griffith Univerity Director of the Neural-Symbolic Reasoning Group Address: N44 1.12, 170 Kessels Rd, Nathan, 4111, Australia Email: z dot hou at griffith dot edu dot au Tel: +61 7 3735 9270 Links DBLP ORCiD Short Bio Zhe Hou obtained his PhD from the Australian National University. His PhD topic was automated reasoning for program verification. He joined Nanyang Technological University in 2025 as a postdoc to work on formal verification of information flow security in full-stack systems. He then joined Griffith University in 2017 on a Defence project to develop trustworthy autonomous systems and advanced reasoning techniques. He became a faculty member at Griffith in late 2019. Research Interests Automated reasoning: separation logic, theorem proving, model checking. Machine learning/LLM: large scale data analytics, eXplaiable AI (XAI), neural-symbolic reasoning. Formal methods: program verification, weak memory model, information-flow security. Autonomous systems: planning, goal reasoning, federated reinforcement learning, multi-agent collaboration. Blockchain: interoperability, cross-chain asset transfer protocol, illegal transaction analysis, security of blockchain systems. Sports analytics: strategy and tactics anlaysis, sports video anlaysis. Quantum computing: quantum program verificaiton, quantum algorithms for computation. See publications by topic. Education PhD of Computer Science, the Australian National University, 2015. Master of Computing, the Australian National University, 2011. Bachelor of Software Engineering, Xidian University, 2010. Work Experience Senior Lecturer at the School of ICT, Griffith University, since 2023. Lecturer at the School of ICT, Griffith University, 2019 - 2022. Research Fellow at IIIS, Griffith University, 2017 - 2019. Postdoc Research Fellow at Nanyang Technological University, 2016 - 2017. Research Assistant at Nanyang Technological University, 2015 - 2016. Lecturer (sessional) at the Australian National University, 2014. Tutor (sessional) at the Australian National University, 2012 - 2014. Awards, Certificates & Fellowships ACM SIGSOFT Distinguished Paper Award at FSE 2025 Leadership Award for ICFEM Organisation, 2024 Member of the Australian Computer Society (ACS), since 2023. Fellow of the Higher Education Academy, since 2022. ICECCS Organiser Leadership Award, 2019. PDCAT Organiser Leadership Award, 2019. ICFEM Chair Leadership Award, 2018. John Makepeace Bennett Award Australian Best PhD Thesis Runner-up, 2016. Spare Time Zhe is also a sketch artist, and he takes custom orders for a price of AU$ 500K and above. See some samples here.",
  "content_length": 2750,
  "method": "requests",
  "crawl_time": "2025-12-01 14:54:50"
}