{
  "name": "Zhe Dang",
  "homepage": "http://www.eecs.wsu.edu/~zdang",
  "status": "success",
  "content": "Zhe Dang Zhe Dang Associate Professor School of Electrical Engineering and Computer Science Washington State University Pullman, WA 99164 Email: zdang@wsu.edu Phone: 509-335-7238 Research Interests Model-checking and testing for infinite-state and/or real-time systems Automata theory and Membrane computing systems (P systems) Application of thermodynamics in computer science [PDF] Education PhD Dissertation: Debugging and Verification of Infinite State Real-time Systems Department of Computer Science University of California at Santa Barbara June, 2000 Committee: Richard A. Kemmerer (Advisor), Tevfik Bultan (Co-advisor), Oscar H. Ibarra (Member) MS Thesis: Using the ASTRAL Model Checker for Cryptographic Protocol Analysis Department of Computer Science University of California at Santa Barbara January, 1998 Committee: Richard A. Kemmerer (Advisor), Divyakant Agrawal (Member), Alan G. Konheim (Member) Teaching See your blackboard pages. Grant NSF grant, Oscar Ibarra (CCF-0430945) and Zhe Dang (CCF-0430531), Collaborative Research: New automata theories for analyzing infinite state and membrane computing systems ($250K, Aug. 1, 2004 -- July 31, 2007) Award ``CEA Young Faculty Recognition\", College of Engineering and Architecture (CEA), Washington State University, 2005. Program Committee Eighth International Conference on Implementation and Application of Automata (CIAA 2003) Tenth International Conference on Development in Language Theory (DLT 2006) PhD Students Gaoyan Xie (January 2002 to July 2005). Current with AMD. PhD Dissertation: Fundamental Studies on Automatic Verification of Component-based Systems -- A Decompositional and Hybrid Approach, July, 2005 Committee: Zhe Dang (Advisor), Anneliese Andrews (Member), Curtis Dyreson (Member) Cheng Li (MS since 2001, PhD since January 2003). Currently with Motorola. Yong Wang Currently with Google. PhD Dissertation: Clustering, Grouping and Processes over Networks, December, 2007 Committee: Zhe Dang (co-Advisor), Min Sik Kim (co-Advisor), K C Wang (Member) Linmin Yang Currently with Google. PhD Dissertation: Entropy and Software Systems -- towards an Information-theoretic Foundation of Software Testing, April, 2011 Committee: Zhe Dang (co-Advisor), Tom Fischer (co-Advisor), Min Sik Kim (Member) Cewei Cui Currently with Amobee PhD Dissertation: Information-theoretic Metrics, Thermodynamics Metrics, and Applications. July 2016. Committee: Zhe Dang (co-Advisor), Tom Fischer (co-Advisor), Li Tan (Member) Eric Wang PhD Dissertation: Complexity Analysis of Communicating Objects Using Gurevich Free Energy, May, 2017 Committee: Zhe Dang (co-Advisor), Tom Fischer (co-Advisor), Carl Hauser (Member) Dmitry Dementyev (PhD since August 2011). Currently with Google. William Hutton Currently with PNNL. PhD Dissertation: Specificationless intrusion detection using thermodynamic formalism of free energy. March 2018. Committee: Zhe Dang (Advisor), Adam Hahn (Member), Carl Hauser (Member) Publications **********Papers in Review********* Wang, Xiujun; Mo, Lei; Zheng, Xiao; Dang, Zhe. [PDF] Streaming Histogram Publication over Weighted Sliding Windows Under Differential Privacy Tsinghua Science and Technology, 2023 (to appear). Liu, Zhi; Wang, Xiujun; Liu, Alex X.; Zheng, Xiao; Zhou, Hao; Hawbani, Ammar; Dang, Zhe. [PDF] A Near-optimal Protocol for Continuous Tag Recognition in Mobile RFID Systems. IEEE/ACM Transactions on Networking, 2023 (to appear). Wang, Xiujun; Liu, Zhi; Gao, Yan; Zheng, Xiao; Dang, Zhe; Shen, Xiaojun. [PDF] A Near-Optimal Protocol for the Grouping Problem in RFID systems. IEEE Transactions on Mobile Computing, 20(4): 1257-1272(2021). Xiujun Wang, Zhi Liu, Susumu Ishihara, Zhe Dang and Jie Li. [PDF] A Near-Optimal Protocol for the Subset Selection Problem in RFID Systems. Proceedings of The 16th International Conference on Mobility, Sensing and Networking (IEEE MSN 2020). IEEE. (Best Paper Award) Oscar H. Ibarra, Zhe Dang, Qin Li Accepting runs of two-way finite automata. Information and Computation, 260: 1--8, 2018. Oscar H. Ibarra, Cewei Cui, Zhe Dang, and Thomas R. Fischer [PDF] Lossiness of communication channels modeled by transducers. International Journal of Computability, 6(2): 165-181, IOS Press, 2017. Cewei Cui, Zhe Dang, Thomas R. Fischer, and Oscar H. Ibarra [PDF] Information rate of some classes of nonregular languages: an automata-theoretic approach. Information and Computation, 256: 45-61, 2017. William J. Hutton, Zhe Dang and Cewei Cui. Killing the password, part 1: An exploratory analysis of walking signatures. IEEE Computing Conference, pp. 808-813, IEEE 2017. Zhe Dang, Thomas R. Fischer, William J. Hutton, Oscar H. Ibarra, Qin Li Quantifying Communication in Synchronized Languages. Theoretical Computer Science, 654:33 44(2016). Cewei Cui, Zhe Dang, Thomas R. Fischer, and Oscar H. Ibarra [PDF] Execution Information Rate for Some Classes of Automata. Information and Computation, 246:20--29, 2016. Cewei Cui and Zhe Dang. [PDF of longer version] A Free Energy Foundation of Semantic Similarity in Automata and Languages. Proc. of SISAP'16, Lecture Notes in Computer Science vol 9939, pp. 34 47, Springer, 2016. William J. Hutton and Zhe Dang Specification-based Intrusion Detection without a Specification. IEEE HST DHS conference, 2016. Eric Wang and Zhe Dang A Message-Passing Architecture Without Public Ids using Send-to-Behavior. IEEE/ACM ASE'15, pp. 902--905, 2015. Zhe Dang, Dmitry Dementyev, Thomas R. Fischer, and William J. Hutton Security of Numerical Sensors in Automata. CIAA 2015, Lecture Notes in Computer Science volume 9223, pp. 76--88, Springer, 2015. Zhe Dang, Thomas R. Fischer, William J. Hutton, Oscar H. Ibarra, Qin Li Quantifying Communication in Synchronized Languages. COCOON'15, Lecture Notes in Computer Science volume 9198, pp. 635--647, Springer, 2015. Qin Li and Zhe Dang [PDF] Sampling Automata and Programs. Theoretical Computer Science, 577:125--140, 2015. Xiujun Wang, Yusheng Ji, Zhe Dang, Xiao Zheng, and Baohua Zhao [PDF] Improved weighted Bloom filter and space lower bound analysis of algorithms for approximated membership querying DASFAA'15, Lecture Notes in Computer Science vol 9050, pp. 346--362, Springer, 2015. Xiujun Wang, Xiao Zheng, Zhe Dang, Xuangou Wu, and Baohua Zhao, [PDF] Near-optimal approximate duplicate-detection in data streams over sliding windows for the uniform query frequency or membership likelihood CBD'14, IEEE, pp. 122-127, 2014. Cewei Cui, Zhe Dang, Thomas R. Fischer, and Oscar H. Ibarra [PDF] Information rate of some classes of nonregular languages: an automata-theoretic approach in MFCS'14, Lecture Notes in Computer Science, volume 8634, pp. 232--243, Springer, 2014. Zhe Dang, Oscar Ibarra and Qin Li. [PDF] Sampling a Two-way Finite Automaton, a book chapter in Automata, Universality, Computation, volume 12 of the series book: Emergence, Complexity and Computation, pp. 103--115, Springer, 2015 Qin Li, Qin-Kai Zeng and Zhe Dang. [PDF] A path sensitive type system for information flow, journal paper, submitted,2014 Oscar H. Ibarra, Cewei Cui, Zhe Dang, and Thomas R. Fischer [PDF] Lossiness of .communication channels modeled by transducers, CiE'14 (Computability in Europe), Lecture Notes in Computer Science, vol 8493, pp. 224-233, Springer, 2014. Eric Wang, Cewei Cui, Zhe Dang, Thomas R. Fischer, and Linmin Yang. [PDF] Zero-knowledge blackbox testing: where are the faults? International Journal of Foundations of Computer Science 25(2): 196-218, 2014. Cewei Cui, Zhe Dang, and Thomas R. Fischer [PDF] Bit rate of programs. submitted, 2013. Cewei Cui, Zhe Dang, Thomas R. Fischer, and Oscar H. Ibarra [PDF] Similarity in Languages and Programs. Theoretical Computer Science, 498: 58--75 (2013). Cewei Cui, Zhe Dang, Thomas R. Fischer, and Oscar H. Ibarra [PDF] Execution Information Rate for Some Classes of Automata. LATA 2013, Lecture Notes in Computer Science vol 7810, pp. 226--237, Springer. Linmin Yang, Cewei Cui, Zhe Dang, and Thomas R. Fischer [PDF] An Information-theoretic Complexity Metric submitted. **********Edited Book (Proceedings)********* Oscar H. Ibarra and Zhe Dang (Eds.). Developments in Language Theory Lecture Notes in Computer Science Vol. 4036, Springer 2006. Oscar H. Ibarra and Zhe Dang (Eds.). [Springer Link] Implementation and Application of Automata. Lecture Notes in Computer Science Vol. 2759, Springer 2003. **********Journal Papers********* Cewei Cui, Zhe Dang, and Thomas R. Fischer [PDF] Typical Paths of a Graph Fundamenta Informaticae, 110(1-4): 95--109, 2011. Linmin Yang, Zhe Dang, and Thomas R. Fischer [PDF] Information Gain of Blackbox Testing Formal Aspects of Computing, 23(4): 513-539, 2011 Linmin Yang, Yong Wang, and Zhe Dang [PDF] Automata and Processes on Multisets of Communicating Objects Natural Computing 9(4):865 - 887 (2010) Linmin Yang, Zhe Dang, and Oscar Ibarra. [PDF] Bond computing systems: a biologically inspired and high-level dynamics model for pervasive computing Natural Computing, 9(2): 347-364 (2010) Linmin Yang, Zhe Dang, and Oscar Ibarra. [PDF] On stateless automata and P systems International Journal of Foundations of Computer Science, 19(5): 1259-1276 (2008) Oscar Ibarra, Zhe Dang, and Linmin Yang. [PDF] On Counter Machines, Reachability Problems, and Diophantine Equations International Journal of Foundations of Computer Science, 19(4): 919-934 (2008) Zhe Dang, Oscar Ibarra, Cheng Li, Gaoyan Xie [PDF] On the Decidability of Model-checking of P Systems Journal of Automata, Languages, and Combintorics, 11(3): 279 - 298 (2006). Oscar Ibarra, Sara Woodworth, Hsu-Chun Yen and Zhe Dang [PDF] On the Computational Power of 1-Deterministic and Sequential P Systems Fundamenta Informaticae,73(1-2): 133-152 (2006) Oscar Ibarra and Zhe Dang [PDF] On the Solvability of a Class of Diophantine Equations and Applications Theoretical Computer Science, 352(1-3): 342-346 (2006) Zhe Dang and Oscar Ibarra [PDF] On P Systems Operating in Sequential Mode International Journal of Foun",
  "content_length": 23705,
  "method": "requests",
  "crawl_time": "2025-12-01 14:54:58"
}