{
  "name": "Zhe Chen 0015",
  "homepage": "https://www.zhe-chen.com",
  "status": "success",
  "content": "Zhe Chen MENU About Me Publications Experiences Personal Zhe Chen Zhe Chen (陈哲) Ph.D. in Computer Science Email: zhechen#fudan.edu.cn [Google Scholar] About Me Dr. Zhe Chen is an assistant professor within the School of Computer Science at Fudan University, and the Co-Founder of AIWiSe Ltd. Inc. He obtained his Ph.D. degree in Computer Science from Fudan University, China, with a 2019 ACM SIGCOMM China Doctoral Dissertation Award. Before joining AIWiSe, he worked as a research fellow in NTU for several years, and his research achievements, along with his efforts in launching products based on them, have thus earned him 2021 ACM SIGMOBILE China Rising Star Award recently. His current research interests including wireless networking, deep learning, mobile and pervasive computing, and embedded systems. More information can be found here. Openings: I am looking for highly self-motivated Ph.D./master students, research interns, and PostDoc researchers, to join our group. If you are interested, please drop me an email with your CV and transcripts. See details here. Research Interests Satellite Internet/ISAC Resource-efficient AI systems Wireless sensing Recent News September 2025: Our two new papers conditionally accepted at ACM/IEEE SenSys 2026! August 2025: Our new paper conditionally accepted at IEEE ICNP 2025! July 2025: Our new paper conditionally accepted at ACM MM 2025! March 2025: Our new paper conditionally accepted at ACM MobiSys 2025! February 2025: We release the new source code of our SplitFM project!!! SplitFM is an open-source framework comprised of Split Parameter-Efficient Fine-Tuning (i.e., SplitLoRA) and Inference (i.e., SplitInfer) for foundation models. SplitFM framework supports four foundation model: DeepSeek-R1, Qwen2-V, LLlama3, and GTP-2. December 2024: Our two new paper accepted at IEEE INFOCOM 2025! November 2024: Our three paper accepted at IEEE TMC! July 2024: We release the source code of our SplitLoRA project! July 2024: Our new paper accepted at IEEE TDSC! June 2024: Our SplitLoRA project, a split parameter-efficient fine-tuning framework for Large Language Models (LLMs) has been launched, and we will release the source code soon. June 2024: Our new paper conditionally accepted at ACM MobiCom 2024! February 2024: Our new paper accepted at ACM MobiSys 2024! December 2023: Our two new paper accepted at IEEE INFOCOM 2024! August 2023: Our new paper accepted at ACM CCS 2023! August 2023: Our new paper accepted at IEEE JSAC! August 2023: Our new paper accepted at IEEE IoT-J! July 2023: Our new paper accepted at IEEE/CVF ICCV 2023! July 2023: Our new paper accepted at IEEE S&P 2024! June 2023: Our new paper conditionally accepted at ACM MobiCom 2023! December 2022: Our two new paper accepted at IEEE INFOCOM 2023! November 2022: Our new paper accepted at ACM TOSN! November 2022: Our new paper conditionally accepted at ACM MobiCom 2023! October 2022: Our new paper accepted at IEEE Communications Magazine! September 2022: Our new paper accepted at IEEE TNSE! September 2022: Our new paper accepted at IEEE TVT! September 2022: Our new paper accepted at ACM SenSys 2022! August 2022: Our new paper accepted at IEEE TMC 2022! June 2022: Our new paper conditionally accepted at ACM MobiCom 2022! December 2021: Our two new papers accepted at IEEE INFOCOM 2022! October 2021: Our new paper accepted at ACM SenSys 2021! August 2021: Our three new papers accepted at ACM MobiCom 2021! Visitors",
  "content_length": 3459,
  "method": "requests",
  "crawl_time": "2025-12-01 14:54:51"
}