{
  "name": "Zhen Li 0026",
  "homepage": "https://mypage.cuhk.edu.cn/academics/lizhen",
  "status": "success",
  "content": "Deep Bit lab Dr. Zhen Li Assistant Professor School of Science and Engineering, CUHKSZ. Future Network of Intelligence Institute, Shenzhen, CUHKSZ Deep Learning based Brain-like Interdisciplinary Transfer technology Lab (Deep Bit Lab) 深度比特实验室 Our Deep Bit Lab focuses on transfering appealing AI technologies for interdisciplinary researches and brain-like computing. Practical applications of great significances are our motivations. \"Passions, interests, believes, creatives and diligences\" is the slogan for our Deep Bit Lab. Interests Open World 3D Understanding Autonomous Driving and World Model Embodied AI Medical Big Data Molecular structure Analysis and Design Interdisciplinary Research Education Visiting Scholar, 2018, 2016 TTIC, University of Chicago PhD. in Hong Kong, 2018 University of Hong Kong M.A. in China, 2014 Sun Yat-sen University B.A. in China, 2011 Sun Yat-sen University Open Opportunities We have opening positions for Ph.D., M.phil. (Limited quotas for Ph.D. application, top conferences/journals are required.), Msc and visiting students, which are waiting for self-motivated talents. Please send me (lizhen@cuhk.edu.cn) your resume if you are interested in. news One paper and one workshop accepted by WACV 2026. One paper accepted by npj Digital Medicine . Two papers and one workshop paper accepted by NeurIPS 2025. One paper accepted by Nature Communications . One paper accepted by TNNLS 2025. One paper accepted by TVCG 2025. Four papers accepted by CVPR 2025. Two papers accepted by AAAI 2025. One as Oral . One paper win the 1st Place for ECCV 2024 Corner Case Scene Understanding Challenge. One paper accepted by BIBM 2024. One paper accepted by NeuIPS 2024. One paper accepted by MICCAI 2024. One paper accepted by IJCV 2024. One paper accepted by ECCV 2024. One paper accepted by ICLR 2024. One paper accepted by CVPR 2024. One paper win the \"Innovation Award\" and 2nd Place for the Predictive World Model of the Autonoumous Grand Challenge at CVPR2024. Publications Papers & Publications *Equal First Author, #Corresponding Author Zhihao Yuan, Xu Yan, Zhuo Li, Xuhao Li, Yao Guo, Shuguang Cui, Zhen Li#. Toward Fine-Grained 3-D Visual Grounding Through Referring Textual Phrases. TNNLS 2025 PDF Code Zhihao Yuan, Yibo Peng, Jinke Ren, Yinghong Liao, Yatong Han, Chun-Mei Feng, Hengshuang Zhao, Guanbin Li, Shuguang Cui, Zhen Li#. Empowering Large Language Models with 3D Situation Awareness. CVPR 2025 PDF Code Haiming Zhang, Zhihao Yuan, Chaoda Zheng, Xu Yan, Baoyuan Wang, Guanbin Li, Song Wu, Shuguang Cui, Zhen Li#. GSmoothFace: Generalized Smooth Talking Face Generation via Fine Grained 3D Face Guidance. TVCG 2025 PDF Code Hongbin Lin, Zilu Guo, Yifan Zhang, Shuaicheng Niu, Yafeng Li, Ruimao Zhang, Shuguang Cui, Zhen Li#. DriveGEN: Generalized and Robust 3D Detection in Driving via Controllable Text-to-Image Diffusion Generation. CVPR 2025 PDF Code Haiming Zhang, Wending Zhou, Yiyao Zhu, Xu Yan, Jiantao Gao, Dongfeng Bai, Yingjie Cai, Bingbing Liu, Shuguang Cui, Zhen Li#. VisionPAD: A Vision-Centric Pre-training Paradigm for Autonomous Driving. CVPR 2025 PDF Jingzhou Luo, Yang Liu, Weixing Chen, Zhen Li#, Yaowei Wang, Guanbin Li, Liang Lin. DSPNet: Dual-vision Scene Perception for Robust 3D Question Answering. CVPR 2025 PDF Code Ying Xue, Haiming Zhang, Yiyao Zhu, Wending Zhou, Shuguang Cui, Zhen Li#. Two-Stage LVLM system: 1st Place Solution for ECCV 2024 Corner Case Scene Understanding Challenge. ECCV 2024 Corner Case Scene Understanding Challenge PDF Code Slide Video Haiming Zhang*, Xu Yan*, Ying Xue, Zixuan Guo, Shuguang Cui, Zhen Li#, Bingbing Liu. D2-World: An Efficient World Model through Decoupled Dynamic Flow. The second place and innovation award of CVPR 2024 Predictive World Model Challenge PDF Video Yuncheng Jiang, Yiwen Hu, Zixun Zhang, Jun Wei, Chun-Mei Feng, Xuemei Tang, Xiang Wan, Yong Liu, Shuguang Cui, Zhen Li#. Towards a Benchmark for Colorectal Cancer Segmentation in Endorectal Ultrasound Videos: Dataset and Model Development. MICCAI 2024 PDF Code Yuncheng Jiang, Zixun Zhang, Jun Wei, Chun-Mei Feng, Guanbin Li, Xiang Wan, Shuguang Cui, Zhen Li#. Let Video Teaches You More: Video-to-Image Knowledge Distillation using DEtection TRansformer for Medical Video Lesion Detection. BIBM 2024 PDF Chaoda Zheng, Feng Wang, Naiyan Wang, Shuguang Cui, Zhen Li#. Towards Flexible 3D Perception: Object-Centric Occupancy Completion Augments 3D Object Detection in Long Sequence. NIPS 2024 PDF Code Slide Intro Chun-Mei Feng,Yuanyang He, Jian Zou, Salman Khan, Huan Xiong, Zhen Li#, WangmengZuo, RickSiowMongGoh, YongLiu. Diffusion-Enhanced Test-time Adaptation with Text and Image Augmentation. IJCV 2024 PDF Hongbin Lin*, Yifan Zhang*, Shuaicheng Niu*, Shuguang Cui, Zhen Li#. Fully Test-Time Adaptation for Monocular 3D Object Detection. ECCV 2024 PDF Code Intro Zhihao Yuan, Jinke Ren, Chun-Mei Feng, Hengshuang Zhao, Shuguang Cui, and Zhen Li#. Visual programming for zero-shot open-vocabulary 3d visual grounding. CVPR 2024 PDF Code Linglin Jing*, Ying Xue*, Xu Yan, Chaoda Zheng, Dong Wang, Ruimao Zhang, Zhigang Wang, Hui Fang, Bin Zhao, Zhen Li#. X4D-SceneFormer: Enhanced Scene Understanding on 4D Point Cloud Videos through Cross-Modal Knowledge Transfer. AAAI 2024 PDF Jun Wei, S. Kevin Zhou, Shuguang Cui, Zhen Li#. WeakPCSOD: Overcoming the Bias of Box Annotations for Weakly Supervised Point Cloud Salient Object. AAAI 2024 PDF Haiming Zhang, Xu Yan, Dongfeng Bai, Jiantao Gao, Pan Wang, Bingbing Liu, Shuguang Cui, Zhen Li#. RadOcc: Learning Cross-Modality Occupancy Knowledge through Rendering Assisted Distillation. AAAI 2024 PDF Intro Linglin Jing, Sheng Xu, Yifan Wang, Yuzhe Zhou, Tao Shen, Zhigang Ji, Hui Fang, Zhen Li#, Siqi Sun . CrossBind: Collaborative Cross-Modal Identification of Protein Nucleic-Acid-Binding Residues. AAAI 2024 PDF Code Yatong Han, Yingfeng Lu, Xu Yan, Hannah Cui, Shenghui Cheng, Jiayou Zheng, Yuzhe Zhou, Sheng Wang, Zhen Li#. Atom-ProteinQA: Atom-level protein model quality assessment through fine-grained joint learning. Comput. Methods Programs Biomed. 249: 108078 (2024). PDF Code Guangyi Liu*, Yu Wang*, Zeyu Feng*, Qiyu Wu, Liping Tang, Yuan Gao, Zhen Li#, Shuguang Cui, Julian J. McAuley, Zichao Yang, Eric P. Xing, Zhiting Hu: Unified Generation, Reconstruction, and Representation: Generalized Diffusion with Adaptive Latent Encoding-Decoding. ICML 2024 PDF Code Yueru Luo, Shuguang Cui, Zhen Li#. DV-3DLane: End-to-end Multi-modal 3D Lane Detection with Dual-view Representation. ICLR 2024 PDF Code Intro Xu Yan, Chaoda Zheng, Ying Xue, Zhen Li#, Shuguang Cui, Dengxin Dai#. Benchmarking the Robustness of LiDAR Semantic Segmentation Models. Int. J. Comput. Vis. 132(7): 2674-2697 (2024) PDF Chaoda Zheng, Xu Yan*, Haiming Zhang, Boyuan Wang, Shenghui Cheng, Shuguang Cui, Zhen Li#. An Effective Motion-Centric Paradigm for 3D Single Object Tracking in Point Clouds. T-PAMI 2023 PDF Code Yuncheng Jiang*, Zixun Zhang*, Yiwen Hu*, Guanbin Li, Xiang Wan, Song Wu, Shuguang Cui Fellow, IEEE, Silin Huang#, Zhen Li#. ECC-PolypDet: Enhanced CenterNet with Contrastive Learning for Automatic Polyp Detection. J-BHI 2023 PDF Ziyi Zhang, Weikai Chen, Chaowei Fang, Zhen Li, Lechao Cheng, Liang Lin, Guanbin Li. RankMatch: Fostering Confidence and Consistency in Learning with Noisy Labels. ICCV 2023 PDF Yiran Qin, Chaoqun Wang, Zijian Kang, Ningning Ma, Zhen Li, Ruimao Zhang. SupFusion: Supervised LiDAR-Camera Fusion for 3D Object Detection. ICCV 2023 PDF Yueru Luo, Chaoda Zheng, Xu Yan, Kun Tang, Chao Zheng, Shuguang Cui, Zhen Li#. LATR: 3D Lane Detection from Monocular Images with Transformer, Oral Presentation! (5% in submission). ICCV 2023 PDF Code Intro Hong Yan, Yang Liu, Yushen Wei, Zhen Li, Guanbin Li, Liang Lin. SkeletonMAE: Graph-based Masked Autoencoder for Skeleton Sequence Pre-training. ICCV 2023 PDF Rui Sun, Fengwei Zhou, Zhenhua Dong, Chuanlong Xie, Lanqing Hong, Jiawei Li, Rui Zhang, Zhenguo Li, Zhen Li#. Fair-CDA: Continuous and Directional Augmentation for Group Fairness. AAAI 2023 PDF Yinghong Liao*, Wending Zhou*, Xu Yan, Shuguang Cui, Yizhou Yu, Zhen Li# Geometry-Aware Network for Domain Adaptive Semantic Segmentation. AAAI 2023 PDF Weibing Zhao, Haiming Zhang, Chaoda Zheng, Xu Yan, Shuguang Cui, Zhen Li#. CPU: Codebook Lookup Transformer with Knowledge Distillation for Point Cloud Upsampling. ACM-MM 2023 PDF Jun Wei, Yiwen Hu, Shuguang Cui, S. Kevin Zhou, Zhen Li#. WeakPolyp: You Only Look Bounding Box for Polyp Segmentation. MICCAI 2023 (Early Accept) PDF Yuncheng Jiang, Zixun Zhang, Ruimao Zhang, Guanbin Li, Shuguang Cui, Zhen Li#. YONA: You Only Need One Adjacent Reference-frame for Accurate and Fast Video Polyp Detection. MICCAI 2023 (Early Accept) PDF Yuhao Du, Yuncheng Jiang, Shuangyi Tan, Xusheng Wu, Dou Qi, Zhen Li#, Guanbin Li#, Xiang Wan. ArSDM: Colonoscopy Images Synthesis with Adaptive Refinement Semantic Diffusion Models. MICCAI 2023 (Early Accept) PDF Xu Yan*, Heshen Zhan*, Chaoda Zheng, Jiantao Gao, Ruimao Zhang, Shuguang Cui, Zhen Li#. Let Images Give You More: Point Cloud Cross-Modal Training for Shape Analysis. NeurIPS 2022 PDF Ziyi Zhang, Weikai Chen, Hui Cheng, Zhen Li, Siyuan Li, Liang Lin, Guanbin Li. Divide_and_Contrast: Source-free Domain Adaptation via Adaptive Contrastive Learning. NeurIPS 2022 PDF Yuanfeng Ji, Haotian Bai, Chongjian GE, Jie Yang, Ye Zhu, Ruimao Zhang#, Zhen Li#, Lingyan Zhanng, Wanling Ma, Xiang Wan#, Ping Luo#. AMOS: A Large-Scale Abdominal Multi-Organ Benchmark for Versatile Medical Image Segmentation NeurIPS 2022 Track Datasets and Benchmarks PDF Jun Wei*, Yiwen Hu*, Guanbin Li, Shuguang Cui, S.Kevin Zhou, Zhen Li# . BoxPolyp: Boost Generalized Polyp Segmentation using Extra Coarse Bounding Box Annotations . MICCAI 2022 PDF Qin Wang, Jiayang Chen, Yuzhe Zhou, Liangzheng Zheng, Zhen Li#, Sheng Wang, Shuguang Cui. . Contact-Distil: Boosting Low Homologous Protein Contact Map Prediction by Self-Supervised Distillation. AAAI 2022 PD",
  "content_length": 29008,
  "method": "requests",
  "crawl_time": "2025-12-01 14:54:57"
}