{
  "name": "Zheng Yang 0002",
  "homepage": "http://tns.thss.tsinghua.edu.cn/~yangzheng",
  "status": "success",
  "content": "Zheng Yang's Homepage Tsinghua University Beijing, China Associate Professor IEEE Fellow Institute of Trustworthy Network and System, School of Software, Tsinghua University Email: hmilyyz [at] gmail [dot] com [Google Scholar]   [DBLP] Hands-on Wireless Sensing with Wi-Fi: A Tutorial. Build your wireless sensing system with code examples from CSI processing to deep learning modelling. Details at GitBook and arXiv:2206.09532v1 Widar RF sensing Dataset. The dataset consists of raw Wi-Fi readings (CSI) and other sophisticated features (e.g., Dopplerâs frequency shift and BVP) of 258K instances of hand gestures, duration of 8,620 minutes, from 75 environments. It can be used directly to test and compare the accuracy, efficiency, and generalization ability of various hand-gesture recognition algorithms. Ziggo TSN Toolkit. Covering a full-stack network management solution for TSN switches, performance evaluation (TSNPerf), traffic management (CNC Script), and fault diagnosis (TSNCard). 04/2024, our paper RF-Diffusion was accepted by MobiCom 2024, and got all four badges in ACM Artifact Evaluation. 10/2023, our paper BioDrone was accepted by MobiCom 2023. 12/2022, our paper SLNet and VeCare were accepted by NSDI 2023. 12/2022, our paper CaaS, DeepScheduler and FlyTracker were accepted by INFOCOM 2023. 03/2022, our paper Wi-Drone and LeoVR were accepted by MobiSys 2022. 12/2021, our paper SwarmMap was accepted by NSDI 2022. 11/2021, elevated to IEEE Fellow. 03/2021, our paper FollowUpAR was accepted by MobiSys 2021. 11/2019, our paper EdgeSLAM was accepted by INFCOM 2020. 05/2019, our paper Widar3.0 was accepted by MobiSys 2019. ãæç®äººç±»è®¡ç®å²ã, ãè®¡ç®æºç»æåçè¯¾ä¸­çå·¥ç¨å¸æç»´ã, ãAIoTæ¶ä»£çæºè½æ çº¿æç¥ï¼ç¹å¾ãç®æ³ãæ°æ®éã, ãæ çº¿æç¥ä¸ºAIå¼å¯æ°æå®ã, ãæ¯ææ§å¶å³æå¡çå®æ¶å·¥ä¸ç½ç»ä½ç³»æ¶æã Zheng Yang is an associate professor in School of Software and BNRist, Tsinghua University, Beijing, China. He received his B.E. degree in the Department of Computer Science from Tsinghua University, and his Ph.D. degree in the Department of Computer Science and Engineering of Hong Kong University of Science and Technology. His research interests include Internet of Things, Industrial Internet, sensing and positioning, edge computing, etc. He is an author and co-author of 4 books and over 120 research papers in premier journals and conferences. He received 4 best paper (candidates) awards and has over 17,000 citations with H-index 64. Ongoing projects include Widar (wireless and sensorless sensing), Ziggo (Time-Sensitive Networking), MoSen (mm-level optical positioning), CityPulse (smart city), etc. Outstanding Achievement Award for Scientific Research in Colleges and Universities (First Class), Ministry of Education, 2022 IEEE Fellow MSRA Collaborative Research Award 2019 Youth Top Talent Support Program (\"Thousands-of-Talents Scheme\") Beijing Nova Program 2011 State Natural Science Award (Second Class) Books Smart Wireless Sensing: From IoT to AIoT Zheng Yang, Kun Qian, Chenshu Wu, Yi Zhang 1st Edition, Springer, Singapore, 2021. ISBN: 978-981-16-5657-6. Read online for Springer subscribers Wireless Indoor Localization A Crowdsourcing Approach Chenshu Wu, Zheng Yang, Yunhao Liu 1st Edition, Springer, Singapore, 2018. ISBN: 978-981-13-0355-5. Read online for Springer subscribers Location, Localization, and Localizability - Location-awareness Technology for Wireless Networks Yunhao Liu and Zheng Yang 1st Edition, Springer, Berlin, 2011. ISBN: 978-1-4419-7370-2. Read online for Springer subscribers ä½ç½®è®¡ç®ï¼æ çº¿ç½ç»å®ä½ä¸å¯å®ä½æ§ æ¨é®, å´éæ²­, åäºæµ© ç¬¬ä¸ç, æ¸ åå¤§å­¦åºçç¤¾. ISBN: 978-7-302-35113-9. è·å¾ä¸­å½å¤§å­¦åºçç¤¾ä¼ç§å­¦æ¯èä½äºç­å¥ Selected Conference Articles More... æ¯ææ§å¶å³æå¡çå®æ¶å·¥ä¸ç½ç»ä½ç³»æ¶æ æ çº¿æç¥ä¸ºAIå¼å¯æ°æå® æºè½æ çº¿æç¥ï¼ç¹å¾ãç®æ³ãæ°æ®é å®¤å å®ä½4.0ï¼Indoor Localization 4.0ï¼ Enabling Sensorless Sensing with WiFi Radar Illinois Institute of Technology (IIT) and the Ohio State University (OSU), Feb., 2017. WiFié·è¾¾ï¼æ æä¸å¨çæç¥ ä¸­å½è®¡ç®æºå¤§ä¼CNCC Plusè®ºåç¹éæ¥åï¼åè¥ï¼2015. ãæ çº¿æç¥ä¸ºAIå¼å¯æ°æå®ã, ãä¸­å½è®¡ç®æºå­¦ä¼éè®¯ã ãæ¯ææ§å¶å³æå¡çå®æ¶å·¥ä¸ç½ç»ä½ç³»æ¶æã, ãä¸­å½è®¡ç®æºå­¦ä¼éè®¯ã Ziggo æ¶é´ææç½ç»äº¤æ¢æº Hands-on Wireless Sensing with Wi-Fi: A Tutorial ãWi-Fiæç¥å®è·µæç¨ã Dataset of Widar series of works AIoTæ¶ä»£çæºè½æ çº¿æç¥ï¼ç¹å¾ãç®æ³ãæ°æ®é, ãä¸­å½è®¡ç®æºå­¦ä¼éè®¯ã, 2020å¹´2æ è®¡ç®æºç»æåçè¯¾ä¸­çå·¥ç¨å¸æç»´, ãä¸­å½è®¡ç®æºå­¦ä¼éè®¯ã ãWiFié·è¾¾ï¼ä»RSSIå°CSIã, ãä¸­å½è®¡ç®æºå­¦ä¼éè®¯ã, 2014å¹´11æ æç®äººç±»è®¡ç®å² Upcoming Conferences COPYRIGHT © 2022 Zheng Yang.",
  "content_length": 4934,
  "method": "requests",
  "crawl_time": "2025-12-01 14:55:00"
}