{
  "name": "Zheng Eddie Li 0001",
  "homepage": "https://pure.qub.ac.uk/en/persons/zheng-li",
  "status": "success",
  "content": "Zheng Li - Queen's University Belfast View Scopus Profile Zheng Li Dr Lecturer, School of Electronics, Electrical Engineering and Computer Science https://orcid.org/0000-0002-9704-7651 Phone+44 (0)28 9097 5494Emailzheng.liqub.acuk Room 01.014 - Computer Science BuildingUnited Kingdom Accepting PhD StudentsPhD projects1. Empirical Software Engineering (Systematic Reviews/Mapping; Mining Software Repositories)2. Cloud/Edge Computing (Containerisation; Performance Engineering; Edge/Tiny Machine Learning)3. Cloud-/IoT-native Software Engineering (DevOps; Microservices Architecture; Agile Development at Scale)4. Software-driven Data Analytics (Data Gravity/Friction Management; Design-time Privacy/Security Preservation)Our group is seeking self-motivated PhD students. Self-funded PhD candidates, CSC scholarship candidates and visiting PhD students are always welcome. The funding opportunities can be explored via http://www.postgraduate-funding.com/gateway 20102025 Research activity per year Personal profile Research InterestsMy original research background is empirical software engineering. Since my Ph.D. work was part a cloud computing project, my research trajectory and interests closely follow the evolution path of cloud-native software engineering (that extends traditional software engineering to covering the DevOps, cloud, container, and microservice technologies), towards the emerging computing paradigms from mobile cloud computing to edge computing and Internet of Things (IoT). Recently I am involved in two scientific AI projects that both deploy their software infrastructure to the cloud, so I am also interested in the emerging topic software engineering for artificial intelligence (SE4AI). Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Fingerprint Dive into the research topics where Zheng Li is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 12 Similar Profiles Service Computer Science 100% Evaluation Computer Science 78% Software Engineering Computer Science 42% Microservice Computer Science 38% Application Computer Science 35% Performance Evaluation Computer Science 34% Design Computer Science 29% Container Computer Science 28% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Projects Projects per year 2024 2024 2024 1 Active Projects per year R1904ECS: National Edge AI Hub for Real Data: Edge Intelligence for Cyber-disturbances and Data Quality Li, Z. (PI), Shakeel, H. (CoI) & Wang, H. (CoI)02/12/2024 → …Project: Research Research output Research output per year 2010 2016 2018 2021 2022 2025 2025 40 Conference contribution 26 Article 1 Chapter (peer-reviewed) 1 Editorial 1 More 1 Special issue Research output per year Research output per year A comparative study towards designing a hybrid architecture of microservices and LLM-based multi-agent systemsYazdanian, P., Liu, Y. & Li, Z., 20 Sept 2025, (Accepted) Proceedings of the 32nd Asia-Pacific Software Engineering Conference (APSEC 2025). IEEE, (Proceedings of the Asia-Pacific Software Engineering Conference (APSEC)).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution An empirical study on precompilation as an Ops-oriented micro-optimisation strategy for microservice-based applicationsDougan, J. & Li, Z., 11 Sept 2025, (Accepted) Proceedings of the 25th International Conference on Algorithms and Architectures for Parallel Processing (ICA3PP 2025). Springer, 12 p. (Lecture Notes in Computer Science).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Code-review-as-an-educational-service: a tool for Java code review in programming educationBeattie, M., Watson, M., Greer, D., Toh, B. Y. & Li, Z., Feb 2025, In: SoftwareX. 29, 7 p., 102048.Research output: Contribution to journal › Article › peer-review Open AccessFile Programming Skill 100% Software Development 100% Industry Standard 100% Software Project 100% Enterprise Level 100% 53 Downloads (Pure) Explainable software engineering: from state of the practice to state of the artLi, Z., Ferrario, M. A., Crossey, B. & Rainer, A., 18 Sept 2025, (Accepted) Proceedings of the 32nd Asia-Pacific Software Engineering Conference (APSEC 2025). IEEE, (Proceedings of the Asia-Pacific Software Engineering Conference (APSEC)).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Fostering qualified software engineers via software engineering conversion programmesLi, Z., 12 Jun 2025, Proceedings of the the 37th IEEE Conference on Software Engineering Education and Training (CSEE&T 2025). Institute of Electrical and Electronics Engineers Inc., 5 p. (Proceedings of the the IEEE Conference on Software Engineering Education and Training).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open AccessFile Software Engineering 100% Software Engineer 100% Computer Science 100% Software Company 33% Software Engineering Education 33% 10 Downloads (Pure) View all 69 research outputs Prizes Agility Fund+ 2024 - Exclusive collaboration in North America and EuropeLi, Z. (Recipient), 22 Jul 2024Prize: Other distinction Agility Fund - Support for external research partnership developmentLi, Z. (Recipient), 10 Jul 2024Prize: Other distinction APSEC Most Influential Paper AwardLi, Z. (Recipient), Dec 2023Prize: Prize (including medals and awards) Driven Approach 100% Software Engineering 100% Microservice 100% Fellow of the Higher Education Academy (FHEA)Li, Z. (Recipient), 24 Jul 2024Prize: Fellowship awarded competitively File IEEE Senior memberLi, Z. (Recipient), 24 Jun 2020Prize: Fellowship awarded competitively View all 9 prizes Activities Activities per year 2019 2024 2025 2025 9 Other 7 Publication peer-review 6 Membership of peer review panel or committee 4 Editorial activity 13 More 4 Oral presentation 3 Participation in conference 3 Other examination 1 Participation in workshop, seminar, course 1 Invited talk 1 Visiting an external academic institution Activities per year Master's Dissertation Examination for the University of MalayaLi, Z. (Examiner)14 Oct 2025Activity: Examination types › Other examination Completed the Higher Education Strategic Export Controls courseLi, Z. (Recipient)08 Oct 2025Activity: Other activity types › Other File Reviewing an EPSRC funding applicationLi, Z. (Recipient)16 Sept 2025Activity: Other activity types › Other Reviewing a Fondecyt-Chile funding applicationLi, Z. (Reviewer)05 Aug 2025Activity: Other activity types › Other Reviewing an EPSRC funding applicationLi, Z. (Reviewer)16 Jul 2025Activity: Other activity types › Other View all 39 activities",
  "content_length": 7239,
  "method": "requests",
  "crawl_time": "2025-12-01 14:55:00"
}