{
  "name": "Zhen-Xiang Chen",
  "homepage": "http://loci.ujn.edu.cn",
  "status": "success",
  "content": "ï»¿ lociç½ç»å®éªå®¤ éè´ç¿åå£«Zhenxiang Chen,Ph.D. Provincial Key Laboratory for Network based Intelligent Computing School of Information Science and Engineering, University of Jinan Mobile:(+86) 186-7881-7522 Email: czx@ujn.edu.cn(æçè¯·èç³»ä¸æ¹é®ä»¶) Lab-Latest: LOCI - The Lab of Cyber Intelligence Lab-Old: LOCI - The Lab of Cyber Intelligence æçèç³»(Emailä¼å ): (+86) 156-1051-6170(Dr. Wang) /zxchen@ujn.edu.cn ä¸ªäººç®ä»--Biography Chen Zhenxiang, doctor of engineering, Professor of Jinan University, doctoral tutor, Dean of School of information science and engineering of Jinan University, national first-class professional principal of network engineering, excellent Postgraduate Tutor of Shandong Province, leader of youth entrepreneurship and technology team of colleges and universities in Shandong Province, and leader of independent innovation team of colleges and universities in Jinan. Currently, he is the director of Shandong health big data industry innovation center, the executive deputy director of the cultivation base (Computer Science) of Shandong basic science research center, the director of China Computer Society (CCF), the vice president of Shandong computer society, the president of International Computer Society (ACM) and the vice president of CCF Jinan Branch. The person in charge of Shandong excellent graduate student case base of fundamentals of computer engineering, the person in charge of Shandong high-quality postgraduate course of advanced computer network, the person in charge of Shandong Provincial ideological and political demonstration course of advanced computer network, and the person in charge of Shandong first-class course of principles of computer network won 3 first prizes and 2 second prizes of Shandong provincial teaching achievements. He is mainly engaged in research in computer networks, network security, intelligent information processing and other fields, and presided over more than 10 provincial and ministerial projects such as 2 projects of the National Natural Science Foundation of China and the key research and development plan of Shandong Province. He has published more than 130 papers in famous journals and conferences at home and abroad, including more than 30 academic papers in representative journals and academic conferences in the fields of IEEE TIFS, TKDE, infcom, iwqos, etc., won 2 second prizes and 1 third prize of Shandong provincial scientific and technological progress award, authorized more than 20 invention patents, transferred 12 invention patents, and some research achievements have been commercialized. éè´ç¿ï¼å·¥å­¦åå£«ï¼æµåå¤§å­¦ææï¼åå£«çå¯¼å¸ï¼æµåå¤§å­¦ä¿¡æ¯ç§å­¦ä¸å·¥ç¨å­¦é¢é¢é¿ï¼ç½ç»å·¥ç¨å½å®¶ä¸æµä¸ä¸è´è´£äººï¼å±±ä¸çä¼ç§ç ç©¶çå¯¼å¸ï¼å±±ä¸çé«ç­å­¦æ ¡éåç§æå¢éå¸¦å¤´äººï¼æµåå¸é«æ ¡èªä¸»åæ°å¢éé¢åäººæãç°ä»»å±±ä¸çå¥åº·å¤§æ°æ®äº§ä¸åæ°ä¸­å¿ä¸»ä»»ï¼å±±ä¸çåºç¡ç§å­¦ç ç©¶ä¸­å¿å¹è²åºå°ï¼è®¡ç®æºç§å­¦ï¼å¸¸å¡å¯ä¸»ä»»ï¼ä¸­å½è®¡ç®æºå­¦ä¼ï¼CCFï¼çäºï¼å±±ä¸è®¡ç®æºå­¦ä¼å¯çäºé¿ï¼å½é è®¡ç®æºå­¦ä¼ï¼ACMï¼æµåä¸»å¸­ï¼CCFæµååé¨å¯ä¸»å¸­ããè®¡ç®æºå·¥ç¨åºç¡ãå±±ä¸çä¼ç§ç ç©¶çæ¡ä¾åºè´è´£äººï¼ãé«çº§è®¡ç®æºç½ç»ãå±±ä¸çç ç©¶çä¼è´¨è¯¾ç¨è´è´£äººï¼ãé«çº§è®¡ç®æºç½ç»ãå±±ä¸çè¯¾ç¨ææ¿ç¤ºèè¯¾è´è´£äººï¼ãè®¡ç®æºç½ç»åçãå±±ä¸çä¸æµè¯¾ç¨è´è´£äººï¼è·å±±ä¸çççº§æå­¦ææä¸ç­å¥3é¡¹ãäºç­å¥2é¡¹ãä¸»è¦ä»äºè®¡ç®æºç½ç»ãç½ç»å®å ¨ãæºè½ä¿¡æ¯å¤çç­é¢åç ç©¶ï¼ä¸»æå½å®¶èªç¶ç§å­¦åºéé¡¹ç®2é¡¹ãå±±ä¸çéç¹ç åè®¡åç­çé¨çº§é¡¹ç®10ä½é¡¹ãå¨å½å å¤èååç©ä¼è®®åè¡¨è®ºæ130ä½ç¯ï¼å ¶ä¸­å¨IEEE TIFSãTKDEï¼INFCOMãIWQoSç­é¢åä»£è¡¨æ§æååå­¦æ¯ä¼è®®åè¡¨å­¦æ¯è®ºæ30ä½ç¯ï¼è·å±±ä¸çç§æè¿æ­¥äºç­å¥2é¡¹ãä¸ç­å¥1é¡¹ï¼ææåæä¸å©20ä½é¡¹ï¼è½¬è®©åæä¸å©12é¡¹ï¼é¨åç ç©¶ææå·²ç»å®ç°äº§ååã ç ç©¶é¢å--Research Areas ç½ç»è¡ä¸ºæµéãæºè½æ°æ®å®å ¨ãå¤§æ°æ®å¤çãäººä½å¥åº·è®¡ç® Cyber Security: mobile security; Big Data analysis in cyber space ä»£è¡¨è®ºæ--Selected Publications Effective detection of mobile malware behavior based on explainable deep neural network[J]. Yan A, Chen Z, Zhang H, et al. Neurocomputing,2020. (ä¸­ç§é¢ SCI ååº: 2 åº, IF=4.438, CCF:C ç±») Deep and broad URL feature mining for android malware detection[J]. Wang S, Chen Z, Yan Q, et al. Information Sciences, 2020, 513: 600-613. (ä¸­ç§é¢ SCI ååº: 1 åº, IF=5.910, CCF:B ç±») A mobile malware detection method using behavior features in network traffic[J]. Wang S, Chen Z, Yan Q, et al. Journal of Network and Computer Applications, 2019, 133: 15-25. (ä¸­ç§é¢ SCI ååº: å¤§ç±» 2 åºå°ç±» 1 åº, IF=5.273, CCF C ç±») Machine learning based mobile malware detection using highly imbalanced network traffic[J]. Chen Z, Yan Q, Han H, et al. Information Sciences, 2018, 433: 346-364. (ä¸­ç§é¢ SCI ååº: 1 åº, IF=5.910, CCF:B ç±») Detecting Android Malware Leveraging Text Semantics of Network Flows[J]. Wang S, Yan Q, Chen Z, Yang B, Zhao C, Conti M, et al. IEEE Transactions on Information Forensics & Security, 2017, PP(99):1-1. (ä¸­ç§é¢ SCI ååº: 1 åº, IF=7.178, CCF:A ç±») A novel semi-supervised learning method for Internet application identification[J] Chen Z, Liu Z, Peng L, et al. Soft Computing, 2017, 21(8): 1963-1975. (ä¸­ç§é¢ SCI ååº: 3 åº, IF=2.784, CCF C ç±») Flexible neural trees based early stage identification for IP traffic[J]. Chen Z, Peng L, Gao C, et al. Soft Computing, 2017, 21(8): 2035-2046. (ä¸­ç§é¢ SCI ååº: 3 åº, IF=2.784, CCF C ç±») Network-based Malware Detection with a Two-tier Architecture for Online Incremental Update[C]. Yan A, Chen Z, Spolaor R, et al. 2020 IEEE/ACM 28th International Symposium on Quality of Service (IWQoS). IEEE, 2020: 1-10. (CCF B) DART: Detecting Unseen Malware Variants using Adaptation Regularization Transfer Learning[C]. Li H, Chen Z, Spolaor R, et al. ICC 2019-2019 IEEE International Conference on Communications (ICC). IEEE, 2019: 1-6. (CCF C) A Signature-Based Assistant Random Oversampling Method for Malware Detection[C]. Pang Y, Chen Z, Peng L, et al. 2019 18th IEEE International Conference On Trust, Security And Privacy In Computing And Communications/13th IEEE International Conference On Big Data Science And Engineering (TrustCom/BigDataSE). IEEE, 2019: 256-263. (CCF C) MulAV: Multilevel and Explainable Detection of Android Malware with Data Fusion[C]. Li Q, Chen Z, Yan Q, et al. International Conference on Algorithms and Architectures for Parallel Processing. Springer, Cham, 2018: 166-177. (CCF C) Cluster Center Initialization and Outlier Detection Based on Distance and Density for the K-Means Algorithm[C]. He Q, Chen Z, Ji K, et al. International Conference on Intelligent Systems Design and Applications. Springer, Cham, 2018: 530-539. (CCF C) A fast and effective detection of mobile malware behavior using network traffic[C]. Liu A, Chen Z, Wang S, et al. International Conference on Algorithms and Architectures for Parallel Processing. Springer, Cham, 2018: 109-120. (CCF C) Deep and broad learning based detection of android malware via network traffic[C]. Wang S, Chen Z, Yan Q, et al. 2018 IEEE/ACM 26th International Symposium on Quality of Service (IWQoS). IEEE, 2018: 1-6. (CCF B) Lexical Mining of Malicious URLs for Classifying Android malware[C]. Wang S, Yan Q, Chen Z, et al. International Conference on Security and Privacy in Communication Systems. Springer, Cham, 2018: 248-263. (CCF C) Trafficav: An effective and explainable detection of mobile malware behavior using network traffic[C]. Wang S, Chen Z, Zhang L, et al. 2016 IEEE/ACM 24th International Symposium on Quality of Service (IWQoS). IEEE, 2016: 1-6. (CCF B) Droidcollector: A high performance framework for high quality android traffic collection[C]. Cao D, Wang S, Li Q, et al. 2016 IEEE Trustcom/BigDataSE/ISPA. IEEE, 2016: 1753-1758. (CCF C) A real-time android malware detection system based on network traffic analysis[C]. Han H, Chen Z, Yan Q, et al. International Conference on Algorithms and Architectures for Parallel Processing. Springer, Cham, 2015: 504-516. (CCF C) A first look at android malware traffic in first few minutes[C]. Chen Z, Han H, Yan Q, et al. 2015 IEEE Trustcom/BigDataSE/ISPA. IEEE, 2015, 1: 206-213. (CCF C) Feature selection toward optimizing internet traffic behavior identification[C]. Chen Z, Peng L, Zhao S, et al. International Conference on Algorithms and Architectures for Parallel Processing. Springer, Cham, 2014: 631-644. (CCF C) ç§ç é¡¹ç®--Research Project å¨ç é¡¹ç® é¡¹ç®æ¥æï¼2019.10-2022.12 é¡¹ç®åç§°ï¼åºäºç½ç»è¡ä¸ºçç§»å¨æ¶æåºç¨æºè½åæ£æµ é¡¹ç®æå±ï¼å±±ä¸çéåç§ææ¯æè®¡å é¡¹ç®èµéï¼18ä¸ é¡¹ç®ä¸­æ ä»»èå¡ï¼é¡¹ç®è´è´£äºº é¡¹ç®æ¥æï¼2019.01-2021.12 é¡¹ç®åç§°ï¼æºè½åç§»å¨æ¶æåºç¨è¡ä¸ºæ£æµ é¡¹ç®æå±ï¼æµåå¸é«æ ¡èªä¸»å¹å »åæ°å¢éé¢åäººæé¡¹ç® é¡¹ç®èµéï¼150ä¸ é¡¹ç®ä¸­æ ä»»èå¡ï¼é¡¹ç®è´è´£äºº ç»é¢é¡¹ç® é¡¹ç®æ¥æï¼2017.01-2020.12 é¡¹ç®åç§°ï¼åºäºæ·±åº¦å­¦ä¹ çç±»å«ä¸å¹³è¡¡æ¡ä»¶ä¸ç§»å¨æ¶æåºç¨å¨çº¿æ£æµ é¡¹ç®æå±ï¼å½å®¶èªç¶ç§å­¦åºéé¢ä¸é¡¹ç® é¡¹ç®èµéï¼62ä¸ é¡¹ç®ä¸­æ ä»»èå¡ï¼é¡¹ç®è´è´£äºº é¡¹ç®æ¥æï¼2016.01-2017.12 é¡¹ç®åç§°ï¼å ·ææºè½è¯å«è½åçç§»å¨æ¶æåºç¨åéæ£æµç³»ç»ç å é¡¹ç®æå±ï¼å±±ä¸çéç¹ç åé¡¹ç® é¡¹ç®èµéï¼25ä¸ é¡¹ç®ä¸­æ ä»»èå¡ï¼é¡¹ç®è´è´£äºº é¡¹ç®æ¥æï¼2015.01-2017.12 é¡¹ç®åç§°ï¼å ·æå ¥ç½åç°è½åçç§»å¨ç»ç«¯æ¶æè½¯ä»¶ç½ç»è¡ä¸ºæ£æµæ¨¡å é¡¹ç®æå±ï¼å±±ä¸çèªç¶ç§å­¦åºé é¡¹ç®èµéï¼20ä¸ é¡¹ç®ä¸­æ ä»»èå¡ï¼é¡¹ç®è´è´£äºº é¡¹ç®æ¥æï¼2011.01-2013.12 é¡¹ç®åç§°ï¼é¢åè¡ä¸ºè¯å«çäºèç½æµéç¹å¾åæåéæ©æ",
  "content_length": 14533,
  "method": "requests",
  "crawl_time": "2025-12-01 14:54:52"
}