{
  "name": "Zheng Gu 0001",
  "homepage": "https://edward3862.github.io",
  "status": "success",
  "content": "Zheng Gu News [2025-05] One paper on visual-to-music generation is accepted by ACL Findings 2025. [2025-01] I join the VCC group at Shenzhen University. [2024-12] I defend my PhD thesis at City University of Hong Kong. [2024-11] I defend my PhD thesis at Nanjing University. [2024-10] I am invited to give a talk at PRCV 2024 PhD Workshop. [2024-06] One paper on few-shot image generation is accepted by PRCV 2024. [2024-03] One paper on visual in-context learning is accepted by SIGGRAPH 2024. Publications CoT-VTM: Visual-to-Music Generation with Chain-of-Thought Reasoning Xikang Guan, Zheng Gu, Jing Huo*, Tianyu Ding, and Yang Gao Findings of the Annual Meeting of the Association for Computational Linguistics (ACL Findings), 2025 MTV-Inpaint: Multi-Task Long Video Inpainting Shiyuan Yang, Zheng Gu, Liang Hou, Xin Tao, Pengfei Wan, Xiaodong Chen, and Jing Liao arxiv preprint, 2025 [Project Page] [Arxiv] [Hugging Face] Task-Aware Few-Shot Image Generation via Dynamic Local Distribution Estimation and Sampling Zheng Gu, Wenbin Li*, Tianyu Ding, Zhengli Wang, Jing Huo, Kuihua Huang, and Yang Gao Chinese Conference on Pattern Recognition and Computer Vision (PRCV), 2024 [Paper] Analogist: Out-of-the-box Visual In-Context Learning with Image Diffusion Model Zheng Gu, Shiyuan Yang, Jing Liao*, Jing Huo*, and Yang Gao ACM Transactions on Graphics (Proceedings of SIGGRAPH), 2024 [Project Page] [Paper] [Arxiv] [Code] [Data] CariMe: Unpaired Caricature Generation with Multiple Exaggerations Zheng Gu, Chuanqi Dong, Jing Huo*, Wenbin Li, and Yang Gao IEEE Transactions on Multimedia (TMM), 2021 [Paper] [Arxiv] [Code] [Data] LoFGAN: Fusing Local Representations for Few-shot Image Generation Zheng Gu†, Wenbin Li†, Jing Huo*, Lei Wang, and Yang Gao International Conference on Computer Vision (ICCV), 2021 [Paper] [Code] [Data] Learning Task-aware Local Representations for Few-shot Learning Chuanqi Dong, Wenbin Li, Jing Huo, Zheng Gu, and Yang Gao* International Joint Conference on Artificial Intelligence (IJCAI), 2020 [Paper] [Code] Unsupervised Domain Attention Adaptation Network for Caricature Attribute Recognition Wen Ji, Kelei He, Jing Huo*, Zheng Gu, and Yang Gao European Conference on Computer Vision (ECCV), 2020 [Paper] [Code] DeepMEF: A Deep Model Ensemble Framework for Video Based Multi-modal Person Identification Chuanqi Dong, Zheng Gu, Zhonghao Huang, Wen Ji, Jing Huo, and Yang Gao ACM Conference on Multimedia (ACM MM), 2019 [Paper] [Code] Honors Huawei Scholarship, Nanjing University, 2021 Suzhou Yucai Scholarship, Nanjing University, 2021 Outstanding Postgraduate Student, Nanjing University, 2021 PhD Talent Scholarship, Nanjing University, 2020 3rd Place, iQIYI Celebrity Video Identification Challenge of ACM MM, 2019 Teaching Fundamentals of Computer, Shenzhen University, Instructor, 2025 Fall Algorithm Design and Analysis, Shenzhen University, Instructor, 2025 Fall Web-based Programming, Shenzhen University, Instructor, 2025 Spring CS3402: Database Systems, City University of HongKong, Teaching Assistant, 2022-2023 Object-oriented Design Method, Nanjing University, Teaching Assistant, 2019-2020 Artificial Intelligence, Nanjing University, Teaching Assistant, 2018-2019 Service Conference/Journal Reviewer: SIGGRAPH Asia, ICCV, ECCV, ACCV, WACV, TVCG, Multimedia Systems. Executive Chair: CCF Nanjing University Student Branch in 2019-2021. Experience 2023.12~2024.07   Research Assistant at CityU Shenzhen Research Institute 2017.08~2018.07   Serve as a Volunteer Teacher at Yunnan Province, Southwest China",
  "content_length": 3558,
  "method": "requests",
  "crawl_time": "2025-12-01 14:54:59"
}