{
  "name": "Zhenlin An",
  "homepage": "https://anplus.github.io",
  "status": "success",
  "content": "Zhenlin An I am an assistant professor in the School of Computing at University of Georgia. I was a postdoctoral researcher at the University of Pittsburgh and Princeton University, advised by Dr. Longfei Shangguan and Prof. Kyle Jamieson. Prior to that, I was a postdoc and got my Ph.D. at Hong Kong Polytechnic University, where I was advised by Dr. Lei Yang and Prof. Jiannong Cao. My research centers on mobile computing, wireless systems, and their intersection with AI. I explore physics-informed AI for intelligent communication, localization, and sensing. Recently, I focus on AR/VR glasses with Efficient Physical AI and 3D VLM neural ray tracing to model and understand the radio/acoustic world build NextG AI-native wireless systems with the radio digital twin I am the recipient of the ACM China SIGBED Doctoral Dissertation Award 2022, ACM MobiCom 2023 Best Paper Runner-up, IEEE SECON 2020 and 2023 Best Paper, and ACM MobiCom Best Demo Runner-up in 2018 and 2022. My works have been published in top conferences and journals such as MobiCom, SIGCOMM, NSDI, INFOCOM, MobiSys, Sensys, S&P, RAL, TON, and TMC. I am looking for multiple self-motivated PhD students/research assistants to start in Fall 2025 and Spring/Fall 2026. Please feel free to reach out to explore potential opportunities to work together. Contact: an.zhenlin@outlook.com news May 11, 2025 Invited to serve on the TPC for BodySys 2025, and our SenSys 2025 paper, “LeakyFeeder” has been nominated for a Best Paper Award. Dec 11, 2023 One paper on cross-media communication and one paper on optical metasurface are accepted in MobiCom 24. One paper on RFID system is accepted in NSDI 2024. Oct 10, 2023 Our papers received ACM MobiCom 2023 Best paper award runner-up and graduate award. Dec 2, 2022 Two papers were accepted by INFOCOM 2023. Nov 18, 2022 Two papers were accepted by MobiCom 2023. selected publications IEEE DySPAN RadioTwin: A Digital Building Material Twin for Wideband, Cross-link, Cross-band Wireless Channel Prediction Zhenlin An, Longfei Shangguan, John Kaewell, Philip Pietraski, and Kyle Jamieson IEEE DySPAN 2025 Bib @article{an2025radiotwin, volume = {}, pages = {}, title = {RadioTwin: A Digital Building Material Twin for Wideband, Cross-link, Cross-band Wireless Channel Prediction}, author = {An, Zhenlin and Shangguan, Longfei and Kaewell, John and Pietraski, Philip and Jamieson, Kyle}, journal = {IEEE DySPAN}, year = {2025}, publisher = {IEEE} } MobiCom NeRF2: Neural Radio-Frequency Radiance Fields Xiaopeng Zhao, Zhenlin An, Qingrui Pan, and Lei Yang In Proceedings of the ACM MOBICOM 2023 Conference 2023 Bib HTML @inproceedings{zhao2023nerf2, title = {NeRF2: Neural Radio-Frequency Radiance Fields}, author = {Zhao, Xiaopeng and An, Zhenlin and Pan, Qingrui and Yang, Lei}, booktitle = {Proceedings of the ACM MOBICOM 2023 Conference}, year = {2023}, note = {This paper received the Best Paper Runner-up Award at MobiCom 2023.} } SIGCOMM Empowering smart buildings with self-sensing concrete for structural health monitoring Zheng Gong, Lubing Han, Zhenlin An, Lei Yang, Siqi Ding, and Yu Xiang In Proceedings of the ACM SIGCOMM 2022 Bib HTML @inproceedings{gong2022empowering, title = {Empowering smart buildings with self-sensing concrete for structural health monitoring}, author = {Gong, Zheng and Han, Lubing and An, Zhenlin and Yang, Lei and Ding, Siqi and Xiang, Yu}, booktitle = {Proceedings of the ACM SIGCOMM}, pages = {560--575}, year = {2022} } MobiSys General-purpose deep tracking platform across protocols for the internet of things Zhenlin An, Qiongzheng Lin, Ping Li, and Lei Yang In Proceedings of ACM MobiSys 2020 Bib @inproceedings{an2020general, title = {General-purpose deep tracking platform across protocols for the internet of things}, author = {An, Zhenlin and Lin, Qiongzheng and Li, Ping and Yang, Lei}, booktitle = {Proceedings of ACM MobiSys}, pages = {94--106}, year = {2020} } IEEE TMC Revitalizing ultrasonic positioning systems for ultrasound-incapable smart devices Zhenlin An, Qiongzheng Lin, Lei Yang, and Yi Guo IEEE Transactions on Mobile Computing 2020 Bib @article{an2020revitalizing, title = {Revitalizing ultrasonic positioning systems for ultrasound-incapable smart devices}, author = {An, Zhenlin and Lin, Qiongzheng and Yang, Lei and Guo, Yi}, journal = {IEEE Transactions on Mobile Computing}, volume = {20}, number = {5}, pages = {2007--2024}, year = {2020}, publisher = {IEEE} } IEEE/ACM ToN Acquiring bloom filters across commercial RFIDs in physical layer Zhenlin An, Qiongzheng Lin, Lei Yang, Wei Lou, and Lei Xie IEEE/ACM Transactions on Networking 2020 Bib @article{an2020acquiring, title = {Acquiring bloom filters across commercial RFIDs in physical layer}, author = {An, Zhenlin and Lin, Qiongzheng and Yang, Lei and Lou, Wei and Xie, Lei}, journal = {IEEE/ACM Transactions on Networking}, volume = {28}, number = {4}, pages = {1804--1817}, year = {2020}, publisher = {IEEE} } MobiCom One tag, two codes: identifying optical barcodes with NFC Zhenlin An, Qiongzheng Lin, Xiaopeng Zhao, Lei Yang, Dongliang Zheng, Guiqing Wu, and Shan Chang In Proceedings of ACM MobiCom 2021 Bib @inproceedings{an2021one, author = {An, Zhenlin and Lin, Qiongzheng and Zhao, Xiaopeng and Yang, Lei and Zheng, Dongliang and Wu, Guiqing and Chang, Shan}, booktitle = {Proceedings of ACM MobiCom}, pages = {108--120}, year = {2021} } ACM TOSN Localizing RFIDs in Pixel Dimensions Zhenlin An, Qiongzheng Lin, Lei Yang, Yi Guo, and Ping Li ACM Transactions on Sensor Networks (TOSN) 2022 Bib @article{an2022localizing, title = {Localizing RFIDs in Pixel Dimensions}, author = {An, Zhenlin and Lin, Qiongzheng and Yang, Lei and Guo, Yi and Li, Ping}, journal = {ACM Transactions on Sensor Networks (TOSN)}, year = {2022}, publisher = {ACM New York, NY} } Email is the best way to reach me.",
  "content_length": 5840,
  "method": "requests",
  "crawl_time": "2025-12-01 14:55:05"
}