{
  "name": "Zheng Wang 0001",
  "homepage": "https://eps.leeds.ac.uk/computing/staff/6452/dr-zheng-wang",
  "status": "success",
  "content": "Professor Zheng Wang | School of Computer Science | University of Leeds Skip to main content University links Search Destination Faculty of Engineering and Physical Sciences site All leeds.ac.uk sites School of Computer Science Search Faculty of Engineering and Physical Sciences School of Computer Science People Profile Professor Zheng Wang Position: Professor of Intelligent Software Technology Areas of expertise: distributed systems; computing systems; compilers; machine learning; artificial intelligence; parallel programming; programming languages Location: 3.25b Sir William Henry Bragg Building Website: Intelligent Systems Software Lab Profile I lead the Intelligent Systems Software Lab. I am a member of the Distributed Systems and Services Group at Leeds, the EPSRC Peer Review College, the UKRI Talent Peer Review College (PRC), and the HiPEAC Network of Excellence. I was a Turing Fellow at The Alan Turing Institute. I was named among the Elsevier and Stanford World’s Top 2% Scientists between 2020 – 2024. Research interests I work to make software development easier and more accessible so that every programmer can easily write, maintain and optimise software. I maintain a list of must-read research papers for machine learning in compilers. I am interested in solving real-world problems by building working prototypes to be tested in real-life environments and real computing hardware using realistic workloads. PhD students: Scholarships are available for outstanding candidates. Being an advisor to students is the best part of my job. Have a look at my research interests and recent publications. If any of those grab you, email me a CV and a short text describing your background. I am also open-minded - if you have a great idea you would like to pursue, get in touch! Please read here before applying. Professional memberships ACM BCS IEEE Research groups and institutes Artificial Intelligence Distributed Systems and Services Current postgraduate researchers Jiayu Zhao Shenghao Qiu Haibo Wang Wu Ying Huanting Wang Amal Aldawsari <h4>Postgraduate research opportunities</h4> <p>We welcome enquiries from motivated and qualified applicants from all around the world who are interested in PhD study. Our <a href=\"https://phd.leeds.ac.uk\">research opportunities</a> allow you to search for projects and scholarships.</p> Projects <li><a href=\"//phd.leeds.ac.uk/project/2008-democratise-large-deep-learning-models\">Democratise Large Deep Learning Models</a></li> <li><a href=\"//phd.leeds.ac.uk/project/792-energy-efficient-computing-through-fine-grained-energy-accounting\">Energy-efficient Computing Through Fine-grained Energy Accounting</a></li> <li><a href=\"//phd.leeds.ac.uk/project/2156-high-level-pattern-aware-parallel-software-development\">High-level Pattern-aware Parallel Software Development</a></li> <li><a href=\"//phd.leeds.ac.uk/project/791-modernise-compiler-technology-with-deep-learning\">Modernise Compiler Technology with Deep Learning</a></li> Research outputs Loading... My five most recent selected research outputs My other selected research outputs Journal articles Conference papers Presentation (conference/workshop etc) Books Chapters Conference abstracts Preprints Reports Internet publications Performances Compositions Exhibitions Posters Artefacts Designs Patents Scholarly editions Software / code Thesis / dissertations Others Datasets Media Working papers Back to top",
  "content_length": 3429,
  "method": "requests",
  "crawl_time": "2025-12-01 14:55:00"
}