{
  "name": "Zhengming Ding",
  "homepage": "https://sse.tulane.edu/cs/faculty/Ding",
  "status": "success",
  "content": "Zhengming (Allan) Ding | Tulane University School of Science and Engineering Skip to main content Information for University Info Account Login EMAIL GIBSON ONLINE MYTULANE Zhengming (Allan) Ding Assistant Professor zding1@tulane.edu (504) 247-1411 School of Science & Engineering Dr. Ding's Website Education & Affiliations Ph.D., 2018, Northeastern University Biography About Professor Ding: Dr. Ding is a faculty member affiliated with Department of Computer Science, Tulane University. Before that he was a faculty member in Indiana University-Purdue University Indianapolis. He received the Ph.D. degree from the Department of Electrical and Computer Engineering, Northeastern University, USA in 2018. Research Interests His research interest lies in computer vision and machine learning, with a focus on developing scalable algorithms to learn robust representations from large-scale data including the following specific topics: Deep Learning (Deep Auto-Encoder, Deep CNN, LSTM, Generative Model) Transfer Learning, Multi-view Learning Low-Rank Modeling, Manifold Learning, Subspace Learning, Metric Learning Large-scale Data Analysis, Social Media Analytics Teaching CMPS 2200 Introduction to Algorithms [Spring 2021] Selected Publications [1]. Zhengming Ding, and Hongfu Liu. Marginalized Latent Semantic Encoder for Zero-Shot Learning. IEEE Conference on Computer Vision and Pattern Recognition (CVPR), pp. 6191-6199, 2019. [2]. Zhengming Ding, Ming Shao, and Yun Fu. Robust Multi-view Representation: A Unified Perspective from Multi-view Learning to Domain Adaption. International Joint Conference on Artificial Intelligence (IJCAI), pp. 5434-5440, 2018 [3]. Zhengming Ding, Ming Shao and Yun Fu. Low-Rank Embedded Ensemble Semantic Dictionary for Zero-Shot Learning. IEEE Conference on Computer Vision and Pattern Recognition (CVPR), pp. 2050-2058, 2017. [4]. Zhengming Ding, Yun Fu. Low-Rank Common Subspace for Multi-View Learning. IEEE International Conference on Data Mining (ICDM), pp. 110-119, 2014. [5]. Zhengming Ding, Ming Shao and Yun Fu. Latent Low-Rank Transfer Subspace Learning for Missing Modality Recognition. Twenty-Eighth AAAI Conference on Artificial Intelligence (AAAI), pp. 1192-1198, 2014. Privacy Accessibility Copyright",
  "content_length": 2256,
  "method": "requests",
  "crawl_time": "2025-12-01 14:55:03"
}