{
  "name": "Zhen Wu 0002",
  "homepage": "https://wuzhen247.github.io",
  "status": "success",
  "content": "Zhen Wu Zhen Wu (吴震) School of Artificial Intelligence, Nanjing University (NJU) Address: 163 Xianlin Avenue, Qixia District, Nanjing, China Office: Room A-201, Yifu Building Email: wuz [at] nju.edu.cn About Me [Google Scholar] Now I am an Assistant Professor at the School of Artificial Intelligence, Nanjing University (NJU), and a member of NJUNLP group, led by Prof. Jiajun Chen. Before that, I received my Ph.D. degree from the Department of Computer Science and Technology of Nanjing University (NJU) in 2021, supervised by Prof. Xinyu Dai. Research Interest My recent research interests mainly include emotional intelligence, multimodal computation, and large language models. News 2025-02-23: Invited to be an Area Chair (AC) for ACL 2025. 2024-10-06: RAGLAB was accepted by EMNLP 2024 Demo Track (CCF-B, oral). 2024-09-26: AutoSurvey was accepted by NeurIPS 2024 (CCF-A). 2024-09-20: One paper was accepted by EMNLP 2024 (CCF-B). 2024-07-16: One paper was accepted by ACM Multimedia 2024 (CCF-A). 2024-05-16: Two papers were accepted by ACL 2024 (CCF-A). 2024-03-16: One paper was accepted by NAACL 2024 (CCF-B). 2024-02-20: One paper was accepted by COLING 2024 (CCF-B). 2023-10-08: Four papers were accepted by EMNLP 2023 (CCF-B). 2023-09-23: We won the runner-up of the Evaluation of Large Model of Finance Technology (SMP2023-ELMFT) out of 2294 teams. Selected Publications ([Full List]) (* indicates equal contribution) UniDrop: A Simple yet Effective Technique to Improve Transformer without Extra Cost Zhen Wu, Lijun Wu, Qi Meng, Yingce Xia, Shufang Xie, Tao Qin, Xinyu Dai, Tie-Yan Liu NAACL-HLT, 2021 (oral presentation) [Paper] [中文解读] [Slides] [Poster] [BibTex] UniDrop integrated different dropout techniques and effectively improved Transformer performance. Grid Tagging Scheme for Aspect-oriented Fine-grained Opinion Extraction Zhen Wu, Chengcan Ying, Fei Zhao, Zhifang Fan, Xinyu Dai, Rui Xia EMNLP Findings, 2020 [Paper] [Datasets and Code] [中文解读] [BibTex] We propose a unified tagging scheme to address fine-grained opinion extraction, in the form of opinion pair (aspect term, opinion term) or opinion triplet (aspect term, opinion term, sentiment). Latent Opinions Transfer Network for Target-Oriented Opinion Words Extraction Zhen Wu*, Fei Zhao*, Xin-Yu Dai, Shujian Huang, Jiajun Chen AAAI, 2020 (oral presentation) [Paper] [Code] [中文解读] [BibTex] We transter opinion knowledge from resource-rich document-level data to improve target-oriented opinion words extraction. Attention Transfer Network for Aspect-level Sentiment Classification Fei Zhao*, Zhen Wu*, Xin-Yu Dai COLING, 2020 [Paper] [Code] [中文解读] [BibTex] We transter opinion knowledge from resource-rich document-level data to improve aspect-level sentiment classification. Transformer-based Multi-Aspect Modeling for Multi-Aspect Multi-Sentiment Analysis Zhen Wu*, Chengcan Ying*, Xinyu Dai, Shujian Huang, Jiajun Chen NLPCC Evaluation, 2020 [Paper] [Code] [BibTex] A simple yet effective method to improve and accelerate multi-aspect multi-sentiment classification. Opinion Transmission Network for Jointly Improving Aspect-oriented Opinion Words Extraction and Sentiment Classification Chengcan Ying*, Zhen Wu*, Xinyu Dai, Shujian Huang, Jiajun Chen NLPCC, 2020 [Paper] [BibTex] A joint method to improve both target-oriented opinion words extraction and aspect-level sentiment classification. Target-oriented Opinion Words Extraction with Target-fused Neural Sequence Labeling Zhifang Fan, Zhen Wu, Xin-Yu Dai, Shujian Huang, Jiajun Chen NAACL-HLT, 2019 [Paper] [Datasets and Code] [中文解读] [Talk] [BibTex] We proposed a new ABSA subtask Target-oriented Opinion Words Extraction and released the datasets. We are the first to annotate the datasets of opinion pair (aspect term, opinion term). Improving Review Representations with User Attention and Product Attention for Sentiment Classification Zhen Wu, Xin-Yu Dai, Cunyan Yin, Shujian Huang, Jiajun Chen AAAI, 2018 (oral presentation) [Paper] [Code] [Poster] [BibTex] Modeling reviews respectively from user's perspective and product's perspective. Experience Aug. 2020 - Mar. 2021, research intern at Microsoft Research Asia, supervised by Lijun Wu and Tao Qin Honor National Scholarship, 2020. NLPCC 2020 Shared Task, Multi-Aspect-based Multi-Sentiment Analysis (MAMS), 2020, Second Place. Evaluation of Chinese Implicit Sentiment Analysis in the 8th National Conference on Social Media Processing, 2019, Third Prize (Top5). CCF Big Data & Computing Intelligence Contest, \"Aspects and Sentiment Recognition of Automotive Industry\" Task, 2018, Champion (Top1/1701). CCF Big Data & Computing Intelligence Contest, 2018, Best Innovation Award. Artificial Intelligence Scholarship, 2018, Nanjing University. Review Services Program Committee Member/Conference Reviewer Neural Information Processing Systems (NeurIPS), 2022 International Conference on Machine Learning (ICML), 2022 AAAI Conference on Artificial Intelligence (AAAI), 2021, 2022 Annual Meeting of the Association for Computational Linguistics (ACL), 2021, 2022 Conference on Empirical Methods in Natural Language Processing (EMNLP), 2021, 2022 International Conference on Computational Linguistics (COLING), 2020, 2022 China National Conference on Computational Linguistics (CCL), 2021 International Workshop on Natural Language Processing for Social Media (SocialNLP), 2021 Journal Reviewer TKDD, TALLIP, Neurocomputing",
  "content_length": 5426,
  "method": "requests",
  "crawl_time": "2025-12-01 14:54:53"
}