{
  "name": "Zhenman Fang",
  "homepage": "http://www.sfu.ca/~zhenman",
  "status": "success",
  "content": "Zhenman Fang | Associate Professor at SFU Zhenman Fang Associate Professor Computer Engineering Option School of Engineering Science Simon Fraser University 8888 University Drive | ASB 9837 Burnaby, BC V5A 1S6, Canada Email: zhenman [at] sfu [dot] ca Google Scholar | DBLP | LinkedIn | CV News New website: Please check our new website. This old website will not be regularly maintained. PhD and MASc opening: Dr. Fang is actively looking for PhD and Master students to join his HiAccel lab. If you are interested in the research on customizable computing, please email me (zhenman [at] ieee [dot] org) your CV, transcript, English test results, and research interests, with the following subject: [PhD/Master] Name+Major+School. Note Master's student in Canada is also research based and funded; but preferences will be given to PhD students. Students with background in hardware acceleration and architecture, compilation and automation tool for killer applications such as large AI models, big data systems, sparsity-aware computation, and fully homomorphic encryption, are highly encouraged to apply. Please find more details in the recruiting page. Here is a nice, high-level introduction to FPGAs, one of the key components of our research: Architecture All Access: Modern FPGA Architecture. This talk is given by Intel, but most of the contents apply to both Intel and AMD/Xilinx FPGAs. Reference letter request: I only provide recommendation letters for undergraduate or graduate students whom I know well, i.e., (1) with whom I have worked in research, or (2) who have received an A+ in my courses and had significant face-to-face interaction with me. Paper submission: Dr. Fang is serving as the Program Vice Chair for FCCM 2026 and Associate Editor of ACM TRETS. Welcome to submit. Nov 2025, one paper accepted by EDBT 2026. The paper is on \"Understanding the Performance of Native Execution in Big Data Engines: The Good, the Bad, and How to Fix It\". Congrats to Haikai! Nov 2025, two papers accepted by FPGA 2026. One paper led by HiAccel group is on \"SORCERI: Streaming Overlay Acceleration for Highly Contracted Electron Repulsion Integral Computations in Quantum Chemistry\". The other paper led by Prof. Kevin Cao's group at UMN is on \"vFPGA: Towards Sub-µs Reconfiguration via 3D FPGA and Packaging Co-Design\". Congrats to Philip and all other co-authors! Nov 2025, one collaboration paper accepted by HPCA 2026. The paper is on \"An Efficient and Scalable Hardware Architecture for Number Theoretic Transform on FPGA with Design Automation\". Congrats to Xingyu and Dilshan! Oct 2025, Dr. Fang has received the 2025 ICCAD 10 Year Retrospective Most Influential Paper Award for the Caffeine paper he co-authored during his postdoc at UCLA. One paper from the 2015 and 2016 editions of ICCAD was selected for the 10-year retrospective most influential paper award as evidenced by impact on the research community as reflected in citations, on the vendor community via its use in an industrial setting or on new research venues as initiated by the paper during the past decade. Oct 2025, three papers accepted by TRETS. One paper is on \"PoCo: Extending Task-Parallel HLS Programming with Shared Multi-Producer Multi-Consumer Buffer Support\" (FPT 2025 Journal Track), which is our latest follow up work of TAPA and PASTA on task-parallel HLS programming. The other two papers are on \"HiSpMM: High Performance High Bandwidth Sparse-Dense Matrix Multiplication on HBM-equipped FPGA\" (FPT 2025 Journal Track) and \"MAD-HiSpMV: Matrix Adaptive Design with Hybrid Row Distribution for Imbalanced SpMV Acceleration on FPGAs\", which are our latest efforts on SpMM and SpMV acceleration. Congrats to Akhil, Ahmad, Manoj, and Xingyu! Sept 2025, Congratulations to Philip for winning the Kaiser Foundation Graduate Scholarship and Dilshan for winning the Lang Wong Memorial Endowment Scholarship! Sept 2025, Dr. Fang is invited to serve on the ACM TRETS Editorial Board, welcome to submit! Sept 2025, one collaboration paper on \"Perturbation-efficient Zeroth-order Optimization for Hardware-friendly On-device Training\" is selected as one of the ICCAD 2025 Best Paper Nominees. Jul 2025, one collaboration paper accepted by ICCAD 2025. The paper is on \"Perturbation-efficient Zeroth-order Optimization for Hardware-friendly On-device Training\". Jun 2025, Dr. Fang has been granted tenure at SFU effective May 30, 2025, and been approved for the promotion to Associate Professor effective Sept 1, 2025. May 2025, one collaboration paper accepted by TCSVT 2025. The paper is on \"ShiftQuant: Towards Accurate and Efficient Sub-8-Bit Integer Training\". May 2025, our AutoNTT paper is one of the FCCM 2025 Best Paper Nominees. Congrats to Dilshan and Qilin! Mar 2025, Dr. Fang receives the inaugural SFU Research Excellence Award - Horizon Award, which acknowledges HiAccel group's outstanding scholarship and cumulative research impact. Mar 2025, one paper accepted by ICME 2025. This paper is on \"SELIC: Semantic-Enhanced Learned Image Compression via High-Level Textual Guidance\", congrats to Haisheng! Mar 2025, one paper accepted by FCCM 2025. This paper is our first attempt on FHE acceleration: \"AutoNTT: Automatic Architecture Design and Exploration for Number Theoretic Transform Acceleration on FPGAs\", congrats to Dilshan and Qilin! Oct 2024, one paper accepted by FPT 2024. This paper is on \"FLUD: A Scalable and Configurable Systolic Array Design for LU Decomposition on FPGAs\", congrats to Xingyu! Sept 2024, our SERI paper has won the FPL 2024 Stamatis Vassiliadis Best Paper Award. Congrats to Philip! Aug 2024, one paper accepted by TIP 2024. The paper is on \"Fast and High-Performance Learned Image Compression With Improved Checkerboard Context Model, Deformable Residual Module, and Knowledge Distillation\", congrats to Haisheng! Jul 2024, Dr. Fang is invited to serve on the FPGA 2025 TPC, welcome to submit! Jul 2024, Dr. Fang is invited to serve on the FPT 2024 TPC, welcome to submit! Jul 2024, one paper accepted by ECCV 2024. The paper is on \"WeConvene: Learned Image Compression with Wavelet-Domain Convolution and Entropy Model\", congrats to Haisheng! Jun 2024, one paper accepted by TRETS. The paper is on \"PASTA: Programming and Automation Support for Scalable Task-Parallel HLS Programs on Modern Multi-Die FPGAs\", congrats to Moazin, Xingyu, Ahmad, and Akhil! This is a work in collaboration with Prof. Jason Cong's group at UCLA and led by SFU. Jun 2024, one paper accepted by TRETS. The paper is on \"SQL2FPGA: Automated Acceleration of SQL Query Processing on Modern CPU-FPGA Platforms\", congrats to Alec's (my first PhD graduate) 17th paper! Jun 2024, five full papers accepted by FPL 2024. The first paper SERI is our first attempt to accelerate quantum chemistry on FPGAs, which got the highest review scores among all FPL 2024 submissions. It is led by my MASc student Philip Stachura, in collaboration with Dr. Xin Wu and Prof. Christian Plessl from Paderborn University. The next two papers FORC and BitBlender accelerate common big data processing tax, Apache ORC file decoder and Bloom filter, on FPGAs. They are led by MASc students Abdul Wadood and Kenny Liu, respectively. The final two papers SDA and SA4 accelerate deep learning workloads, stable diffusion and 4-bit (convolutional) systolic array, on FPGAs. Both papers are led by my visiting PhD student Geng Yang (remotely due to visa issues) from Xidian University. The SDA paper is done in collaboration with Prof. Yanzhi Wang and Prof. Xue Lin from Northeastern University, and Prof. Jie Lei from Xidian University. The SA4 paper is also done in collaboration with Prof. Jie Lei from Xidian University. Congratulations to all! More News Bio Dr. Zhenman Fang is an Associate Professor in School of Engineering Science (Computer Engineering Option) and an Associate Member in School of Computing Science, Simon Fraser University, Canada, where he joined since Apr 2019. Zhenman founded and directs the HiAccel lab. He is also a member of SFU Systems Group and SFU Institute for Neuroscience and Neurotechnology. Zhenman's recent research focuses on customizable computing with software-defined hardware acceleration, which aims to sustain the ever-increasing performance, energy-efficiency, and reliability demand of important application domains in post-Moore’s law era. It spans the entire computing stack, including emerging application characterization and acceleration (including machine learning, big data analytics, high-performance computing, and precision medicine), novel accelerator-rich and near-data computing architecture designs, and corresponding programming, runtime, and tool support. Zhenman has published over 70 papers in top conferences and journals and two US patents, including the ICCAD 10 Year Retrospective Most Influential Paper Award in 2025, three best paper awards (FPL 2024 Stamatis Vassiliadis Best Paper, TCAD 2019 Donald O. Pederson Best Paper, and MEMSYS 2017 Best Paper), four best paper nominees (ICCAD 2025, FCCM 2025, HPCA 2017 and ISPASS 2018), a top paper highlighted in the FPGA 2021 Special Issue in ACM TRETS, a top paper received the highest review score among all FPGA 2024 submissions, and an invited paper from Proceedings of the IEEE 2019. His research has also been recognized with the inaugural SFU Research Excellence Award - Horizon Award (2025), a NSERC (Natural Sciences and Engineering Research Council of Canada) Alliance Award (2020), a CFI JELF (Canada Foundation for Innovation John R. Evans Leaders Fund) Award (2019), a Xilinx University Program Award (2019), a Team Award from Xilinx Software and IP Group (2018), and a Postdoc Fellowship from UCLA Institute for Digital Research and Education (2016-2017). Zhenman has also actively served in the organizing and program committee of top-tier conferences in the areas of FPGA and reconfigurable computing, design automation, and computer architecture. Recently, he has served as Program ",
  "content_length": 14634,
  "method": "requests",
  "crawl_time": "2025-12-01 14:55:12"
}