{
  "name": "Zhengxiong Li",
  "homepage": "https://cse.ucdenver.edu/~lizheng",
  "status": "success",
  "content": "Zhengxiong Li Dr. Li is an Assistant Professor of Computer Science and Engineering (CSE) Department at the University of Colorado Denver (CU Denver). He founds and directs the META (Mobile, Emerging Technologies & Applications) Lab. He has published over 60 research papers on top CS conferences and journals (e.g., IROS, MobiCom, MobiSys, SenSys, UbiComp, Oakland, CCS, NDSS, HOST, WWW), co-authored one book, and is a named inventor on many international and U.S. patents. He received a Ph.D. degree from the University at Buffalo, SUNY (UB). In addition, he received both an M.S. degree and a B.S. degree from Hangzhou Dianzi University (HDU) (both with honors), China. Dr. Li is on the committee at the Denver Science Fair for K-12 education outreach. News May, 2025 CU SPUR starts! Excited to mentor and support undergraduate student research in Colorado. May, 2025 Denver 7 recently featured our LLM-based phish email detection and analysis work in their media coverage. May, 2025 Ashlynn and Deveyn were recognized with the EURēCA! Grant 2025 and received the People’s Choice Award at the 2025 RaCAS Symposium at CU Denver . Nov, 2024 Lauched Cyber Nachos, an open-source platform designed to drive innovation and development in the AI Robotics, with partial support from the National Science Foundation (NSF)! Nov, 2024 Served as a general co-chair in The 7th International Workshop on Physics Embedded AI Solutions in Mobile Computing (Picasso 2024), co-located with ACM MobiCom 2024. May, 2024 CU SPUR starts! Excited to mentor and support undergraduate student research in Colorado. May, 2024 Welcome Submission! Honored to collaborate with Dr. Chenhan Xu as the guest editor for the special issue titled “Innovative Applications of mmWave Sensors” in MDPI Sensors. Feb, 2024 Newsweek recently featured our mobile security work, PrintListener, in their media coverage. Jan, 2024 Zheshuo and I work as volunteer judges in the 2023-2024 season of the CoorsTek Denver Metro Regional Science and Engineering Fair. Sep, 2023 Present and outreach our mmWave security work in the 2023 International Mechatronics Conference and Expo. Sep, 2023 Served as the mentor in the CU Denver EURēCA! Program for undergraduate research and creative endeavors. May, 2023 Worked as the volunteer judge in the 2023 Engineering Capstone Expo at CU Denver. Apr, 2023 Honored to be selected as a 2023 mHTI Scholar (https://mhti.md2k.org/index.php/scholars/2022-scholars-2)! Apr, 2023 Worked as a volunteer in the Spring 2023 Engineering Open House at CU Denver. Mar, 2023 Received the Google Cloud Training Credits Award. Thanks, Google! Mar, 2023 Won the Inaugural Coleman Institute Translational Research Award! Thanks, CU! Feb, 2023 Worked as the volunteer judge in the 2022-2023 season of the CoorsTek Denver Metro Regional Science and Engineering Fair. Nov, 2022 Won the Best Paper Award Candidate and Best Poster Award Runner-up at ACM SenSys 2022. Jul, 2022 Won the Research Award from Meta 2022 Privacy Enhancing Technologies. Thanks, Meta! Jul, 2022 Won the Best Student Paper Award in IEEE International Conference on Health Informatics (ICHI) 2022. Jul, 2022 Serve as a general co-chair in the 5th International Workshop on Combining Physical and Data-Driven Knowledge in Ubiquitous Computing (CPD 2022, https://ubicomp-cpd.com/2022.html), co-located with UbiComp 2022. Looking forward to see you in Atlanta, GA on September! Jun, 2022 Serve as a panelist to review proposals in NSF 2022. Jan, 2022 Work as the volunteer judge with Xingyu in the 2021-2022 season of the CoorsTek Denver Metro Regional Science and Engineering Fair to support academic STEM development in local middle and high schools. Oct, 2021 Our team won the runner-up award in the 2021 IEEE Healthcare Summit (IHS) COVID-19 Data Hackathon (Sensor Informatics Track). Oct, 2021 Gave an invited talk on “Research, a bravest and most romantic job” at UB CSE Distinguished Alumni Series. Sep, 2021 META lab is looking for motivated students (Undergraduate/Ph.D.). Please drop me an email if you have any interests. Selected Publications Papers in Denver. Supervised students/scholars are underlined. IROS 2025 VRobotix: A Scalable and Cost-Effective Virtual-Reality-Based Robotic Manipulation Dataset Generation Framework Xinmin Fang, Zheshuo Li, Lingfeng Tao, and Zhengxiong Li In Proceedings of the 2025 IEEE/RSJ International Conference on Intelligent Robots and Systems 2025 IROS 2025 DexPour: Effective and Efficient High-DoF Robotic Hand Liquid Pouring via Hierarchical Reward with Approximated Proxy Abstraction Xinmin Fang, Lingfeng Tao, and Zhengxiong Li In Proceedings of the 2025 IEEE/RSJ International Conference on Intelligent Robots and Systems 2025 IROS 2025 Bio-Skin: A Cost-Effective Thermostatic Tactile Sensor with Multi-Modal Force and Temperature Detection Haorao Guo, Haoyang Wang, Zhengxiong Li, and Lingfeng Tao, In Proceedings of the 2025 IEEE/RSJ International Conference on Intelligent Robots and Systems 2025 IROS 2025 Adaptive Anomaly Recovery for Telemanipulation: A Diffusion Model Approach to Vision-Based Tracking Haoyang Wang, Haorao Guo, Zhengxiong Li, and Lingfeng Tao, In Proceedings of the 2025 IEEE/RSJ International Conference on Intelligent Robots and Systems 2025 CNS 2025 PlasTrack: Path-Independent Plasma-Induced Attacks on mmWave Sensing Tracking Zheshuo Li, Lingfeng Tao, Yidan Hu, and Zhengxiong Li In Proceedings of the 2025 IEEE Conference on Communications and Network Security 2025 HOST 2025 Best PaperFinalist FanBleed: Stealing Your Secrets via Observing Your Cooling Fan Sisheng Liang, Zhengxiong Li, Zihao Zhan, and Zhenkai Zhang, In Proceedings of the 2025 IEEE International Symposium on Hardware Oriented Security and Trust 2025 MobiSys 2025 Best ArtifactAwardHonorableMention You Only Render Once: Enhancing Energy and Computation Efficiency of Mobile Virtual Reality Xingyu Chen, Xinmin Fang, Shuting Zhang, Xinyu Zhang, Liang He, and Zhengxiong Li 2025 Sensor 2025 A Comprehensive Survey of Research Trends in mmWave Technologies for Medical Applications Xiaoyu Zhang, Chuhui Liu, Yanda Cheng, Zhengxiong Li, Chenhan Xu, Chuqin Huang, Ye Zhan, Wei Bo, Jun Xia, and Wenyao Xu, Sensors 2025 SenSys 2025 CaphandAuth: Robust and Anti-spoofing Hand Authentication via COTS Capacitive Touchscreens Xiaojing Zhu, Man Zhou, Xiaoxiao Qiao, Zijian Ling, Qin Liu, Houzhen Wang, Xiaojing Ma, and Zhengxiong Li In Proceedings of the 23rd ACM Conference on Embedded Networked Sensor Systems 2025 SenSys SensorS&P Workshop2025 Best Paper Award mmVanish: Extending the Vanish Attack for Multi-Radar Exploitation of mmWave Sensing with Meta-material Tags Xinmin Fang, Hailu Xu, Lingfeng Tao, and Zhengxiong Li In Proceedings of the 2nd International Workshop on Security and Privacy of Sensing Systems 2025 SenSysPoster 2025 Poster Abstract: Understanding IoT Security Awareness Disparities Between CS and Non-CS Students Xinmin Fang, and Zhengxiong Li In Proceedings of the 23rd ACM Conference on Embedded Networked Sensor Systems 2025 SenSysHumanSysWorkshop 2025 Towards a Lightweight Platform for Human-Robot Interaction in Federated Edge and IoT Environments Simon Zhang, Zhengxiong Li, Xin Qin, and Hailu Xu, In Proceedings of the 3rd International Workshop on Human-Centered Sensing, Modeling, and Intelligent Systems 2025 SenSysHumanSysWorkshop 2025 Through-dressing Wound Monitoring Based on The mmWave Sensor Xiaoyu Zhang, Zhengxiong Li, Yanda Cheng, Chenhan Xu, Chuqin Huang, Emma Zhang, Ye Zhan, Wei Bo, Jun Xia, and Wenyao Xu, In Proceedings of the 3rd International Workshop on Human-Centered Sensing, Modeling, and Intelligent Systems 2025 IoTJ 2025 mmSkin: An Over-Gauze Wound Assessment System Using Radio Frequency Technologies Xiaoyu Zhang, Zhengxiong Li, Yanda Cheng, Chenhan Xu, Chuqin Huang, Emma Zhang, Ye Zhan, Wei Bo, Jun Xia, and Wenyao Xu, IEEE Internet of Things Journal 2025 IoTJ 2025 mmHand: Towards Pixel-Level-Accuracy Hand Localization Using A Single Commodity mmWave Device Xiaoyu Zhang, Zhengxiong Li, Chenhan Xu, Luchuan Song, Huining Li, Hongfei Xue, Yingxiao Wu, and Wenyao Xu, IEEE Internet of Things Journal 2025 MobiComPicasso 2024 MetaGlucose: Low-cost and Practical Cold Liquid Glucose Level Measurement for Health Yilin Song, Xinmin Fang, Zheshuo Li, and Zhengxiong Li In Proceedings of the 30th Annual International Conference on Mobile Computing and Networking (MobiCom Picasso Workshop 2024) 2024 MobiComPicasso 2024 A Black-Box Approach for Quantifying Leakage of Trace-Based Correlated Data Shafizur Rahman Seeam, Zhengxiong Li, and Yidan Hu, In Proceedings of the 30th Annual International Conference on Mobile Computing and Networking (MobiCom Picasso Workshop 2024) 2024 CNS 2024 Multi-sensor Data Privacy Protection with Adaptive Privacy Budget for IoT Systems Xinyi Liu, Ye Zheng, Zhengxiong Li, and Yidan Hu, In IEEE Conference on Communications and Network Security (CNS) 2024 NDSS 2024 PrintListener: Uncovering the Vulnerability of Fingerprint Authentication via the Finger Friction Sound Man Zhou, Shuao Su, Qian Wang, Li Qi, Yuting Zhou, Xiaojing Ma, and Zhengxiong Li In The Network and Distributed System Security (NDSS) Symposium 2024 TMC 2023 FingerPattern: Securing Pattern Lock Via Fingerprint-Dependent Friction Sound Man Zhou, Yuting Zhou, Shuao Su, Qian Wang, Qi Li, Shengshan Hu, Chunwu Yu, and Zhengxiong Li IEEE Transactions on Mobile Computing 2023 CCS 2023 TileMask: A Passive-reflection-based Attack against mmWave Radar Object Detection in Autonomous Driving Yi Zhu, Chenglin Miao, Hongfei Xue, Zhengxiong Li, Yunnan Yu, Wenyao Xu, Lu Su, and Chunming Qiao, In Proceedings of the 2023 ACM signal conference on computer and communications security 2023 NDSS 2023 MetaWave: Attacking mmWave Sensing with Meta-material-enhanced Tags Xingyu Chen, Zhengxiong Li, Baicheng Chen, Yi Zhu, Chris Xiaoxuan Lu, Zhengyu Peng, Feng Lin, Wenyao Xu, Kui Ren, and Chunming Qiao, In The 30th Network and Distributed System Security (N",
  "content_length": 16361,
  "method": "requests",
  "crawl_time": "2025-12-01 14:55:05"
}