{
  "name": "Zhenyu Ning",
  "homepage": "https://ningzhenyu.github.io/index.html",
  "status": "success",
  "content": "Zhenyu Ning's Personal Website Zhenyu Ning (宁振宇) Associate Professor College of Computer Science and Electronic Engineering Hunan University Contact: Room 661, Building of CSEE 2 South Lushan Road, Yuelu District Changsha, Hunan, China, 410082 Email: [Publications] [Google Scholar] About me I am an Associate Professor at the College of Computer Science and Electronic Engineering at Hunan University. I was a Research Assistant Professor at the Southern University of Science and Technology from June 2020 to April 2022. I earned my Ph.D. degree from the Department of Computer Science at Wayne State University in 2020. Before starting my Ph.D., I had 4 years of experience in the industry. I completed my Master's degree and Bachelor's degree at Tongji University in 2011 and 2008, respectively. Research My primary research interests are in different areas of security and privacy, including system security, mobile security, IoT security, transportation security, trusted execution environment, and hardware-assisted security. I am always looking for self-motivated master students and postdocs who are interested in system security and determined to publish high-quality research papers. Please feel free to shoot me an email and let's enjoy research together. News [Mar. 2024] CCA-based hotpatch paper has been accepted by ISSTA'24. Congrats, Zhenyu! [Aug. 2023] Prof. Ning has been invited to talk in CISPA Summer School. [May. 2023] ETM-based failure diagnosis paper has been accepted by ISSTA'23. Congrats, Yiming and Yuxin! [Feb. 2023] Arm enclave paper has been accepted by USENIX Security'23. Congrats, Yiming and Yuxin! Recent Publications [All] ˆ indicates equal contribution; * indicates the corresponding author. Armor: Protecting Software Against Hardware Tracing Techniques Tai Yue, Fengwei Zhang*, Zhenyu Ning, Pengfei Wang, Xu Zhou*, Kai Lu, and Lei Zhou To Apear In IEEE Transactions on Information Forensics & Security (TIFS), 2024. Impact Factor: 7.231. Efficiently Rebuilding Coverage in Hardware-Assisted Greybox Fuzzing Tai Yue, Yibo Jin, Fengwei Zhang*, Zhenyu Ning, Pengfei Wang*, Xu Zhou, and Kai Lu In Proceedings of the 27th International Symposium on Research in Attacks, Intrusions and Defenses (RAID), Palazzo della Salute in Padua, Italy, September 2024. [slides] BootRIST: Detecting and Isolating Mercurial Cores at the Booting Stage Yihao Luo, Yunjie Deng, Jingquan Ge, Zhenyu Ning, and Fengwei Zhang* In Proceedings of the 29th European Symposium on Research in Computer Security (ESORICS), Bydgoszcz, Poland, September 2024. [slides] FortifyPatch: Towards Tamper-resistant Live Patching in Linux-based Hypervisor Zhenyu Ye, Lei Zhou, Fengwei Zhang, Wenqiang Jin, Zhenyu Ning*, Yupeng Hu*, and Zheng Qin In Proceedings of the 33rd ACM SIGSOFT International Symposium on Software Testing and Analysis (ISSTA), Vienna, Austria, September 2024. [slides] BFTRAND: Low-latency Random Number Provider for BFT Smart Contracts Jinghui Liao, Borui Gong, Wenhai Sun, Fengwei Zhang*, Zhenyu Ning, Man Ho Allen Au, and Weisong Shi In Proceedings of the 54th Annual IEEE/IFIP International Conference on Dependable Systems and Networks (DSN), Brisbane, Australia, June 2024. [slides] CAGE: Complementing Arm CCA with GPU Extensions Chenxu Wang, Fengwei Zhang*, Yunjie Deng, Kevin Leach, Jiannong Cao, Zhenyu Ning, Shoumeng Yan, and Zhengyu He In Proceedings of the 31st Network and Distributed System Security Symposium (NDSS), San Diego, CA, February, 2024. [slides] Building a Lightweight Trusted Execution Environment for Arm GPUs Chenxu Wang, Yunjie Deng, Zhenyu Ning, Kevin Leach, Jin Li, Shoumeng Yan, Zhengyu He, Jiannong Cao, and Fengwei Zhang* In IEEE Transactions on Dependable and Secure Computing (TDSC), Vol.21, No.4, pp.3801-3816, 2024. Impact Factor: 7.329. Hardware-assisted Live Kernel Function Updating on Intel Platforms Lei Zhou, Fengwei Zhang*, Kevin Leach, Xuhua Ding, Zhenyu Ning, Guojun Wang, and Jidong Xiao In IEEE Transactions on Dependable and Secure Computing (TDSC), Vol.21, No.4, pp.2085-2098, 2024. Impact Factor: 7.329. Raft: Hardware-assisted Dynamic Information Flow Tracking for Runtime Protection on RISC-V Yu Wang, Jinting Wu, Haodong Zheng, Zhenyu Ning, Boyuan He, Fengwei Zhang* In Proceedings of the 26th International Symposium on Research in Attacks, Intrusions and Defenses (RAID), Hong Kong, October, 2023. [slides] Shelter: Extending Arm CCA with Isolation in User Space Yiming Zhangˆ, Yuxin Huˆ, Zhenyu Ning, Fengwei Zhang*, Xiapu Luo, Haoyang Huang, Shoumeng Yan, and Zhengyu He In Proceedings of the 32nd USENIX Security Symposium (USENIX Security), Anaheim, CA, August 2023. [slides] Current Students Ph.D. Students Qilin Chen (co-advised with Prof. Yaohua Wang) Zhenyu Ye (co-advised with Prof. Yupeng Hu) Master Students Juyang Ye (co-advised with Prof. Yaohua Wang) Sirui Qi (co-advised with Prof. Yaohua Wang) Tianyang Yin (co-advised with Prof. Yupeng Hu) Donghan He (co-advised with Prof. Yupeng Hu) Jiaxin Yuan Qihao Yang Jialu Liu Alumni Yuwen Xin (co-advised with Prof. Yupeng Hu) We must all face the choice between what is right and what is easy. — Albus Dumbledore",
  "content_length": 5153,
  "method": "requests",
  "crawl_time": "2025-12-01 14:55:07"
}