{
  "name": "Zheng Song 0001",
  "homepage": "https://percom.club",
  "status": "success",
  "content": "Pervasive Computing Lab@UMDearbornSearch this siteEmbedded FilesSkip to main contentSkip to navigationThe Pervasive Computing Lab at UMDearbornThe Pervasive Computing Lab is a hub of advanced research in cloud, mobile, edge, and vehicular computing. Our work encompasses the creation of efficient systems and innovative applications within pervasive computing, smart cities, and IoT. Underpinning our efforts is a profound belief that technology must be harnessed not merely for its inherent fascination, but for its transformative potential to substantially elevate the quality of human life and societal well-being. For collaboration opportunities, please contact Dr. Zheng Song at zhesong@umich.edu. NewsDr Song was invited to serve as a Program Committee (PC) member for ICCCN'26 and ICDCS'26, and as a panelist for NSFThe AI4ALL initiative aims to make AI accessible to everyone by offering engaging workshops on what AI is, how it is transforming the world, and how students can apply it within their own fields—especially designed for non-CS majors to build AI awareness and literacy. In 2025–2026, I am organizing the AI4ALL Seminar Series in collaboration with the AI Club at UM-Dearborn. More information is available at: https://sites.google.com/umich.edu/aic-ai4all/ .Our paper has been accepted to IEEE Transactions on Services Computing — congratulations to Zhengquan Li! He is on the job market this year, and I strongly recommend him for consideration. Zhengquan has an excellent research record, including an ICDCS’24 Distinguished Paper Award and publications in top venues such as Middleware and TSC, along with solid teaching and mentoring experience.Congratulations to Dr. Khairul Mottakin on successfully defending his Ph.D. dissertation and joining Saginaw Valley State University (SVSU) as an Assistant Professor! His research focuses on WiFi sensing, edge computing, and intelligent IoT systems, with several impactful publications available here . Sincere thanks to the dissertation committee members — Dr. Jinhua Guo, Dr. Xiao Zhang, and Dr. Alireza Mohammadi — for their valuable guidance and support. Wishing Dr. Mottakin all the best in his next journey!Working DirectionsDistributed System and MiddlewareIoT Systems and ApplicationsWeb Service and Service-Oriented ArchitectureComputer Science EducationGoogle SitesReport abusePage detailsPage updated Google SitesReport abuse",
  "content_length": 2407,
  "method": "requests",
  "crawl_time": "2025-12-01 14:55:02"
}