{
  "name": "Zhengzhong Tu",
  "homepage": "https://taco-group.github.io",
  "status": "success",
  "content": "TACO-Group@TAMU Trustworthy, Autonomous, Human-Centered, and Embodied Intelligence Group @ Texas A&M University Faculty Dr. Zhengzhong Tu is currently an Assistant Professor in the Department of Computer Science and Engineering at Texas A&M University, College Station, TX, USA. He is the director of the Trustworthy, Autonomous, Human-Centered, and Embodied Intelligence Group (TACO-Group) at TAMU. Contact: tzz [AT] tamu [.] edu Headline Prof. Tu has broad research interests spanning from trustworthy machine learning, multimodal and generative AI, autonomous driving systems, to embodied AI, machine learning system. We pick the following papers that represent our recent flavors. The list will change over time: [Multimodal Agents for Vision-Centric Tasks, NeurIPS 2025] [High-Res Video Generation, ICLR 2025] [Scalable & Secure V2X Systems, ICLR 2025] [VLM Post-Training Alignment, EMNLP 2025] [Trustworthy VLMs for Autonomous Driving, Arxiv 2024] [Language-driven Image Editing, ECCV 2024] [Conditional Diffusion Distillation, CVPR 2024] Please check the Research tab for details of research in our lab. Follow @TACO-Group 🚧 I am looking for highly motivated students, in terms of RA / TA / internship / visiting students. Interested candidates are strongly encouraged to contact me by email: tzzhire[AT]gmail[.]com or fill out the Google forms. Check out more detailed here. Tweets Tweets by _vztu PI & Research Interest Dr. Tu received his Ph.D. degree under the supervision of Prof. Alan C. Bovik in Electrical and Computer Engineering from The University of Texas at Austin, Austin, TX, USA, in 2022 Summer. Afterward, he worked at Google Research on computational imaging and generative models. He has been involved in multiple product through interning at Google Research, Pixel Camera, and YouTube team. Dr. Tu has authored 30+ peer-reviewed international journal/conference papers in related areas. He has received Best Paper Nomination Award at CVPR 2022, won the First Place at the AI4Streaming Video Quality Challenge held at CVPR 2024, been acknowledged with highlights in Google Research's Annual Blog, and featuring in Google I/O media outlets. He served as technical reviewers for over 18+ international journals/conferences, such as IEEE TPAMI, IJCV, TIP, TCSVT, TMM, TCI, TSTSP, RA-Letters, IROS, ICRA, NeurIPS, ICLR, ICML, CVPR, ICCV, ECCV, WACV, ICIP, VCIP, ISCAS, etc. Our group at Texas A&M University strives to explore cutting-edge generative and multimodal AI technologies, including core data generation, modeling, and alignment, as well as their domain-specific adaptations on real-world applications, such as autonomous vehicles/mobility, robotics, and healthcare. News [Nov 2025] CyPortQA was selected as Oral Presentation. Cheers! [Oct 2025] 2x AAAI 2026 accepted. Cheers! （AISI Track) CyPortQA: Benchmarking Multimodal Large Language Models for Cyclone Preparedness in Port Operation （Demo Track) DreamLand: Real-Time Interactive 4D Scene Generation 1x TMLR'2025 accepted. Cheers! AutoTrust: Benchmarking Trustworthiness in Large Vision Language Models for Autonomous Driving Dr. Tu gives keynote talks at 2COOOL and X-Sense workshop with ICCV 2025. Dr. Tu gave an invited talk at UC Merced. [Sep 2025] Dr. Tu was selected in the Stanford/Elsevier Top 2% Scientists List 2025! 2x NeurIPS'2025 accepted. Cheers! 4KAgent: agentic any image to 4K super-resolution DisCO: Reinforcing Large Reasoning Models with Discriminative Constrained Optimization Grateful to receive the 2025 Nvidia Academic Grant Award! Dr. Tu gave multiple invited talks at GMU, UMD, and UDel [Aug 2025] Dr. Tu will serve as Area Chair for ICLR 2026! 1x EMNLP'2025 (Main Track) accepted. Cheers! Re-Align: Aligning Vision Language Models via Retrieval-Augmented Direct Preference Optimization Dr. Tu gave an invited talk at Meta! Dr. Tu gave an invited talk at Berkeley Agentic AI Summit! [July 2025] Dr. Tu joins the Video Quality Expert Group (VQEG) board as a co-chair in Subjective and objective assessment of GenAI content (SOGAI) Dr. Tu starts to serve as Associate Editor for the prestigious IEEE Transactions on Image Processing! [June 2025] Dr. Tu will serve as AC for WACV 2026! See you again in Tuscon, AZ! 2x IROS'2025 accepted. Cheers! CoMamba: Real-time Cooperative Perception Unlocked with State Space Models CoCMT: Communication-Efficient Cross-Modal Transformer for Collaborative Perception Dr. Tu will attend CVPR 2025 in Nashville TN! Dr. Tu will co-organize the CVPR 2025 Workshop on Distillation of Foundation Models for Autonomous Driving Dr. Tu will co-organize the CVPR 2025 MetaFood Workshop. Dr. Tu will give an invited talk at Google XR at Mountain View, CA! [May 2025] Dr. Tu will attend ICRA 2025 in Atlanta, GA! Dr. Tu will attend VQEG 2025 Meeting hosted by Meta in Menlo Park, CA! Dr. Tu will give an invited talk at UC Davis! Dr. Tu gave an invited talk at Samsung Research America (SRA) in Dallas! 0x ICML'2025 accepted. No xixi :( [Apr 2025] Our team (TACO-SR) has won the 1st place on the NTIRE 2025 Challnege on Short-Form UGC Video Quality Assessment and Enhancement (Track 2: KwaiSR)! NTIRE 2025 Challenge on Short-form UGC Video Quality Assessment and Enhancement: Methods and Results Dr. Tu will serve as an Area Chair for NeurIPS 2025, at your service! Dr. Tu will serve as an Area Chair for WDFM-AD workshop with CVPR 2025! Dr. Tu will co-organize the 2nd MetaFood Workshop with CVPR 2025! Welcome to participate our challenge: 3D Reconstruction from Monocular Multi-Food Images. Dr. Tu gave an invited talk at Param-Intelligence (π) seminar talk at WPI. Advancing Cooperative Perception Systems in Real-World Deployment: Challenges, Solutions, and Frontiers Dr. Tu attended WACV'2025 in Tuscon, AZ [Mar 2025] Dr. Tu gave an invited talk at AI Seminar at ASU. Advancing Cooperative Perception Systems in Real-World Deployment: Challenges, Solutions, and Frontiers Dr. Tu attended WACV'2025 in Tuscon, AZ Dr. Tu co-organized the 3rd Workshop on Large Language and Vision Models for Autonomous Driving (LLVM-AD) with WACV'2025 in Tuscon, AZ. [Feb 2025] Dr. Tu gave an invited talk at Ethical and Explainable GeoAI Workshop held by TAMIDS. Towards Scalable, Trustworthy, and End-to-End Collaborative Driving 3x CVPR'2025 (1x Highlight) accepted. Cheers! [Highlight] DPU: Dynamic prototype updating for multimodal out-of-distribution detection Edit Away and My Face Will not Stay: Personal Biometric Defense against Malicious Generative Editing SleeperMark: Towards Robust Watermark against Fine-Tuning Text-to-image Diffusion Models 1x ICRA'2025 accepted. Cheers! V2X-DGW: Domain Generalization for Multi-agent Perception under Adverse Weather Conditions [Jan 2025] We welcome Xiangbo Gao to join the TACO group! 2x ICLR'2025 (1x Spotlight) accepted. Cheers! [Spotlight] 4k4dgen: Panoramic 4d generation at 4k resolution STAMP: Scalable Task- And Model-agnostic Collaborative Perception 2x WACV'2025 workshop accepted. Cheers! OpenEMMA: Open-Source Multimodal Model for End-to-End Autonomous Driving HFMF: Hierarchical Fusion Meets Multi-Stream Models for Deepfake Detection Dr. Tu attended Transportation Research Board (TRB) Annual Meeting at Washing D.C. [Dec 2024] Dr. Tu will serve as an Area Chair for ICCV2025, at your service! [Nov 2024] 1x IEEE TIP accepted. Cheers! MWFormer: Multi-Weather Image Restoration Using Degradation-Aware Transformers. 1x TMLR accepted. Cheers! Bigger is not Always Better: Scaling Properties of Latent Diffusion Models [Oct 2024] Dr. Tu visited DARPA DSO Day, MIT, and Boston University. [Sep 2024] We welcome Xing Shuo and Renjie Li to join TACO group! 1x IEEE TPAMI accepted. Cheers! V2X-ViTv2: Improved Vision Transformers for Vehicle-to-Everything Cooperative Perception 1x NeurIPS'24 (DB& Track) accepted. Cheers! OpenCDA-∞: A Closed-loop Benchmarking Platform for End-to-end Evaluation of Cooperative Perception Dr. Tu, with his crew, visited Rice CS and gave an invited talk on diffusion models and generative AI. Democratizing Diffusion Models for Controllable & Efficient Computational Imaging Dr. Tu gave an invited talk at SPS Webinar Series. SPS Webinar: Rapid, Accurate, and Explainable Video Quality Assessment for User-Generated Content [Aug 2024] We won the 3rd place in the AIM 2024 Challenge (Compressed Video Quality Assessment Track) AIM 2024 Challenge on Compressed Video Quality Assessment: Methods and Results Dr. Tu visited NYU, Columbia University. [July 2024] Dr. Tu was invited to an AI coffee chat by Dr. Zhang from Expresso Labs Our book chapter about Quality Assessment has been published. \"Quality Assessment in Media and Entertainment: Challenges and Trends\" in Computer Vision: Challenges, Trends, and Opportunities 1x ECCV'24 accepted. Cheers! SPIRE: Semantic Prompt-Driven Image Restoration Dr. Tu gave a talk on COVER (Slides) at Video Quality Expert Group (VQEG) Meeting [Jun 2024] 2x CVPR'24 accepted. Cheers! CoDi: Conditional Diffusion Distillation for Higher-Fidelity and Faster Image Generation Light the Night: A Multi-Condition Diffusion Framework for Unpaired Low-Light Enhancement in Autonomous Driving We won the 1st place in the AI4Streaming workshop (UGC Video Quality Assessment). [Challenge Report] COVER: A Comprehensive Video Quality Evaluator Our book chapter Quality Assessment in Media and Entertainment: Challenges and Trends in Computer Vision: Challenges, Trends, and Opportunities has been Published. Sponsor",
  "content_length": 9453,
  "method": "requests",
  "crawl_time": "2025-12-01 14:55:04"
}