{
  "name": "Zhennan Sun",
  "homepage": "http://www.cbsr.ia.ac.cn/users/znsun",
  "status": "success",
  "content": "﻿ Home Page Introduction Education Research Publications Professional activities Awards General 　　　Zhenan Sun 　　 Professor Center for Research on Intelligent Perception and Computing National Laboratory of Pattern Recognition Institute of Automation, Chinese Academy of Sciences Room 1605, Intelligence Bulding, 95 Zhongguancun East Road, Beijing, 100190, P.R.China Phone: (86)10-82544642　 E-mail:znsun@nlpr.ia.ac.cn Introduction Zhenan Sun received the B.S. degree in industrial automation from the Dalian University of Technology, Dalian, China, in 1999, the M.S. degree in system engineering from the Huazhong University of Science and Technology, Wuhan, China, in 2002, and the Ph.D. degree in pattern recognition and intelligent systems from the Chinese Academy of Sciences, Beijing, China, in 2006. Since 2006, he has been a Faculty Member with the National Laboratory of Pattern Recognition, Institute of Automation, Chinese Academy of Sciences, where he is currently a Professor. He has authored/co-authored over 100 technical papers. His current research interests include biometrics, pattern recognition, and computer vision. Education PhD Candidate in Pattern Recognition and Intelligent Systems, 09/2002 —03/2006 Institute of Automation, Chinese Academy of Sciences (CASIA) Advisor: Prof. Tieniu Tan Master’s Degree in Systems Engineering, 09/1999 — 07/2002 Department of Automation, Huazhong University of Science and Technology Advisor: Prof. Chaoyuan Yue Bachelor’s Degree in Control Engineering, 09/1995 — 07/1999 Department of Automation, Dalian University of Technology Research Key Technology and Verification System of the Intelligent Analysis of Large Visual Data for Large Scale Scene Sources of Funding: National Key Research and Development Program of China Intelligent analysis of the big visual data in large-scale complex scene is the key technology of public security, social management, transportation and military defense. However, existing methods generally lack of practicality due to the perceptual blind spots, such as small range scene, close individual identification, weak group characterization, and difficult event warning. This project aims to break through the perceptual blind spots of intelligent analysis of big visual data, and solve the key scientific problem “Multi-granularity and multi-dimensional thorough understanding of the big visual data of large scale complex scene” from three levels of individual-group-scene. In particular, this project will solve these the urgent bottleneck problems: 1) Individual perception: long distance 10 m), high throughput (100 people / minute), multiple objects (5 people), multi-modal iris, human face, gait), multi-dimension (identity, property, behavior); 2) Group perception: cross-density crowding (1-1000 persons / frame), varying spatial-temporal group association (0.5-6 hours), multi-category population event (10 kinds of events); 3) Scene perception: high-precision 3D reconstruction(error less than 10%) of large-scale scenes (stations and airports), object localization (error less than 3 meters), object retrieval(accuracy greater than 90%), and event analysis (accuracy greater than 85%). It is expected that the success of this project will make our country step into the international forefront of big visual data research, and obtain significant international influential research achievements on big visual data perception. This project will break through 10 key technologies of individual, group and scene perception with independent property rights, and provide million-level video application platforms. This project will produce remarkable social and economic benefits in Anti-Terrorism, Smart City and transportation. 　 Intelligent Light-field Imaging for Long-range Iris Recognition of Multiple Subjects Sources of Funding: National Natural Science Foundation of China Iris imaging is the first essential step of iris recognition. The limitations of current iris imaging in terms of the imaging distance, depth of field, posture and the number of users prevent wide applications of iris recognition technology. Therefore we propose a novel iris imaging method based on light-field imaging and intelligent vision algorithms to provide user-friendly iris image acquisition at a distance. Firstly light-field data is captured by the microlens array and multi-sensors optical system, and then computer vision methods for human-computer interaction such as head pose estimation, face detection and eye detection are integrated with image processing methods such as image stitching and digital refocusing to achieve large volume iris image acquisition of multiple subjects at a distance. The innovations of this project will establish an intelligent light-field imaging method for long-range iris recognition of multiple subjects and promote the development of iris recognition and opto-electonic engineering technology so that long-range iris recognition systems can be widely used in public security applications. 　 Light Field Imaging for Advanced Computer Vision Sources of Funding: Chinese Academy of Sciences Traditional cameras transform 3D scenes into 2D images so computer vision has become an ill-posed problem. So it is better to provide more visual information to support advanced computer vision. This project proposes to develop a novel camera to capture 4D light field information of visual scenes. Microlens array is used to record the direction information of light fields so that it is possible to reconstruct depth information of visual objects. In addition, image refocusing algorithms are developed to extend the depth of field of cameras. The innovations of light field cameras will significantly facilitate the research of computer vision. The main applications of light field cameras include iris and face recognition at a distance, visual surveillance, etc. Publications 1.\tZhenan Sun, Hui Zhang, Tieniu Tan, and Jianyu Wang, \"Iris Image Classification Based on Hierarchical Visual Codebook,\" IEEE Transactions on Pattern Analysis and Machine Intelligence, Vol. 36, No. 6, 2014, pp.1120-1133. 2.\tZhenan Sun and Tieniu Tan, \"Ordinal Measures for Iris Recognition,\" IEEE Transactions on Pattern Analysis and Machine Intelligence, Vol. 31, No. 12, 2009, pp. 2211 - 2226. 3.\tZhenan Sun, Libin Wang, Tieniu Tan, “Ordinal Feature Selection for Iris and Palmprint Recognition”, IEEE Transactions on Image Processing, Vol. 23, No. 9, 2014, pp.3922-3934. 4.\tZhenan Sun, Yunhong Wang, Tieniu Tan, Jiali Cui, “Improving Iris Recognition Accuracy via Cascaded Classifiers”, IEEE Transactions on Systems, Man, and Cybernetics-Part C，Volume 35, Issue 3, 2005, pp.435 - 441. 5.\tYunlian Sun, Man Zhang, Zhenan Sun, Tieniu Tan, Demographic Analysis from Biometric Data: Achievements, Challenges, and New Frontiers, IEEE Transactions on Pattern Analysis and Machine Intelligence, 2017. 6.\tJie Gui, Tongliang Liu, Zhenan Sun, Dacheng Tao, Tieniu Tan, Fast supervised discrete hashing, IEEE Transactions on Pattern Analysis and Machine Intelligence, 2017. 7.\tNianfeng Liu, Jing Liu, Zhenan Sun, Tieniu Tan, A Code-level Approach to Heterogeneous Iris Recognition, IEEE Transactions on Information Forensics and Security, 2017. 8.\tJie Gui, Zhenan Sun, Shuiwang Ji, Dacheng Tao, Tieniu Tan, Feature Selection Based on Structured Sparsity: A Comprehensive Study, IEEE Transactions on Neural Networks and Learning Systems, 2017. 9.\tRan He, Liang Wang, Zhenan Sun, Yingya Zhang, Bo Li, Information Theoretic Subspace Clustering, IEEE Transactions on Neural Networks and Learning Systems, Vol. 27, No. 12, 2016, pp.2643-2655. 10.\tJie Gui, Tongliang Liu, Dacheng Tao, Zhenan Sun, Tieniu Tan, \"Representative Vector Machines: A unified framework for classical classifiers\", IEEE Transactions on Cybernetics, Vol. 46, No. 8, 2016, pp.1877-1888. 11.\tY. Sun, K. Nasrollahi, Z. Sun, T. Tan, \"Complementary Cohort Strategy for Multimodal Face Pair Matching\", IEEE Transactions on Information Forensics and Security, Vol.11, No.5, 2016, pp.937-950. 12.\tQi Li, Zhenan Sun, Zhouchen Lin, Ran He, Tieniu Tan, Transformation invariant subspace clustering, Pattern Recognition, Volume 59, November 2016, Pages 142-155. 13.\tRan He, Tieniu Tan, Larry Davis, Zhenan Sun, Learning structured ordinal measures for video based face recognition, Pattern Recognition, 2017. 14.\tRan He, Yingya Zhang, Zhenan Sun, and Qiyue Yin, \"Robust Subspace Clustering With Complex Noise\", IEEE Transactions on Image Processing, vol.24, no.11, pp.4001-4013, Nov. 2015. 15.\tShu Zhang, Jian Liang, Ran He, Zhenan Sun, \"Code Consistent Hashing based on Information-theoretic Criterion\", IEEE Transactions on Big Data, Vol.1, No.3, pp.84-94, 2015. 16.\tWenbo Dong, Zhenan Sun and Tieniu Tan, \"Iris Matching Based on Personalized Weight Map\", IEEE Transactions on Pattern Analysis and Machine Intelligence, Vol. 33 , No. 9 , 2011, pp. 1744 - 1757. 17.\tZhaofeng He, Tieniu Tan, Zhenan Sun and Xianchao Qiu, \"Towards Accurate and Fast Iris Segmentation for Iris Biometrics\", IEEE Transactions on Pattern Analysis and Machine Intelligence, Vol. 31, No. 9, 2009, pp.1670-1684. 18.\tZhenhua Chai, Zhenan Sun, et al., “Gabor Ordinal Measures for Face Recognition”, IEEE Transactions on Information Forensics and Security, Vol. 9, No. 1, 2014, pp.14 -26. 19.\tRan He, Weishi Zheng, Tieniu Tan and Zhenan Sun, “Half-quadratic based Iterative Minimization for Robust Sparse Representation”, IEEE Transactions on Pattern Analysis and Machine Intelligence, Vol. 36, No. 2, 2014, pp. 261 - 275. 20.\tJie Gui, Zhenan Sun, Jun Cheng, Shuiwang Ji, and Xindong Wu, “How to Estimate the Regularization Parameter for Spectral Regression Discriminant Analysis and its Kernel Version?”, IEEE Transactions on Circuits and Systems for Video Technology, Vol. 24, No. 2, 2014, pp.211 – 223. 21.\tJie Gui, Dacheng Tao, Zhenan Sun, Yong Luo, Xinge You, Yuanyan Tang, Group Sparse Multiview Patch Alignment Frame",
  "content_length": 12093,
  "method": "requests",
  "crawl_time": "2025-12-01 14:55:05"
}