{
  "name": "Zhi-Hua Zhou",
  "homepage": "https://cs.nju.edu.cn/zhouzh",
  "status": "success",
  "content": "Zhi-Hua Zhou's Homepage Brief CV Zhi-Hua Zhou can be pronounced simply as [Jihua Joe] Professor, Computer Science and Artificial Intelligence Vice President, Nanjing University, China Fellow of the ACM, AAAI, AAAS, IEEE et al. Correspondence Mail: Zhi-Hua Zhou Vice President, University Office Nanjing University, Xianlin Campus 163 Xianlin Avenue, Qixia District Nanjing 210023, China URL: http://www.lamda.nju.edu.cn/zhouzh/ Email: zhouzh at nju dot edu dot cn or zhouzh.gm at gmail.com (Gmail infrequently read; to use only when emails to university account returned.) [Interest] [Career] [Award] {Activity} {Publication} [Course] {Student} {LAMDA Group} Research Interest Research is for curiosity and fun, though practical implications can emerge. I am interested in general machine learning and data mining technologies and theoretical underpinnings. During the past decades I have been working on the following topics: Ensemble learning Evolutionary learning Weakly supervised learning (incl. semi-supervised learning, active learning, multi-instance learning, crowdsourcing learning, learning with noisy labels, etc.) Multi-label learning Imbalanced learning (incl. cost-sensitive learning, class-imbalance learning) Learning theory Face recognition ...... Some of the above topics are still in my concern, some faded out, while some new ones come in: Open-environment machine learning Machine learning + logic reasoning Learnware ...... 周志华 著.机器学习,北京:清华大学出版社,2016. (ISBN 978-7-302-42328-7), with English version; Japanese version; Korean version 周志华, 王魏, 高尉, 张利军 著.机器学习理论导引,北京:机械工业出版社,2020. (ISBN 978-7-111-65424-7) Z.-H. Zhou. Ensemble Methods: Foundations and Algorithms, 2nd edition, Boca Raton, FL: CRC Press, 2025. (ISBN 978-1-032-96060-9). 1st edition with Japanese version; 中文版 Z.-H. Zhou, Y. Yu, C. Qian. Evolutionary Learning: Advances in Theories and Algorithms, Berlin: Springer, 2019. (ISBN 978-981-13-5955-2); 中文版 [go top] Career Main Positions: Cheung Kong Professor (appointed by the Ministry of Education of China) Department of Computer Science & Technology, Nanjing University, China Mar. 2007 - Professor Department of Computer Science & Technology, Nanjing University, China Nov. 2003 - Administrative Positions: Vice President Nanjing University, China Jul. 2024 - Dean School of Artificial Intelligence, Nanjing University, China Mar. 2018 - Sep. 2024 Head Department of Computer Science and Technology, Nanjing University, China Jan. 2018 - Sep. 2024 Deputy Head Department of Computer Science and Technology, Nanjing University, China May 2013 - Jan. 2018 Standing Deputy Director National Key Laboratory for Novel Software Technology, Nanjing University, China Nov. 2010 - Founding Director Institute of Machine Learning and Data Mining (LAMDA), Nanjing University, China Nov. 2007 - Director AI Lab, Department of Computer Science & Technology, Nanjing University, China May 2002 - Honorary Positions: Adjunct Professor Sichuan University, China Jan. 2009 - Dec. 2012 Adjunct Professor Hong Kong University of Science & Technology, China Jan. 2009 - Dec. 2010 Adjunct Professor Nanjing University of Aeronautics and Astronautics, China Jun.2004 - May 2008 Honorary Fellow Deakin University, Australia Nov.2002 - Oct.2006 [go top] Award & Honor (international only) Award (incomplete): CCF-ACM Artificial Intelligence Award (2020) Nation Science Review 2019 Best Paper Award IEEE Computer Society Edward J. McCluskey Technical Achievement Award (2019) ACML Distinguished Contributions Award (2019) Academy of Europe Foreign Member (2017) IEEE Computational Intelligence Magazine 2017 Outstanding Paper Award (with Nitesh V. Chawla, Yaochu Jin, and Graham Williams) ACM Fellow (2016) AAAI Fellow (2016) AAAS Fellow (2016) IEEE ICDM Outstanding Service Award (2016) PAKDD Distinguished Contributions Award (2016) ACM Distinguished Scientist (2013) IEEE Computational Intelligence Society Outstanding Early Career Award (2013) IEEE Fellow (2013) IAPR Fellow (2012) PAKDD 2012 Data Mining Competition (Open Category) Grand Prize Winner Team Leader (Members: Nan Li, Chao Qian, Shao-Yuan Li, Yue Zhu, Qing Da) Pattern Recognition Journal 2006-2010 Most Cited Article (with Xiaoyang Tan, Songcan Chen, and Fuyan Zhang) IET/IEE Fellow (2010) ISIBM Outstanding Achievement Award (2009) Keynote/Plenary Speaker (recent incomplete): CVPR'21 (IEEE Conference on Computer Vision and Pattern Recognition), Jun. 2021, virtual WSDM'20 (13th ACM International Conference on Web Search and Data Mining), Feb. 2020, Houston, TX, USA IJCAI'19 (28th International Joint Conference on Artificial Intelligence, Aug. 2019, Macao, China) AISTATS'19 (22nd International Conference on Artificial Intelligence and Statistics, Apr. 2019, Naha, Japan) ICPR'18 (24th International Conference on Pattern Recognition, Aug. 2018, Beijing, China) KSEM'17 (10th International Conference on Knowledge Science, Engineering and Management, Aug. 2017, Melbourne, Australia) AusAI'16 (29th Australasian Joint Conference on Artificial Intelligence, Dec. 2016, Hobart, Austrlia) ISNN'16 (13th International Symposium on Neural Networks, Jul. 2016, Saint Petersburgh, Russia) ICMLA'15 (14th IEEE International Conference on Machine Learning and Applications, Dec. 2015, Miami, FL, USA) ANNPR'14 (6th IAPR International Workshop on Artificial Neural Networks in Pattern Recognition, Oct. 2014, Montreal, Canada) ECDA'14 (European Conference on Data Analysis, Jul. 2014, Bremen, Germany) [go top] Course Introduction to Machine Learning For undergraduate students Advanced Machine Learning For graduate students Introduction to Data Mining For undergraduate students [go top] Last Modified: Oct. 20, 2024",
  "content_length": 5694,
  "method": "requests",
  "crawl_time": "2025-12-01 14:55:09"
}