{
  "name": "Zhi-Quan Tom Luo",
  "homepage": "https://sse.cuhk.edu.cn/en/faculty/luozhiquan",
  "status": "success",
  "content": "LUO, Zhiquan Tom | School of Science and Engineering Search Search SEARCH CUHK-Shenzhen ç®ä½ä¸­æ About the School Introduction of SSE Deanâs message Annual Undergraduate Prospectus School Video Contact us News SSE News SSE Newsletter Interviews with SSE Faculty Members Announcement Programmes Undergraduate Programmes Mathematics and Applied Mathematics Physics Chemistry Materials Science and Engineering New Energy Science and Engineering Electrical and Computer Engineering Financial Engineering(offered jointly with the SME and the SDS) CUHK Special Exchange Programme Double Major Programmes Columbia University 3+2 Initiative (Columbia Class) Long Feng Class Bachelor-Master Scheme Bachelor-PhD Class Q&A on Registry Matters Master of Science Programmes Master of Science in Communications Engineering Master of Science in Computer and Information Engineering Master of Science in Integrated Circuits and Systems Master of Science in Financial Mathematics Master of Science in Artificial Intelligence for Science Master of Science in Artificial Intelligence and Robotics Executive Master of Science in Supply Chain and Logistics Management (Part-time master programme) Research Postgraduate Programmes Mathematics Physics Chemistry Materials Science and Engineering Energy Science and Engineering Computer and Information Engineering Biomedical Engineering Faculty Academic Staff Research Fellow Academic Research Research Field Laboratories Research News Academic Activities Long Feng Science Forum SSE Upcoming Events SSE Events Review Materials Characterization and Preparation Center Students Studentsâ Activities Studentsâ Achievements Student Sharing Student Associations Maker Lab About us Tools & Equipment Project Ideas Career About us Career Handbook International Co Exchange & Visiting Programs Collaborative Degree Program Further Education and Employment Latest News Industrial Talks Employment Workshop Further Study Workshop Counselling Alumni Cooperation Recruitments About the School Introduction of SSE Deanâs message Annual Undergraduate Prospectus School Video Contact us News SSE News SSE Newsletter Interviews with SSE Faculty Members Announcement Programmes Undergraduate Programmes Mathematics and Applied Mathematics Physics Chemistry Materials Science and Engineering New Energy Science and Engineering Electrical and Computer Engineering Financial Engineering(offered jointly with the SME and the SDS) CUHK Special Exchange Programme Double Major Programmes Columbia University 3+2 Initiative (Columbia Class) Long Feng Class Bachelor-Master Scheme Bachelor-PhD Class Q&A on Registry Matters Master of Science Programmes Master of Science in Communications Engineering Master of Science in Computer and Information Engineering Master of Science in Integrated Circuits and Systems Master of Science in Financial Mathematics Master of Science in Artificial Intelligence for Science Master of Science in Artificial Intelligence and Robotics Executive Master of Science in Supply Chain and Logistics Management (Part-time master programme) Research Postgraduate Programmes Mathematics Physics Chemistry Materials Science and Engineering Energy Science and Engineering Computer and Information Engineering Biomedical Engineering Faculty Academic Staff Research Fellow Academic Research Research Field Laboratories Research News Academic Activities Long Feng Science Forum SSE Upcoming Events SSE Events Review Materials Characterization and Preparation Center Students Studentsâ Activities Studentsâ Achievements Student Sharing Student Associations Maker Lab About us Tools & Equipment Project Ideas Career About us Career Handbook International Co Exchange & Visiting Programs Collaborative Degree Program Further Education and Employment Latest News Industrial Talks Employment Workshop Further Study Workshop Counselling Alumni Cooperation Recruitments CUHK-Shenzhen ç®ä½ä¸­æ LUO, Zhiquan Tom X.Q. Deng Presidential Chair Professor Foreign Member of the Chinese Academy of Engineering (CAE)ï¼Fellow of Royal Society of Canada (FRSC), IEEE Fellow, Fellow of the Society for Industrial and Applied Mathematics Education Background PhD, ORC/EECS, MIT, 1989BS, Applied Mathematics, Peking University, 1984 Research Field Optimization methods for big data analytics, complexity and computational issues arising from signal processing, digital communication Personal Website https://tomluo123.github.io/ Personal Website (CUHK-Shenzhen) https://myweb.cuhk.edu.cn/luozhiquan Email pengyanni@cuhk.edu.cn Biography Zhi-Quan (Tom) Luo (Fellow, IEEE and SIAM) received the B.S. degree in Applied Mathematics from Peking University and the Ph.D. degree in Operations Research from the Massachusetts Institute of Technology (MIT) in 1989. From 1989 to 2003, he was on the faculty of the Department of Electrical and Computer Engineering at McMaster University, Canada, where he held a Tier-1 Canada Research Chair in Information Processing (2001â2003). He subsequently joined the University of Minnesota as a Full Professor and the endowed ADC Chair in Digital Technology. Currently, he is Vice President (Academic) at The Chinese University of Hong Kong, Shenzhen, and serves as the Director of the Shenzhen Research Institute of Big Data (SRIBD) and Executive Director of the Shenzhen Loop Area Institute.Professor Luo was elected a Fellow of the Royal Society of Canada in 2014 and a Foreign Member of the Chinese Academy of Engineering in 2021. His honors include four IEEE Signal Processing Society Best Paper Awards, a EUSIPCO Best Paper Award, the 2020 ICCM Best Paper Award, the Farkas Prize from INFORMS, the Paul Y. Tseng Memorial Lectureship Prize, the inaugural CSIAM Wang Xuan Applied Mathematics Prize (2022), the Shenzhen Science and Technology Progress Award (First Class, 2023), and the Hua Prize (2025). He served as Editor-in-Chief of the IEEE Transactions on Signal Processing (2012â2014) and as an Associate Editor for several leading journals.In 2020, Professor Luo pioneered a data-driven approach to network optimization that integrates statistical network models with artificial intelligence. This methodology has been deployed in more than 30 countries to optimize 1.8 million base stations, improving wireless network performance for roughly one quarter of the global population while substantially reducing operators' costs and carbon emissions, thereby delivering significant economic and societal impact worldwide. Academic Publications F. Yin, L. Pan, T. Chen, S. Theodoridis, Zhi-Quan Luo and A. M. Zoubir, \"Linear Multiple Low-Rank Kernel Based Stationary Gaussian Processes Regression for Time Series,\" in IEEE Transactions on Signal Processing, vol. 68, pp. 5260-5275, 2020.Mingyi Hong, Tsung-Hui Chang, Xiangfeng Wang, Meisam Razaviyayn, Shiqian Ma, Zhi-Quan Luo, âA block successive upper bound minimization method of multipliers for linearly constrained convex optimizationâ, MATHEMATICS OF OPERATIONS RESEARCH, Vol. 68, pp. 2244â2255, June. 2020Y. Huang, S. A. Vorobyov and Z. Luo, \"Quadratic Matrix Inequality Approach to Robust Adaptive Beamforming for General-Rank Signal Model,\" in IEEE Transactions on Signal Processing, vol. 68, pp. 2244-2255, Jan. 2020Y. Yang, M. Pesavento, Z. Luo and B. Ottersten, \"Inexact Block Coordinate Descent Algorithms for Nonsmooth Nonconvex Optimization,\" in IEEE Transactions on Signal Processing, vol. 68, pp. 947-961, Dec. 2019Ruoyu Sun, Zhi-Quan Luo, Yinyu Ye, âOn the Efficiency of Random Permutation for ADMM and Coordinate Descentâ, MATHEMATICS OF OPERATIONS RESEARCH, Vol. 45, pp. 233â271, Nov. 2019.Nicholas Moehle, Xinyue Shen, Zhi-Quan Luo, Stephen Boyd , âA Distributed Method for Optimal Capacity Reservationâ, Journal of Optimization Theory and Applications, Vol. 182, pp. 1130â1149, September 2019.Z. Lin, W. Pu and Z. Luo, \"Minimax Design of Constant Modulus MIMO Waveforms for Active Sensing,\" in IEEE Signal Processing Letters, vol. 26, no. 10, pp. 1531-1535, Oct. 2019.Meisam Razaviyayn, Mingyi Hong, Navid Reyhanian, Zhi-Quan Luo, âA linearly convergent doubly stochastic GaussâSeidel algorithm for solving linear equations and a certain class of over-parameterized optimization problemsâ, Mathematical Programming, Vol. 176, pp. 465â496, July 2019.W. Liu, R. Sun and Zhi-Quan Luo, \" Globally Optimal Joint Uplink Base Station Association and Beamforming,\" in IEEE Transactions on Communications, May.2, 2019.A. Aubry, A. De Maio, A. Zappone, M. Razaviyayn and Z. Luo, \"A New Sequential Optimization Procedure and Its Applications to Resource Allocation for Wireless Systems,\" in IEEE Transactions on Signal Processing, vol. 66, no. 24, pp. 6518-6533, 15 Dec.15, 2018.F. Shang, J. Cheng, Y. Liu, Z. Luo and Z. Lin, \"Bilinear Factor Matrix Norm Minimization for Robust PCA: Algorithms and Applications,\" in IEEE Transactions on Pattern Analysis and Machine Intelligence, vol. 40, no. 9, pp. 2066-2080, 1 Sept. 2018.Ghasem MIRJALILY and Z. Luo, \" Optimal Network Function Virtualization and Service Function Chaining: A Survey.\" Chinese Journal of Electronics, vol. 27, Issue 4, pp. 704 â 717, July 2018.W. Liao, M. Hong, H. Farmanbar and Z. Luo, \"A Distributed Semiasynchronous Algorithm for Network Traffic Engineering.\" IEEE Transactions on Signal and Information Processing over Networks, vol. 4, no. 3, pp. 436-450, Sept. 2018.Wenqiang Pu, Ya Feng Liu, Junkun Yan, Hongwei Liu, Zhi-Quan Luo, âOptimal estimation of sensor biases for asynchronous multi-sensor data fusionâ, Mathematical Programming, Vol. 170, pp. 357â386, July 2018.Wenqiang Pu, Jinjun Xiao, Tao Zhang, Zhi-Quan Luo, âAn optimization model for electroencephalography-assisted binaural beamformingâ, The Journal of the Acoustical Society of America, vol. 143, issue 3, pp. 1744-1744, Mar. 2018.Mingyi Hong and Zhi-Quan Luo, âOn the Linear Convergence of The Alternating Direction Method of Multipliersâ, Mathematical Programming, Vol. 162, pp. 165â",
  "content_length": 13225,
  "method": "requests",
  "crawl_time": "2025-12-01 14:55:12"
}