{
  "name": "Zhi Zhang 0001",
  "homepage": "https://zhangzhics.github.io",
  "status": "success",
  "content": "About me - Zhi Zhang Zhi Zhang (张智)zzhangphd@gmail.com Follow Sydney, Australia I’m a Senior lecturer (equivalent to associate professor in US) in the University of Western Australia. I received my Ph.D. degree in Computer Science from the University of New South Wales, Australia. My research interests are in the areas of hardware security, system security, and their intersections with AI security.News!Our paper “HyperHammer: Breaking Free from KVM-Enforced Isolation” has been accepted by ASPLOS 2025.Our paper “Achilles: A Formal Framework of Leaking Secrets from Signature Schemes via Rowhammer” has been accepted by USENIX Security 2025.Our paper “THEMIS: Towards Practical Intellectual Property Protection for Post-Deployment On-Device Deep Learning Models” has been accepted by USENIX Security 2025.Working Experience 2025.8-Present: Senior Lecturer University of Western Australia 2023.1-2025.8: Lecturer University of Western Australia 2022.4-2022.12: Research Scientist Data61, CSIRO Supervisor: Dr. Dongxi Liu and Dr. Surya Nepal 2020.11-2022.4: Postdoctoral Fellow Data61, CSIRO Supervisor: Dr. Dongxi Liu and Dr. Surya Nepal 2020.8-2020.11: Postdoctoral Fellow Swinburne University of Technology Supervisor: Prof. Yang Xiang Prestigious Awards [2025] USENIX SECURITY Honorable Mention Paper Award [2024] USENIX SECURITY Distinguished Paper Award [2023] ASIACCS Distinguished Paper Award [2022] CSIRO’s SCS Program Collaboration Award [2022] CSIRO’s SCS Program Science Excellence Award [2021] UNSW Dean’s Award for Outstanding PhD Theses (Top 10%) [2017-2020] UNSW International Postgraduate Award and CSIRO Top-up Phd Scholarship [2012] Peking University Scholarship, China (Top 3%) [2010] College Graduate Excellence Award, Sichuan Province, China (Top 1%) [2009] National Scholarship, China (Top 3%) Invited Industrial Talks [2020] A New Rowhammer Technique to Break ALL Existing Defenses Yueqiang Cheng, Zhi Zhang CanSecWest [2019] Winter is Coming Back: Defeating the Most Advanced Rowhammer Defenses to Gain Root and Kernel Privileges Yueqiang Cheng, Zhi Zhang, Surya Nepal, Zhi Wang Black Hat Asia Open-Source Contributions [2024] CVE-2024-2881, CVE-2024-1545, CVE-2023-51939, CVE-2024-28285, CVE-2024-31510 (Cryptographic Libraries) [2023] /sys/devices/virtual/powercap accessible by default to containers (Docker Container Security Issue) [2016] VT-d: make flush-all actually flush all (Xen Patch) [2013] CVE-2013-6375 (Xen Vulnerability) [2013] fix linear page table construction in alloc l2 table (Xen Patch) Educational Background [2017-2021] Ph.D. in computer science, University of New South Wales Supervisor: Dr. Surya Nepal [2011-2014] M.S. in software engineering, Peking University Supervisor: Prof. Qingni Shen [2012-2013] Visiting Research Assistant, Singapore Managment University [2007-2011] B.S. in communication engineering, Sichuan University",
  "content_length": 2883,
  "method": "requests",
  "crawl_time": "2025-12-01 14:55:09"
}