{
  "name": "Zhichao Cao 0001",
  "homepage": "https://cse.msu.edu/~caozc",
  "status": "success",
  "content": "Zhichao Cao Homepage - Michigan State University Zhichao Cao Ph.D Office: Room 3224, Engineering Building, 428 S. Shaw Lane, East Lansing, MI 48824 Email: caozc at msu dot edu Biography I am an assistant professor at Department of Computer Science and Engineering, Michigan State University (MSU). I am also a faculty affiliate of AgBioResearch at MSU. My research interests lie broadly in IoT systems, edge computing and mobile computing. Recent News [Proud Supervisor] Yidong Ren has received the Paul Baran Young Scholar Award from Marconi Society. Congratulations to Yidong! Great job! [Wireless Networking] Our paper \"LoRaSeek: Boosting Denoising Ability in Neural-enhanced LoRa Decoder via Hierachical Feature Extraction\" is accepted by ACM MobiCom 2025. Congratulations to Khang, an excellent senior undergraduate who has been working with me for three years! [Service] Invited to be a TPC member of ACM MobiCom 2026, which will be held in Austin, U.S. Welcome to submit your works. [Group] Jialuo Du will join my group as a Research Associate this fall. [Group] Yidong has successful obtained his Ph.D. degree and will join Qualcomm. Congratulations to Yidong. [Service] Invited to be a TPC member of IEEE INFOCOM 2026, which will be held in Japan. Welcome to submit your works. [Wireless Sensing] Our paper \"Proteus: Enhanced mmWave Leaf Wetness Detection with Cross-Modality Knowledge Transfer\" is accepted by ACM SenSys 2025. Congratulations to Yimeng! [Service] Invited to be the Finance Co-Chair of ACM MobiCom 2025 [Wireless Networking] Our paper \"AeroEcho: Towards Agricultural Low-power Wide-area Backscatter with Aerial Excitation Source\" is accepted by IEEE INFOCOM 2025. Congratulations to Yidong! [Edge ML] Our paper \"GeoFL: A Framework for Efficient Geo-Distributed Cross-Device Federated Learning\" is accepted by IEEE INFOCOM 2025. Congratulations to Maolin! [Wireless Sensing] Our paper \"Adonis: Neural-enhanced Fine-grained Leaf Wetness Sensing with Efficient mmWave Imaging\" is accepted by IEEE INFOCOM 2025. Congratulations to Yimeng! [Media Report] My NSF CAREER Award has been highlighted in several reports of MSU Engineering Communications, MSU Today, and Spartan Community Letter . Go Green! Edge Intelligence and Networking (EIN) Group [Group Members] Our EIN research group focus on broad networking optimization and computational intelligence topics we have met during developing and implementing various edge and IoT systems that can enhance MSU's strength. The research of EIN group is mainly support by NSF and MSU internal resources. Research Projects: MindCare: Long-term sensing and monitoring IoT and edge systems for mental health. (2024 - Present) FarmEye: A large-scale agriclture data collection system with LoRa. (2021 - Present) NSF Grants: CAREER: LoRa Enabled Space-air-ground Integrated Networks for Next-Generation Agricultural IoT. 2024 - 2029. [Project Website] Collaborative Research: NeTS: Medium: Towards High-Performing LoRa with Embedded Intelligence on the Edge (Leading PI). 2023 - 2027. [Project Website] CNS Core: Small: Collaborative: Coalescent Computing - New Theory, Mechanism and Platform for Adaptive Edge Computing (PI). 2020 - 2022. MSU Internal Grants: MDARD: A Holistic Approach to Increasing Climate Resilience of Tree Fruit Production (Co-PI). 2024 - 2027. Tetrad: Risk Modeling for Older Drivers: Applying Edge AI and IoT in Cognition-aware, Continuous Driving Skill Analysis (Leading PI). 2024 - 2025. Recent Publications (Year 2025) Peer Review: Khang Nguyen, Yidong Ren, Jialuo Du, Jingkai Lin, Maolin Gan, Shigang Chen, Mi Zhang, Chunyi Peng, and Zhichao Cao. LoRaSeek: Boosting Denoising Ability in Neural-enhanced LoRa Decoder via Hierachical Feature Extraction. MobiCom 2025. [PDF] Shakhrul Iman Siam, Hyunho Ahn, Li Liu, Samiul Alam, Hui Shen, Zhichao Cao, Ness Shroff, Bhaskar Krishnamachari, Mani Srivastava, and Mi Zhang. Artificial intelligence of things: A survey. ACM TOSN 21(1):1-75, 2025. [PDF] Yimeng Liu, Maolin Gan, Huaili Zeng, Yidong Ren, Gen Li, Jingkai Lin, Younsuk Dong, Xiaobo Tan, and Zhichao Cao. Proteus: Enhanced mmWave Leaf Wetness Detection with Cross-Modality Knowledge Transfer. SenSys 2025. [PDF] Yidong Ren, Gen Li, Yimeng Liu, Younsuk Dong, and Zhichao Cao. AeroEcho: Towards Agricultural Low-power Wide-area Backscatter with Aerial Excitation Source. INFOCOM 2025. [PDF] Yimeng Liu, Maolin Gan, Gen Li, Younsuk Dong, and Zhichao Cao. Adonis: Neural-enhanced Fine-grained Leaf Wetness Sensing with Efficient mmWave Imaging. INFOCOM 2025. [PDF] Maolin Gan, Lanpeng Li, Samiul Alam, Li Liu, Luyang Liu, Mi Zhang, and Zhichao Cao. GeoFL: A Framework for Efficient Geo-Distributed Cross-Device Federated Learning. INFOCOM 2025. [PDF] Shichen Zhang, Qijun Wang, Maolin Gan, Zhichao Cao, and Huacheng Zeng. RadSee: See Your Handwriting Through Walls Using FMCW Radar. NDSS 2025. [PDF] Pre-Print: Yimeng Liu, Maolin Gan, Yidong Ren, Gen Li, Jingkai Lin, Younsuk Dong, and Zhichao Cao. Hydra-Bench: A Benchmark for Multi-Modal Leaf Wetness Sensing. arXiv preprint arXiv:2507.22685, 2025. [PDF] Yidong Ren, Maolin Gan, Chenning Li, Shakhrul Iman Siam, Mi Zhang, Shigang Chen, and Zhichao Cao. Morph: ChirpTransformer-based Encoder-decoder Co-design for Reliable LoRa Communication. arXiv preprint arXiv:2507.22851, 2025. [PDF] Maolin Gan*, Khang Nguyen*, Jialuo Du, Yidong Ren, and Zhichao Cao. NELoRa++: Towards General Neural-enhanced LoRa Demodulation. MSU EIN Group Technical Report, 2025. [PDF] Teaching Fall 2020, 2025/Spring 2021, 2022, 2023, CSE-220, Programming in C Spring 2024, 2025, CSE-410, Operating System Spring 2020/Fall 2021, 2022, 2023, CSE-891, AIoT: Artificial Intelligence in the Edge Quote \"Nothing endures but change.\" - Heraclitus, Greek philosopher (540 BC - 480 BC)",
  "content_length": 5794,
  "method": "requests",
  "crawl_time": "2025-12-01 14:55:16"
}