{
  "name": "Zhichun Zhu",
  "homepage": "https://ece.uic.edu/profiles/zhichun-zhu-phd",
  "status": "success",
  "content": "Zhu, Zhichun | Electrical and Computer Engineering | University of Illinois Chicago Your browser is unsupported We recommend using the latest version of IE11, Edge, Chrome, Firefox or Safari. Zhichun Zhu Associate Professor Department of Electrical and Computer Engineering Contact Building & Room: 1015 SEO Address: 851 S. Morgan St, MC 154, Chicago, IL 60607 Office Phone: 312.355.0441 Email: zzhu@uic.edu About Research Interests Computer architecture Performance modeling and evaluation Energy-efficiency computer designs Selected Publications Bahareh Pourshirazi, Majed Valad Beigi, Zhichun Zhu, and Gokham Memik, Writeback-aware LLC management for PCM-based main memory systems, ACM Transactions on Design Automation of Electronic Systems, Vol. 24, No. 2, March 2019, pp. 18:1-18:19. Kun Fang, Hongzhong Zheng, Jiang Lin, Zhao Zhang, and Zhichun Zhu, Mini-Rank: A power-efficient DDRx DRAM memory architecture, IEEE Transactions on Computers, Vol. 63, No.6, June 2014, pp. 1500-1512. Jiang Lin, Hongzhong Zheng, Zhichun Zhu, and Zhao Zhang, Thermal modeling and management of DRAM systems, IEEE Transactions on Computers, Vol. 63, No. 10, October 2013, pp. 2069-2082. Kun Fang, Long Chen, Zhao Zhang, and Zhichun Zhu, Memory architecture for integrating emerging memory technologies. In Proceedings of the 2011 International Conference on Parallel Architecture and Compilation Techniques (PACT), Galveston, TX, October 2011, pp. 403-412. Hongzhong Zheng, Jiang Lin, Zhao Zhang and Zhichun Zhu, Decoupled DIMM: Building high-bandwidth memory system using low-speed DRAM devices. In Proceedings of the 36th Annual International Symposium on Computer Architecture, Austin, TX, June 2009, pp. 255-265. Hongzhong Zheng, Jiang Lin, Zhao Zhang, Eugene Gorbatov, Howard David and Zhichun Zhu, Mini-rank: adaptive DRAM architecture for improving memory power efficiency. In Proceedings of the 41st IEEE/ACM International Symposium on Microarchitecture, Lake Como, Italy, November 2008, pp. 210-221. Jiang Lin, Hongzhong Zheng, Zhichun Zhu, Eugene Gorbatov, Howard David and Zhao Zhang, Software thermal management of DRAM memory for multicore systems. In Proceedings of the 2008 ACM SIGMETRICS International Conference on Measurement and Modeling of Computer Systems, Annapolis, MD, June 2008, pp. 337-348. Jiang Lin, Hongzhong Zheng, Zhichun Zhu, Howard David and Zhao Zhang, Thermal modeling and management of DRAM memory systems. In Proceedings of the 34th International Symposium on Computer Architecture, San Diego, CA, June 2007, pp. 312-322. Zhichun Zhu and Zhao Zhang, A performance comparison of DRAM memory system optimizations for SMT processors, In Proceedings of the 11th International Symposium on High-Performance Computer Architecture, San Francisco, CA, February 2005, pp. 213-224. Zhao Zhang, Zhichun Zhu, and Xiaodong Zhang, A Permutation-based Page Interleaving Scheme to Reduce Row-buffer Conflicts and Exploit Data Locality. In Proceedings of 33rd Annual International Symposium on Microarchitecture, Monterey, California, December 2000, pp. 32-41. Education Ph.D. Computer Science College of William and Mary, 2003 B.Sc. Computer Engineering Huazhong University of Science and Technology, China,1992",
  "content_length": 3219,
  "method": "requests",
  "crawl_time": "2025-12-01 14:55:28"
}