{
  "name": "Zhida Sun",
  "homepage": "https://zhdsun.github.io",
  "status": "success",
  "content": "Zhida Sun - HCI Researcher Visual Computing Research Center College of Computer Science and Software Engineering Shenzhen University Zhizhen Building (L6), Yuehai Campus (South), 3688 Nanhai Avenue, Nanshan District, Shenzhen zhida.sun at connect dot ust dot hk zhida.sun at szu dot edu dot cn I am zhdsun @ Gmail, Facebook, Twitter, LinkedIn, Medium, Instagram, Behance, Vimeo [DBLP] [Google Scholar] [ORCID] Updates Jul/25 Receive a 'Special Recognition' from UIST'25 review Mar/25 Creative blends of visual concepts @ CHI'25 Feb/25 Layered image vectorization via semantic simplification @ CVPR'25 Jan/25 Receive a 'Special Recognition' from CHI'25 review 2024 Sep/24 Receive a 'Special Recognition' from CSCW'24 review Jul/24 Graph simplification via adaptive motif design @ VIS'24 Jul/24 Visual analysis system for UAV path planning @ CAD/CG'24 Mar/24 Understanding anthropomorphism in chatbot system @ CHI LBW'24 Mar/24 Creating visual analogies with data @ CHI'24 Mar/24 Visual design for amplifying music listening experience through song comments @ Journal of Visualization 2023 Dec/23 Probing vision transformer with interactive visualization @ ICDMW'23 Jan/23 Our work 'IntimaSea' gets accepted by CHI'23 2022 Nov/22 Receive a 'Special Recognition' from CHI'23 review Jan/22 Our work 'Metaphoraction' gets accepted by TOCHI'22 2021 May/21 Attend CHI'21 @ Virtual 2020 Dec/20 Our work 'MetaMap' gets accepted by CHI'21 Nov/20 Receive a 'Special Recognition' from CHI'21 review July/20 Pass the PhD Thesis Defence May/20 Pass the PhD Thesis Proposal Defence Apr/20 Our work 'A Postcard from Your Food Journey in the Past' gets accepted by DIS'20 Mar/20 Our work 'Fostering Engagement in Technology-Mediated Stress Management' gets accepted by IJHCS'20 2019 Dec/19 Our work 'VoiceCoach' gets accepted by CHI'20 Jun/19 Our work 'DataShot' gets accepted by IEEE InfoVis'19 2018 Dec/18 Start my internship @ MSRA, Beijing Nov/18 Receive two 'Special Recognition's from CHI'19 review Jun/18 Attend DIS'18 @ Hong Kong as a volunteer Apr/18 Attend CHI'18 @ Montreal Feb/18 Our Late-Breaking Work on scale exploration in AR gets accepted by CHI'18 Jan/18 Pass the PhD Qualifying Exam 2017 Nov/17 Receive a 'Special Recognition' from CHI'18 review Jun/17 Start my oversea exchange @ EPFL, Lausanne May/17 Attend CHI'17 @ Denver Feb/17 Our Late-Breaking Work on biofeedback design gets accepted by CHI'17 2016 Dec/16 Present our 'Danmu visualization' work in SIGGRAPH Asia'16 @ Macao I serve as a tenure-track assistant professor at the College of Computer Science and Software Engineering (CSSE), Shenzhen University (SZU), and I am also affiliated with the Visual Computing Research Center (VCC). I obtained my doctoral degree from the Human-Computer Interaction Initiative, Department of Computer Science and Engineering (CSE), at the Hong Kong University of Science and Technology (HKUST), where I was under the supervision of Prof. Xiaojuan Ma. My primary research interest revolves around the field of Human-Engaged Computing, with a particular emphasis on: Leveraging foundation models and conceptual metaphors to stimulate creative ideation and inspiration. Enhancing exploratory and explanatory data analysis through novel visualization and narrative techniques. Fostering user engagement and well-being in digital environments by incorporating positive computing principles. Our research center welcomes graduate students and visiting interns/scholars who share a strong interest in these areas. Please get in touch with your resume/CV to learn more about potential opportunities. Publications Featured All publications Creativity Support with Conceptual Metaphors Creative Blends of Visual Concepts Zhida Sun, Zhenyao Zhang, Yue Zhang, Min Lu, Dani Lischinski, Daniel Cohen-Or, and Hui Huang. CHI Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 2025. [project page] [arxiv] [presentation: Youtube] Metaphoraction: Support Gesture-based Interaction Design with Metaphorical Meanings Zhida Sun, Sitong Wang, Chengzhong Liu, and Xiaojuan Ma. TOCHI ACM Transactions on Computer-Human Interaction, 2022. [project page] [pre-print] [link] [gesture survey] [code] [hands-on experience] [presentation: Youtube] MetaMap: Supporting Visual Metaphor Ideation through Multi-dimensional Example-based Exploration Youwen Kang*, Zhida Sun*, Sitong Wang, Zeyu Huang, Ziming Wu, and Xiaojuan Ma. CHI Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 2021. [project page] [code] [paper] [link] [video preview: Youtube] [presentation: Youtube] Design for Well-being \"A Postcard from Your Food Journey in the Past\": Promoting Self-Reflection on Social Food Posting Zhida Sun, Sitong Wang, Wenjie Yang, Onur Y端r端ten, Chuhan Shi, and Xiaojuan Ma. DIS Proceedings of the Designing Interactive Systems Conference, 2020. [project page] [link] [presentation: Youtube] [presentation: Vimeo] Fostering Engagement in Technology-Mediated Stress Management: A Comparative Study of Biofeedback Designs Zhida Sun, Manuele Reani, Quan Li, and Xiaojuan Ma. IJHCS International Journal of Human-Computer Studies, 2020. [project page] [link] [media coverage: HKUST] Visualization for Data Communication DataShot: Automatic Generation of Fact Sheets from Tabular Data Yun Wang*, Zhida Sun*, Haidong Zhang, Weiwei Cui, Ke Xu, Xiaojuan Ma, and Dongmei Zhang. TVCG InfoVis IEEE Transactions on Visualization and Computer Graphics, 2019. [paper] [supplemental material] [link] [media coverage: MSRAsia] [media coverage: ZJU VAG] [media coverage: Zhihu] [intro: bilibili] VideoForest: Interactive Visual Summarization of Video Streams Based on Danmu Data Zhida Sun, Mingfei Sun, Nan Cao, and Xiaojuan Ma. SA SIGGRAPH ASIA Symposium on Visualization, 2016. [project page] [paper] [link] [video] [slide] Creative Blends of Visual Concepts Zhida Sun, Zhenyao Zhang, Yue Zhang, Min Lu, Dani Lischinski, Daniel Cohen-Or, and Hui Huang. CHI Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 2025. [project page] [arxiv] [presentation: Youtube] Layered Image Vectorization via Semantic Simplification Zhenyu Wang, Jianxi Huang, Zhida Sun, Yuanhao Gong, Daniel Cohen-Or, and Min Lu. CVPR Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition, 2025. [project page] [arxiv] AdaMotif: Graph Simplification via Adaptive Motif Design Hong Zhou, Peifeng Lai, Zhida Sun, Xiangyuan Chen, Yang Chen, Huisi Wu, and Yong Wang. TVCG IEEE Transactions on Visualization and Computer Graphics, 2024. [link] [fast forward: Youtube] [presentation: Youtube] Anthropomorphism in Chatbot Systems Between Gender and Individual Differences Zhida Sun, Manuele Reani, Yunzhong Luo, and Zhuolan Bao. CHI EA Proceedings of the SIGCHI Conference Extended Abstracts on Human Factors in Computing Systems, 2024. [link] [presentation: Youtube] Beyond Numbers: Creating Analogies to Enhance Data Comprehension and Communication with Generative AI Qing Chen, Wei Shuai, Jiyao Zhang, Zhida Sun, and Nan Cao. CHI Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 2024. [project page] [link] [video preview: Youtube] [presentation: Youtube] Amplifying the Music Listening Experience through Song Comments on Music Streaming Platforms Longfei Chen, Qianyu Liu, Chenyang Zhang, Yangkun Huang, Zhenhui Peng, Haipeng Zeng, Zhida Sun, Xiaojuan Ma, and Quan Li. J. Vis. Journal of Visualization, 2024. [link] EL-VIT: Probing Vision Transformer with Interactive Visualization Hong Zhou, Rui Zhang, Peifeng Lai, Chaoran Guo, Yong Wang, Zhida Sun, and Junjie Li. ICDMW IEEE International Conference on Data Mining Workshops, 2023. [link] IntimaSea: Exploring Shared Stress Display in Close Relationships Yanqi Jiang, Xianghua (Sharon) Ding, Xiaojuan Ma, Zhida Sun, and Ning Gu. CHI Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 2023. [media coverage: UofGlasgow] [video preview: Youtube] [presentation: Youtube] Metaphoraction: Support Gesture-based Interaction Design with Metaphorical Meanings Zhida Sun, Sitong Wang, Chengzhong Liu, and Xiaojuan Ma. TOCHI ACM Transactions on Computer-Human Interaction, 2022. [project page] [pre-print] [link] [gesture survey] [code] [hands-on experience] [presentation: Youtube] MetaMap: Supporting Visual Metaphor Ideation through Multi-dimensional Example-based Exploration Youwen Kang*, Zhida Sun*, Sitong Wang, Zeyu Huang, Ziming Wu, and Xiaojuan Ma. CHI Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 2021. [project page] [code] [paper] [link] [video preview: Youtube] [presentation: Youtube] \"A Postcard from Your Food Journey in the Past\": Promoting Self-Reflection on Social Food Posting Zhida Sun, Sitong Wang, Wenjie Yang, Onur Y端r端ten, Chuhan Shi, and Xiaojuan Ma. DIS Proceedings of the Designing Interactive Systems Conference, 2020. [link] [presentation: Youtube] [presentation: Vimeo] Fostering Engagement in Technology-Mediated Stress Management: A Comparative Study of Biofeedback Designs Zhida Sun, Manuele Reani, Quan Li, and Xiaojuan Ma. IJHCS International Journal of Human-Computer Studies, 2020. [project page] [link] [media coverage: HKUST] VoiceCoach: Interactive Evidence-based Training for Voice Modulation Skills in Public Speaking Xingbo Wang, Haipeng Zeng, Yong Wang, Aoyu Wu, Zhida Sun, Xiaojuan Ma, and Huamin Qu. CHI Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 2020. [project page] [paper] [link] [demo] [presentation: Youtube] [presentation: iQIYI] [slide] [data] DataShot: Automatic Generation of Fact Sheets from Tabular Data Yun Wang*, Zhida Sun*, Haidong Zhang, Weiwei Cui, Ke Xu, Xiaojuan Ma, and Dongmei Zhang. TVCG InfoVis IEEE Transactions on Visualization and Computer Graphics, 2019. [paper] [supplemental material] [link] [media coverage: MSRAsia] [media coverage: ZJU VAG] [media coverage: Zhihu] [intro: bilibili] Mediating Color Filter Exploration with Color Theme Semantics",
  "content_length": 15693,
  "method": "requests",
  "crawl_time": "2025-12-01 14:55:21"
}