{
  "name": "Zhifeng Zhu",
  "homepage": "https://zhuzibn.github.io",
  "status": "success",
  "content": "COSMAL COSMAL Group Computational spintronics and magnetism Lab COSMAL consists of a wonderful group of individuals. COSMAL Group Computational spintronics and magnetism Lab COSMAL consists of a wonderful group of individuals. COSMAL Group Computational spintronics and magnetism Lab COSMAL consists of a wonderful group of individuals. Prof. Zhifeng Zhu Assistant Professor, School of Information Science and Technology, ShanghaiTech University Biography I joined School of Information Science and Technology in ShanghaiTech University as an Assistant Professor. I obtained my PhD degree in Engineering from National University of Singapore in Sept. 2019. I obtained my Bachelor degree in Microelectronics from University of Electronic Science and Technology of China in July 2014. Our current research focus on the theoretical and numerical study (e.g., macrospin, micromagnetic and atomistic modelling) of antiferromagnets and ferrimagnets based spintronic devices, including the MRAM, spintronic oscillator, in memory computing and bio-inspired computing. Currently, I am in charge of Shanghai Sailing Project and National Natural Science Foundation of China Youth Project. I am currently a reviewer for Nat. Commun., Phys. Rev. Lett., Phys. Rev. B, Appl. Phys. Lett., J. Appl. Phys., IEEE Trans. Circuits Syst. II, Exp. Briefs, Jpn. J. Appl. Phys. and Appl. Phys. 简介 祝智峰教授获电子科技大学学士学位（专业：电子科学与技术（微电子技术）），后于新加坡国立大学获博士学位（专业：电子工程）。博士毕业后留校从事博士后研究，现为上海科技大学信息科学与技术学院助理教授、博士生导师、研究员。课题组聚焦于自旋电子器件在下一代存储与计算技术中的应用，重点开展磁随机存储器及类脑计算器件的理论与计算模拟研究。 作为负责人主持国家自然科学基金青年项目、面上项目、上海市自然科学基金、上海市扬帆计划等项目，参与多项科技部重点研发计划，并在上海市青少年科学创新实践工作站牵头子课题面向人工智能的类脑芯片研究。指导的学生屡获殊荣，包括博士国家奖学金、上海科技大学优秀毕业生、国家留学基金委资助等。近三年以通讯作者在Phys. Rev. Lett. (*1), Sci. Bull. (*1), ACS Nano (*1), Phys. Rev. B (*5), Appl. Phys. Lett. (*4)等高水平期刊发表论文，并长期担任Phys. Rev. Lett., Nat. Commun., IEEE Trans. Circuits Syst. I,II, IEEE Electron Devices Lett.等权威期刊审稿人。 More Information",
  "content_length": 1914,
  "method": "requests",
  "crawl_time": "2025-12-01 14:55:28"
}