{
  "name": "Zhigang Lu 0001",
  "homepage": "https://zhigang.lu",
  "status": "success",
  "content": "Zhigang's Homepage Home About me Research Selected publications Research team Teaching WSU JCU and UoA Services Professional services Public and Uni services Goodies Useful links Zhigang's Homepage Dr Zhigang LU 卢 志刚 Senior Lecturer (equiv to Assoc Prof in the US system) Academic Program Advisor School of Computer, Data and Mathematical Sciences Western Sydney University Email: Z [dot] Lu [at] westernsydney [dot] edu [dot] au Office: Y.3.32, Building Y, Western Sydney University (Penrith campus), Kingswood, NSW 2747, Australia ORCID: 0000-0001-5102-6217 Homepage: zhigang.lu You'll Never Walk Alone Short Bio Dr Zhigang Lu is a Senior Lecturer of Computer Science, an Academic Program Advisor with the School of Computer, Data and Mathematical Sciences, Western Sydney University (WSU) and a member of WSU Artificial Intelligence Research Group (AIRG). He is also an Adjunct Lecturer with James Cook University since August 2024. His academic career began as a continuing Lecturer of Information Technology at James Cook University from January 2023, where he was recognised as one of the best lecturers based on student evaluations. He played a leading role in developing a new cyber security major to refresh the Master of Information Technology program, which is set to launch in Trimester 1, 2025. Prior to that, he was a Postdoctoral Research Fellow with the Macquarie University Cyber Security Hub, Macquarie University from Jan 2020, working closely with Prof Dali Kaafar, Dr Hassan Asghar and Dr Dinusha Vatsalan. He was funded by the Macquarie University Cyber Security Hub, in partnership with the Defence Science & Technology Group and Data61-CSIRO, through the Next Generation Technologies Fund. He obtained his PhD (supervised by Prof Hong Shen and Prof Michael Sheng, funded by the Adelaide Graduate Research Scholarship) and MPhil (supervised by Prof Hong Shen and A/Prof Nickolas Falkner) degrees from the University of Adelaide (now Adelaide University) and BEng degree from Xidian University, all in computer science. He was one of the two recipients of the University Master by Research Medal in 2015. He won a First Award in the National Undergraduate Mathematical Contest in Modelling (Shaanxi Division) in 2009 and a Third Award in the International Collegiate Programming Contest (ICPC Intramural Competition) in 2008. He also worked as a Data Scientist in the industry for three months in early 2022. Research Interests Topics on privacy, security, robustness and alignment of AI/ML. News Nov, 2025. Our paper, ‘Approximation Algorithm for Constrained -Center Clustering: A Local Search Approach’, was accepted by the 40th Annual AAAI Conference on Artificial Intelligence (AAAI-2026, Top-2 AI conference, oral presentation). Nov, 2025. Our paper, ‘Optimized Algorithms for Text Clustering with LLM-Generated Constraints’, was accepted by the 40th Annual AAAI Conference on Artificial Intelligence (AAAI-2026, Top-2 AI conference, poster presentation). Oct, 2025. I secured a CDMS Undergraduate Summer Research Fund for the Summer Term 2025. Sep, 2025. I will be serving as the PC member for the Tracks of Systems and Infrastructure for Web, Mobile and Web of Things and User Modeling, Personalization and Recommendation at the WebConf-2026 (aka WWW, CORE A*). Sep, 2025. Our paper, ‘One Head to Rule Them All: Amplifying LVLM Safety through a Single Critical Attention Head’, was accepted by the 39th Annual Conference on Neural Information Processing Systems (NeurIPS-2025, Top-3 machine learning conference, poster presentation). Aug, 2025. I was appointed as the Consulting Area Editor for IEEE Transcations on Information Forensics and Security (TIFS, Top-2 cybersecurity journal). Aug, 2025. Our paper, ‘LEAP: An LLM-based Evidence Augmented Pipeline for Table-based Fact Verification’, was accepted by the 21st International Conference on Advanced Data Mining and Applications (ADMA-2025, CORE C & CCF C). Aug, 2025. I was invited to serve as a PC member for AAAI-2026 (Top-2 AI conference). Jul, 2025. Our paper, ‘Energy-Aware Intrusion Detection with Q-learning–Based Dynamic Scheduler on Lightweight IoT Devices’, was accepted as a poster by the 28th International Symposium on Research in Attacks, Intrusions and Defenses (RAID-2025, CORE A). Jul, 2025. Our paper, ‘Online Streaming Sampling Publication Method over Sliding Windows with Differential Privacy’, was accepted by IEEE Transactions on Dependable and Secure Computing (TDSC, Top-2 cybersecurity journal). Jul, 2025. Our paper, ‘Reconstruction of Differentially Private Text Sanitization via Large Language Models’, was accepted by the 28th International Symposium on Research in Attacks, Intrusions and Defenses (RAID-2025, CORE A). Jul, 2025. May you Rest in Peace, Diogo Jota. YNWA May, 2025. Our paper, ‘Near-Optimal Algorithms for Instance-level Constrained k-Center Clustering’, was accepted by IEEE Transactions on Neural Networks and Learning Systems (TNNLS, CORE A*). Apr, 2025. I joined the supervision panel for WSU PhD student Shawal Khan. Feb, 2025. Our team at AIRG secured a $68k grant in collaboration with our industrial partner. I will be leading the project moving forward. Jan, 2025. I was appointed as the Special Issue Chair for SmartIoT-2025. Jan, 2025. I was appointed as the Academic Program Advisor (APA) for Bachelor of CompSci and Bachelor of ICT (WSU Penrith campus). Dec, 2024. Our paper, ‘PriDM: Effective and Universal Private Data Recovery via Diffusion Model’, was accepted by IEEE Transactions on Dependable and Secure Computing (TDSC, Top-2 cybersecurity journal). Dec, 2024. The subject, Artificial Intelligence, I coordinated and lectured from Week 4 at WSU, received 75% overall satisfaction from the student feedback. This is the second-best student evaluation over the past five years. Nov, 2024. Welcome MPhil student Hong Chen to the AIRG, WSU. Page generated 2025-11-08, by jemdoc+MathJax.",
  "content_length": 5934,
  "method": "requests",
  "crawl_time": "2025-12-01 14:55:28"
}