{
  "name": "Zhijian Liu",
  "homepage": "https://zhijianliu.com",
  "status": "success",
  "content": "Zhijian Liu Zhijian Liu zhijian [at] ucsd (dot) edu I am a research scientist at NVIDIA and an incoming assistant professor at UCSD. I finished my PhD at MIT, advised by Song Han. My research focuses on efficient machine learning and systems. I am recruiting PhD students from HDSI/CSE in the upcoming application cycle. I am also always looking for talented research interns to join our group! If you're interested, please fill out this form. Email  / Google Scholar  / LinkedIn  / GitHub News I commit 1 hour every week to provide guidance, suggestions, and/or mentorships for students from underrepresented groups or whoever is in need. Please fill in this form if you are interested. I was selected as one of the Rising Stars in Data Science by UChicago and UCSD! I was selected as one of the Rising Stars in ML and Systems by MLCommons! I was awarded Qualcomm Innovation Fellowship. Thanks, Qualcomm! Our SPVCNN++ won the first place in nuScenes LiDAR Segmentation Challenge. Our HAQ has been integrated into Intel's OpenVINO toolkit. Publications ( show selected / show all ) NVILA: Efficient Frontier Visual Language Models Zhijian Liu*, Ligeng Zhu*, Baifeng Shi, Zhuoyang Zhang, Yuming Lou, Shang Yang, Haocheng Xi, Shiyi Cao, Yuxian Gu, Dacheng Li, Xiuyu Li, Yunhao Fang, Yukang Chen, Cheng-Yu Hsieh, De-An Huang, An-Chieh Cheng, Vishwesh Nath, Jinyi Hu, Sifei Liu, Ranjay Krishna, Daguang Xu, Xiaolong Wang, Pavlo Molchanov, Jan Kautz, Hongxu Yin, Song Han, Yao Lu* CVPR 2025 / Paper / Project Page / Code SparseVILA: Query-Aware Visual Sparsity Should Happen at Decoding Samir Khaki, Junxian Guo, Jiaming Tang, Shang Yang, Yukang Chen, Konstantinos N. Plataniotis, Yao Lu, Song Han, Zhijian Liu ICCV 2025 SparseLoRA: Accelerating LLM Fine-Tuning with Contextual Sparsity Samir Khaki*, Xiuyu Li*, Junxian Guo*, Ligeng Zhu, Chenfeng Xu, Konstantinos N. Plataniotis, Amir Yazdanbakhsh, Kurt Keutzer, Song Han, Zhijian Liu ICML 2025 / Paper Fast-dLLM: Training-Free Acceleration of Diffusion LLM by Enabling KV Cache and Parallel Decoding Chengyue Wu, Hao Zhang, Shuchen Xue, Zhijian Liu, Shizhe Diao, Ligeng Zhu, Ping Luo, Song Han, Enze Xie arXiv 2025 / Paper / Project Page / Code FlatFormer: Flattened Window Attention for Efficient Point Cloud Transformer Zhijian Liu*, Xinyu Yang*, Haotian Tang, Shang Yang, Song Han CVPR 2023 / Paper / Project Page / Code SparseViT: Revisiting Activation Sparsity for Efficient High-Resolution Vision Transformer Xuanyao Chen*, Zhijian Liu*, Haotian Tang, Li Yi, Hang Zhao, Song Han CVPR 2023 / Paper / Project Page / Code BEVFusion: Multi-Task Multi-Sensor Fusion with Unified Bird's-Eye View Representation Zhijian Liu*, Haotian Tang*, Alexander Amini, Xinyu Yang, Huizi Mao, Daniela L. Rus, Song Han ICRA 2023 / Paper / Project Page / Code TorchSparse: Efficient Point Cloud Inference Engine Haotian Tang*, Zhijian Liu*, Xiuyu Li*, Yujun Lin, Song Han MLSys 2022 / Paper / Project Page / Code VISTA 2.0: An Open, Data-Driven Simulator for Multimodal Sensing and Policy Learning for Autonomous Vehicles Alexander Amini*, Tsun-Hsuan Wang*, Igor Gilitschenski, Wilko Schwarting, Zhijian Liu, Song Han, Sertac Karaman, Daniela L. Rus ICRA 2022 / Paper / Project Page / Code / MIT News Enable Deep Learning on Mobile Devices: Methods, Systems, and Applications Han Cai*, Ji Lin*, Yujun Lin*, Zhijian Liu*, Haotian Tang*, Hanrui Wang*, Ligeng Zhu*, Song Han TODAES 2022 / Paper LocTex: Learning Data-Efficient Visual Representations from Localized Textual Supervision Zhijian Liu, Simon Stent, Jie Li, John Gideon, Song Han ICCV 2021 / Paper / Project Page SemAlign: Annotation-Free Camera-LiDAR Calibration with Semantic Alignment Loss Zhijian Liu*, Haotian Tang*, Sibo Zhu*, Song Han IROS 2021 / Paper / Project Page PVNAS: 3D Neural Architecture Search with Point-Voxel Convolution Zhijian Liu*, Haotian Tang*, Shengyu Zhao, Kevin Shao, Song Han TPAMI 2021 / Paper / Project Page Efficient and Robust LiDAR-Based End-to-End Navigation Zhijian Liu*, Alexander Amini*, Sibo Zhu, Sertac Karaman, Song Han, Daniela L. Rus ICRA 2021 / Paper / Project Page / CSAIL News Differentiable Augmentation for Data-Efficient GAN Training Shengyu Zhao, Zhijian Liu, Ji Lin, Jun-Yan Zhu, Song Han NeurIPS 2020 / Paper / Project Page / Code Searching Efficient 3D Architectures with Sparse Point-Voxel Convolution Haotian Tang*, Zhijian Liu*, Shengyu Zhao, Yujun Lin, Ji Lin, Hanrui Wang, Song Han ECCV 2020 / Paper / Project Page / Code DataMix: Efficient Privacy-Preserving Edge-Cloud Inference Zhijian Liu*, Zhanghao Wu*, Chuang Gan, Ligeng Zhu, Song Han ECCV 2020 / Paper HAT: Hardware-Aware Transformers for Efficient Natural Language Processing Hanrui Wang, Zhanghao Wu, Zhijian Liu, Han Cai, Ligeng Zhu, Chuang Gan, Song Han ACL 2020 / Paper / Project Page / Code / MIT News GAN Compression: Efficient Architectures for Interactive Conditional GANs Muyang Li, Ji Lin, Yaoyao Ding, Zhijian Liu, Jun-Yan Zhu, Song Han CVPR 2020 / Paper / Project Page / Code APQ: Joint Search for Network Architecture, Pruning and Quantization Policy Tianzhe Wang*, Kuan Wang*, Han Cai, Ji Lin, Zhijian Liu, Hanrui Wang, Yujun Lin, Song Han CVPR 2020 / Paper / Code Hardware-Centric AutoML for Mixed-Precision Quantization Kuan Wang*, Zhijian Liu*, Yujun Lin*, Ji Lin, Song Han IJCV 2020 / Paper Lite Transformer with Long-Short Range Attention Zhanghao Wu*, Zhijian Liu*, Ji Lin, Yujun Lin, Song Han ICLR 2020 / Paper / Code Point-Voxel CNN for Efficient 3D Deep Learning Zhijian Liu*, Haotian Tang*, Yujun Lin, Song Han NeurIPS 2019 / Paper / Project Page / Code / NVIDIA News Spotlight Presentation Deep Leakage from Gradients Ligeng Zhu, Zhijian Liu, Song Han NeurIPS 2019 / Paper / Project Page / Code AutoML for Architecting Efficient and Specialized Neural Networks Han Cai*, Ji Lin*, Yujun Lin*, Zhijian Liu*, Kuan Wang*, Tianzhe Wang*, Ligeng Zhu*, Song Han IEEE Micro 2019 / Paper HAQ: Hardware-Aware Automated Quantization with Mixed Precision Kuan Wang*, Zhijian Liu*, Yujun Lin*, Ji Lin, Song Han CVPR 2019 / Paper / Project Page / Code Oral Presentation Unsupervised Discovery of Parts, Structure, and Dynamics Zhenjia Xu*, Zhijian Liu*, Chen Sun, Kevin Murphy, William T. Freeman, Joshua B. Tenenbaum, Jiajun Wu ICLR 2019 / Paper / Project Page / Code Learning to Exploit Stability for 3D Scene Parsing Yilun Du, Zhijian Liu, Hector Basevi, Ales Leonardis, William T. Freeman, Joshua B. Tenenbaum, Jiajun Wu NeurIPS 2018 / Paper / Project Page AMC: AutoML for Model Compression and Acceleration on Mobile Devices Yihui He*, Ji Lin*, Zhijian Liu, Hanrui Wang, Li-Jia Li, Song Han ECCV 2018 / Paper / Project Page / Code Physical Primitive Decomposition Zhijian Liu, William T. Freeman, Joshua B. Tenenbaum, Jiajun Wu ECCV 2018 / Paper / Project Page",
  "content_length": 6782,
  "method": "requests",
  "crawl_time": "2025-12-01 14:55:31"
}