{
  "name": "Zhijian Wu",
  "homepage": "https://cs.whu.edu.cn/info/1019/2949.htm",
  "status": "success",
  "content": "ï»¿ å´å¿å¥-æ­¦æ±å¤§å­¦è®¡ç®æºå­¦é¢ EN æ§ç æ­¦å¤§ä¸»é¡µ é¦é¡µ å­¦é¢æ¦åµ å­¦é¢ç®ä» åå²æ²¿é© ç°ä»»é¢å¯¼ ç»ç»æºæ èç³»æä»¬ è®¡ç§æ å å¸èµéä¼ é«å±æ¬¡äººæ ä¸ä»»æå¸ å®éªææ¯äººå è£ä¼æå¸ äººæå¹å » æ¬ç§çæè² ç ç©¶çæè² çå­¦çæè² å½é äº¤æµ ç§å­¦ç ç©¶ ç§ç è¿å± å­¦æ¯äº¤æµ é¡¹ç®ç³æ¥ ç ç©¶å¹³å° å ç¾¤å·¥ä½ å å»ºå·¥ä½ çºªæ£å·¥ä½ å·¥ä¼å·¥ä½ å ±éå¢å·¥ä½ å­¦ä¹ èµæ äººææè å¸èµå²ä½æè åå£«åæè éç¼äººåæè æ ¡åé£é æ°åºæ ¡å æ ¡åå¨æ æ ¡ååº ä¿¡æ¯å ¬å¼ è§ç« å¶åº¦ åäºæµç¨ å¸¸ç¨ä¸è½½ èç³»æ¹å¼ E-mailï¼zhijianwu@whu.edu.cn åå ¬çµè¯ï¼ åå ¬å°ç¹ï¼ å´å¿å¥ æ­¦æ±å¤§å­¦è®¡ç®æºå­¦é¢ è½¯ä»¶å·¥ç¨ç³» æºè½åè½¯ä»¶ä¸æå¡ç ç©¶æææ (åå¯¼) å§åï¼å´å¿å¥ ä¸»é¡µï¼ æ§å«ï¼ç· èç§°ï¼ææ (åå¯¼) å­¦åå­¦ä½ï¼åå£« çµè¯ï¼ åå ¬å°ç¹ï¼ E-mailï¼zhijianwu â whu.edu.cn è¯·æå·¥æ¿æ¢ç¬¦å· é¢åï¼æºè½è®¡ç® æçä¿¡æ¯ï¼å¹´åº¦ææ¶ç¡å£«0åï¼ææ¶æ¹åï¼...è¯·éæ©...ã ææ¶åå£«0åï¼ææ¶æ¹åï¼...è¯·éæ©...ã ç ç©¶æ¹å æºè½è®¡ç® æè²èæ¯ 1979å¹´-1983å¹´ï¼æ±è¥¿å¤§å­¦(ç°åæå¤§å­¦)æ°å­¦ç³»æ¬ç§ï¼1985å¹´-1988å¹´ï¼æ­¦æ±å¤§å­¦æ°å­¦ç³»ç¡å£«ï¼2001å¹´-2004å¹´ï¼æ­¦æ±å¤§å­¦è®¡ç®æºå­¦é¢åå£«ã å·¥ä½ç»éª 1983å¹´-1985å¹´ï¼æ±è¥¿æè²å­¦é¢(ç°åæå¸èå­¦é¢)æ°å­¦ç³»ï¼1988å¹´-2010å¹´ï¼æ­¦æ±å¤§å­¦è½¯ä»¶å·¥ç¨å½å®¶éç¹å®éªå®¤ï¼2010å¹´è³ä»ï¼æ­¦æ±å¤§å­¦è®¡ç®æºå­¦é¢ã ææè¯¾ç¨ æ¬ç§çãç¦»æ£æ°å­¦ããç¡å£«çãå¹¶è¡ç®æ³ãåãæ¼åè®¡ç®ååºç¨ããåå£«çãå¯è®¡ç®çè®ºä¸è®¡ç®å¤ææ§ãã åè¡¨è®ºæ Zhijian Wu and Lishan Kang. A fast and elitist parallel evolutionary algorithm for solving systems of non-linear equations[C]. Proceedings of 2003 Congress on Evolutionary Computation, 8-12, December 2003, Canberra, Australia, pp.1026-1028 Zhijian Wu, Zhilong Tang, Jun Zou, Lishan Kang, and Mingbiao Li. Evolutionary algorithm for solving parameter identification problems in elliptic systems[C]. Proceedings of 2004 Congress on Evolutionary Computation, 19-23 June 2004, Portland, Oregon, USA, pp.803-808 Zhijian Wu, Zhilong Tang, Jun Zou, Lishan Kang, and Mingbiao Li. An Evolutionary Algorithm for Parameters Identification in Parabolic Systems[C], Proceedings of 2004 Genetic and Evolutionary Computation Conference, 26-30 June 2004, Washington, USA, pp.1336-1337 Zhijian Wu, Lishan Kang, Jun Zou, Zhilong Tang, and Mingbiao Li. An Evolutionary Algorithm for Identifying Parameters in Parabolic Systems[C]. Proceedings of International Symposium on Intelligence Computation & Its Applications 2005, 4-6 April 2005, Wuhan, China: 92-96 Dazhi Jiang, Zhijian Wu, and Lishan Kang. A Simple and Effective Evolutionary Algorithm for Multimodal Function Optimization[C]. Proceedings of International Symposium on Intelligence Computation & Its Applications 2005, 4-6 April 2005, Wuhan, China, pp.257-261 å§å¤§å¿ï¼å´å¿å¥ï¼åº·ç«å±±. åºå è¡¨è¾¾å¼ç¨åºè®¾è®¡çGRCMæ¹æ³[J]. ç³»ç»ä»¿çå­¦æ¥, 2006, 18(6): 1466-1468 Zhijian Wu, Dazhi Jiang, and Lishan Kang, Evolutionary Algorithm for Identifying Discontinuous Parameters of Inverse Problems[C]. Proceedings of the International Conference on Computational Science 2007 (Y. Shi et al.(Eds.)), 27-30 May 2007, Beijing, China, Part IV, LNCS 4490, pp.1131-1138 Zhijian Wu, Dazhi Jiang, Ming Wei, and Yuangxiang Li. Dynamical Evolution in Function Finding[C]. Proceeding of the Third International Conference on Nature Computation (ICNC), Jingsheng Lei, Jingtao Yao, and Qingfu Zhang (Eds.), 24--27 August, 2007, Haikou, China, Volume 5, pp.614-618 Dazhi Jiang, Zhijian Wu, and Lishan Kang. Parameter Identifications in Differential Equations by Gene Expression[C]. Proceeding of the Third International Conference on Nature Computation (ICNC), Jingsheng Lei, Jingtao Yao, and Qingfu Zhang (Eds.), 24--27 August, 2007, Haikou, China, Volume 5, pp.644-648 Dazhi Jiang and Zhijian Wu. Algorithm Based on Heuristic Subspace Searching Strategy for Solving Investment Portfolio Optimization Problems[C]. Proceedings of the IEEE Congress on Evolutionary Computation 2008(CEC 2008), 1-6 June 2008, Hong Kong, pp.607-611 Dazhi Jiang and Zhijian Wu. Evolutionary Modeling Based on Overlap Reuse[C]. Proceedings of the IEEE Congress on Evolutionary Computation 2008(CEC 2008), 1-6 June 2008, Hong Kong, pp.612-616 å´å¿å¥ï¼å§å¤§å¿. ä¸ç§åºäºåºå è¡¨è¾¾å¼ç¨åºè®¾è®¡çæ°ç®æ³[J]. ç³»ç»ä»¿çå­¦æ¥, 2008, 20(8):1986-1989 Hui Wang, Yong Liu, Zhijian Wu, Hui Song, Sanyou Zeng, and Lishang Kang. An Improved Particle Swarm Optimization with Adaptive Jumps[C]. Proceedings of the IEEE Congress on Evolutionary Computation 2008(CEC 2008), 1-6 June 2008, Hong Kong, pp.392-397 Hui Wang, Zhijian Wu, Yong Liu, and Sanyou Zeng. Particle Swarm Optimization with a Novel Multi-parent Crossover Operator[C]. Proceedings of the 4th International Conference on Natural Computation (ICNC 2008), 25-27 August 2008, Jinan, China, pp.664-668 Jinglei Guo, Zhijian Wu, and Zhejun Wu. An Improved Particle Swarm Optimization Algorithm based on Velocity Updating[C]. Proceedings of the 2008 IEEE International Conferences on Cybernetics & Intelligent Systems (CIS) and Robotics, Automation & Mechatronics (RAM) (CIS-RAM 2008), 22-24 September 2008ï¼Chengdu, China, pp.330-334 é­äº¬è¾ï¼å´å¿å¥ï¼å¼ å»ºä¼. åºäºç­çº§çµçèªéåºç²å­ç¾¤ä¼åç®æ³[J]. åä¸­ç§æå¤§å­¦å­¦æ¥(èªç¶ç§å­¦ç), 2009, 37(4):65-68 Jianwei Zhang, Zhijian Wu, Jinglei Guo, Min Peng, Yingjiang Zhang, and Chunzhi Wang. Evolving Classification Rules by Unconstrained Gene Expression Programming[C]. Proceedings of International Workshop on Intelligent Systems and Applications, 2009. ISA 2009. 23-24 May 2009, pp:1-4 Jianwei Zhang, Zhijian Wu, Zongyue Wang, Jinglei Guo, and Zhangcan Huang. Unconstrained gene expression programming[C]. IEEE Congress on Evolutionary Computation, 2009. CEC '09. 18-21 May 2009, pp:2043-2048 Hui Wang, Zhijian Wu, Yong, Liu, Jing Wang, Dazhi Jiang, and Lili Chen. Space Transformation Search: A New Evolutionary Technique[C]. The 2009 World Summit on Genetic and Evolutionary Computation, GEC 2009, June, 2009, 537-544 Hui Wang, Zhijian Wu, and S. Rahnamayan. A scalability Test for Accelerated DE Using generalized Opposition-Based Learning[C]. Proceedings of Intelligent System Design and Applications, 2009, June, 2009, pp.1090-1095 Hui Wang, Zhijian Wu, Jing Wang, Xiaojian Dong, Song Yu, and Cheng Chen. A New Population Initialization Method Based on Space Transformation Search[C]. Fifth International Conference on Natural Computation, ICNC 2009, August, 2009, 332-336 Xiaojian Dong, Song Yu, Zhijian Wu, and Zhangxing Chen. A hybrid parallel evolutionary algorithm based on elite-subspace strategy and space transformation search[C]. Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics), v 5938 LNCS, p 139-145, 2010, High Performance Computing and Applications - Second International Conference, HPCA 2009,  August, 2009 Song Yu, Zhijian Wu, Hui Wang, and Zhangxing Chen. A hybrid particle swarm optimization algorithm based on space transformation search and a modified velocity model[C]. Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics), v 5938 LNCS, p522-527, 2010, High Performance Computing and Applications - Second International Conference, HPCA 2009, August, 2009 Jing Wang, Zhijian Wu, Hui Wang, and Lishan Kang. A Novel Evolutionary Algorithm Based on Multi-parent Crossover and Space Transformation Search[C]. The Proceeding of 4th International Symposium on Intelligence Computation and Applications, Huangshi, China, Oct. 23-25, 2009, Springer-Verlag Berlin, Heidelberger Platz 3, D-14197 Berlin, Germany 2009:201-210 å¼ å»ºä¼ï¼å´å¿å¥ï¼é»æ¨ç¿ï¼å§å¤§å¿ï¼é­äº¬è¾. åºäºå¤è¡¨è¾¾å¼ç¼ç¨çåç±»ç®æ³ç ç©¶[J]. å°åå¾®åè®¡ç®æºç³»ç»ï¼2010, 31(7): 1371-1374 Hui Wang, Zhijian Wu, Sanyou Zeng, Dazhi Jiang, Yong Liu, Jing Wang, and Xianqiang Yang. A Simple and Fast Particle Swarm Optimization[J]. J. of Mult.-Valued Logic & Soft Computing, 2010, 16:611-629 Hui Wang, Zhijian Wu, and Shahryar Rahnamayan. Differential Evolution Enhanced by Neighborhood Search[C]. In Proceedings of IEEE Congress on Evolutionary Computation, July, 2010, 1-8 Hui Wang, Zhijian Wu, Shahryar Rahnamaya, and Dazhi Jiang. Sequential DE Enhanced by Neighborhood Search for Large Scale Global Optimization[C]. In Proceedings of IEEE World Congress on Computational Intelligence 2010: 4056-4062 Xuezhi Yue, Zhijian Wu, Dazhi Jiang, and Kangshun Li. GPS Height Fitting using Gene Expression Programming[C]. In Proceedings of International Symposium on  Intelligence Computation and Applications, October, 2010, LNCS: 25-32 Dazhi Jiang, Hui Wang, and Zhijian Wu. A Variant of Differential Evolution Based on Permutation Regulation Mechanism[C]. In Proceedings of International Symposium on  Intelligence Computation and Applications, October, 2010, LNCS: 76-85 Hui Wang, Zhijian Wu, Shahryar Rahnamayan, and Jing Wang. Diversity Analysis of Opposition-Based Differential Evolutionâan Experimental Study[C]. In Proceedings of International Symposium on Intelligence Computation and Applications, October, 2010, LNCS:95-102 Jing Wang, Zhijian Wu, and Hui Wang. Hybrid Differential Evolution Algorithm with Chaos and Generalized Opposition-Based Learning[C]. In Proceedings of International Symposium on Intelligence Computation and Applications, October, 2010, LNCS:103-111 Xiaojian Dong, Zhijian Wu, Zhaolu Guo, Hui Wang, and Kangshun Li. Research on FPGA Chip of Software/Hardware Co-Design for Calculating Super-high-order Matrix[C]. 2010 3rd International Conference on Power Electronics and Intelligent Transportation System, 554-557. èµµéæ, å´å¿å¥, ",
  "content_length": 21872,
  "method": "requests",
  "crawl_time": "2025-12-01 14:55:30"
}