{
  "name": "Zhiling Lan",
  "homepage": "https://cs.uic.edu/profiles/lan-zhiling",
  "status": "success",
  "content": "Lan, Zhiling | Computer Science | University of Illinois Chicago Your browser is unsupported We recommend using the latest version of IE11, Edge, Chrome, Firefox or Safari. Zhiling Lan Professor Department of Computer Science Contact Building & Room: CDRLC 4407 Address: 850 W. Taylor St, MC 152, Chicago, IL 60607 Email: zlan@uic.edu Related Sites: Research Website About Zhiling Lan is Professor of Computer Science at the University of Illinois Chicago (UIC). She also has a joint appointment with Argonne National Laboratory. She was Professor of Computer Science at the Illinois Institute of Technology from 2002 to 2023. She leads the SPEAR team (Systems for Performance, Energy, and Resiliency), part of the UIC EVL Lab. Research Interests: Parallel and distributed systems, high-performance computing External Links: Google Scholar DBLP Selected Grants DOE, Tachyon: Intelligent Multi-Scale Modeling of Distributed Resilient Infrastructure and Workflows for Data Intensive HEP Analyses, site PI at UIC NSF, SHF: Small: Intelligent Management of Hybrid Workloads for Extreme Scale Computing, PI NSF, AIMCI: AI-Guided Resource Management for Advanced Cyberinfrastructure, PI NSF, Beyond Performance: Energy-Conscious High Performance Computing (EcoHPC), PI DOE/ANL, AI4LCF: AI-guided leadership facility management, PI Selected Publications SC’25     Z. Zheng, S. Sultanov, M. Papka, and Z. Lan, “Exploring Uncore Frequency Scaling for Heterogeneous Computing”, Proc. of ACM/IEEE SC, 2025. TOMACS’25     X. Wang, K. Brown, R. Ross, C. Carothers, and Z. Lan, “MFNetSim: A Multi-Fidelity Network Simulation Framework for Multi-Traffic Modeling of Dragonfly Systems”, ACM Transactions on Modeling and Computer Simulation (TOMACS), 2025. CCGrid’25    F. Ferdaus, X. Wu, V. Taylor, Z. Lan, S. Shanmugavelu, V. Vishwanath, and M. Papka, “Evaluating Energy Efficiency of AI Accelerators Using Two MLPerf Benchmarks”, Proc of CCGrid’25, 2025. LLMxHPC’24    M. Dearing, Y. Tao, X. Wu, Z. Lan, and V. Taylor, “LASSI: An LLM-based Automated Self-Correcting Pipeline for Translating Parallel Scientific Codes”, 2024 International Workshop on Large Language Models and HPC(LLMxHPC), 2024. PADS’23      E. Cruz, K. Brown, X. Wang, X. Xu, K. Shu, Z. Lan, R. Ross and C. Carothers, “Hybrid PDES Simulation of HPC Networks using Zombie Packets”,  [Best Short Paper Award], ACM SIGSIM-PADS’23. SC’22     Y. Kang, X. Wang, and Z. Lan, “Mitigating Network Contention with Intelligent Routing” Cluster’22      B. Li, M. Dearing, Y. Fan, B. Allcock, P. Rich, M. Papka, and Z. Lan, “MRSch: Multi-Resource Scheduling for HPC”. IPDPS’21    Y. Fan, Z. Lan, P. Rich, W. Allcock, and M. Papka, “Hybrid Workload Scheduling on HPC Systems”. HPDC’21     Y. Kang, X. Wang, and Z. Lan, “Q-adaptive: A Multi-Agent Reinforcement Learning Based Routing on Dragonfly Network” IPDPS’21     Y. Fan, Z. Lan, T. Childers, P. Rich, W. Allcock, and M. Papka, “Deep Reinforcement Agent for Scheduling in HPC”. IPDPS’20    X. Wang, M. Mubarak, Y. Kang, R. Ross, and Z. Lan, “Union: An Automatic Workload Manager for Accelerating Network Simulation”. HPDC’19     Y. Fan, Z. Lan, P. Rich, W. Allcock, M. Papka, B. Austin, and D. Paul, “Scheduling Beyond CPUs for HPC”. SC’16.    X. Yang, J. Jenkins, M. Mubarak, R. Ross, and Z. Lan, “Watch Out for the Bully! Job Interference Study on Dragonfly Network”. SC’16     S. Wallace, X. Yang, V. Vishwanath, W. Allcock, S. Coghlan, M. Papka, and Z. Lan, “A Data Driven Scheduling Approach for Power Management on HPC Systems”. Service to Community Technical Program Committee (TPC): SC, HPDC, ICS, IPDPS, CCGrid, CCGrid, e-Energy, eScience, JSSPP, PADS, MASCOTS, and others Associate Editor of IEEE Transactions on Parallel and Distributed Systems (TPDS), 2014-2018. Education Ph.D. in Computer Engineering from Northwestern University, 2002",
  "content_length": 3843,
  "method": "requests",
  "crawl_time": "2025-12-01 14:55:33"
}