{
  "name": "Zhipeng Wang 0009",
  "homepage": "https://research.manchester.ac.uk/en/persons/zhipeng-wang",
  "status": "success",
  "content": "Zhipeng Wang - Research Explorer The University of Manchester Zhipeng Wang Dr Lecturer in Cyber Security, Systems and Software Security https://orcid.org/0000-0003-1089-1583 Accepting PhD Students Personal profile OverviewI am a Lecturer (equivalent to an Assistant Professor) in the Department of Computer Science at the University of Manchester. Previously, I finished my role as a Postdoctoral Research Associate at Imperial College London, where I also completed my PhD. My research interests lie in the domain of privacy and security within decentralized and distributed computing systems, with a particular focus on blockchain and decentralized AI systems, as well as the underlying cryptographic primitives and protocols that support and secure them. Currently, I am exploring the following topics: Blockchain: privacy, security, consensus, and applicationsApplied cryptography: classical and post-quantum solutionsDecentralized AI: security, privacy, and incentive mechanisms Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Education/Academic qualificationDoctor of Philosophy, PhD in Computer Science, Imperial College LondonOct 2020 → May 2024Award Date: 1 May 2024 External positionsResearch Associate, Imperial College LondonJan 2024 → Jul 2025 KeywordsSecurityPrivacyCryptographyDecentralized SystemBlockchain & Distributed LedgersDecentralized AI Fingerprint Dive into the research topics where Zhipeng Wang is active. These topic labels come from the works of this person. Together they form a unique fingerprint. Blockchain Computer Science 100% Smart Contract Computer Science 66% Lattices Mathematics 66% Ethereum Computer Science 33% Privacy Preserving Computer Science 33% Obscuring Computer Science 33% Evaluation Result Computer Science 33% User Privacy Computer Science 33% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output 12 Conference contribution 3 Article Research output per year Research output per year AIArena : A Blockchain-Based Decentralized AI Training PlatformWang, Z., Sun, R., Lui, E., Zhou, T., Wen, Y. & Sun, J., 2025, Companion Proceedings of the ACM on Web Conference 2025.Research output: Chapter in Book/Conference proceeding › Conference contribution › peer-review A Transaction-Level Model for Blockchain PrivacyWicht, F.-X. P., Wang, Z., Le, D. V. & Cachin, C., 2025, International Conference on Financial Cryptography and Data Security (FC).Research output: Chapter in Book/Conference proceeding › Conference contribution › peer-review DSKE: Digital Signatures with Key ExtractionWang, Z., Alpos, O., Kavousi, A., Wong, H. W. H., Chau, S. Y., Le, D. V. & Cachin, C., 2025, Cryptographers’ Track at the RSA Conference.Research output: Chapter in Book/Conference proceeding › Conference contribution › peer-review Leverage Staking with Liquid Staking Derivatives (LSDs): Opportunities and RisksXiong, X., Wang, Z., Chen, X., Knottenbelt, W. & Huth, M., Jun 2025, 2025 IEEE International Conference on Blockchain and Cryptocurrency (ICBC).Research output: Chapter in Book/Conference proceeding › Conference contribution › peer-review SoK: Bitcoin Layer Two (L2)Qi, M., Wang, Q., Wang, Z., Schneider, M., Zhu, T., Chen, S., Knottenbelt, W. & Hardjono, T., Sept 2025, In: ACM Computing Surveys.Research output: Contribution to journal › Article › peer-review View all 15 research outputs",
  "content_length": 3899,
  "method": "requests",
  "crawl_time": "2025-12-01 14:55:35"
}