{
  "name": "Zhiqian Chen",
  "homepage": "https://imczq.com",
  "status": "success",
  "content": "Zhiqian ChenSearch陈枳扦 Assistant Prof.Mississippi State Univ.I am an Assistant Professor of Computer Science & Engineering at Mississippi State University, focusing on dynamics over graphs (see details of my research interests). I obtained my Ph.D. at Virginia Tech in 2020, under the supervision of Dr. Chang-Tien Lu. For students interested in me, check ways to work with me. If interested in my courses, please check the course syllabi.Check Unifying Spectral and Spatial Graph Neural Network (slides) at CVPR 24’, SIAM MDS 24’, CIKM 24’ and SIAM Data Mining 25’. This tutorial is based on our ACM Computing Survey paper and a paper collection Awesome Spectral GNN.Hiring PhD student starting in Spring 2026. Fill this form to apply.If a course is full and you still want to enroll, see how to override[Honor] 11/25: Recognized as a Research Fellow at the Social Science Research Center, Mississippi State University, during its 75th Anniversary.[Grant] 8/25: Received Turing AI Gift Money to conduct research on Large Language Models (LLMs)[Grant] 6/25: Received NSF CAREER Award for my research on unification and interactions across heterogenous graph dynamics: NSF Link[Award] 5/25: Received the Ottilie Schillig Special Teaching Award - Enhancing AI Pedagogy with Interactive Educational Tools: Awardee List[Grant] 8/24: Received a NSF CNS/MSI fund (co-PI) to advance speech recognition in English and Spanish w/ graph learning & LLMs: NSF Link.[Grant] 7/24: Received a NSF CNS/CIRC fund (PI) to develop research infrastructure for graph dynamics: NSF Link.[Papers] 7/24: 1 paper accepted at IJCAI 24 about Trajectory Mining on Graph, 2 papers accepted at EMBC 2024 about Antimicrobial Resistance Prediction with Genetic Graph and Generation of Synthetic Microbiomes, 1 paper accepted at PAKDD on Appliances Graph for Energy Disaggregation[Grant] 6/24: We will start working on the spatial epidemiology of animal disease with USDA scientists under USDA-ARS funded project.[Grant] 4/24: Received a NSF EDU/ITEST fund (Co-PI) to conduct AI education research: NSF Link. See media report.[Grant] 1/24: Received NSF IIS/III REU supp to fund (PI) undergraduate student research.[Paper] 12/23: 2 papers are accepted by AAAI 24 proposing Graph Bayesian Optimization to conduct information propagation efficiently: Multiple-Source Localization from a Single-Snapshot Observation Using Graph Bayesian Optimization, and Graph Bayesian Optimization for Multiplex Influence Maximization[Paper] 12/23: Our theoretical framework for spectral GNN accepted by ACM Computing Survey, see paper, related work and slides.[Grant] 12/23: Received a Seed Grant from the International Institute to develop collaboration with the U. of Auckland in New Zealand.[Grant] 12/23: Launch a working group on Graph AI doing cross-disciplinary study. Thanks to BCoE.[Tool] 8/23: XFlow is released, which targets modeling generalized graph flows[Grant] 8/23: Received support from USDA-ARS funded project (Co-PI) on disease genetics. Special thanks to CVM@MSState. See our storymap.[Paper] 12/22: One paper is accepted by SIAM Data Mining (SDM) 23’ Understanding Influence Maximization via Higher-Order Decomposition: how seeds interact in higher-order perspective[Grant] 4/22: Received NSF’s IIS/III fund (PI) for interpretable graph dynamics: NSF LinkMore News[Paper] 12/21: One paper about Graph Wavelet is accepted by SIAM Data Mining (SDM) 22’ with SIAM Early Career Travel Award[Tutorial] 5/21: See our tutorial Spreading Model for Epidemics (GNN, RNN, SIR and PDE) in SDM 21’[Paper & Award] 9/20: Papers on Kalman filtering and school redistricting are accepted by ACM SIGSPATIAL 20’ with (Best Paper Award)[Paper] 12/19: Unsupervised learning for material discovery is published in Nature Communications.Selected as 22nd of Top 50 Chemistry and Materials Sciences Articles Top 50 CollectionResearch Interest: My research focuses on graph dynamics, leveraging methodologies such as spectral graph theory, uncertainty quantification, higher-order analysis, and physics-inspired approaches. Currently, I am particularly interested in the dynamics of coupled and interdependent networks. My collaborations span diverse applications, including Social network 1, Transportation 2, Spatial epidemiology, ecological network 3, Brain network 4, Genetics 5, Circuit 6. Also, I have been working on spectral method 7, Uncertainty Quantification 8, LLM/transformers, AI education 9research interestsWorking with MS State faculty with crimiology expertise in cyberbully, hate speech in NSF projects: Advancing Speech Detection: A Hybrid Approach Using Large Language Models and Graph Neural Networks, and Synergistic Graph Flow Analytics: An Integrated Infrastructure for Bridging Complexity, Fragmentation, and Interdisciplinary Gaps ↩︎traffic modeling, Graph Convolutional Networks with Kalman Filtering for Traffic Prediction, redistricting Geospatial clustering for balanced and proximal schools ↩︎with USDA ecologists in funded projects. ↩︎with MS State faculty and Univ. of Mississippi Medical Center (UMMC) on brain signals of ADHD & sleep ↩︎with MS State College of Veterinary Medicine, EMBC paper ↩︎UC Davis & GMU, DATE paper ↩︎Bridging the Gap between Spatial and Spectral Domains: A Unified Framework for Graph Neural Networks ↩︎AAAI 24: Multiple-Source Localization from a Single-Snapshot Observation Using Graph Bayesian Optimization, SDM 23: Understanding Influence Maximization via Higher-Order Decomposition ↩︎NSF project: Learning to create Intelligent Solutions with Machine Learning and Computer Vision: A Pathway to AI Careers for Diverse High School Students ↩︎Grants, Awards & HonorsNSF CAREERNSF Jun 2025 – May 2030Sole PI - Unification across various graph dynamics and their interactionsNSF CNSNSF Jan 2025 – Dec 2026Co-PI - MSI: Detect hate speech in English and Spanish with graph learning + LLM.See certificateNSF EDUNSF Sep 2024 – Aug 2027Co-PI - ITEST: Develop AI education program for K-12 in Mississippi.See certificateNSF CNSNSF Jul 2024 – Jun 2025PI - CIRC: Develop Grand Theory for Graph Dynamics.See certificateNSF REU - SupplementNSF Feb 2024 – Nov 2024Sole-PI: Develop undergraduate research experience on graph dynamics.See certificateUSDA-ARSUSDA Oct 2023 – Aug 2028Co-PI - Developing Detection and Modeling Tools for the Geospatial and Environmental Epidemiology of Animal Disease.NSF IISNSF Apr 2022 – Nov 2024Sole PI - CRII: Interpretable Influence Propagating and Blocking on Graphs.See certificateUSDA-ARSUSDA Apr 2020 – Aug 2024Co-PI - Advancing Agricultural Research through High Performance ComputingSelected*All UQ Spectral Higher-Order ApplicationHigher-order Relation in SeedsHow remote seeds can implicitly ``interact’’ with each other in the influence maximization problem?PDF Cite CodeAn Unified Framework for GraphsIs there an unfying framework for all types of graphs, including spectral and spatial, also, directed, higher-order, and dynamic graphs?PDF Code SlidesGraph Bayesian OptimizationHow to conduct Bayesian optimization over graph problems so as to reduce data use?Machine Learning for Computer Scientists and Data Analysts: From an Applied PerspectiveA textbook for practitioners and students in computer science and data analysisCite ProjectGraph Learning with Kalman FilteringUse Kalman filtering to handle uncertainty.PDF Cite Code VideoGraph Learning on CircuitsUes graph neural network to model circuit, and predict its encryption attribute.PDF CiteGraph Learning on Street ViewsUse streetview to predict the crime statistics.PDF CiteUse GAN to Fuse Music GenresMake new music with GAN!PDF Cite SlidesContact Me zchen@cse.msstate.edu OR chen.zhiqian.work@gmail.com 304 Butler Hall, 665 Perry Street, MS State, MS 39762 Cite × Copy Download",
  "content_length": 7777,
  "method": "requests",
  "crawl_time": "2025-12-01 14:55:34"
}