{
  "name": "Zhiqiang Tao",
  "homepage": "http://ztao.cc",
  "status": "success",
  "content": "ZTao's Homepage Welcome to ZTao's Homepage! Home Research Publications Teaching Group Services Zhiqiang Tao Assistant Professor, School of Information Golisano College of Computing and Information Sciences Rochester Institute of Technology, Rochester, NY Email: zhiqiang.tao[AT]rit[DOT]edu [Google Scholar] [DBLP] [Semantic Scholar] [LinkedIn] Brief Bio I am an Assistant Professor in the School of Information at Rochester Institute of Technology (RIT). Prior to joining RIT, I was an Assistant Professor in the Department of Computer Science and Engineering at Santa Clara University from 2020 to 2022. I received my Ph.D. degree from the ECE Department at Northeastern University, under the supervision of Prof. Yun Raymond Fu. I obtained my B.E. and M.E. degrees from Tianjin University in 2012 and 2015, respectively. My group focuses on studying smart, scalable, and secure machine learning algorithms through optimization and inference techniques for a wide range of fields, including healthcare, AI education, computational imaging, and data science applications. Particularly, our recent works investigate large language models (LLM) / large vision-language models (LVLM) toward reliable multimodal understanding, calibrated uncertainties on low-level vision, ranking fairness, and desired preference. I am looking for highly-motivated graduate (PhD/MS) and undergraduate students to work with our group. Please drop me an email if interested. Recent News: 2025-09: One paper on LVLM Reasoning was accepted by NeurIPS 2025. Congratulations to Guohao. 2025-09: One paper on LLM Ranker was accepted by SIGIR-AP 2025. Congratulations to Haowei. 2025-08: Four papers on Visual AutoRegressive modeling, Reasoning LLMs, and LVLM Fairness were accepted by EMNLP 2025. Congratulations to Jiamian, Ziqi, Prasanna, and Xuyang. 2025-08: Received an NIH R16 Award to support our research on medical LVLMs for Dermatology AI. 2025-08: Received an NSF ERI Award to support our research on uncertainty quantification for computational imaging. 2025-06: One paper on Structured DPO for LVLMs was accepted by ICCV 2025. Congratulations to Guohao. 2025-05: I received the RIT GCCIS Emerging Scholar Award. 2025-02: One paper on Hyperspectral Transformer was accepted by IEEE TPAMI. Congratulations to Jiamian. 2024-12: My little one was born. Hello World! More...",
  "content_length": 2354,
  "method": "requests",
  "crawl_time": "2025-12-01 14:55:35"
}