{
  "name": "Zhiru Zhang",
  "homepage": "http://www.csl.cornell.edu/~zhiruz",
  "status": "success",
  "content": "Zhiru Zhang Computer Systems Laboratory Home Research Publications Software Releases Group Website Zhiru Zhang Professor Computer Systems Laboratory School of Electrical and Computer Engineering College of Engineering Cornell University office: 320 Rhodes Hall, Ithaca, NY 14853 phone: (607) 255-5954 email: zhiruz -at- cornell.edu Dr. Zhiru Zhang is a Professor in the School of Electrical and Computer Engineering at Cornell University and a member of the Computer Systems Laboratory. His current research investigates new algorithms, methodologies, and design automation tools for heterogeneous computing systems. Recent publications from his group focus on the topics of high-level synthesis (HLS), hardware specialization for machine learning, and programming models for software-defined FPGAs. He is an IEEE Fellow and has been honored with the Intel Outstanding Researcher Award, AWS AI Amazon Research Award, Facebook Research Award, Google Faculty Research Award, DAC Under-40 Innovators Award, Rising Professional Achievement Award from the UCLA Henry Samueli School of Engineering and Applied Science, DARPA Young Faculty Award, IEEE CEDA Ernest S. Kuh Early Career Award, NSF CAREER Award, and Ross Freeman Award for Technical Innovation from Xilinx. He has won multiple Best Paper Awards from top conferences and journals, including ASPLOS (2025), ISPD (2025), FPGA (2024, 2022, 2021, 2019), AutoML (2024), FCCM (2018), ACM TODAES (2012), and Top Picks in Hardware and Embedded Security (2020). His papers on HLS scheduling and application-specific instruction-set processor (ASIP) compilation have been inducted into the ACM/SIGDA TCFPGA Hall of Fame for the classes of 2022 and 2023, respectively. On the teaching side, he received the Ruth and Joel Spira Award for Excellence in Teaching (2018) and twice the Michael Tien'72 Excellence in Teaching Award (2016, 2022), the highest recognition for teaching in the College of Engineering. Prior to joining Cornell, he earned his Ph.D. in Computer Science from UCLA and co-founded AutoESL based on his dissertation research on HLS. AutoESL was acquired by Xilinx (now AMD), and its HLS tool evolved into Vivado HLS (now Vitis HLS), which is widely used for designing FPGA-based hardware accelerators. He also holds a B.S. in Computer Science from Peking University and an M.S. in Computer Science from UCLA. Teaching ECE 5775 (now 6775) [site]: High-Level Digital Design Automation (FA'25, '24, '23, '22, '18, '17, '16, '15, '14) ENGRD/ECE 2300 [site]: Digital Logic and Computer Organization (SP'25, '24, '22, '21, '18, '17, '16, '15, '14) ECE 6980: Special Topics on Hardware Acceleration of Deep Learning (SP'23) ENGRG 1050: Freshman Engineering Seminar (FA'22, '17, '13) ECE 5950: Special Topics on High-Level Digital Design Automation (SA'13) Recent News Mercer Distinguished Lecture at RPI on accelerator design and programming (11/19) Niansong awarded LAD fellowship (11/15) Tawa accepted to CGO'26 (11/3) APU characterization accepted to MICRO'25 (7/14) ASPEN accepted to MLCAD'25 (7/4) EqMap and e-boost accepted to ICCAD'25 (6/30) Invited talk on AI-driven hardware design at ISCA'25 Workshop (6/21) CirSTAG nominated for DAC'25 best paper (5/13) JUMP 2.0 SRC e-workshop talk on differentiable compiler optimization (4/29) SmoothE won ASPLOS'25 Best Paper Award (4/1) Cypress won ISPD'25 Best Paper Award (3/19) Prepropagation GNN accepted to MLSys'25 (2/10) Hanchen successfully defended his dissertation (2/3) Nikita successfully defended his dissertation (1/22) Shaojie successfully defended his dissertation (1/10) ARIES accepted to FPGA'25 (11/29/2024) Invited talk on differentiable e-graph extraction at NVIDIA (11/8/2024) Invited talk on accelerator programming at Stanford (11/7/2024) SmoothE accepted to ASPLOS'25 (10/31/2024) FLIQS won AutoML'24 Best Paper Award (9/12/2024) Invited talk on data specialization for ML at MLCAD (9/9) Hongzheng won 3rd place in the PLDI'24 Student Research Competition (6/27/2024) Invited talk on accelerator programming \"at\" IBM (6/14/2024) GPU pangenome layout accepted to SC'24 (6/14/2024) Hongzheng selected as 2024 MLCommons Rising Stars (5/16/2024) Invited AI-day tech talk on binarized deep learning \"at\" RTX (5/8/2024) Grateful to receive AWS AI Amazon Research Award (4/29/2024) Grateful to receive Intel Outstanding Researcher Award (4/11/2024) Sabre accepted to OSDI'24 (3/21/2024) LLM FPGA accepted to FCCM'24 journal track (3/19/2024) HLS formal verification won FPGA'24 Best Paper Award (3/5/2024) Invited talk on scalable graph learning at FPGA'24 SpatialML Workshop (3/3/2024) Allo accepted to PLDI'24 (2/26/2024) Chenhui successfully defended his dissertation (2/23/2024) HOGA accepted to DAC'24 (2/13/2024) Polynormer accepted to ICLR'24 (1/16/2024) UniSparse accepted to OOPSLA'24 (12/22/2023) Slapo accepted to ASPLOS'24 (11/7/2023) Yichi successfully defended his dissertation (9/29/2023) BMT accepted to NeurIPS'23 (9/21/2023) Invited talk on ML for HLS \"at\" ESWeek (9/19/2023) Invited panel on HLS adoption at DAC (7/13/2023) Invited talk on datapath synthesis at DAC (7/11/2023) Yixiao received Cornell ECE Outstanding PhD TA Award! (4/20/2023) Invited panel on EDA for domain specific computing at ISPD (3/29/2023) ASIP synthesis paper inducted into ACM/SIGDA TCFPGA Hall of Fame (2/13/2023) More news Research Group [site] [github] [youtube] [linkedin] Jordan Dotzel (MS/PhD, started FA'19, with Prof. Mohamed Abdelfattah) Jie Liu (MS/PhD, started FA'19) Zichao Yue (MS/PhD, started SU'20) Yixiao Du (MS/PhD, started SU'20) Yaohui Cai (MS/PhD, started SP'21, with Prof. Chris De Sa) Andrew Butt (MS/PhD, started FA'21) Hongzheng Chen (MS/PhD, started FA'21) Jiajie Li (MS/PhD, started FA'21) Niansong Zhang (MS/PhD, started FA'21) Matthew Hofmann (MS/PhD, started FA'22) Zhanqiu (Summer) Hu (MS/PhD, started FA'23, with Prof. Udit Gupta) Vesal Bakhtazad (MS/PhD, started SP'24) Dr. Grace Dinh (PostDoc, 2024-) Dr. Yizhao Gao (PostDoc, 2025-) Alumni Dr. Hanchen Jin (MS/PhD, 2018-2025), now with MangoBoost, Bellevue, WA Dr. Nikita Lazarev (MS/PhD, 2019-2025), now co-founder of a stealth startup (AI infra) Dr. Shaojie Xiang (MS/PhD, 2018-2025), now with AWS AI, Santa Clara, CA Dr. Chenhui Deng (PhD, 2018-2024, dissertation) now with NVIDIA Research, Santa Clara, CA Dr. Yichi Zhang (PhD, 2018-2023, dissertation) now with Google DeepMind, Mountain View, CA Dr. Zhongyuan Zhao (PostDoc, 2020-2023) now with Qualcomm, San Diego, CA Prof. Qi Sun (PostDoc, 2022-2023) now with Zhejiang University Dr. Ecenur Ustun (PhD, 2016-2022, dissertation) now with Meta Reality Labs, Redmond, WA Prof. Debjit Pal (PostDoc, 2019-2022) now with University of Illinois Chicago, Chicago, IL Dr. Yi-Hsiang (Sean) Lai (PhD, 2016-2021, dissertation) now with AWS AI, Santa Clara, CA Dr. Yuan Zhou (PhD, 2015-2021, dissertation) now with AWS AI, Santa Clara, CA Dr. Nitish Srivastava (PhD, 2014-2020, dissertation) now with Meta, New York City, NY Dr. Ritchie Zhao (PhD, 2014-2019, dissertation) now with NVIDIA, Redmond, WA Prof. Cunxi Yu (PostDoc, 2018-2019) now with University of Maryland, College Park, MD Dr. Zhenghong (John) Jiang (PostDoc, 2016-2019) now with Cadence, San Jose, CA Dr. Steve Dai (PhD, 2013-2018, dissertation) now with NVIDIA Research, Santa Clara, CA Dr. Gai Liu (PhD, 2013-2018, dissertation) now with Google, Mountain View, CA Dr. Mingxing Tan (PostDoc, 2013-2015) now with Waymo Research, Mountain View, CA",
  "content_length": 7456,
  "method": "requests",
  "crawl_time": "2025-12-01 14:55:40"
}