{
  "name": "Zhirong Yang",
  "homepage": "https://www.ntnu.no/ansatte/zhirong.yang",
  "status": "success",
  "content": "Zhirong Yang - NTNU Zhirong Yang Last ned pressefoto Last ned pressefoto Foto: Lukk Zhirong Yang Professor Institutt for datateknologi og informatikk zhirong.yang@ntnu.no +4790154911 Room 313, IT-bygget Gløshaugen, Trondheim Google Scholar Homepage Publikasjoner 2025 Zhang, Jin; Li, Jingyue; Yang, Zhirong. (2025) Dynamic robustness evaluation for automated model selection in operation. Information and Software Technology Vitenskapelig artikkel Fu, Chengbo; Niskanen, Einari A.; Wei, Gong-Hong; Yang, Zhirong; Sanvicente-García, Marta; Güell, Marc. (2025) k-mer manifold approximation and projection for visualizing DNA sequences. Genome Research Vitenskapelig artikkel Yu, Tong; Cheng, Lei; Khalitov, Ruslan; Olsson, Erland Brandser; Yang, Zhirong. (2025) Self-distillation improves self-supervised learning for DNA sequence inference. Neural Networks Vitenskapelig artikkel Yu, Tong; Cheng, Lei; Khalitov, Ruslan; Yang, Zhirong. (2025) A sparse and wide neural network model for DNA sequences. Neural Networks Vitenskapelig artikkel Alam, Azimil Gani; Bartonova, Alena; Høiskar, Britt Ann Kåstad; Fredriksen, Mirjam; Sharma, Jivitesh; Mathisen, Hans Martin. (2025) Predicting the student's perceptions of multi-domain environmental factors in a Norwegian school building: Machine learning approach. Building and Environment Vitenskapelig artikkel Yang, Zhirong; Ren, Wenzi; Liu, Shushu; Wei, Haoyu. (2025) Artificial intelligence in forest management and tree health protection. Vitenskapelig Kapittel/Artikkel/Konferanseartikkel 2024 Liu, Peng; Zhang, Lemei; Farup, Terje Nissen; Lauvrak, Even Wienenga; Ingvaldsen, Jon Espen; Eide, Simen. (2024) NLEBench+NorGLM: A Comprehensive Empirical Analysis and Benchmark Dataset for Generative Language Models in Norwegian. Vitenskapelig Kapittel/Artikkel/Konferanseartikkel Cheng, Lei; Yu, Tong; Khalitov, Ruslan; Yang, Zhirong. (2024) Self-supervised Learning for DNA sequences with circular dilated convolutional networks. Neural Networks Vitenskapelig artikkel 2023 Yang, Zhirong; Chen, Yuwei; Sedov, Denis; Kaski, Samuel; Corander, Jukka. (2023) Stochastic Cluster Embedding. Statistics and computing Vitenskapelig artikkel Cheng, Lei; Khalitov, Ruslan; Yu, Tong; Zhang, Jing; Yang, Zhirong. (2023) Classification of long sequential data using circular dilated convolutional neural networks. Neurocomputing Vitenskapelig artikkel 2022 Lin, Chengchuang; Chen, Hanbiao; Huang, Jiesheng; Peng, Jing; Guo, Li; Yang, Zhirong. (2022) ChromosomeNet: A massive dataset enabling benchmarking and building basedlines of clinical chromosome classification. Computational biology and chemistry Vitenskapelig artikkel Lees, John A.; Tonkin-Hill, Gerry; Yang, Zhirong; Corander, Jukka. (2022) Mandrake: visualizing microbial population structure by embedding millions of genomes into a low-dimensional representation. Philosophical Transactions of the Royal Society of London. Biological Sciences Vitenskapelig artikkel Kong, Jiehong; Skjelbred, Hans Ivar; Babayev, Piri; Yang, Zhirong. (2022) Integrating Machine Learning Techniques into the Decision-making Process for Hydro Scheduling. Vitenskapelig Kapittel/Artikkel/Konferanseartikkel Zhang, Jing; Geng, YangLi-ao; Wang, Wen; Sun, Wenju; Yang, Zhirong; Li, Qingyong. (2022) Distribution and gradient constrained embedding model for zero-shot learning with fewer seen samples. Knowledge-Based Systems Vitenskapelig artikkel Yu, Tong; Khalitov, Ruslan; Cheng, Lei; Yang, Zhirong. (2022) Paramixer: Parameterizing Mixing Links in Sparse Factors Works Better than Dot-Product Self-Attention. Computer Vision and Pattern Recognition Vitenskapelig artikkel Khalitov, Ruslan; Yu, Tong; Cheng, Lei; Yang, Zhirong. (2022) Sparse factorization of square matrices with application to neural attention modeling. Neural Networks Vitenskapelig artikkel 2021 Liu, Zhenhui; Dahl, Sondre Strande; Larsen, Erik Stensrud; Yang, Zhirong. (2021) A simple machine learning based framework for processing the inline inspection data of subsea pipelines. IOP Conference Series: Materials Science and Engineering Vitenskapelig artikkel Lin, Chengchuang; Zhao, Gansen; Yin, Aihua; Yang, Zhirong; Li, Guo; Chen, Hanbiao. (2021) A novel chromosome cluster types identification method using ResNeXt WSL model. Medical Image Analysis Vitenskapelig artikkel Lin, Chengchuang; Shan, Chun; Zhao, Gansen; Yang, Zhirong; Peng, Jing; Chen, Shaojie. (2021) Review of Image Data Augmentation in Computer Vision. Jisuanji kexue yu tansuo Vitenskapelig oversiktsartikkel/review Ulvestad, Anita; Cao, Guangyu; Gustavsen, Kai; Vogt, Matthias; Rismyhr, Tore; Yang, Zhirong. (2021) Analysis of the effect of indoor environment on pupils’ health in one Norwegian school during COVID-19 pandemic. Vitenskapelig Kapittel/Artikkel/Konferanseartikkel 2020 Wang, Chao; Liu, Gonghui; Yang, Zhirong; Li, Jun; Zhang, Tao; Jiang, Hailong. (2020) Downhole gas-kick transient simulation and detection with downhole dual-measurement points in water-based drilling fluid. Journal of Natural Gas Science and Engineering Vitenskapelig artikkel Xue, Kai; Ding, Yiyu; Yang, Zhirong; Nord, Natasa; Barillec, Mael Roger Albert; Mathisen, Hans Martin. (2020) A Simple and Novel Method to Predict the Hospital Energy Use Based on Machine Learning: A Case Study in Norway. Communications in Computer and Information Science (CCIS) Vitenskapelig artikkel Shao, Hui; Chen, Yuwei; Yang, Zhirong; Jiang, Changhui; Li, Wei; Wu, Haohao. (2020) Feasibility study on hyperspectral LiDAR for ancient Huizhou-style architecture preservation. Remote Sensing Vitenskapelig artikkel Lin, Chengchuang; Zhao, Gansen; Yang, Zhirong; Yin, Aihua; Wang, Xinming; Guo, Li. (2020) CIR-Net: Automatic Classification of Human Chromosome Based on Inception-ResNet Architecture. IEEE/ACM Transactions on Computational Biology & Bioinformatics Vitenskapelig artikkel Wang, Chao; Liu, Gonghui; Yang, Zhirong; Li, Jun; Zhang, Tao; Jiang, Hailong. (2020) Downhole working conditions analysis and drilling complications detection method based on deep learning. Journal of Natural Gas Science and Engineering Vitenskapelig artikkel Bordin, Chiara; Skjelbred, Hans Ivar; Kong, Jiehong; Yang, Zhirong. (2020) Machine Learning for Hydropower Scheduling: State of the Art and Future Research Directions. Procedia Computer Science Vitenskapelig artikkel Wang, Chao; Liu, Gonghui; Li, Jun; Zhang, Tao; Yang, Zhirong; Jiang, Hailong. (2020) Non-uniform temperature distribution's impact on downhole weight on bit (DWOB) measurement and the novel compensatory method. Journal of Petroleum Science and Engineering Vitenskapelig artikkel 2019 Shao, Hui; Chen, Yuwei; Yang, Zhirong; Jiang, Changhui; Li, Wei; Wu, Haohao. (2019) A 91-Channel Hyperspectral LiDAR for Coal/Rock Classification. IEEE Geoscience and Remote Sensing Letters Vitenskapelig artikkel Lu, Yao; Yang, Zhirong; Kannala, Juho; Kaski, Samuel. (2019) Learning Image Relations with Contrast Association Networks. Vitenskapelig Kapittel/Artikkel/Konferanseartikkel Abudahab, Khalil; Prada, Joaquín; Yang, Zhirong; Bentley, Stephen; Croucher, Nicholas; Corander, Jukka. (2019) PANINI: Pangenome Neighbour Identification for Bacterial Populations. Microbial Genomics Vitenskapelig artikkel Lu, Yao; Corander, Jukka; Yang, Zhirong. (2019) Doubly Stochastic Neighbor Embedding on Spheres. Pattern Recognition Letters Vitenskapelig artikkel 2018 Sedov, Denis; Yang, Zhirong. (2018) Word Embedding based on Low-Rank Doubly Stochastic Matrix Decomposition. Vitenskapelig Kapittel/Artikkel/Konferanseartikkel 2017 Chewapreecha, Claire; Holden, Matthew T.G.; Vehkala, Minna; Välimäki, Niko; Yang, Zhirong; Harris, Simon R.. (2017) Global and regional dissemination and evolution of Burkholderia pseudomallei. Nature Microbiology Vitenskapelig artikkel 2016 Yang, Zhirong; Corander, Jukka; Oja, Erkki. (2016) Low-rank doubly stochastic matrix decomposition for cluster analysis. Journal of machine learning research Vitenskapelig artikkel Tidsskriftspublikasjoner Zhang, Jin; Li, Jingyue; Yang, Zhirong. (2025) Dynamic robustness evaluation for automated model selection in operation. Information and Software Technology Vitenskapelig artikkel Fu, Chengbo; Niskanen, Einari A.; Wei, Gong-Hong; Yang, Zhirong; Sanvicente-García, Marta; Güell, Marc. (2025) k-mer manifold approximation and projection for visualizing DNA sequences. Genome Research Vitenskapelig artikkel Yu, Tong; Cheng, Lei; Khalitov, Ruslan; Olsson, Erland Brandser; Yang, Zhirong. (2025) Self-distillation improves self-supervised learning for DNA sequence inference. Neural Networks Vitenskapelig artikkel Yu, Tong; Cheng, Lei; Khalitov, Ruslan; Yang, Zhirong. (2025) A sparse and wide neural network model for DNA sequences. Neural Networks Vitenskapelig artikkel Alam, Azimil Gani; Bartonova, Alena; Høiskar, Britt Ann Kåstad; Fredriksen, Mirjam; Sharma, Jivitesh; Mathisen, Hans Martin. (2025) Predicting the student's perceptions of multi-domain environmental factors in a Norwegian school building: Machine learning approach. Building and Environment Vitenskapelig artikkel Cheng, Lei; Yu, Tong; Khalitov, Ruslan; Yang, Zhirong. (2024) Self-supervised Learning for DNA sequences with circular dilated convolutional networks. Neural Networks Vitenskapelig artikkel Yang, Zhirong; Chen, Yuwei; Sedov, Denis; Kaski, Samuel; Corander, Jukka. (2023) Stochastic Cluster Embedding. Statistics and computing Vitenskapelig artikkel Cheng, Lei; Khalitov, Ruslan; Yu, Tong; Zhang, Jing; Yang, Zhirong. (2023) Classification of long sequential data using circular dilated convolutional neural networks. Neurocomputing Vitenskapelig artikkel Lin, Chengchuang; Chen, Hanbiao; Huang, Jiesheng; Peng, Jing; Guo, Li; Yang, Zhirong. (2022) ChromosomeNet: A massive dataset enabling benchmarking and building basedlines of clinical chromosome classification. Computational biology and chemistry Vitenskapelig artikkel Lees, John A.; Tonkin-Hill, Gerry; Yang, Zhirong; Corander, Jukka. (2022) Mandrake: visu",
  "content_length": 16783,
  "method": "requests",
  "crawl_time": "2025-12-01 14:55:39"
}