{
  "name": "Zhisheng Yan",
  "homepage": "https://mason.gmu.edu/~zyan4/index.html",
  "status": "success",
  "content": "Zhisheng Yan - George Mason University Zhisheng Yan Home Research Publications Code Teaching News Zhisheng Yan Associate Professor Department of Information Sciences and Technology School of Computing George Mason University Office: Suite 417, Research Hall, George Mason University, Fairfax, VA 22030 Phone: (703)993-7283 Email: zyan4@gmu.edu Openings: Multiple graduate and undergraduate positions are available in our group. More Details Biography I am currently an Associate Professor in Department of Information Sciences and Technology, School of Computing, at George Mason University. I lead the Mason immErsive meDia computIng and Applications (MEDIA) Lab. My research focuses on the systems and security issues of immersive cyber-human systems, such as VR, AR, imaging, and video systems. Previously, I was an Assistant Professor in Department of Computer Science at Georgia State University. I also worked at Stanford University as a visiting researcher, hosted by Dr. Bernd Girod. I received my Ph.D. degree in Computer Science and Engineering from University at Buffalo, The State University of New York. I worked with Dr. Chang Wen Chen for my dissertation. I am honored to receive several research awards, including NSF CAREER Award, NSF CRII Award, Mason Presidential Award for Faculty Excellence in Research, NDSS'24 Distinguished Paper Award, ACM MMSys'22 Best Student Paper Award, ACM SIGMM Best PhD Thesis Award, University at Buffalo CSE Best Dissertation Award, ACM HotMobile'18 Best Demo Award, University at Buffalo David M. Benenson Memorial Award, and IEEE HealthCom'14 Best Student Paper Runner-up. News [Activity] 2024/11: Gave a keynote on Immersive Sensing with Physical Knowledge at ACM MobiCom's PICASSO workshop [Publication] 2024/09: Video aggregation at edge for immersive services (PDF) accepted by ACM SenSys'24 [Publication] 2024/03: NeRF serving framework for mobile immersive applications (PDF) accepted by ACM MobiSys'24 [Award] 2024/02: Heimdall (PDF), an accoustic VR keystroke attack, received the Distinguished Paper Award at NDSS'24 [Publication] 2024/01: Learning to manage uncertainty in video streaming (PDF) accepted by ACM MMSys'24 [Publication] 2023/12: Neural video coding and streaming with loose frame referencing (PDF) accepted by NSDI 2024 [Publication] 2023/09: accoustic VR keystroke attacks (PDF) accepted by NDSS 2024 [Publication] 2023/09: pedestrian rushing detection for automated driving (PDF) accepted by ACM SenSys 2023 [Publication] 2023/08: 360 video identification attacks on VR (PDF) accepted by USENIX Security 2024 [Activity] 2023/06: Gave an invited talk on \"Building Trustworthiness for Immersive Computing at Scale\" at UIUC [Award] 2023/03: Received the Mason Presidential Award for Faculty Excellence in Research [Service] 2023/02: Started the position of Associate Editor for IEEE Multimedia [Publication] 2022/07: Dynamic adaptive offloading for video analytics (PDF) accepted by ACM MM 2022 [Award] 2022/06: CICO received the Best Student Paper Award at ACM MMSys 2022 (PDF) [Service] 2022/05: Reviewed proposals for NSF CISE and National Science Centre, Poland [Publication] 2022/02: 360 video analytics framework for firefighters (PDF) accepted by CPS-ER [Publication] 2022/02: Context-aware image offloading for visual analytics (PDF) accepted by ACM MMSys 2022 [Publication] 2022/02: Multiview vehicle model recognition (PDF) accepted by IEEE TCSVT 2022 [Award] 2022/01: Received the NSF CAREER award on machine centered 360 video analytics from NSF CISE [Service] 2021/12: Co-Chair the TPC of ACM NOSSDAV 2022, co-located with ACM MMSys [Publication] 2021/12: Keystroke inference attacks on MR (PDF) accepted by IEEE VR 2022 [Publication] 2021/10: Deep compressive offloading for images (PDF) accepted by ACM SenSys 2021 - AIChallengeIoT [Activity] 2021/10: Gave an invited talk on \"Things I wish I knew before I Started My PhD\" at UB CSE Distinguished Alumni Series [Service] 2021/10: Co-Chair the TPC of 2021 IEEE Smart World Congress [Award] 2021/09: Received an NSF grant to study augmented reality for firefighters and commanders in incident command [Activity] 2021/07: Start my new position at George Mason University [Service] 2021/03: Co-Chair the TPC in systems and middleware area for ACM MM 2021 [Service] 2020/11: Served in two NSF panels [Award] 2020/10: Received the IEEE Transactions on Multimedia Outstanding Reviewer Award [Service] 2020/08: Invited to serve as the co-director for the Review Board of IEEE ComSoc MMTC [Publication] 2020/07: Live 360 video streaming delay analysis (PDF) accepted by ACM MM 2020 [Service] 2020/06: Invited to serve as the publicity chair for CPSBigData (International Workshop on Big Data Analytics of Cyber-Physical Systems) 2020 [Award] 2020/04: Received the NSF CRII award on 360 video monitoring from NSF CISE [Service] 2020/04: Invited to serve as the workshop co-chair for ACM MM 2020 [Activity] 2020/02: Invited to attend the CRA Career Mentoring Workshop [Publication] 2020/01: VR authentication in head-mounted display (PDF) accepted by NDSS 2020 [Service] 2020/01: Co-Chair the TPC in systems and middleware area for ACM MM 2020 [Publication] 2019/12: Position paper on how to evaluate 360 video streaming (PDF) accepted by ACM HotMobile 2020 [Service] 2019/11: Served as a panelist for NSF [Service] 2019/10: Co-Chair the TPC of 2020 International Conference on Internet of Things (ICIOT) to be held at Honolulu, Hawaii [Award] 2019/09: Received the Intel AI DevCloud access and Neural Compute Stick 2 support for our video 360 research [Activity] 2019/08: Invited to attend the NSF NeTS Early Career Workshop [Publication] 2019/07: Our open-source 360 video saliency dataset is now available at GitHub. It can be used for viewport prediction, sphere-plane projection, video compression, etc. [Service] 2019/06: Co-Chair the TPC of the Sixth National Workshop for REU Research in Networking and Systems (REUNS 2019) [Activity] 2019/06: Gave an invited talk on \"Detecting Panoramic Saliency for 360-degree Video Streaming\" at ACM MM 2019 TPC Workshop [Award] 2019/05: Three MANSys members (Anh, Jun and Shiqing) received the Travel Award from ACM to attend ACM MMSys 2019 [Publication] 2019/04: Measurement of YouTube 360° live video streaming (PDF) accepted by ACM NOSSDAV 2019 [Activity] 2019/04: Invited to attend the NSF CISE CAREER Workshop [Service] 2019/03: Served as a panelist for NSF [Award] 2019/02: Received the REU Site grant on immersive media computing from NSF CISE [Service] 2019/02: Co-Chair the TPC in systems and middleware area for ACM MM 2019 [Publication] 2019/01: Two papers accepted by ACM MMSys 2019 -- real-time stitching for 360-degree videos (PDF) and 360-degree video saliency (PDF) More News",
  "content_length": 6766,
  "method": "requests",
  "crawl_time": "2025-12-01 14:55:38"
}