{
  "name": "Zhiting Hu",
  "homepage": "http://zhiting.ucsd.edu",
  "status": "success",
  "content": "Zhiting Hu Zhiting Hu zhitinghu at gmail dot com zhh019 at ucsd dot edu Assistant Professor HalÄ±cÄ±oÄlu Data Science Institute (HDSI) Department of Computer Science and Engineering (affiliate) Artificial Intelligence Group (affiliate) UC San Diego Office: HDSI 442 Publications  / Google Scholar  / Teaching  / CV  / Bio  / Twitter I am taking on new students and postdocs from HDSI, CSE, and related departments. We also have research positions for MS/undergrad students (UCSD or external). See more details here. Research My primary research interests lie in the general areas of Machine Learning, Artificial Intelligence, Natural Language Processing, large-scale ML/AI systems, and their applications. In particular, I'm interested in principles, methodologies, and systems of building AI agents that learn and reason with human-level (or super-human) efficiceny and generality. To this end, we're building general World Models (PAN, LAW, RAP) to enable next-generation machine reasoning beyond large language models (LLM Reasoners). We're also working on Panoramic Learning (HDSR)—building AI agents with ALL types of experience, ranging from data instances (NeurIPS), embodied experiences (NeurIPS), structured knowledge (ACL, NeurIPS), constraints, to rewards (EMNLP), adversaries (NeurIPS), lifelong interplay, etc. Along this line, we've been studying a standardized ML formalism (\"Standard Model\" of ML) for systematic understanding, unifying, and generalizing a wide range of ML paradigms (e.g., supervised, unsupervised, active, reinforcement, adversarial, meta, lifelong learning). We're part of the open-source consortium Maitrix.org, aiming at build AI-powered realities with techniques of large language/multi-modal models, agent Models, and world models. MixLab Current members Postdoc Zhen Wang Kun Zhou PhD Shibo Hao Yi Gu Frederick Pi Jiannan Xiang Qiyue Gao Yuheng Zha Yichi Yang Hansen Lillemark Jorge Cheng Ted Feng News 2024-04, Invited talk at UCSD Biostatistics Seminar on \"From Large Language Models to Large Biology Models: A Beginning of the Quest\". 2024-03, Seminar at Amazon on \"Language Models, Agent Models, and World Models: The LAW for Machine Reasoning and Planning\". 2024-02, Tutorial at AAAI2024 on Language Models Meet World Models (slides). 2023-12, Tutorial at NeurIPS2023 on Language Models Meet World Models (slides, videos). 2023-06, Invited talk at ICSA2023 on \"Toward a 'Standard Model' of Machine Learning\" [slides]. 2023-05, Co-organzed the ICLR2023 workshop on Machine Learning for IoT: Datasets, Perception and Understanding. 2023-01, Lecture at DeepLearn 2023 Winter: \"A 'Standard Model' for Machine Learning with All Experience\". 2022-10, Invited talk at MBZUAI: \"Towards A 'Standard Model' of Machine Learning\". 2022-05, Seminar at Amazon: \"Machine Learning with No (Good) Data\". 2022-04, Invited talk at USC ISI: \"Text Generation with No (Good) Data: Reinforcement Learning, Causal Inference, and Unified Evaluation\" [slides]. 2021-09, Started my position at UCSD. 2020-09 -- present, Visiting Amazon as a scientist. 2021-07, Invited talks at MSR, ETH, and NUS: \"Text Generation with No (Good) Data: New Reinforcement Learning and Causal Frameworks\" [slides]. 2021-07, Co-organzed the ICML2021 workshop on Machine Learning for Data. 2020-11, Invited talk at MPI: \"Learning with ALL Experiences: A Standardized ML Formalism\" [slides]. 2020-08, Tutorial at KDD2020 on Learning from All Types of Experiences: A Unifying Machine Learning Perspective. 2020-02, Tutorial at AAAI2020 on Modularizing Natural Language Processing. 2019-12, Co-organzed the NeurIPS2019 workshop on Learning with Rich Experience: Integration of Learning Paradigms. show more Co-organzed the CVPR 2019 workshop on Towards Causal, Explainable and Universal Medical Visual Diagnosis. Co-organzed the ICML 2019 workshop on Learning and Reasoning with Graph-Structured Representations. Released Texar, a general-purpose toolkit for ML, NLP, and text generation. Co-organzed the ICML 2018 workshop on Theoretical Foundations and Applications of Deep Generative Models. Website template from here.",
  "content_length": 4117,
  "method": "requests",
  "crawl_time": "2025-12-01 14:55:40"
}