{
  "name": "Zhiwei Xu 0001",
  "homepage": "https://www-personal.umd.umich.edu/~zwxu",
  "status": "success",
  "content": "Zhiwei Zhiwei(Tommy) Xu, PhD Associate Professor Computer and Information Science University of Michigan-Dearborn Dearborn, MI 48128 Email: zwxu@umich.edu Office: 204 CIS Winter 2025 Office Hrs: M 4:00-6:00PM, T 1:00-2:00 Courses CIS553 Software EngineeringCIS375 Software Engineering CIS285 Software Engineering Tools CIS476/566 Design Patterns Some Areas of Interest Computational Intelligence in Software Engineering Large Scale Data Analysis in Time Series Optimization Some Publications Journal Publications and Book Chapter David Degras, Zhiwei Xu, Ting Zhang, and Wei Biao Wu, Testing for Parallelism Among Trends in Multiple Time Series, IEEE Transactions on Signal Processing, 60(3), 1087-1097, 2012. Zhiwei Xu, Yi Liu, and Yongning Tang, Adopting the Information Contained by Outliers in the Modeling Process, The International Journal of Computers and Their Applications, 18(2), 100-110, 2011. Zhiwei Xu, Kehan Gao, Taghi M. Khoshgoftaar, and Naeem Seliya, System Regression Test Planning with a Fuzzy Expert System, Information Sciences, in press, http://dx.doi.org/10.1016/j.ins.2010.09.012. Yongning Tang, Ye Wu, Zhiwei Xu,and Ehab Al-Shaer, Probabilistic and Reactive Fault Diagnosis for Dynamic Overlay Networks, Peer-to-Peer Networking and Applications, 4(4), 439-452, 2010. Zhen-Jun Shi, Shengquan Wang, and Zhiwei Xu, The Convergence of Conjugate Gradient Method with Nonmonotone Line Search, Applied Mathematics and Computation, 217(5), 1921-1932, 2010. Zhou Zhou, Zhiwei Xu, Wei Biao Wu Long-term Prediction Intervals of Time Series, IEEE Transactions on Information Theory, Vol. 56, No. 3, March 2010, 1436-1446 Zhen-Jun Shi and Zhiwei Xu, The convergence of subspace trust region methods, The Journal of Computational and Applied Mathematics. 231 (2009), No. 1, 365377 Zhiwei Xu, Taghi M. Khoshgoftaar: Identification of Fuzzy Models of Software Cost Estimation. Fuzzy Sets and Systems 145(1): 141-163 (2004) Zhiwei Xu, Taghi M. Khoshgoftaar, Edward B. Allen: Application of fuzzy expert systems in assessing operational risk of software. Information & Software Technology 45(7): 373-388 (2003) Zhiwei Xu, and Taghi M. Khoshgoftaar: Application of Fuzzy Rule Extraction to Minimize the Cost of Misclassification on Software Quality Modeling. Book Chapter submitted for Software Engineering with Fuzzy Theory, published by Physica Verlag. Zhiwei Xu, and Taghi M. Khoshgoftaar: Software Quality Prediction for High Assurance Network Telecommunications Systems, The Computer Journal--Special Issue on High Assurance System, British Computer Society 45(6): 557-587, 2001 Conference Proceedings Thangaraj Karol Stuart, and Zhiwei Xu, Advanced Pattern Match techniques for identifying Similar Transactions in a Database System, The 16th International Conference on Distributed Multimedia Systems, Oak Brook, Illinois, Oct 2010. Yongning Tang, Guang Cheng, Zhiwei Xu, Ehab Al-Shaer Community-base Fault Diagnosis Using Incremental Belief Revision. 2009 IEEE International Conference on Networking, Architecture, and Storage: P121-128 Zhiwei Xu, Zhou Zhou, Weibiao Wu Long-term Prediction of Wireless Network Traffic The 21th International Conference on Software Engineering and Knowledge Engineering, Boston, July 2009 Naeem Seliya, Zhiwei Xu, Taghi M. Khoshgoftaar \"Addressing Class Imbalance in Non-Binary Classification Problems\" 20th IEEE International Conference on Tools with Artificial Intelligence, Dayton, Ohio, November 2008 Zhiwei Xu, Naeem Seliya An Adaptive Neural Network with Dynamic Structure for Software Defect Prediction The 20th International Conference on Software Engineering and Knowledge Engineering, San Francisco, CA, July 2008 Weibiao Wu, Zhiwei Xu Robust prediction of network traffic Using Quantile Regression Models In Proceedings of IEEE International Conference on Information Reuse and Integration, Waikoloa, HI, September 2006. IEEE Computer Society. Zhiwei Xu Defect Driven Regression Test Case Selection Using Expert System 2006 Motorola Software System Simulation Symposium, Itasca, IL, September 2006 Zhiwei Xu, Taghi M. Khoshgoftaar, Kehan Gao Application of Fuzzy Expert System In Test Case Selection For System Regression Test In Proceedings of IEEE International Conference on Information Reuse and Integration, Las Vegas, NV, August 2005. IEEE Computer Society. Yan Liu, Bojan Cukic, Zhiwei Xu Predicting with Confidence - An Improved Dynamic Cell Structure in Proceedings of International Conference on Natural Computation, pages 750-759, Changsha, China, August 2005. IEEE Computer Society. Zhiwei Xu Application of Fuzzy Expert System In System Test 2005 Motorola Software System Simulation Symposium, Itasca IL, July 2004 Zhiwei Xu, A Rule-Based Fuzzy Classification for Software Quality Models In Proceedings of 12th International Conference on Software Quality, Westin, Ottawa, October 28-30, 2002. Zhiwei Xu and Noel Samaan A Novel Adaptive Neural Network Based Technique to Enhance Software System Assurance for Regression Testing In proceedings of Sixth IEEE International Symposium on High Assurance Systems Engineering, Boca Raton, FL, October 22-24, 2001. IEEE Computer Society. Taghi M. Khoshgoftaar, Edward B. Allen, and Zhiwei Xu Predicting testability of program modules using a neural network In Proceedings of Symposium on Application-Specific Systems and Software Engineering Technology, Richardson, Texas, March 2000. IEEE Computer Society. Zhiwei Xu, Taghi M. Khoshgoftaar, and Edward B. Allen Application of Fuzzy Linear Regression Model for Predicting Program Faults. In Proceedings of Sixth ISSAT International Conference on Reliability and Quality in Design, Orlando, Florida USA, August 2000. International Society of Science and Applied Technologies. Pages 96-101 Zhiwei Xu, Taghi M. Khoshgoftaar, and Edward B. Allen Prediction of Software Faults Using Fuzzy Nonlinear Regression Modeling In Proceedings: Fifth IEEE International Symposium on High-Assurance Systems Engineering, Pages: 281-290, Albuquerque, New Mexico, November 2000. Zhiwei Xu, Taghi M. Khoshgoftaar Quality Predication For A Very Large Legacy Telecommunication Systems using Fuzzy Nonlinear Regression Modeling The Eleventh International Symposium on Software Reliability Engineering, San Jose, CA October 2000 Zhiwei Xu Application of Neural Network in Software Reliability Engineering, The Tenth International Symposium on Software Reliability Engineering, Boca Raton, FL, November 1999.",
  "content_length": 6445,
  "method": "requests",
  "crawl_time": "2025-12-01 14:55:41"
}