{
  "name": "Zhiwu Xu 0001",
  "homepage": "https://zhiwuxu.github.io",
  "status": "success",
  "content": "Zhiwu XU's Homepage Zhiwu XU Associate Professor College of Computer Science and Software Engineering, Shenzhen University 724, College of Computer Science and Software Engineering Shenzhen University Nanhai Ave 3688, Nanshan District Shenzhen,Guangdong,P.R.China,518060 Email: xuzhiwu AT szu DOT edu DOT cn Biography | Research Interests | Publications | Courses | Honors and Awards Biography I am currently an associate professor at Shenzhen University. I received the Bachelor Degree in Computer science and technology from Sun Yat-sen University in 2007, and the Ph.D. degrees in Computer science from IRIF (PPS), Universite Paris Cite (University Paris Diderot - Paris 7) and SKLCS, Institute of Software, Chinese Academy of Sciences, under the joint cultivation, in 2013. Research Interests Program Analysis and Verification, Type Systems, Software Security, Automata Theory and Logic, and Machine Learning. Publications (NOTICE: The electronic versions of the papers listed on this webpage are provided for personal use. Copyright is owned by the respective publishers or persons, and should be included explicitly in any distribution of the papers. See also at Google Scholar and DBLP.) Yeting Li, Yecheng Sun, Zhiwu Xu, Haiming Chen, Xinyi Wang, Hengyu Yang, Huina Chao, Cen Zhang, Yang Xiao, Yanyan Zou, Feng Li, Wei Huo. VULCANBOOST: Boosting ReDoS Fixes through Symbolic Representation and Feature Normalization[C]. 34th USENIX Security Symposium. 4463-4479. August 13–15, 2025. Cheng Wen, Jialun Cao, Jie Su, Zhiwu Xu, Shengchao Qin, Mengda He, Haokun Li, Shing-Chi Cheung and Cong Tian. Enchanting Program Specification Synthesis by Large Language Models using Static Analysis and Program Verification[C]. 36th International Conference on Computer Aided Verification (CAV 2024). 302-328. 24-27 July, 2024. Cheng Wen, Yuandao Cai, Bin Zhang, Jie Su, Zhiwu Xu, Dugang Liu, Shengchao Qin, Zhong Ming and Cong Tian. Automatically Inspecting Thousands of Static Bug Warnings with Large Language Model: How Far Are We?[J]. Transactions on Knowledge Discovery from Data (TKDD). 18(7): 168:1-168:34. June 2024. Jiaxiang Liu, Yunhan Xing, Xiaomu Shi, Fu Song, Zhiwu Xu, Zhong Ming. Abstraction and Refinement: Towards Scalable and Exact Verification of Neural Networks[J]. ACM Transactions on Software Engineering and Methodology (TOSEM). 33(5): 129:1-129:35, June 2024. [URL] Zhiwu Xu, Bohao Wu, Cheng Wen, Bin Zhang, Shengchao Qin, Mengda He. RPG: Rust Library Fuzzing with Pool-based Fuzz Target Generation and Generic Support[C]. 46th International Conference on Software Engineering (ICSE 2024). 124:1--124:13. 14-20 April 2024. Yulin Wu, Zhiwu Xu, Shengchao Qin. Detecting API-Misuse Based on Pattern Mining via API Usage Graph with Parameters[C]. 17th International Symposium on Theoretical Aspects of Software Engineering (TASE 2023). 344-363. 4-6 July 2023. Bristol, United Kingdom. [URL] Xinyi Wang, Cen Zhang, Yeting Li, Zhiwu Xu, Shuailin Huang, Yi Liu, Yican Yao, Yang Xiao, Yanyan Zou, Yang Liu, Wei Huo. Effective ReDoS Detection by Principled Vulnerability Modeling and Exploit Generation[C]. 44th IEEE Symposium on Security and Privacy (SP 2023). 2427-2443. May 22-24, 2023. San Francisco, CA, USA. [URL] Zhiwu Xu, Yazheng Liu, Shengchao Qin, Zhong Ming. Output Range Analysis for Feed-Forward Deep Neural Networks via Linear Programming[J]. IEEE Transactions on Reliability. 72(3):1191-1205, September 2023. [URL] Yeting Li, Yecheng Sun, Zhiwu Xu, Jialun Cao, Yuekang Li, Rongchen Li, Haiming Chen, Shing-Chi Cheung, Yang Liu, Yang Xiao. RegexScalpel: Regular Expression Denial of Service (ReDoS) Defense by Localize-and-Fix[C]. 31st USENIX Security Symposium (USENIX Security 22). 4183-4200. 10-12 August 2022. BOSTON, MA, USA. [URL] Cheng Wen, Mengda He, Bohao Wu, Zhiwu Xu, Shengchao Qin. Controlled Concurrency Testing via Periodical Scheduling[C]. 44th International Conference on Software Engineering (ICSE 2022). 474-486, 21-29 May 2022. Pittsburgh, PA, USA. Yida Tao, Zhihui Chen, Yepang Liu, Jifeng Xuan, Zhiwu Xu, and Shengchao Qin. Demystifying \"Bad\" Error Messages in Data Science Libraries[C]. 29th ACM Joint European Software Engineering Conference and Symposium on the Foundations of Software Engineering (ESEC/FSE 2021). 818-829, 23-28 August 2021. Athens, Greece. [URL] Yeting Li, Zixuan Chen, Jialun Cao, Zhiwu Xu, Qiancheng Peng, Haiming Chen, Liyuan Chen, and Shing-Chi Cheung. ReDoSHunter: A Combined Static and Dynamic Approach for Regular Expression DoS Detection[C]. 30th USENIX Security Symposium (USENIX Security 21). 3847-3864. 11-13 August 2021. JW Marriott Parq Vancouver, Vancouver, Canada. [URL] Yida Tao, Shan Tang, Yepang Liu, Zhiwu Xu, and Shengchao Qin. Speeding up Data Manipulation Tasks with Alternative Implementations: An Exploratory Study[J]. Transactions on Software Engineering and Methodology. 230(4):1-28, 23 July 2021. [URL] Zhiwu Xu, Cheng Wen, Shengchao Qin, Mengda He. Extracting automata from neural networks using active learning[J]. PeerJ Computer Science 7:e436. 19 April 2021. [URL] Zhiwu Xu, Hongxu Chen, Alwen Tiu, Yang Liu, Kunal Sareen. A Permission-Dependent Type System for Secure Information Flow Analysis[J]. Journal of Computer Security. 29(2): 161-228. 29 March 2021. [PDF] Yeting Li, Shuaimin Li, Zhiwu Xu, Jialun Cao, Zixuan Chen, Yun Hu, Haiming Chen, Shing-Chi Cheung. TransRegex: Multi-modal Regular Expression Synthesis by Generate-and-Repair[C]. 43rd International Conference on Software Engineering (ICSE 2021). 1210-1222, 22-30 May 2021. Madrid, Spain. [PDF] Haiming Chen and Zhiwu Xu. Inclusion Algorithms for One-Unambiguous Regular Expressions and Their Applications[J]. Science of Computer Programming. 193:102436, 1 July 2020. [PDF] Zhiwu Xu, Xiongya Hu, Yida Tao and Shengchao Qin. Analyzing Cryptographic API Usages for Android Applications Using HMM and N-Gram[C]. 14th International Symposium on Theoretical Aspects of Software Engineering (TASE 2020). 153-160, 11-13 December 2020. Hangzhou, China. [PDF] Yeting Li, Zhiwu Xu, Jialun Cao, Haiming Chen, Tingjian Ge, Shing-Chi Cheung, Haoren Zhao. FlashRegex: Deducing Anti-ReDoS Regexes from Examples[C]. 35th IEEE/ACM International Conference on Automated Software Engineering (ASE 2020). 659-671, 21-25 September 2020. Melbourne, Australia. [PDF] Yida Tao, Jiefang Jiang, Yepang Liu, Zhiwu Xu, Shengchao Qin. Understanding Performance Concerns in the API Documentation of Data Science Libraries[C]. 35th IEEE/ACM International Conference on Automated Software Engineering (ASE 2020). 895-906, 21-25 September 2020. Melbourne, Australia. [PDF] Cheng Wen, Haijun Wang, Yuekang Li, Shengchao Qin, Yang Liu, Zhiwu Xu, Hongxu Chen, Xiaofei Xie, Geguang Pu, Ting Liu. MemLock: Memory Usage Guided Fuzzing[C]. 42nd International Conference on Software Engineering (ICSE 2020), 765-777, 6-11 July 2020. Seoul, South Korea. [PDF] Yeting Li, Jialun Cao, Haiming Chen, Tingjian Ge, Zhiwu Xu and Qiancheng Peng. FlashSchema: achieving high quality XML schemas with powerful inference algorithms and large-scale schema data[C]. 36th IEEE International Conference on Data Engineering (ICDE 2020). 1962-1965, 20-24 April 2020. Dallas, Texas, USA. [PDF] Yida Tao, Shan Tang, Yepang Liu, Zhiwu Xu, Shengchao Qin. How Do API Selections Affect the Runtime Performance of Data Analytics Tasks?[C]. 34th IEEE/ACM International Conference on Automated Software Engineering (ASE 2019). 665-668, 10-15 November 2019. San Diego, California, United States. [PDF] Zhiwu Xu, Cheng Wen, Shengchao Qin. Type Learning for Binaries and its Applications[J]. The IEEE Transactions on Reliability. 68(3), 893-912, September 2019. [PDF] Fu Song, Yedi Zhang, Taolue Chen, Yu Tan and Zhiwu Xu. Probabilistic Alternating-Time mu-Calculus[C]. Thirty-Third AAAI Conference on Artificial Intelligence (AAAI 2019). 6179-6186, 27 January-1 February 2019. Honolulu, Hawaii, USA. [PDF] Zhiwu Xu, Ping Lu and Haiming Chen. Towards an Effective Syntax and a Generator for DREGs[J]. The Computer Journal, Volume 62, Issue 9, September 2019, Pages 1322-1341. [PDF] Zhiwu Xu, Cheng Wen, Shengchao Qin. State-taint analysis for detecting resource bugs[J]. Science of Computer Programming, 93-109, 2018. [PDF] Jingyi Wang, Jun Sun, Yifan Jia, Shengchao Qin and Zhiwu Xu. Towards `Verifying' a Water Treatment System. 22nd International Symposium on Formal Methods (FM 2018), 73-92, 15-17 July 2018. Oxford, UK. [PDF] Giuseppe Castagna, Kim Nguyen, Zhiwu Xu, Pietro Abate. Polymorphic Functions with Set-Theoretic Types:Part 2: Local Type Inference and Type Reconstruction[C]. 42nd ACM Symposium on Principles of Programming Languages (POPL 2015). 289-302, 15-17 January 2015. Mumbai, India. [URL] Giuseppe Castagna, Kim Nguyen, Zhiwu Xu, Hyeonseung Im, Sergue誰 Lenglet, Luca Padovani. Polymorphic functions with set-theoretic types: part 1: syntax, semantics, and evaluation[C]. 41st ACM Symposium on Principles of Programming Languages (POPL 2014). 5-18, 20-21 January 2014. San Diego, CA, USA. [URL] Courses Automata Theory and Formal Languages (2020 Autumn, 2021 Autumn, 2022 Autumn, 2023 Autumn) Specification and Verification (2021 Autumn, 2022 Autumn, 2023 Autumn) Software Engineering (2020 Autumn, 2021 Autumn, 2022 Autumn, 2023 Autumn) Software Testing (2020 Spring, 2023 Spring, 2024 Spring) Programming Languages (2020 Spring, 2021 Spring, 2022 Spring, 2023 Spring) Programming Analysis and Verification (2024 Spring) Honors and Awards Best Paper Award for FMAC 2018 Best Student Paper Award for SmartCom 2017 EAPLS PhD Award 2013 CACM Research Highlights nomination by ACM SIGPLAN for ICFP'11, 2013 The France Eiffel Excellence Scholarship for international students, 2011-2012 The Joint Doctoral Promotion Programme of Chinese Academy of Sciences, 2009-2010",
  "content_length": 9774,
  "method": "requests",
  "crawl_time": "2025-12-01 14:55:40"
}