{
  "name": "Zhixuan Fang",
  "homepage": "https://people.iiis.tsinghua.edu.cn/~fang",
  "status": "success",
  "content": "Zhixuan Fang (æ¿æºè½©) Menu Home Curriculum Vitae Publications Zhixuan Fang (æ¿æºè½©) Assistant Professor, Institute for Interdisciplinary Information Sciences (IIIS), Tsinghua University Beijing, China zfang [AT] mail.tsinghua.edu.cn About me I am now a tenure-track assistant Professor in the Institute for Interdisciplinary Information Sciences (IIIS), Tsinghua University. My research focuses on developing methods and solutions to address challenges in social and computer systems consist of multiple interest-driven individuals, e.g., multi-agent systems. Typically, I model and analyze the system through the lens of game theory, mechanism design, learning and decision making, and algorithms. My recent studies are mostly on the topics of blockchain systems, collaborative learning, and network economics. I received my PhD degree from IIIS, Tsinghua University in 2018 (supervised by Prof. Andrew Chi-Chih Yao and Prof. Longbo Huang). I was then a postdoctoral researcher in the Department of Infomation Engineering, The Chinse University of Hong Kong, advised by Prof. Jianwei Huang. Prior to my Ph.D., I received my B.S. degree in School of Physics, Peking University in 2013. Student recruitment æç: I am looking for motivated PhD, postdoc, and research assistant/undergraduate intern. Feel free to contact me if you are interested. Researcher recruitment ç ç©¶åå²ä½(ä¸æµ·)ï¼ We also have openings for full time/intern researcher at Shanghai Qi Zhi Institute (SQZ). Feel free to contact me if you are interested. News [08/2025] One paper accepted to CIKM 2025! [07/2025] One paper accepted to SRDS 2025! [05/2025] One paper accepted to ACL 2025! [04/2025] One paper accepted to IEEE TNSE! [12/2024] Four (full) papers accepted to AAMAS 2025! [12/2024] One paper accepted to AAAI 2025! [10/2024] One paper accepted to IEEE/ACM ToN! [09/2024] Paper “Mechanisms Design for Blockchain Storage Sustainability” is selected as ESI Hot Paper/Highly Cited Paper! [08/2024] Paper “The Earth is Flat becauseâ¦: Investigating LLMsâ Belief towards Misinformation via Persuasive Conversation” won the Outstanding Paper Award of ACL 2024! [07/2024] Congratulations to Qingsong Liu for his graduation! Dr. Liu received Tsinghua University Outstanding Doctoral Dissertation Award, and will join UMass Amherst as a postdoc! [06/2024] One paper accepted to IEEE/ACM ToN! [05/2024] Two papers accepted to ICML 2024! [04/2024] One paper accepted to UAI 2024! [03/2024] One paper accepted to SIGMETRICS 2024! [01/2024] One paper accepted to IEEE/ACM ToN! [12/2023] Two papers (abstract) accepted to AAMAS 2024! [12/2023] One paper accepted to AAAI 2024! [12/2023] One paper accepted to INFOCOM 2024! [08/2023] Paper “We-TIPS: Weak-Block-Based Transaction Inclusion Protocol with Signaling in DAG-based Blockchain” is selected as Best Paper Candidate of WiOpt 2023! [04/2023] One paper accepted to Euro S&P 2023! [12/2022] One paper accepted to SIGMETRICS 2023! [12/2022] One paper accepted to INFOCOM 2023! [09/2022] Two papers accepted to NeurIPS 2022! More [07/2022] One paper accepted to MobiHoc 2022! [07/2022] Two papers accepted to WiOpt 2022! [06/2022] Two papers accepted to IEEE JSAC! [05/2022] Paper \"Economic Analysis of Decentralized Exchange Market with Transaction Fee Mining\" won the Best Paper Award of ACM BSCI 2022. Recent highlights Qijun Miao and Zhixuan Fang, “User-side Model Consistency Monitoring for Open Source Large Language Models Inference Services”, ACL 2025. Qingsong Liu and Zhixuan Fang, “Learning the Optimal Control for Evolving Systems with Converging Dynamics,” ACM SIGMETRICS 2024. Canhui Chen and Zhixuan Fang, “Gacha Game Analysis and Design,” ACM SIGMETRICS 2023. Yuming Shao and Zhixuan Fang, “On Multi-Armed Bandit with Impatient Arms”, ICML 2024. Canhui Chen and Zhixuan Fang, “We-TIPS: Weak-Block-Based Transaction Inclusion Protocol with Signaling in DAG-based Blockchain,” WiOpt 2023. Yirui Zhang, Siwei Wang, and Zhixuan Fang, “Matching in Multi-arm Bandit with Collision,” NeurIPS 2022.",
  "content_length": 4043,
  "method": "requests",
  "crawl_time": "2025-12-01 14:55:40"
}