{
  "name": "Zhixiang Chen 0003",
  "homepage": "https://www.sheffield.ac.uk/dcs/people/academic/zhixiang-chen",
  "status": "success",
  "content": "Dr Zhixiang Chen | Computer Science | The University of Sheffield Skip to main content Search sheffield.ac.uk Close menu × School of Computer Science School of Computer Science Menu Dr Zhixiang Chen School of Computer Science Lecturer in Machine Learning AI Strategy Support Member of the Machine Learning research group Member of the Computer Vision research group Open staff member portrait in a modal window Zhixiang.Chen@sheffield.ac.uk Regent Court (DCS) Full contact details Dr Zhixiang Chen School of Computer Science Regent Court (DCS) 211 Portobello Sheffield S1 4DP Orcid ID:https://orcid.org/0000-0002-5636-6082 Google Scholar Profile Dr. Zhixiang Chen is a Lecturer in Machine Learning at the Department of Computer Science of the University of Sheffield. Before joining the University of Sheffield, he held postdoctoral positions at Imperial College London, UK and Tsinghua University, China. He received a PhD degree from Tsinghua University, China and a B.Eng. degree from Xi'an Jiaotong University, China. Research interests Dr. Chen is interested in various areas of Computer Vision and Machine Learning including human analysis, detection and retrieval. Publications Show: Featured publications All publications Featured publications This person does not have any publications available. All publications Journal articles Li Q, Chen Z, Li Y, Jiang Z & Cao S (2026) Efficient network compression via gradient-score aware pruning. Neurocomputing, 660, 131870-131870. Deng S, Deng L, Meng X, Sun T, Chen B, Chen Z, Hu H, Xie Y, Yin H & Yu S (2024) EHIR: Energy-based Hierarchical Iterative Image Registration for Accurate PCB Defect Detection. Pattern Recognition Letters, 185, 38-44. Fan Z, Huang Z, Chen Z, Xu T, Han J & Kittler J (2024) Lightweight multiperson pose estimation with staggered alignment self-distillation. IEEE Transactions on Multimedia, 26, 9228-9240. View this article in WRRO Chen H, Deng L, Chen Z, Liu C, Zhu L, Dong M, Lu X & Guo C (2024) SFCFusion: Spatial–Frequency Collaborative Infrared and Visible Image Fusion. IEEE Transactions on Instrumentation and Measurement, 73, 1-15. Guo C, Liu C, Deng L, Chen Z, Dong M, Zhu L, Chen H & Lu X (2023) Multi-scale infrared and visible image fusion framework based on dual partial differential equations. Infrared Physics & Technology, 135, 104956-104956. Liu X, Zhou S, Lei T, Jiang P, Chen Z & Lu H (2023) First-person video domain adaptation with multi-scene cross-site datasets and attention-based methods. IEEE Transactions on Circuits and Systems for Video Technology, 33(12), 7774-7788. View this article in WRRO Li S, Chen Z, Li X, Lu J & Zhou J (2020) Unsupervised Variational Video Hashing With 1D-CNN-LSTM Networks. IEEE Transactions on Multimedia, 22(6), 1542-1554. Yuan X, Chen Z, Lu J, Feng J & Zhou J (2018) Reconstruction-based supervised hashing. Pattern Recognition, 79, 147-161. Chen Z & Zhou J (2018) Collaborative multiview hashing. Pattern Recognition, 75, 149-160. Lu J, Duan Y, Chen Z & Zhou J (2018) Binary Representation Learning and Its Applications. Moshi Shibie Yu Rengong Zhineng Pattern Recognition and Artificial Intelligence, 31(1), 12-22. Chen Z, Lu J, Feng J & Zhou J (2018) Nonlinear Structural Hashing for Scalable Video Search. IEEE Transactions on Circuits and Systems for Video Technology, 28(6), 1421-1433. Chen BH, Deng L, Chen ZX, Duan YQ & Zhou J (2017) Instant Dense 3D Reconstruction-Based UAV Vision Localization. Tien Tzu Hsueh Pao Acta Electronica Sinica, 45(6), 1294-1300. Chen Z, Lu J, Feng J & Zhou J (2017) Nonlinear Sparse Hashing. IEEE Transactions on Multimedia, 19(9), 1996-2009. Deng L, Chen BH, Lai WL, Chen ZX & Zhou J (2017) Interactive Calibrating 3D surveillance system Based on 3d reconstruction. Tien Tzu Hsueh Pao Acta Electronica Sinica, 45(3), 527-533. Chen Z, Lu J, Feng J & Zhou J (2017) Nonlinear Discrete Hashing. IEEE Transactions on Multimedia, 19(1), 123-135. Deng L, Chen Z, Chen B, Duan Y & Zhou J (2016) Incremental image set querying based localization. Neurocomputing, 208, 315-324. Chen B, Chen Z, Deng L, Duan Y & Zhou J (2016) Building change detection with RGB-D map generated from UAV images. Neurocomputing, 208, 350-364. Chen B, Deng L, Duan Y, Chen Z & Zhou J (2016) Multiple model fusion in 3-D reconstruction: Illumination and scale invariance. Qinghua Daxue Xuebao Journal of Tsinghua University, 56(9), 969-973. Chen Z-X, Li Z-L, Cao S, Wang F & Zhou J (2015) Schedule refinement for homogeneous multi-core processors in the presence of manufacturing-caused heterogeneity. Frontiers of Information Technology & Electronic Engineering, 16(12), 1018-1033. Cao S, Li Z, Wang F, Jiang G, Chen Z & Wei S (2013) Energy-efficient stream task scheduling scheme for embedded multimedia applications on multi-issued stream architectures. Journal of Systems Architecture, 59(4-5), 187-201. Wei CP, Li ZL, Liu H & Chen ZX () Design of a Random Test Platform for DSP Serials Used in Embedded Systems. Advanced Materials Research, 267, 98-103. Book chapters Sun Q, Cao S & Chen Z (2023) Filter Pruning via Automatic Pruning Rate Search, Lecture Notes in Computer Science (pp. 594-610). Springer Nature Switzerland Shi X, Chen Z & Kim T-K (2020) Distance-Normalized Unified Representation for Monocular 3D Object Detection, Lecture Notes in Computer Science (pp. 91-107). Springer International Publishing Chen Z, Cai R, Lu J, Feng J & Zhou J (2018) Order-Sensitive Deep Hashing for Multimorbidity Medical Image Retrieval, Lecture Notes in Computer Science (pp. 620-628). Springer International Publishing Conference proceedings Sun J, Chen Z & Kim T-K (2023) MAPConNet: Self-supervised 3D Pose Transfer with Mesh and Point Contrastive Learning. 2023 IEEE/CVF International Conference on Computer Vision (ICCV) (pp 14406-14416), 1 October 2023 - 6 October 2023. Xiao J, Deng L, Chen Z, Li X, Chen B & Yin H (2023) Dual-Path Reconstruction Guided Segmentation Network for Unsupervised Anomaly Detection and Localization. 2023 International Joint Conference on Neural Networks (IJCNN) (pp 1-8), 18 June 2023 - 23 June 2023. Yin H, Deng L, Chen Z, Chen B, Sun T, Xie Y, Xiao J, Fu Y, Deng S & Li X (2023) LSMD-Net: LiDAR-Stereo Fusion with Mixture Density Network for Depth Sensing (pp 89-105) Shi X, Chen Z & Kim T-K (2023) Multivariate Probabilistic Monocular 3D Object Detection. 2023 IEEE/CVF Winter Conference on Applications of Computer Vision (WACV), 2 January 2023 - 7 January 2023. Choi H, Chen Z, Shi X & Kim TK (2022) Semi-Supervised Object Detection with Object-wise Contrastive Learning and Regression Uncertainty. Bmvc 2022 33rd British Machine Vision Conference Proceedings Shi X, Ye Q, Chen X, Chen C, Chen Z & Kim T-K (2021) Geometry-based Distance Decomposition for Monocular 3D Object Detection. 2021 IEEE/CVF International Conference on Computer Vision (ICCV), 10 October 2021 - 17 October 2021. Chen Z & Kim T-K (2021) Learning Feature Aggregation for Deep 3D Morphable Models. 2021 IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR) (pp 13159-13168), 20 June 2021 - 25 June 2021. Li S, Chen Z, Lu J, Li X & Zhou J (2019) Neighborhood Preserving Hashing for Scalable Video Retrieval. 2019 IEEE/CVF International Conference on Computer Vision (ICCV) (pp 8211-8220), 27 October 2019 - 2 November 2019. Chen Z, Yuan X, Lu J, Tian Q & Zhou J (2018) Deep Hashing via Discrepancy Minimization. 2018 IEEE/CVF Conference on Computer Vision and Pattern Recognition (pp 6838-6847), 18 June 2018 - 23 June 2018. Ma C, Chen Z, Lu J & Zhou J (2018) Rank-Consistency Multi-Label Deep Hashing. 2018 IEEE International Conference on Multimedia and Expo (ICME) (pp 1-6), 23 July 2018 - 27 July 2018. Yuan X, Lu J, Chen Z, Feng J & Zhou J (2017) Reconstruction-based supervised hashing. 2017 IEEE International Conference on Multimedia and Expo (ICME) (pp 1404-1409), 10 July 2017 - 14 July 2017. Shan Cao , Zhaolin Li , Zhixiang Chen , Guoyue Jiang & Shaojun Wei (2013) Compiler-assisted leakage energy optimization of media applications on stream architectures. International Symposium on Quality Electronic Design (ISQED) (pp 120-127), 4 March 2013 - 6 March 2013. Zhixiang Chen , Yi Fang , Fang Wang & Zhaolin Li (2013) Implementation of H.264 intra-frame encoding on clustered stream architectures. 2013 IEEE 10th International Conference on ASIC (pp 1-4), 28 October 2013 - 31 October 2013. Liu H, Li Z & Chen Z (2013) Design of a dynamic reconfigurable coprocessor for flexible precision matrix algorithms in media processing and industrial control applications. 2013 IEEE Third International Conference on Information Science and Technology (ICIST) (pp 714-717), 23 March 2013 - 25 March 2013. Brooks T, Kaarst-Brown M, Caicedo C, Joon Park & McKnight L (2013) A failure to communicate: Security vulnerabilities in the GridStreamX Edgeware application. 2013 IEEE Third International Conference on Information Science and Technology (ICIST) (pp 516-523), 23 March 2013 - 25 March 2013. Liu H, Li Z & Chen Z (2013) Research and Implementation of Random Test Generator for VLIW DSPs. 2013 INTERNATIONAL CONFERENCE ON INFORMATION SCIENCE AND TECHNOLOGY (ICIST) (pp 524-527) Cao S, Li Z, Chen Z, Jiang G & Wei S (2012) Low Power Schedule Algorithm for Embedded Multimedia Applications Basing on Imagine-L Processor. 2012 IEEE 14th International Conference on High Performance Computing and Communication & 2012 IEEE 9th International Conference on Embedded Software and Systems (pp 1344-1351), 25 June 2012 - 27 June 2012. Grants VIM: towards a Vision based System for Inventory Management with Deep Learning, EPSRC, 01/2024 - 01/2026, £46,354, as PI Professional activities and memberships 2019 China Society of Image and Graphics Doctoral Dissertation Award2018  IEEE International Conference on Multimedia and Expo Best Paper Award2017 China National Postdoctoral Program for Innovative TalentsGrant Reviewer: UKRI-FLF, NSFCSenior Program Committee Member: AAAI 2023Conference Reviewer: CVPR, ICCV, ECCV, ICLR, Neu",
  "content_length": 10203,
  "method": "requests",
  "crawl_time": "2025-12-01 14:55:43"
}