{
  "name": "Zhiyong Peng 0001",
  "homepage": "https://cs.whu.edu.cn/info/1019/2494.htm",
  "status": "success",
  "content": "ï»¿ å½­æºå-æ­¦æ±å¤§å­¦è®¡ç®æºå­¦é¢ EN æ§ç æ­¦å¤§ä¸»é¡µ é¦é¡µ å­¦é¢æ¦åµ å­¦é¢ç®ä» åå²æ²¿é© ç°ä»»é¢å¯¼ ç»ç»æºæ èç³»æä»¬ è®¡ç§æ å å¸èµéä¼ é«å±æ¬¡äººæ ä¸ä»»æå¸ å®éªææ¯äººå è£ä¼æå¸ äººæå¹å » æ¬ç§çæè² ç ç©¶çæè² çå­¦çæè² å½é äº¤æµ ç§å­¦ç ç©¶ ç§ç è¿å± å­¦æ¯äº¤æµ é¡¹ç®ç³æ¥ ç ç©¶å¹³å° å ç¾¤å·¥ä½ å å»ºå·¥ä½ çºªæ£å·¥ä½ å·¥ä¼å·¥ä½ å ±éå¢å·¥ä½ å­¦ä¹ èµæ äººææè å¸èµå²ä½æè åå£«åæè éç¼äººåæè æ ¡åé£é æ°åºæ ¡å æ ¡åå¨æ æ ¡ååº ä¿¡æ¯å ¬å¼ è§ç« å¶åº¦ åäºæµç¨ å¸¸ç¨ä¸è½½ èç³»æ¹å¼ E-mailï¼peng@whu.edu.cn åå ¬çµè¯ï¼ 68775673 åå ¬å°ç¹ï¼A518 å½­æºå æ­¦æ±å¤§å­¦è®¡ç®æºå­¦é¢ è®¡ç®æºç§å­¦ç³» å¤§æ°æ®ç ç©¶æ ææ (åå¯¼) å§åï¼å½­æºå ä¸»é¡µï¼ æ§å«ï¼ç· èç§°ï¼ææ (åå¯¼,) å­¦åå­¦ä½ï¼åå£« çµè¯ï¼68775673 åå ¬å°ç¹ï¼A518 E-mailï¼peng â whu.edu.cn è¯·æå·¥æ¿æ¢ç¬¦å· é¢åï¼å¤§æ°æ®å®å ¨,æ°æ®ç®¡ç,æ°æ®åº,æ°æ®ææä¸åæ, æçä¿¡æ¯ï¼2018å¹´åº¦ææ¶ç¡å£«4åï¼ææ¶æ¹åï¼è®¡ç®æºç§å­¦ä¸ææ¯(å­¦ç¡),è½¯ä»¶å·¥ç¨(å­¦ç¡),è®¡ç®æºææ¯(ä¸ç¡),è½¯ä»¶å·¥ç¨(ä¸ç¡)ã ææ¶åå£«2åï¼ææ¶æ¹åï¼è®¡ç®æºç§å­¦ä¸ææ¯,è½¯ä»¶å·¥ç¨ã ç ç©¶æ¹å ï¼1ï¼å¯¹è±¡ä»£çæ°æ®åºç³»ç» ï¼2ï¼Webç¤¾åºç®¡çä¸æå¡ ï¼3ï¼å¶é ä¸å¤§æ°æ®ç®¡çç³»ç» ï¼4ï¼ç§æå¤§æ°æ®ç®¡çä¸åæ ï¼5ï¼æè²å¤§æ°æ®ç®¡çä¸åæ ï¼6ï¼æåå¤§æ°æ®ç®¡çä¸åæ ï¼7ï¼äºæ°æ®å®å ¨ä¸éç§ä¿æ¤ ï¼8ï¼æ°æ®åºæ°´å°ä¸çæä¿æ¤ æè²èæ¯ 1992.4 â1995.3  æ¥æ¬äº¬é½å¤§å­¦ä¿¡æ¯ç§å­¦ç³»å­¦ä¹ è·å·¥å­¦åå£«å­¦ä½ 1985.9 â1988.4  å½é²ç§æå¤§å­¦è®¡ç®æºç³»å­¦ä¹ è·å·¥å­¦ç¡å£«å­¦ä½ 1981.9 â1985.7  æ­¦æ±å¤§å­¦è®¡ç®æºç§å­¦ç³»å­¦ä¹ è·çå­¦å­¦å£«å­¦ä½ å·¥ä½ç»éª 2000.11 âè³ä»   æ­¦æ±å¤§å­¦è®¡ç®æºå­¦é¢ï¼ææï¼åå£«çå¯¼å¸ 1997.5 â2000.11  ç¾å½æ æ®å ¬å¸æ¥æ¬ç ç©¶æ ç ç©¶å 1995.4 â1997.3   æ¥æ¬äº¬é½é«åº¦ææ¯ç ç©¶æ ç ç©¶å ææè¯¾ç¨ ä½¿ç¨è±æåçææï¼ãDatabase System Implementationãï¼ç¾ï¼Hator Garcia-Molina, Jeffrey.D.Ullman, Jennifer Widom èï¼ï¼ä¸ºæ¬ç§çä¸»è®²ãæ°æ®åºç³»ç»å®ç°ãåè¯­æå­¦è¯¾ç¨ï¼è®²ææ°æ®åºçå é¨å®ç°æºå¶ï¼ ä½¿ç¨èªç¼ææãPostgreSQLæ°æ®åºå æ ¸åæãä¸ºç ç©¶çä¸»è®²ãæ°æ®åºå æ ¸åæãå®è·µè¯¾ç¨ï¼æå¯¼å­¦çåæå¼æºå¯¹è±¡å ³ç³»æ°æ®åºç³»ç»PostgreSQLçæºä»£ç ï¼ éåæ°æ®ç®¡çé¡¶çº§å­¦æ¯æååä¼è®®æè¿å å¹´è®ºæï¼ä¸ºç ç©¶çä¸»è®²ãæ°æ®ç®¡çåæ²¿ææ¯ãï¼è®²è§£æ°æ®ç®¡çåä¸ªç ç©¶æ¹åçä¸çä¸ç®åæä»äºçæåæ²¿å·¥ä½ã å¨è®¡ç®æºå­¦é¢èå´å å¼è®¾ç ç©¶çå­¦ç§éå¼è¯¾ç¨âç ç©¶æ¹æ³è®ºâï¼ä½¿ç ç©¶çè½å¤ææ¡ä»äºç ç©¶çä¸è¬ç¨åºãæ¹æ³åè§èã åè¡¨è®ºæ å­¦æ¯è®ºæï¼è±æï¼ ï¼1ï¼ Zhang P., Bao Z., Yuchen L., Guoliang L., Yipeng Z., Zhiyong P. Trajectory-driven Influential Billboard Placement. Proceedings of the 24rd ACM SIGKDD, London, 2018 ï¼2ï¼ Ping Zhang, Zhifeng Bao, Yudong Niu,  Yipeng Zhang, Songsong Mo, Fei Geng, Zhiyong Peng, Proactive rumor control in online networks, Journal of World Wide Web, pp 1â20, July 28, 2018, DOI  10.1007/s11280-018-0623-9 ï¼3ï¼ Yuling Shi, Zhiyong Peng, Liang Hong, Qian Yu:SoC-constrained team formation with self-organizing mechanism in social networks. Knowl.-Based Syst. 138: 1-14 (2017) ï¼4ï¼ Yuling Shi, Zhiyong Peng, Hongning Wang:Modeling Student Learning Styles in MOOCs. CIKM 2017: 979-988 ï¼5ï¼ Liang Wang, Liwei Wang, Zhiyong Peng:Probabilistic object deputy model for uncertain data and lineage management. Data Knowl. Eng. 109: 70-84 (2017) ï¼6ï¼ Wei Song, Bing Wang, Qian Wang, Zhiyong Peng, Wenjing Lou:Tell me the truth: Practically public authentication for outsourced databases with multi-user modification. Inf. Sci. 387: 221-237 (2017) ï¼7ï¼ Wei Song, Bing Wang, Qian Wang, Zhiyong Peng, Wenjing Lou, Yihui Cui:A privacy-preserved full-text retrieval algorithm over encrypted data for cloud storage applications. J. Parallel Distrib. Comput. 99: 14-27 (2017) ï¼8ï¼ Wei Song, Bing Wang, Qian Wang, Chengliang Shi, Wenjing Lou, Zhiyong Peng:Publicly Verifiable Computation of Polynomials Over Outsourced Data With Multiple Sources. IEEE Trans. Information Forensics and Security 12(10): 2334-2347 (2017) ï¼9ï¼ Tieyun Qian, Bing Liu, Li Chen, Zhiyong Peng, Ming Zhong, Guoliang He, Xuhui Li, Gang Xu:Tri-Training for authorship attribution with limited training data: a comprehensive study. Neurocomputing 171: 798-806 (2016) ï¼10ï¼Song Wang, Hao Huang, Yunjun Gao, Tieyun Qian, Liang Hong, Zhiyong Peng:Fast Rare Category Detection Using Nearest Centroid Neighborhood. APWeb (1) 2016: 383-394 ï¼11ï¼Xiaoying Wu, Dimitri Theodoratos, Zhiyong Peng:Efficiently Mining Homomorphic Patterns from Large Data Trees. DASFAA (1) 2016: 180-196 ï¼12ï¼Zhiyong Peng, MingLiang Yue, Xia Wu, Yuwei Pengï¼Blind watermarking scheme for polylines in vector geo-spatial data. Multimedia Tools Appl. 74(24): 11721-11739 (2015ï¼ ï¼13ï¼Xia Wu, Yuanyuan Zhu, Shengchao Xiong, Yuwei Peng, Zhiyong Peng:A New Similarity Measure Between Semantic Trajectories Based on Road Networks. APWeb 2015: 522-535 ï¼14ï¼Liang Wang, Liwei Wang, Zhiyong Peng: A Working Model for Uncertain Data with Lineage. ER 2015: 369-383 ï¼15ï¼Wei Song, Zhiyong Peng, Qian Wang, Fangquan Cheng, Xiaoxin Wu, Yihui Cui:Efficient privacy-preserved data query over ciphertext in cloud computing. Security and Communication Networks 7(6): 1049-1065 (2014) ï¼16ï¼Tieyun Qian, Qing Li, Jaideep Srivastava, Zhiyong Peng, Yang Yang, Shuo Wang:Exploiting small world property for network clustering. World Wide Web 17(3): 405-425 (2014)ï¼17ï¼Tieyun Qian, Bing Liu, Li Chen, Zhiyong Peng:Tri-Training for Authorship Attribution with Limited Training Data. ACL (2) 2014: 345-351 ï¼18ï¼Yihui Cui, Zhiyong Peng, Wei Song, Xiaojuan Li, Fangquan Cheng, Luxiao Ding:A Time-Based Group Key Management Algorithm Based on Proxy Re-encryption for Cloud Storage. APWeb 2014: 117-128 ï¼19ï¼Dacheng Liu, Zhiyong Peng, Bin Liu, Xu Chen, Yuqi Guo:Technology Effect Phrase Extraction in Chinese Patent Abstracts. APWeb 2014: 141-152 ï¼20ï¼Junyan Jiang, Zhiyong Peng, Xiaoying Wu, Nan Liang: Sharing-Aware Scheduling of Web Services. APWeb 2014: 153-164 ï¼21ï¼Ge Xie, Zhiyong Peng, Wei Song:Query Authentication over Cloud Data from Multiple Contributors. APWeb 2014: 469-477 ï¼22ï¼Qian Yu, Zhiyong Peng, Liang Hong, Bin Liu, Haiping Peng:Novel Community Recommendation Based on a User-Community Total Relation. DASFAA (2) 2014: 281-295 ï¼23ï¼MingLiang Yue, Zhiyong Peng, Kai Zheng, Yuwei Peng:Rights Protection for Trajectory Streams. DASFAA (2) 2014: 407-421 ï¼24ï¼Ling Feng, Zhiyong Peng, Bin Liu, Dunren Che: Finding Novel Patents Based on Patent Association. WAIM 2014: 5-17 ï¼25ï¼Fangquan Cheng, Qian Wang, Qianwen Zhang, Zhiyong Peng:Highly Efficient Indexing for Privacy-Preserving Multi-keyword Query over Encrypted Cloud Data. WAIM 2014: 348-359 ï¼26ï¼Bin Fu, Wenfeng Li, Zhiyong Peng:Sublinear Time Approximate Sum via Uniform Random Sampling. COCOON 2013: 713-720 ï¼27ï¼Chuanjian Wang, Zhiyong Peng, Yuwei Peng, Liang Yu, Junzhou Wang, Qingzhan Zhao: Watermarking geographical data on spatial topological relations. Multimedia Tools Appl. 57(1): 67-89 (2012) ï¼28ï¼Xu Chen, Zhiyong Peng, Cheng Zeng: A co-training based method for chinese patent semantic annotation. CIKM 2012: 2379-2382 ï¼29ï¼Dawen Jia, Cheng Zeng, Wenhui Nie, Zhihao Li, Zhiyong Peng: A New Approach for Date Sharing and Recommendation in Social Web. DEXA (2) 2012: 314-328 ï¼30ï¼Zhiyong Peng, Hui Wang, Yuwei Peng, Bo Xu, Zeqian Huang: A Three Layer System Architecture for Web-Based Unstructured Data Management.  APWeb 2010: 447-450 ï¼31ï¼Xiaozhu Liu, Zhiyong Peng:An efficient random access inverted index for information retrieval. WWW 2010: 1153-1154 ï¼32ï¼Tieyun Qian, Jaideep Srivastava, Zhiyong Peng, Phillip C.-Y. Sheu:Simultaneously Finding Fundamental Articles and New Topics Using a Community Tracking Method. PAKDD 2009: 796-803 ï¼33ï¼Zukai Tang, Zhiyong Peng, Yi Ren: Using Object Deputy Model for Aspect Oriented Programming. C5 2007: 170-177 ï¼34ï¼Min Huang, Xiang Zhou, Jiaheng Cao, Zhiyong Peng: Geo-WDBMS: An Improved DBMS with the Function of Watermarking Geographical Data. DASFAA 2007: 1098-1109 ï¼35ï¼Zhiyong Peng, Yuwei Peng, Boxuan Zhai:Using object deputy database to realize multi-representation geographic information system. GIS 2007: 43 ï¼36ï¼Xiang Zhou, Min Huang, Zhiyong Peng:An additive-attack-proof watermarking mechanism for databases' copyrights protection using image. SAC 2007: 254-258 ï¼37ï¼Zhiyong Peng, Yuan Shi, Boxuan Zhai:Realization of Biological Data Management by Object Deputy Database System. Transaction on Computational Systems Biology, LNBI 4070, 2006, pp.49~67, Springer Verlag ï¼38ï¼Zhe Shan, Yu Yang, Qing Li, Yi Luo, Zhiyong Peng: A Light-Weighted Approach to Workflow View Implementation. APWeb 2006: 1059-1070 ï¼39ï¼Boxuan Zhai, Yuan Shi, Zhiyong Peng: Object Deputy Database Language. C5 2006: 88-95 ï¼40ï¼Yuan Shi, Boxuan Zhai, Xiang Zhou, Zhiyong Peng: Object Identifier Reuse Mechanism for TOTEM. ICDE Workshops 2006: 127 ï¼41ï¼Liwei Wang, Zhiyong Peng, Min Luo, Wenhao Ji, Zeqian Huang: A Scientific Workflow Framework Integrated with Object Deputy Model for Data Provenance. WAIM 2006: 569-580 ï¼42ï¼Xuhui Li, Zhiyong Peng, Jiannong Cao:A practical approach to specifying and verifying mobile agent algorithms. Int. J. Pervasive Computing and Communications 1(2): 115-122 (2005) ï¼43ï¼Zhiyong Peng, Qing Li, Ling Feng, Xuhui Li, Junqiang Liu: Using Object Deputy Model to Prepare Data for Data Warehousing. IEEE Trans. Knowl. Data Eng. 17(9): 1274-1288 (2005) ï¼44ï¼Zhiyong Peng, Kai Huang, Shijun Li, Yi Luo: Integration of Multiple Heterogeneous Databases",
  "content_length": 22624,
  "method": "requests",
  "crawl_time": "2025-12-01 14:55:41"
}