{
  "name": "Zhiyong Shan",
  "homepage": "https://www.wichita.edu/profiles/academics/engineering/SoC/Shan-Zhiyong.php",
  "status": "success",
  "content": "Zhiyong Shan Zhiyong Shan Associate Professor, Coordinator of Graduate Software Engineering Certificate College of Engineering School of Computing (316) 978 3929 zhiyong.shan@wichita.edu Office hours: 8:30 am to 9:30 am Monday and Wednesday 237, Jabara Hall Main Campus Overview Zhiyong Shan is an associate professor in the School of Computing and the director of Software Analysis & Intelligence Laboratory. Information Areas of Research Interest Research Interests Program Analysis Mobile Phone Security Virtual Machine Areas of Teaching Interest Aug 2017-Dec 2018, Operating System (Wichita State University). Aug 2017-Dec 2018, Software Analytics (Wichita State University). Aug 2016-Dec 2016, Advanced Software Engineering (University of Central Missouri) May 2016-June 2016, Advanced Android Application Programing (University of Central Missouri) Jan 2016-May 2016, Advanced Computer Network and Security (University of Central Missouri) Aug 2015-Dec 2015, Advanced Operating System (University of Central Missouri) Publications Selected Papers Preethi Santhanam, Hoang Dang, Zhiyong Shan, and Iulian Neamtiu. Scraping sticky leftovers: App user information left on servers after account deletion. In 43rd IEEE Symposium on Security and Privacy (Oakland 2022). Zhiyong Shan, Raina Samuel and Iulian Neamtiu. Device Administrator Use and Abuse in Android: Detection and Characterization. In Proceedings of the 25th Annual International Conference on Mobile Computing and Networking (MobiCom 2019). ACM, Oct 21-25, Los Cabos, Mexico, pp. 1-16. Zhiyong Shan, Iulian Neamtiu, Raina Samuel, Self-Hiding Behavior in Android Apps: Detection and Characterization, 40th International Conference on Software Engineering (ICSE 2018). Zhiyong Shan, Tanzirul Azim, Iulian Neamtiu. Finding Resume and Restart Errors in Android Applications. ACM Conference on Object-Oriented Programming, Systems, Languages & Applications (OOPSLA 2016), November 2016. Jin, Xinxin, Soyeon Park, Tianwei Sheng, Rishan Chen, Zhiyong Shan, and Yuanyuan Zhou. \"FTXen: Making hypervisor resilient to hardware faults on relaxed cores.\" In 2015 IEEE 21st International Symposium on High Performance Computer Architecture (HPCA’15), pp. 451-462. IEEE, 2015. Zhiyong Shan, Xin Wang, Tzi-cker Chiueh: Shuttle: Facilitating Inter-Application Interactions for OS-Level Virtualization. IEEE Trans. Computers 63(5): 1220-1233 (2014) Zhiyong Shan, Xin Wang: Growing Grapes in Your Computer to Defend Against Malware. IEEE Trans. on Information Forensics and Security 9(2): 196-207 (2014) Zhiyong Shan, Xin Wang, Tzi-cker Chiueh: Malware Clearance for Secure Commitment of OS-Level Virtual Machines. IEEE Trans. on Dependable and Secure Computing. 10(2): 70-83 (2013) Zhiyong Shan, Xin Wang, Tzi-cker Chiueh: Enforcing Mandatory Access Control in Commodity OS to Disable Malware. IEEE Trans. on Dependable and Secure Computing 9(4): 541-555 (2012) Zhiyong Shan, Xin Wang, Tzi-cker Chiueh, Xiaofeng Meng: Facilitating inter-application interactions for OS-level virtualization. In Proceedings of the 8th ACM Annual International Conference on Virtual Execution Environments (VEE’12), 75-86 Zhiyong Shan, Xin Wang, Tzi-cker Chiueh, and Xiaofeng Meng. \"Safe side effects commitment for OS-level virtualization.\" In Proceedings of the 8th ACM international conference on Autonomic computing (ICAC’11), pp. 111-120. ACM, 2011. Zhiyong Shan, Xin Wang, and Tzi-cker Chiueh. 2011. Tracer: enforcing mandatory access control in commodity OS with the support of light-weight intrusion detection and tracing. In Proceedings of the 6th ACM Symposium on Information, Computer and Communications Security (ASIACCS '11). ACM, New York, NY, USA, 135-144. (full paper acceptance rate 16%) Books Zhiyong Shan, Wenchang Shi. Research in Access Control of Operating Systems. Science Press, Beijing, China, Mar 2009. Zhiyong Shan, Zhiqun Guo, E-Commerce Security and Management, China Renmin University Press, Beijing, China, May 2010. Professional Experience Aug 2017-Dec 2018, Operating System (Wichita State University). Aug 2017-Dec 2018, Software Analytics (Wichita State University). Aug 2016-Dec 2016, Advanced Software Engineering (University of Central Missouri) May 2016-June 2016, Advanced Android Application Programing (University of Central Missouri) Jan 2016-May 2016, Advanced Computer Network and Security (University of Central Missouri) Aug 2015-Dec 2015, Advanced Operating System (University of Central Missouri) Additional Information Ph.D. Students Hoang Dang Preethi Santhanam Master's Students Anusha Konduru Ameya Jaykumar Jadhav Undergraduate Students Luke Baird Seth Allen Rodgers ©",
  "content_length": 4650,
  "method": "requests",
  "crawl_time": "2025-12-01 14:55:45"
}