{
  "name": "Zhiyi Huang 0002",
  "homepage": "https://i.cs.hku.hk/~zhiyi",
  "status": "success",
  "content": "Zhiyi Huang Zhiyi Huang é»å¿æ¯ Office 423 Chow Yei Ching Building The University of Hong Kong Email zhiyi@cs.hku.hk (primary) hzhiyi@hku.hk hzhiyi.tcs@gmail.com Short Bio I am an Associate Professor and the Head of Computer Science Division at School of Computing and Data Science, the University of Hong Kong. Before joining HKU, I was a postdoc at Stanford University from 2013 to 2014, working with Tim Roughgarden. I received my Ph.D. from the University of Pennsylvania under the supervision of Sampath Kannan and Aaron Roth in 2013, and a bachelor's degree in 2008 from the first \"Yao Class\" founded by Andrew Chi-Chih Yao at Tsinghua University. I work broadly on algorithms, focusing on the role of informationâand its flip-side, uncertaintyâin computation. I am interested in algorithms for sequential decision-making under uncertainty (online algorithms), learning based on different forms of information (learning theory), incentivizing self-interested agents to share private information (mechanism design), and disclosing one kind of information while keeping the other confidential (differential privacy). My research was recognized by several Best Paper Awards from ESA 2024 (Track S), FOCS 2020, and SPAA 2015. I also received an RGC Research Fellow Scheme and an Early Career Award by RGC Hong Kong, an Excellent Young Scientists Fund (HK & Macau) by NSFC, a Morris and Dorothy Rubinoff Dissertation Award, and a Simons Graduate Fellowship in Theoretical Computer Science. News Jul 2025 I was named a RGC Research Fellow by the Research Grants Council of Hong Kong. Jul 2025 The following papers were accepted to FOCS 2025: \"Optimal 4-approximation for the correlated Pandora's problem\", with Nikhil Bansal and Zixuan Zhu. \"Edge-weighted matching in the dark\", with Enze Sun, Xiaowei Wu, and Jiahao Zhao. Apr 2025 My paper with Chui Shan Lee, Xinkai Shu, and Zhaozi Wang, \"The long arm of Nashian allocation in online p-mean welfare maximization\", was accepted to ICALP 2025. Oct 2024 My paper with Ziyun Chen, Dongchen Li, and Zhihao Gavin Tang, \"Prophet secretary and matching: the significance of the largest item\", was accepted to SODA 2025. Sep 2024 My paper with Chui Shan Lee, Jianqiao Lu, and Xinkai Shu, \"Online matching meets sampling without replacement\", was accepted to WINE 2024. Expositional Materials Online Matching WINE 2023 Tutorial on \"Recent progress and future directions in online matching\" (with Zhihao Gavin Tang) Part 1 Part 2 FOCS 2023 Workshop on \"Online algorithms and online rounding: recent progress\" (with David Wajc) \"Online matching: a brief survey\" at SIGecom Exchange (with Zhihao Gavin Tang and David Wajc) COCOON 2024 Tutorial on \"Online correlated selection\" Slides Learning Aspects of Stochastic Optimization Lectures on \"Data-driven auction design\" at Peking University Part 1 Part 2 Part 3 Research Below is a reasonably updated list of my publications (see also, Google Scholar and DBLP). Following the tradition of Theoretical Computer Science, authors are listed in alphabetical order, unless stated otherwise. Click the buttons below to filter by my recent research themes. Teaching I teach/have taught the following courses at the University of Hong Kong: COMP3251 Algorithm Design (formerly COMP3250 Design and Analysis of Algorithms), in every spring semester from 2015 to 2025. COMP3351 Advanced Algorithm Analysis, in 2024 Spring, 2020 Fall, and 2018 Fall COMP3352 Algorithmic Game Theory, in 2022 Spring, 2019 Fall, and 2017 Fall COMP9601 Theory of Computation and Algorithm Design, in 2016 Fall COMP8601 Advanced Topics in Theoretical Computer Science, in 2016 Spring Group",
  "content_length": 3649,
  "method": "requests",
  "crawl_time": "2025-12-01 14:55:41"
}