{
  "name": "Zhiyao Duan",
  "homepage": "https://hajim.rochester.edu/ece/sites/zduan",
  "status": "success",
  "content": "Zhiyao Duan Home CV Research Publications Teaching Links Welcome to Zhiyao Duan's Homepage! (photo taken in 2018) Zhiyao Duan () Professor Department of Electrical and Computer Engineering (primary) Department of Computer Science (secondary) Goergen Institute for Data Science (affiliated) University of Rochester Google Scholar Profile Research Statements: 2025 2019 2012 Teaching Statements: 2025 2019 2012 Service Statements: 2025 2019 Mailing Address: University of Rochester 720 Computer Studies Building Rochester, NY 14627, USA. Phone: +1 (585) 275-5302 Email: firstname <dot> lastname @ rochester.edu News 06/2025 - I was invited to give a keynote talk at the ICME workshop on AI for Music. 03/2025 - I was invited to give a talk at the AAAI workshop on AI for Music. 12/2024 - I gave a talks at CCoM on AI-Powered Interactive Music Making. 10/2024 - I was invited to give a talk on speech synthesis at SANE 2024 and a talk on AI-Powered Interactive Music Making at CSMT 2024 and Boston AI Music Meetup. 09/2024 - I gave a talk at Michigan State University. 07/2024 - I participated in the Dagstuhl Seminar 24302 in Dagstuhl, Germany. 01/2024 - I joined the technical committee of the IEEE Signal Processing Society Acoustic and Audio Signal Processing (AASP). 01/2024 - I'm now the President of the International Society for Music Information Retrieval (ISMIR). My term is two years (2024 and 2025). 12/2023 - I was invited to give a few lectures at the Winter School on Speech and Audio Processing (WiSSAP) in IIT Kanpur. 11/2023 - I co-delivered a tutorial with my student Christos Benetatos and Dr. Philippe Pasquier from Simon Fraser University at ISMIR 2023. 08/2022 - I gave a tutorial at the CAAI International Conference on Artificial Intelligence (CICAI). 04/2022 - I ended my sabbatical leave at Kwai Inc. and returned to UofR! 03/2022 - The web version of BachDuet is online! Improvise duet counterpoint with AI here. 02/2022 - I joined the editorial board of IEEE Open Access Journal for Signal Processing (OJ-SP) for 2022-2024. 12/2021 - I will be a guest editor for the Transactions of International Society for Music Information Retrieval (TISMIR) Special Collection on Cultural Diversity in MIR. 11/2021 - I'm elected as President-Elect of the ISMIR Society for 2022-2023 and will become the President for 2024-2025! 11/2020 - I will serve as a Scientific Program Co-Chair of ISMIR 2021. 07/2020 - I'm promoted to Associate Professor with tenure on July 1, 2020! 05/2020 - I'll be taking a sabbatical leave from UofR from June 2020 to August 2021 to be a Principal Research Scientist at Kwai Inc. 11/2019 - I gave a tutorial on Audiovisual Music Processing with Drs. Slim Essid and Sanjeel Parekh from Telecom ParisTech and my student Bochen Li at ISMIR2019. 09/2019 - AIR lab welcomes 3 new PhD students and 2 visiting PhD students! 08/2019 - Congratulations to our new graduate Dr. Emre Eskimez (co-advised with Prof. Wendi Heinzelman)! 07/2019 - I taught the Music & Math course to high school students at the Upward Bound program for the third time. Very glad to see students' appreciation! 06/2019 - AIR lab welcomes 6 undergraduate students this summer (3 domestic and 3 international)! 06/2019 - I gave a keynote talk at the 2019 Midwest Music and Audio Day (MMAD2019). Yujia and Christos also gave great presentations there! 03/2019 - I received an NSF CAREER Award for an exciting research project on Human-Computer Collaborative Music Making! Thank you, NSF! 02/2019 - I gave a talk at MARL at NYU. Yujia, Christos and myself also had a good time at NEMISIG2019 in Brooklyn College. 02/2019 - I had a great time in the Dagstuhl seminar on Melody and Voice Processing. 01/2019 - Two overview papers (automatic music transcription and audio-visual analysis of musical performances) were published in the IEEE Signal Processing Magazine special issue on Recent Advances in Music Signal Processing. 09/2018 - AIR lab welcomes two new PhD students: Ge Zhu and Christos Benetatos! 08/2018 - Our University of Rochester Multi-Modal Music Performance (URMP) dataset is finally online. Check this out. 06/2018 - Two papers were accepted to ISMIR 2018, one on visual performance generation and the other on music harmonization. Congrats, Bochen and Yujia! 02/2018 - Five papers were accepted to ICASSP 2018. Congrats Yichi, Bochen, Ray, Emre, and Zhihan! 12/2017 - Andrea passed his PhD defense. Congratulations, Dr. Cogliati, my first PhD student!! 10/2017 - Our ISMIR paper won one of the best paper award nominations. Congratulations, Bochen! 08/2017 - I received an NSF BIGDATA grant to develop Audio-Visual Scene Understanding algorithms with Chenliang Xu from CS. Thanks for your generous support, NSF! 07/2017 - I received a University of Rochester AR/VR Pilot Grant to develop a synthetic talking face to assist hearing-impaired along with Ross Maddox from BME and Chenliang Xu from CS. Thanks for your generous support, UR! 07/2017 - I received a University of Rochester AR/VR Pilot Grant to develop spatial audio techniques for live streaming, with Ming-Lun Lee from ECE and Matthew Brown from Eastman. Thanks for your generous support, UR! 07/2017 - Our SMC paper won one of the best paper awards. Congratulations, Bochen! 06/2017 - Two papers were accepted by WASPAA 2017. 06/2017 - Two papers were accepted by ISMIR 2017. 06/2017 - Andrea, Yichi and Zhiyao attended MMAD and gave presentations. 05/2017 - I gave talks at USTC, SUSTC, PKU-Shenzhen, SJTU, and Fudan University in China. 04/2017 - One paper was accepted by SMC 2017. 02/2017 - We hosted NEMISIG 2017 + HAMR at the University of Rochester! 02/2017 - Our lab received a GPU donation from NVIDIA. Thanks for your generous support, NVIDIA! 12/2016 - Three papers were accepted by ICASSP 2017. 12/2016 - I gave a talk on \"Complete Music Transcription\" at the Music Signal Processing session at the 5th joint meeting between the Acoustical Society of America and the Acoustical Society of Japan. 11/2016 - I gave a talk on \"Complete Music Transcription\" at the WNYISPW 2016 workshop. 11/2016 - I gave a talk on \"The Machine Musicianship\" at Beihang University. 11/2016 - I gave a talk on \"AIR Lab Research Overview\" at the Chinese Sound and Music Technology (CSMT) workshop. 09/2016 - I gave a talk on \"Sound Interactions\" at Indiana University Bloomington. 08/2016 - I gave a talk on \"Sound Retrieval through Vocal Imitation\" at the RIASE workshop. 08/2016 - I received an NSF grant to develop Algorithms for Query by Example of Audio Databases with Bryan Pardo from Northwestern University! Thanks for your generous support, NSF! 08/2016 - I received a University of Rochester Goergen Institute for Data Science Collaborative Pilot Award Program in Health Analytics to work on ECG Signal Analysis with Mina Attin from School of Nursing! Thanks for your generous support, UR! AIR Lab Is Recruiting I am looking for strongly motivated PhD students to work with me in the Audio Information Research (AIR) lab on cool computer audition projects. Students are expected to have a solid background in mathematics, programming, and academic writing. Experiences in music activities will be a plus. If you are interested, please apply through the ECE program at the university's admission website, and mention my name in your personal statement. If you apply through the CS program, please remind me through email, as I do not review all CS applications. If you are in the Rochester area, please feel free to stop by my office for a chat. If you are a master's or undergrad student who wants to do a project/thesis with me, you are welcome too. Please send me an email or stop by my office. Brief Bio Zhiyao Duan is a professor in Electrical and Computer Engineering, Computer Science and Data Science at the University of Rochester. He is also a co-founder of Violy, a music tech company for instrument education. He received his B.S. in Automation and M.S. in Control Science and Engineering from Tsinghua University, China, in 2004 and 2008, respectively, and received his Ph.D. in Computer Science from Northwestern University in 2013. His research interest is in computer audition and its connections with computer vision, natural language processing, and augmented and virtual reality. He received a best paper award at the SMC 2017, a best paper nomination at ISMIR 2017, and a CAREER award from the National Science Foundation (NSF). His research is funded by NSF, NIH, NIJ, New York State Center of Excellence in Data Science, Adobe, IngenID, Kwai, Meta, Microsoft, Tiktok, and University of Rochester internal awards on AR/VR, health analytics, and data science. He served as a Scientific Program Co-Chair of ISMIR 2021, an associate editor for IEEE Open Journal of Signal Processing, a guest editor for Transactions of the International Society for Music Information Retrieval, and a guest editor for Frontiers in Signal Processing. He currently serves as a senior area editor for IEEE Signal Processing Letters. He is a member of the IEEE Signal Processing Society Audio and Acoustic Signal Processing (AASP) technical committee. He is the President of the International Society for Music Information Retrieval (ISMIR) in 2024 and 2025. Research Interests My research interests lie primarily in the emerging area of Computer Audition, which is about designing intelligent algorithms and systems that can understand sounds, including music, speech and environmental sounds. This is an interdisciplinary area that draws from many fields including signal processing, machine learning, psychoacoustics, music theory, etc. Specific problems that I have been working on include automatic music transcription, sound source separation, audio-score alignment, music annotation and recommendation, speech enhancement and emotion analysis, sound retrieval, and audio-visual analysis of music performances. Our work is funded by the National Science Foundation under grants No. 1617107, titled \"III: Small: Coll",
  "content_length": 10386,
  "method": "requests",
  "crawl_time": "2025-12-01 14:55:42"
}