{
  "name": "Zhongfei Zhang",
  "homepage": "http://www.cs.binghamton.edu/~zhongfei",
  "status": "success",
  "content": "Zhongfei (Mark) Zhang Zhongfei (Mark) Zhang Q 16, Engineering Building Professor Department of Computer Science Watson School of Engineering and Applied Sciences Binghamton University Binghamton, NY 13902-6000 Phone: (607) 777-2935 Fax: (607) 777-4729 zhongfei@cs.binghamton.edu http://www.cs.binghamton.edu/~zhongfei Zhongfei (Mark) Zhang is a Professor of Computer Science at Binghamton University, State University of New York (SUNY). He directs the Multimedia Research Laboratory at Binghamton. He has a B.S. (cum laude) in Electronics Engineering, an M.S. in Information Science, both from Zhejiang University, Hangzhou, China, and a Ph.D. in Computer Science from the University of Massachusetts at Amherst. When he was in the graduate school, he also worked as an Intern student at NEC Research Institute, Inc. at Princeton, NJ, and as a technical consultant at Applied Artificial Intelligence, Inc. (formerly Amerinex Artificial Intelligence, Inc.) at Amherst, MA. He was a research scientist at the Center of Excellence for Document Analysis and Recognition and was on the faculty of the Department of Computer Science and Engineering, both at the University at Buffalo, SUNY, before he joined the faculty of the Department of Computer Science at Binghamton. He also holds many visiting positions while he was on leave from Binghamton years ago including an NRC Visiting Fellow at the Air Force Research Laboratory in the US, a Microsoft Visiting Researcher Fellow at Microsoft Research, a JSPS Fellow and Chuo University Visiting Professorship at Chuo University and Waseda University both in Japan, a visiting faculty at Carnegie Mellon University in the US, a French CNRS Chair Professorship at the University of Lille 1 in France, and a QiuShi Chair Professorship at Zhejiang University in China. He has published over 200 peer-reviewed academic papers in the leading international journals and conferences as well as several invited papers and book chapters in his areas, has edited or co-edited three books, has published two monographs, has served as editorial board members in several international journals and as different roles in the organization committees for the premier conferences in his areas, and has served as grant review panelists for several governmental and private funding agencies including NSF and NASA. His research is supported by federal and state governments, noticeably including NSF, AFOSR, and AFRL. He is a Fellow of IEEE, IAPR, AAIA, and National Academy of Inventors (NAI). Research Interests Machine Learning, Data Mining and Knowledge Discovery, Artificial Intelligence, Multimedia Information Indexing and Retrieval, Computer Vision and Image Understanding, and Pattern Recognition. My Google Profile Courses taught CS538: Introduction to Multimedia Database Systems CS548: Introduction to Multimedia Systems CS565: Introduction to Artificial Intellligence CS556: Introduction to Computer Vision CS535: Introduction to Data Mining CS435: Introduction to Data Mining CS635: Graduate Seminar on Advanced Topics on Data Mining CS333: Introduction to Algorithms Selected Publications The very first monograph on multimedia data mining is published and is available at Amazon The first monograph on relational data clustering is published and is available at Amazon The last time this page was updated was on 10 July 2022.",
  "content_length": 3366,
  "method": "requests",
  "crawl_time": "2025-12-01 14:55:47"
}