{
  "name": "Zhongxiang Dai",
  "homepage": "https://sds.cuhk.edu.cn/en/teacher/1746",
  "status": "success",
  "content": "DAI, Zhongxiang | School of Data Science SEARCH SDSÂ Portal Search SEARCH CUHK-Shenzhen ç®ä½ä¸­æ About SDS Overview Academic Area Deanâs Message Publications Brochure SchoolÂ Newsletter Annual Report FAQ Contact Us Programmes Introduction Undergraduate Data Science and Big Data Technology Statistics Computer Science and Engineering Financial Engineering 2+2 Double Major Programme Interdisciplinary Data Analytics +Â X Double Major Programme Aerospace Science and Earth InformaticsÂ + X Double Major Programme Columbia University 3+2 Initiative (Columbia Class) Taught Postgraduate M.Sc in Data Science M.Sc in Financial Engineering(Full-time/Part-time) M.Sc in Artificial Intelligence and Robotics M.Sc in Computer Science M.Sc in Statistics M.Sc in Bioinformatics Research Postgraduate M.Phil.-Ph.D. Programme in Data Science M.Phil.-Ph.D. Programme in Computer Science Faculty Faculty Emeritus Faculty Affiliated Appointments Researchers/Visitors Students UG Academic Advisory System Ph.D. Students Student Interviews News & Announcements News Announcements School Events Academic Conferences DDTOR 2025 CSAMSE 2023 RMTA 2023 ICASSP 2022 Mostly OM 2019 Academic Activities SDS Colloquium Series Other Events Research Jobs Faculty Positions Postdoctoral Fellowships Career Graduate Placements International Programmes About SDS Overview Academic Area Deanâs Message Publications Brochure SchoolÂ Newsletter Annual Report FAQ Contact Us Programmes Introduction Undergraduate Data Science and Big Data Technology Statistics Computer Science and Engineering Financial Engineering 2+2 Double Major Programme Interdisciplinary Data Analytics +Â X Double Major Programme Aerospace Science and Earth InformaticsÂ + X Double Major Programme Columbia University 3+2 Initiative (Columbia Class) Taught Postgraduate M.Sc in Data Science M.Sc in Financial Engineering(Full-time/Part-time) M.Sc in Artificial Intelligence and Robotics M.Sc in Computer Science M.Sc in Statistics M.Sc in Bioinformatics Research Postgraduate M.Phil.-Ph.D. Programme in Data Science M.Phil.-Ph.D. Programme in Computer Science Faculty Faculty Emeritus Faculty Affiliated Appointments Researchers/Visitors Students UG Academic Advisory System Ph.D. Students Student Interviews News & Announcements News Announcements School Events Academic Conferences DDTOR 2025 CSAMSE 2023 RMTA 2023 ICASSP 2022 Mostly OM 2019 Academic Activities SDS Colloquium Series Other Events Research Jobs Faculty Positions Postdoctoral Fellowships Career Graduate Placements International Programmes SDSÂ Portal CUHK-Shenzhen ç®ä½ä¸­æ DAI, Zhongxiang Assistant Professor Education Background Ph.D. in Computer Science, National University of Singapore, 2017-2021B.Eng. in Electrical Engineering, National University of Singapore, 2011-2015 Academic Area Artificial Intelligence, Computer Science, Machine Learning and Artificial Intelligence, Operations Research, Optimization Research Field Machine Learning, Large Language Models, Multi-Armed Bandits Personal Website https://daizhongxiang.github.io Email daizhongxiang@cuhk.edu.cn Office Room 319a, Daoyuan Building Biography Dr. Zhongxiang Dai is an Assistant Professor (Presidential Young Fellow) and Ph.D. Supervisor at the School of Data Science, The Chinese University of Hong Kong, Shenzhen (CUHK-Shenzhen). His research is supported by multiple funding sources, serving as the Principal Investigator (PI) for projects including the NSFC Young Scientist Fund, the Guangdong Provincial Natural Science Foundation Excellent Young Scientists Fund, the Shenzhen Natural Science Foundation General Program, as well as the Huawei LLM Agent Cooperation Project and the Huawei Young Scholars Program.Prior to joining CUHK-Shenzhen, Dr. Dai was a Postdoctoral Fellow at the Massachusetts Institute of Technology (MIT) in 2024 and at the National University of Singapore (NUS) from 2021 to 2023. He received his B.Eng. in Electrical Engineering (First Class Honors) in 2015 and his Ph.D. in Computer Science in 2021, both from the National University of Singapore. His doctoral studies were supported by the Singapore-MIT Alliance for Research and Technology (SMART) Graduate Fellowship.Dr. Dai's research interests cover the theory and application of machine learning. On the application side, he focuses on Large Language Models (LLMs), with research directions including LLM-based agents, LLM personalization, LLM online routing, LLM-based social simulation, and prompt optimization for LLMs. On the theoretical side, he conducts in-depth research on multi-armed bandit algorithms. He has published over 36 papers in top-tier AI conferences and journals, with over 28 publications at ICML, NeurIPS, and ICLR. He serves as an Area Chair for NeurIPS and ICLR and regularly reviews for multiple top-tier AI conferences. Academic Publications Selected Publications (# corresponding author, * equal contribution):1. X. Lin, Z. Dai#, A. Verma, S. K. Ng, P. Jaillet and B. K. H. Low, âPrompt optimization with human feedback,â arXiv preprint 2024.2. X. Lin*, Z. Wu*, Z. Dai#, W. Hu, Y. Shu, S. K. Ng, P. Jaillet and B. K. H. Low, âUse Your INSTINCT: INSTruction optimization for LLMs usIng Neural bandits Coupled with Transformers,â in ICML 2024.3. Z. Dai*, G. K. R. Lau*, A. Verma, Y. Shu, B. K. H. Low and P. Jaillet, âQuantum Bayesian optimization,â In NeurIPS 2023.4. Z. Dai, Q. P. Nguyen, S. S. Tay, D. Urano, R. Leong, B. K. H. Low and P. Jaillet, âBatch Bayesian optimization for replicable experimental design,â In NeurIPS 2023.5. A. Hemachandra, Z. Dai#, J. Singh, S. K. Ng and B. K. H. Low, âTraining-free neural active learning with initialization-robustness guarantees,â in ICML 2023.6. Z. Dai, Y. Shu, A. Verma, F. X. Fan, B. K. H. Low and P. Jaillet, âFederated neural bandits,â In ICLR 2023.7. Y. Shu*, Z. Dai*, W. Sng, A. Verma, P. Jaillet and B. K. H. Low, âZeroth-order optimization with trajectory-informed derivative estimation,â In ICLR 2023.8. Z. Dai, Y. Shu, B. K. H. Low and P. Jaillet, âSample-then-optimize batch neural Thompson sampling,â In NeurIPS 2022.9. A. Verma*, Z. Dai* and B. K. H. Low, âBayesian optimization under stochastic delayed feedback,â In ICML 2022.10. Z. Dai, B. K. H. Low and P. Jaillet, âDifferentially private federated Bayesian optimization with distributed exploration,â In NeurIPS 2021.11. Z. Dai, B. K. H. Low and P. Jaillet, âFederated Bayesian optimization via Thompson sampling,â In NeurIPS 2020.12. Z. Dai, Y. Chen, B. K. H. Low, P. Jaillet and T.-H. Ho, âR2-B2: Recursive Reasoning-Based Bayesian optimization for no-regret learning in games,â In ICML 2020.13. Z. Dai, H. Yu, B. K. H. Low and P. Jaillet, âBayesian optimization meets Bayesian optimal stopping,â In ICML 2019. A complete list of publications can be found at https://daizhongxiang.github.io Address: 3 - 6 Floor, Dao Yuan Building, 2001 Longxiang Road, Longgang District, ShenzhenE-mail: sds@cuhk.edu.cnWechat Account: cuhksz-sdssds.cuhk.edu.cnCopyright Â© CUHK-Shenzhen School of Data Science",
  "content_length": 7072,
  "method": "requests",
  "crawl_time": "2025-12-01 14:55:45"
}