{
  "name": "Zhongyuan Wang 0001",
  "homepage": "https://cs.whu.edu.cn/info/1019/2495.htm",
  "status": "success",
  "content": "ï»¿ çä¸­å -æ­¦æ±å¤§å­¦è®¡ç®æºå­¦é¢ EN æ§ç æ­¦å¤§ä¸»é¡µ é¦é¡µ å­¦é¢æ¦åµ å­¦é¢ç®ä» åå²æ²¿é© ç°ä»»é¢å¯¼ ç»ç»æºæ èç³»æä»¬ è®¡ç§æ å å¸èµéä¼ é«å±æ¬¡äººæ ä¸ä»»æå¸ å®éªææ¯äººå è£ä¼æå¸ äººæå¹å » æ¬ç§çæè² ç ç©¶çæè² çå­¦çæè² å½é äº¤æµ ç§å­¦ç ç©¶ ç§ç è¿å± å­¦æ¯äº¤æµ é¡¹ç®ç³æ¥ ç ç©¶å¹³å° å ç¾¤å·¥ä½ å å»ºå·¥ä½ çºªæ£å·¥ä½ å·¥ä¼å·¥ä½ å ±éå¢å·¥ä½ å­¦ä¹ èµæ äººææè å¸èµå²ä½æè åå£«åæè éç¼äººåæè æ ¡åé£é æ°åºæ ¡å æ ¡åå¨æ æ ¡ååº ä¿¡æ¯å ¬å¼ è§ç« å¶åº¦ åäºæµç¨ å¸¸ç¨ä¸è½½ èç³»æ¹å¼ E-mailï¼wzy_hope@163.com åå ¬çµè¯ï¼ åå ¬å°ç¹ï¼604 çä¸­å  æ­¦æ±å¤§å­¦è®¡ç®æºå­¦é¢ è®¡ç®æºç§å­¦ç³» å½å®¶å¤åªä½è½¯ä»¶å·¥ç¨ææ¯ç ç©¶ä¸­å¿ ææ (åå¯¼) å§åï¼çä¸­å  ä¸»é¡µï¼ æ§å«ï¼ç· èç§°ï¼ææ (åå¯¼) å­¦åå­¦ä½ï¼åå£« çµè¯ï¼ åå ¬å°ç¹ï¼604 E-mailï¼wzy_hope â 163.com è¯·æå·¥æ¿æ¢ç¬¦å· é¢åï¼å¤åªä½ææ¯ä¸å¤§æ°æ®åæ,è®¡ç®æºè§è§,ç©ºé´ä¿¡æ¯å¤ç, æçä¿¡æ¯ï¼å¹´åº¦ææ¶ç¡å£«0åï¼ææ¶æ¹åï¼ã ææ¶åå£«0åï¼ææ¶æ¹åï¼ã ç ç©¶æ¹å çä¸­å ï¼æ­¦æ±å¤§å­¦è®¡ç®æºå­¦é¢ãå½å®¶å¤åªä½è½¯ä»¶å·¥ç¨ææ¯ç ç©¶ä¸­å¿ææï¼åå£«çå¯¼å¸ãé¿æä»äºå¤åªä½ä¿¡æ¯å¤çãçæ§è§é¢å¤§æ°æ®åæãèº«ä»½è®¡ç®çç ç©¶ï¼ä¸»æå½å®¶èªç¶ç§å­¦åºéé¢ä¸é¡¹ç®3é¡¹ãéç¹é¡¹ç®1é¡¹ï¼ä¸»ææ¹åçææ¯åæ°éå¤§é¡¹ç®1é¡¹ï¼æ ä»»æ°ä¸ä»£å®½å¸¦æ çº¿ç§»å¨éä¿¡ç½å½å®¶éå¤§ç§æä¸é¡¹é¡¹ç®å¯ç»é¿ãä½ä¸ºææ¯è´è´£äººç å¶çç½ç»æåæºãè§é¢æå¡å¨åå«è·å¾CESå¤§å¥ãå ¨å½åå¤§å®é²æ°éäº§åï¼åå å®æ½äºä¸èå¹³å®åå¸ãæ·±å³çµå­å ¬äº¤çæ§ç­éå¤§å·¥ç¨é¡¹ç®ï¼ç¼å¶3é¡¹å ¬å®é¨æ åï¼éå¯¹æ°å èºçäººåé²æ§ç åçå£ç½©äººè¸è¯å«ææ¯åå°æ¹åæ¥æ¥ãç¯çæ¶æ¥ãä¸­å½ç§ææ°é»ç½ç­åªä½å¹¿æ³å ³æ³¨ãå¨å½é æå¨æååé¡¶çº§å½é ä¼è®®åè¡¨è®ºæ80ä½ç¯ï¼å«5ç¯ESIç­ç¹/é«è¢«å¼è®ºæï¼ï¼ç¬¬ä¸ç³è¯·äººææåæä¸å©30ä½é¡¹ï¼å ¶ä¸­3é¡¹ä¸å©ææ¯è¢«æå½AVSå½å®¶æ åéçº³ï¼æå¯¼ç ç©¶çè·å¾IEEE AIM 2019å½é ç«èµç¬¬äºåãè·å¾æè²é¨ãå ¬å®é¨ãæ¹åçãå¹¿ä¸çç§æå¥å±6é¡¹ã æè²èæ¯ 1991-1995, æ­¦æ±å¤§å­¦æ¬ç§ 1998-2001ï¼æ­¦æ±å¤§å­¦ç¡å£« 2001-2008ï¼æ­¦æ±å¤§å­¦åå£« 2012-2013, ç¾å½Texas A&Må¤§å­¦åå£«åè®¿é®å­¦è å·¥ä½ç»éª 2001-2006ï¼æ­¦æ±å¤§å­¦å©æ 2006-2009ï¼æ­¦æ±å¤§å­¦è®²å¸ 2009-2014ï¼æ­¦æ±å¤§å­¦å¯ææ 2014-ï¼æ­¦æ±å¤§å­¦ææ ææè¯¾ç¨ æ°å­å¾åå¤çãæ·±åº¦å­¦ä¹ ä¸è®¡ç®æºè§è§ãæ°å­è§é¢å¤çã åè¡¨è®ºæ [1] Zhongyuan Wang, Ruimin Hu, Shizheng Wang, Junjun Jiang, Face Hallucination via Weighted Adaptive Sparse Regularization, IEEE Transactions on Circuits and Systems for Video Technology, vol. 24, no. 5, pp. 802â813, 2014. [2] ZhongYuan Wang, Zhen Han, RuiMin Hu, JunJun Jiang, Noise robust face hallucination employing Gaussian-Laplacian mixture model, Neurocomputing, 133:153-160, 2014. [3] Zhongyuan Wang, Ruimin Hu, Zhenfeng Shao, Zhiqiang Hou, Parameter Estimation in Sparse Representation Based Face Hallucination, Digital Signal Processing, 31: 28-34, 2014. [4] Rui Zhong, Ruimin Hu, Zhongyuan Wang, Shizheng Wang, Fast Synopsis for Moving Objects Using Compressed Video, Signal Processing Letters, 21 (7): 834-838, Jul. 2014. [5] J. Jiang, R. Hu, Z. Wang, and Z. Han, Noise Robust Face Hallucination via Locality-constraint Representation, IEEE Transaction on Multimedia, 16(5):1268-1281 , Aug. 2014. [6] Junjun Jiang, Ruimin Hu, Zhongyuan Wang, Zhen Han, Face Super-Resolution via Multi-layer Locality-constrained Iterative Neighbor Embedding and Intermediate Dictionaries Learning, IEEE Trans. on Image Process., 23(10): 4220 - 4231 ,Oct. 2014. [7] Zhiqiang Hou, Ruimin Hu, Zhongyuan Wang, Cloud Model-based Dynamic Texture Synthesis for Video coding, ICPR 2014, pp. 838 -842. [8] Jinhui Hu, Ruimin Hu, Zhongyuan Wang, Structure tensor based in-loop filter for depth video coding, Electronics Letters, 50 (4):274-276, 2014. [9] Lin Jiang, Ruimin Hu, Xiaochen Wang, Maoshen Zhang, Zhongyuan Wang, AVS2 speech and audio coding scheme for high quality at low bitrates, ICME 2014, pp.1-6. [10] Zhongyuan Wang, Jun Chang, Ruimin Hu, Rui Zhong, Generating algorithm for integer DST radixes in video coding, Journal of Visual Communication and Image Representation, 25 (8): 1918â1921, 2014. [11] Shenming Qu, Ruimin Hu, Shihong Chen, Junjun Jiang, Zhongyuan Wang, Jun Chen, Face hallucination via re-identified K-nearest neighbors embeddingï¼ICME 2014, pp.1-6. [12] Rui Zhong, Ruimin Hu,  Zhongyuan Wang, Shizheng Wang, 3D Hybrid Just Noticeable Distortion modeling for Depth Image-Based Rendering, Multimedia Tools and Applications, vol.74, no.23, pp. 10457-10478 , 2015. [13] Shenming Qu, Ruimin Hu, Zhongyuan Wang, Shihong Chen, Face hallucination via Cauchy regularized sparse representation, ICASSPâ2015, pp. 1216-1220. [14] Jin Wang, Chao Liang, Xiaochen Wang, Zhongyuan Wang, Real-life Voice Activity Detection based on Audio-visual Alignment, PCM 2015, vol. 9315, pp.109-117. [15] Zhongyuan Wang, Jing Xiao, Tao Lu, Zhenfeng Shao, Ruimin Hu, Tuning Sparsity for Face Hallucination Representation, PCM 2015, vol. 9314, pp.299-309. [16] Mingshen Ma, Ruimin Hu, Shihong Chen, Jing Xiao, Zhongyuan Wang, Shenming Qu, Global Object Representation of Scene Surveillance Video Based on Model and Feature Parameters, PCM 2015, vol. 9314, pp. 223-232. [17] å®æç,åæ¸ ä¸½,æ¨è¾,åæ´²å³°,çä¸­å .åºäºKinectä¼ æå¨ççº¢å¤åºæ¯å¢å¼º, æ¿å ä¸çº¢å¤, 45(3):325-330, 2015å¹´3æ. [18] çç¾,æ¢è¶ ,çææ¨,çä¸­å ,è¡çæ.åºäºè§è§æ¾èåº¦çè¯´è¯æ£æµ, æ­¦æ±å¤§å­¦å­¦æ¥(çå­¦ç),2015,(04) . [19] Zhongyuan Wang, Zhen Han, Qijun Wang, and Jinhui Hu, Face hallucination via trend-constrained regularization, Journal of Signal Processing Systems, 79 (1): 105-111,Apr. 2015. [20] JingYa Zhu, ZhongYuan Wang, Rui Zhong, ShenMing Qu, Dictionary based surveillance image compression, J. Vis. Commun. Image R., 31: 225â230, Aug. 2015. [21] Zhongyuan Wang, Jinhui Hu, ShiZheng Wang, Tao Lu, Trilateral constrained sparse representation for Kinect depth hole filling, Pattern Recognition Letters, 65(1): 95â102, 2015. [22] Shenming Qu, Ruimin Hu, Shihong Chen, Junjun Jiang, Zhongyuan Wang, Maosheng Zhang, Super-resolution for face image with an improved K-NN search strategy, China Communications, vol. 13, no. 4, pp. 151-161, 2016. [23] Junjun Jiang, Ruimin Hu, Zhongyuan Wang, Zhen Han, Jiayi Ma, Facial Image Hallucination through Coupled-Layer Neighbor Embedding, IEEE Trans. on Circuits and Systems for Video Technology, vol. 26, no.9, pp.1674-1684, Sept. 2016. [24] Zhongyuan Wang, Xiaowei Song, ShiZheng Wang, Jing Xiao, Rui Zhong, Ruimin Hu, Filling Kinect depth holes via position-guided low rank matrix completion, Neurocomputing, vol.215, pp.48â52, Nov. 2016. [25] Zhongyuan Wang, Ruimin Hu, Junjun Jiang, Zhen Han, Zhenfeng Shao, Heteroskedasticity tuned mixed-norm sparse regularization for face hallucination, Multimedia Tools and Applications, vol.75, no. 24, pp.17273â17301, Dec. 2016. [26] Tang H., Liu X., Xiong C., Wang Z., Ez Eldin M., Proof of Nondeterministic Polynomial-Time Complete Problem for Soil Slope-Stability Evaluation, International Journal of Geomechanics, vol. 16, no. 5, Oct. 2016. [27] Junjun Jiang, Zhongyuan Wang, Chen Chen, Tao Lu, L1-L1 norms for face super-resolution with mixed Gaussian-impulse noise, ICASSP 2016, pp. 2089-2093. [28] Kefan Shen, Zhongyuan Wang, Zhen Han, Fast video enhancement transcoding, ICIPâ2016, Phoenix, Arizona, USA, Sept. 25-28, 2016, pp. 2177-2181. [29] Liguo Zhou, Zhongyuan Wang, Youming Fu, Jun Chen, Rui Xiang, Rui Zhong, Shizheng Wang, Depth image in-loop filter via graph cut, ICIPâ2016, pp. 4027-4031. [30] Jiayi Ma, Chang Li, Yong Ma, Zhongyuan Wang, Hyperspectral image denoising based on low-rank representation and superpixel segmentation, ICIPâ2016, pp.3086 -3090. [31] Liuyi Hu, Zhongyuan Wang, Mang Ye, Jing Xiao, Ruimin Hu, Spatiotemporal saliency based on location prior model, International Joint Conference on Neural Networks( IJCNN), 2016, pp.2526 -2533. (Oral) [32] Liang Chen, Ruimin Hu, Zhen Han, Zhongyuan Wang, Qing Li, Zheng Lu. Face Super Resolution for VLQ facial images via parent patch matching. International Joint Conference on Neural Networks (IJCNN), 2016, pp. 2515-2521. (Oral) [33] Qi wang,Zhongyuan Wang,Jing Xiao, Jun Xiao, Wenbin Li, Fine-grained Vehicle Recognition in Traffic Surveillance, PCM 2016, pp. 285-295. (Oral) [34] Mengling Shao, Ruimin Hu, Xu Wang, Zhongyuan Wang, Jing Xiao, Ge Gao, Salient Object Detection in Video Based on Dynamic Attention Center, PCM 2016, pp.458-468. [35] Mingfu Xiong, Jun Chen, Zheng Wang, Zhongyuan Wang, Ruimin Hu, Chao Liang, Daming Shi, Person re-identification via multiple coarse-to-fine deep metrics, European Conference on Artificial Intelligence (ECAI), 2016, pp. 355-362. [36] Junjun Jiang, Jiayi Ma, Chen Chen, Zhongyuan Wang, Tao Lu, Smooth sparse representation for noise robust face super-resolution, VCIP 2016, pp.1-4. [37] Chang Li,Yong Ma,Yuan Gao, Zhongyuan Wang, Jiayi Ma, Sparse unmixing of hyperspectral data based on robust linear mixing model, VCIP 2016, pp.1-4. [38] Jinhui Hu, Zhongyuan Wang, Ruolin Ruan, Kinect Depth Holes Filling by Similarity and Position Constrained Sparse Representation, ICISP 2016: 378-387. [39] Jing Xiao, Ruimin Hu, Liang Liao, Zhongyuan Wang, Zxixiang Xiong, Knowledge-based Coding of Objects for Multisource Surveillance Video Data, IEEE Transactions on Multimedia, 18(9): 1691-1706, 2016. [40] Jing Xiao, Zhongyuan Wang, Yu Chen, Liang Liao, Jun Xiao, Gen Zhan, Ruimin Hu, A Sensitive object-oriented Approach to Big Surveillance Data Compression for Social Security Applications in Smart Cities, Software Experience and Practice, vol. 47, no. 8, pp.1061-1080, 2017. [4",
  "content_length": 38204,
  "method": "requests",
  "crawl_time": "2025-12-01 14:55:45"
}