{
  "name": "Zhouhui Lian",
  "homepage": "http://www.icst.pku.edu.cn/zlian",
  "status": "success",
  "content": "Zhouhui Lian's Homepage Zhouhui Lian(è¿å®è¾) Associate Professor, Ph.D. Wangxuan Institute of Computer Technology (WICT) Peking University No. 128 Zhongguancun North Street, Haidian District Beijing, China Phone: 86-10-62768782 Email: lianzhouhui@pku.edu.cn Our research group: IGCL ï¼ä¸­æçï¼ News Bio Research Achievements Publications Courses Others News: Â Â Â Â [2025-11-24]Â Our paper \"IndoorUAV: Benchmarking Vision-Language UAV Navigation in Continuous Indoor Environments\" has been accepted by AAAI 2026 (source code and data are available) Â Â Â Â [2025-11-24]Â Our paper \"UTDesign: A Unified Framework for Stylized Text Editing and Generation in Graphic Design Images\" has been accepted by SIGGRAPH Asia 2025 (source code and data will be available) Â Â Â Â [2025-11-24]Â Our paper \"MMMG: A Massive, Multidisciplinary, Multi-Tier Generation Benchmark for Text-to-Image Reasoning\" has been accepted by NeurIPS 2025 (source code and data are available) Â Â Â Â [2025-06-28]Â Our paper \"CalliReader: Contextualizing Chinese Calligraphy via an Embedding-Aligned Vision-Language Model\" has been accepted by ICCV 2025 (source code and data are available) Â Â Â Â [2025-03-06]Â I will serve as a Technical Papers Committee Member for SIGGRAPH Asia 2025. Â Â Â Â [2025-03-02]Â Our papers \"Creating Your Editable 3D Photorealistic Avatar with Tetrahedron-constrained Gaussian Splatting\" (highlight), \"TexGaussian: Generating High-quality PBR Material via Octree-based 3D Gaussian Splatting\" and \"ART: Anonymous Region Transformer for Variable Multi-Layer Transparent Image Generation\" have been accepted by CVPR 2025 (source code and data will be available) Â Â Â Â [2025-02-18]Â I will serve as an Area Chair for NeurIPS 2025. Â Â Â Â [2024-12-15]Â I will serve as an Area Chair for ICML 2025. Â Â Â Â [2024-12-05]Â I will serve as an Area Chair for ICCV 2025. Â Â Â Â [2024-09-23]Â Our papers \"HFH-Font: Few-shot Chinese Font Synthesis with Higher Quality, Faster Speed, and Higher Resolution\" and \"Pano2Room: Novel View Synthesis from a Single Indoor Panorama\" have been accepted by SIGGRAPH Asia 2024 Â Â Â Â [2024-09-23]Â Our paper \"UDiffText: A Unified Framework for High-quality Text Synthesis in Arbitrary Images via Character-aware Diffusion Models\" has been accepted by ECCV 2024 Representative Works: Canonical Forms for Non-rigid 3D Shape Retrieval (IJCV 2013, 3DOR 2017) 3D Shape Measures (rectilinearity, convexity) (IJCV 2010, CVPR 2012) 3D Shape Retrieval Contest (SHREC) (IJCV 2016, PR 2013(ESI Highly Cited Paper) , 3DOR 2015, 14, 11, 10) Aesthetic Assessment and Font Recognition for Chinese Characters (CVPR 2017, IJCAI 2015) Generation of Chinese Fonts (www.flexifont.com, SIGGRAPH (TOG) 19, 20, SIGGRAPH ASIA (TOG) 19) Texture Transfer and Text Effects Transfer (CVPR 18, 19, 20) Bio: I was graduated from School of Automation Science and Electrical Engineering, Beihang University in Sep. 2011 with Ph.D. From Jan. 2008 to Jan. 2009, supported by the China Scholarship Council (CSC), I visited School of Computer Science, Cardiff University, UK as a visiting scholar. Then, I worked as a Guest Researcher at the Information Technology Lab (ITL), National Institute of Standards and Technology (NIST), U.S. from Jul. 2009 to Jul. 2011. After that, I came back to China and worked as a postdoctoral researcher at ICST, Peking University, where I became an Assistant Professor in Jun. 2013 and was promoted to Associate Professor in Aug. 2015. Education: 09/2005~06/2011  Ph.D., School of Automation Science and Electrical Engineering, Beihang University, Beijing, China. 09/2001~07/2005  B.Eng., College of Automation Engineering, Nanjing University of Aeronautics and Astronautics, Nanjing, China. Working Experience: 08/2015~now, Associate Professor, Institute of Computer Science and Technology, Peking University, Beijing, China 06/2013~08/2015, Assistant Professor, Institute of Computer Science and Technology, Peking University, Beijing, China 07/2011~06/2013, Postdoctoral Researcher, Institute of Computer Science and Technology, Peking University, Beijing, China 07/2009~07/2011, Guest Researcher, Information Technology Laboratory, National Institute of Standards and Technology, USA 01/2008~01/2009, Academic Visitor, School of Computer Science, Cardiff University, UK Research: Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Back to top My research interests include Computer Graphics, Computer Vision, and Artificial Intelligence. More specifically, we have been working on the following topics in the last few years: (1) Font Synthesis; (2) Text Image Analysis and Synthesis; (3) 3D Content Generation. Students: PhD Students: Guo Pu Yuxuan Luo Master Students: Bojun Xiong Hua Li Xu Liu Yiming Zhao Hanxi Liu Hao Yuan Alumni Yitian Liu(PhD 2024) Shilong Li (Master 2024) Zeqing Xia (PhD 2023) Jialei Cui (Master 2023) Shiyao Xu(Master 2023) Zenggui Chen (Master 2023) Yuqing Wang (Master 2023) Yizhi Wang (PhD 2022) Jie Chen (Master 2021) Yue Gao (Master 2021) Shuseng Tang (Master 2021) Tao Sheng (Master 2021) Xiang Zhang (Master 2021) Yifang Men (Master 2020) Xiao Sun (Master 2020) Yichen Gao (Master 2020) Wenguan Wang (Master 2020) Juncheng Liu (PhD 2019) Yuan Guo (Master 2019) Yue Jiang (Master 2019) Xudong Chen (Master 2017) Chendong Liu (Master 2017) Weikang Song (Master 2016) Rongju Sun (Master 2016) Wanqiong Pan (Master 2015) Hao Sun (Master 2015) Jun Zhang (Master 2015) Wenyan Dong (Master 2015) Tianyang Yi (Master 2014) Chenxi Wang (Master 2013) Yang Liu (Master 2012) Hongmei Li (Master 2012) Reading List: Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Achievements: Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Back to top I have published more than 100 academic papers in prestigious journals and conferences (e.g., ToG, TPAMI, IJCV, SIGGRAPH/SIGGRAPH Asia, CVPR, NeurIPS, ICCV, etc). I was the principal investigator of several projects funded by the National Natural Science Foundation of China, Beijing Nova Program of Science and Technology, etc., and have led our group to successfully develop practical systems for the generation of Chinese fonts. These systems and techniques related to computer fonts have been adopted by a company called Founder Handwriting since 2016 to create font products that have served millions of users, making significant social and economic benefits. Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Publications (selected):Â Â Â Â Â Â Â Back to top Y. Luo, J. Tang, C. Huang, F. Ma, Z. Lian*, CalliReader: Contextualizing Chinese Calligraphy via an Embedding-Aligned Vision Language Model, ICCV 2025 H. Liu, Y. Men, Z. Lian*, Creating Your Editable 3D Photorealistic Avatar with Tetrahedron-constrained Gaussian Splatting, CVPR 2025 (Highlight, Acceptance rate 2.9%) B. Xiong, J. Liu, J. Hu, C. Wu, J. Wu, X. Liu, C. Zhao, E. Ding, Z. Lian*, TexGaussian: Generating High-quality PBR Material via Octree-based 3D Gaussian Splatting, CVPR 2025 Y. Pu, Y. Zhao, Z. Tang, R. Yin, H. Ye, Y. Yuan, D. Chen, J. Bao, S. Zhang, Y. Wang, L. Liang, L. Wang, J. Li, X. Li, Z. Lian, G. Huang, B. Guo, ART: Anonymous Region Transformer for Variable Multi-Layer Transparent Image Generation, CVPR 2025 H. Li, Z. Lian*, HFH-Font: Few-shot Chinese Font Synthesis with Higher Quality, Faster Speed, and Higher Resolution, ACM Transactions on Graphics (TOG) (presented at SIGGRAPH Asia 2024) G. Pu, Y. Zhao, Z. Lian*, Pano2Room: Novel View Synthesis from a Single Indoor Panorama. SIGGRAPH Asia 2024 Y. Zhao, Z. Lian*, UDiffText: A Unified Framework for High-quality Text Synthesis in Arbitrary Images via Character-aware Diffusion Models, ECCV 2024 (code) Y. Liu, Z. Lian*. QT-Font: High-efficiency Font Synthesis via Quadtree-based Diffusion Models, SIGGRAPH 2024 (Code) Y. Men, B. Lei, Y. Yao, M. Cui, Z. Lian, X. Xie. En3D: An Enhanced Generative Model for Sculpting 3D Humans from 2D Synthetic Data, CVPR 2024 (Code) Y. Men, H. Liu, Y. Yao, M. Cui, X. Xie, Z. Lian*, 3DToonify: Creating Your High-Fidelity 3D Stylized Avatar Easily from 2D Portrait Images, CVPR 2024 J. Cui, J. Du, W. Liu, Z. Lian*, TextNeRF: A Novel Scene-Text Image Synthesis Method based on Neural Radiance Fields, CVPR 2024 (Code) Y. Liu, Z. Lian*. DeepCalliFont: Few-shot Chinese Calligraphy Font Synthesis by Integrating Dual-modality Generative Models. AAAI 2024 (Code) Y. Luo, Z. Wu, Z. Lian*, CalliRewrite: Recovering Handwriting Behaviors from Calligraphy Images without Supervision, ICRA 2024  (Code) (Selected as a Finalist of IEEE ICRA Best Paper Award in Service Robotics ) G. Pu, Y. Men, Y. Mao, Y. Jiang, W. Ma, Z. Lian*. Controllable Image Synthesis with Attribute-Decomposed GAN. IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI). 2023 (Code) G. Pu, P.-S. Wang, Z. Lian*. SinMPI: Novel View Synthesis from a Single Image with Expanded Multiplane Images. SIGGRAPH Asia 2023 Y. Wang, Y. Wang, L. Yu, Y. Zhu, Z. Lian*. DeepVecFont-v2: Exploiting Transformers to Synthesize Vector Fonts with Higher Quality. CVPR 2023 Z. Xia, B. Xiong, Z. Lian*. VecFontSDF: Learning to Reconstruct and Synthesize High-quality Vector Fonts via Signed Distance Functions. CVPR 2023 âC. Xiao, W. Su, J. Liao, Z. Lian, Y. Song, H. Fu. How Differently Do People Sketch 3D Objects? ACM Transactions on Graphics (TOG) (presented at SIGGRAPH Asia 2022) Y. Men, Y. Yao, M. Cui, Z. Lian*, X. Xie. DCT-Net: Domain-calibrated Translation for Portrait Stylization. ACM Transactions on Graphics (TOG). (Accepted)(to be presented at SIGGRAPH 2022)  (Code) Z. Chen, Z. Lian*. Semi-supervised Semantic Segmentation via Prototypical Contrastive Learning. ACM MM 2022 Y. Wang, G. Pu, W. Luo, Y. Wang, P. Xiong, H. Kang, Z. Lian*. Aesthetic Text Logo Synthesis via Content-aware Layout Inferring. CVPR 2022 (Code) Y. Men, Y. Yao, M. Cui, Z. Lian, X. Xie, X. Hua. Unpaired Cartoon Image Synthesis via Gated Cycle Mapping. CVPR 2022 Z. Lian*, Y. Gao. CVFont: Synthesizing Chinese Vector Fonts via Deep Layout Inferring,  Computer Graphics Forum (CGF), 2022 Y. Wang, Z. Lian*. DeepVecFont: Synthesiz",
  "content_length": 14740,
  "method": "requests",
  "crawl_time": "2025-12-01 14:55:46"
}