{
  "name": "Zhouhan Lin",
  "homepage": "https://jhc.sjtu.edu.cn/people/members/faculty/zhouhan-lin.html",
  "status": "success",
  "content": "Zhouhan Lin - Faculty - ä¸æµ·äº¤éå¤§å­¦çº¦ç¿°Â·éæ®å ç½å¤«ç¹è®¡ç®æºç§å­¦ä¸­å¿ï¼John Hopcroft Centerï¼ Home 021-54740299 No. 800 Dong Chuan Road, Minhang District, Shanghai 200240 P.R. China Home People Members Research Staff Graduate Students Administrative Staff Past Leadership Transferred Faculty Research Research Areas Artificial Intelligence Networks Theoretical Computer Science Computer Architecture and Systems Quantum Information and Computing Publications Graduate Program Admission Application FAQs Scholarships Students Ph.D Students M.S. Students Alumni Courses News & Events News Seminar Workshop JHC Newsletters About Director's Message Overview Leadership Open Positions / Job Opportunity Faculty Opening Administrative Staff Opening Postdoctoral Opening Contact Us Wiki Documentation Blog Search... Search Home People Members Faculty Associate Professor hantek AT sjtu DOT edu DOT cn https://hantek.github.io/ Zhouhan Lin About Associate Professor (tenure-track) John Hopcroft Center for Computer Science Shanghai Jiao Tong University Research Interests Machine Learning, Natural Language Processing Selected Publications ·Lin, Zhouhan, Minwei Feng, Cicero Nogueira dos Santos, Mo Yu, Bing Xiang, Bowen Zhou, and Yoshua Bengio. \"A structured self-attentive sentence embedding.\" arXiv preprint arXiv:1703.03130 (2017). ·Lin, Zhouhan, Matthieu Courbariaux, Roland Memisevic, and Yoshua Bengio. \"Neural networks with few multiplications.\" arXiv preprint arXiv:1510.03009 (2015). ·Shen, Yikang, Zhouhan Lin, Athul Paul Jacob, Alessandro Sordoni, Aaron Courville, and Yoshua Bengio. \"Straight to the Tree: Constituency Parsing with Neural Syntactic Distance.\" In Proceedings of the 56th Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers), pp. 1171-1180. 2018. ·Du, Wenyu, Zhouhan Lin, Yikang Shen, Timothy J. O'Donnell, Yoshua Bengio, and Yue Zhang. \"Exploiting Syntactic Structure for Better Language Modeling: A Syntactic Distance Approach.\" arXiv preprint arXiv:2005.05864 (2020). ·Chen, Yushi, Zhouhan Lin, Xing Zhao, Gang Wang, and Yanfeng Gu. \"Deep learning-based classification of hyperspectral data.\" IEEE Journal of Selected topics in applied earth observations and remote sensing 7, no. 6 (2014): 2094-2107. ç½ç«å£°æ|åæ é¾æ¥|èç³»æä»¬ Â© John Hopcroft Center for Computer Science, Shanghai Jiao Tong University åäº«å° å°åï¼ä¸æµ·å¸ä¸å·è·¯800å·ä¸æµ·äº¤éå¤§å­¦è½¯ä»¶å¤§æ¥¼ä¸å®¶æ¥¼ é®ç®±ï¼jhc@sjtu.edu.cn çµè¯ï¼021-54740299 é®ç¼ï¼200240",
  "content_length": 2542,
  "method": "requests",
  "crawl_time": "2025-12-01 14:55:46"
}