{
  "name": "Zhou Li 0001",
  "homepage": "https://faculty.sites.uci.edu/zhouli",
  "status": "success",
  "content": "Zhou Li – UCI EECS Log InSearch Skip to content Zhou (Joe) Li, (李洲)Associate ProfessorUniversity of California, IrvineThe Henry Samueli School of EngineeringElectrical Engineering & Computer ScienceIrvine, CA 92697-2625, USAOffice: 3227 Engineering HallEmail: zhou.li@uci.eduMy CV. Announcement #1: We (Prof. Z. Berkay Celik, Prof. Wajih Ul Hassan and myself) are launching a new workshop PRISM (Workshop of Attack Provenance, Reasoning, and Investigation for Security in the Monitored Environment) at NDSS’26. Call for submissions can be found here. Please submit your papers or tutorials! Announcement #2: I’m serving the IEEE S&P’26 donation chair. Please contact me if your organization is interested in sponsoring this event! About openings: I am constantly looking for self-motivated PhD students and PostDoc researchers who have strong interests in system security and privacy. Visitors are also welcome. If you are interested, send me an email and please specify how your prior experiences relate to my research areas. Due to the volume of inquiries, my apology if you don’t receive my reply. News – November 2025: Received Amazon Research Awards for the second time. Many thanks to Amazon!– October 2025: One paper accepted by NDSS’26. Congratulations to Danyu!– October 2025: Workshop proposal accepted by NDSS’26. Please see Announcement #1.– September 2025: Received API credits from OpenAI Researcher Access Program. Many thanks to OpenAI!– September 2025: Serving IEEE S&P’26 donation chair. Please see Announcement #2. Professional Bio I am an associate professor in the department of Electrical Engineering & Computer Science of University of California, Irvine. My research focus is security and privacy. I’m also affiliated with UCI Center for Embedded and Cyber-phyiscal Systems (CECS), UCI Cybersecurity Policy & Research Institute (CPRI), UCI NetSys, UCI Future Health and the ProperAI institute. I was a principal research scientist at RSA Laboratories working on security analytics before joining UCI. I’m an IEEE senior member and ACM senior member. I received IEEE Big Data Security Junior Research Award, NSF CAREER Award, Microsoft Security AI RFP award,  Amazon Research Awards and IRTF ANRP award. Project Websites [Completed] Maestro – Robust AI (NSF EAGER-SaTC) DNS debug (NSF CAREER) Differentially Private Internet Measurement (NSF IMR) Secure Multiparty Computations for Graph-based Intrusion Detection (NSF PDaSP) Recent Research Areas & Interests Internet security DNS Protocol security [Security’18][CoNext’19][FOCI’20][NDSS’23][Security’23a] DNS Measurement [IMC’19][NDSS’21][SRDS’21] Malicious domain detection [DSN’15][CCS’17] Domain fraud [Security’14][Security’16][EuroS&P’19][SecureComm’18a][DSN’18][SecureComm’19] Organizational network security Graph Neural Network (GNN) based anomaly detection  [Security’23b] Efficient attack provenance  [Security’21] Detection with web proxy logs [DSN’15][SecDev’16][ACSAC’16][ACSAC’18a] Detection with end-host logs [RAID’17] Privacy Enhancement Technologies (PETs) Application of differential privacy (DP) [EuroSP’22] Data stream DP [CCS’21a] Security and privacy for machine learning Model extraction attacks with side-channel [DSN’20][TIFS’21][ACSAC’22] Data extraction [ACSAC’21a] Adversarial perturbation [IJCAI’20][TDSC’22][DSN’23] Education [EAAI’23] Experience & Education 2025-, Associate Professor at UCI EECS2018-2025, Assistant Professor at UCI EECS2013-2018, Principal Research Scientist at RSA Laboratories2011, Research Intern at Microsoft Research Silicon Valley, Mentor: Yinglian Xie and Fang Yu2014, Ph.D. in Computer Science, Indiana University Bloomington, Advisor: XiaoFeng Wang2008, M.Sc. in Computer Science, Wuhan University, China2006, B.Sc. in Computer Science, Wuhan University, China Support You can also find me at Google Scholar, DBLP, ResearchGate, SemanticScholar, LinkedIn and Twitter.",
  "content_length": 3902,
  "method": "requests",
  "crawl_time": "2025-12-01 14:55:47"
}