{
  "name": "Zhu Li 0001",
  "homepage": "http://l.web.umkc.edu/lizhu",
  "status": "success",
  "content": "白夜の彷徨い - Zhu Li's Home at CSEE/UMKC　 Zhu Li Professor, Dept. Computer Science & Electrical Engineering, FH560E, University of Missouri, Kansas City Director, NSF I/UCRC Center for Big Learning at UMKC Associate Editor-in-Chief, IEEE Trans on Circuits & Sys for Video Tech Email: lizhu@umkc.edu, Phone: 816 235 2346, About Me Research Teaching Publications Teachings Spring 2023: ECE/CS 5582 Computer Vision , previous offerings: 2022 Fall Fall 2022: ECE/CS 5578 Multimedia Communication , previous offerings: Fall, 2022 Fall 2019: ECE/CS 484 Digital Image Processing Fall 2017: Adv. Multimedia Communication Bio Zhu Li (Bio, CV) is a professor with the Dept of Computer Science & Electrical Engnieering (CSEE), University of Missouri,Kansas City, and the director of the NSF Center for Big Learning at UMKC . He was an AFRL summer visiting professor at the US Air Force Academy , Colorado Springs, Summer of 2016-18, 2020, and 2022-24. He received his PhD in Electrical & Computer Engineering from Northwestern University, Evanston in 2004. He was Sr. Staff Researcher/Sr. Manager with with Samsung Research America's Multimedia Standards Research Lab in Richardson, TX, 2012-2015, Sr. Staff Researcher/Media Analytics Group Lead with FutureWei (Huawei) Technology's Media Lab in Bridgewater, NJ, 2010~2012, and an Assistant Professor with the Dept of Computing, The Hong Kong Polytechnic University from 2008 to 2010, and a Principal Staff Research Engineer with the Multimedia Research Lab (MRL), Motorola Labs, from 2000 to 2008. His research interests include image/video, light field and point cloud compression, deep learning based compression schemes, remote sensing and vision, image/video denoising and super-resolution, video hashing and identification, as well as the video communication system issues like joint source-channel coding, rate-distortion optimization and communication resource management. He has 60+ issued or pending patents, 200+ publications in book chapters, journals, conference proceedings and standard contributions in these areas. He is an IEEE senior member, Associate Editor-in-Chief (AEiC) for IEEE Trans on Circuits & System for Video Technology, Associate Editor (2020~) for IEEE Trans on Image Processing , associated editor for IEEE Trans.on Multimedia, 2016-19,for IEEE Trans on Circuits & System for Video Technology, 2015-18, for Journal of Signal Processing Systems (Springer), 2015~present, steering committee memeber of IEEE ICME, elected member (2014-2017) of the IEEE Multimedia Signal Processing (MMSP) Tech Committee, elected Vice Chair (2008-2010), Standards Liaison (2014-2016) of the IEEE Multimedia Communication Technical Committee (MMTC), member of the Best Paper Award Committee, ICME 2010, co-editor for the Springer-Verlag book on \"Intelligent Video Communication: Techniques and Applications\", and \" Multimedia Analysis, Computing and Communication,\". He received a Best Paper Runner-up Award at the Perception Beyond Visual Spectrum (PBVS) challenge at CVPR 2023, the Best Poster Paper Award at IEEE Int'l Conf on Multimedia & Expo (ICME), Toronto, 2006, and the Best Paper (DoCoMo Labs Innovative Paper) Award at IEEE Int'l Conf on Image Processing (ICIP), San Antonio, 2007. Recent papers can be found at here , and PhD/Post-Doc openings here. Teaching Fall 2025: ECE/CS 5582 Computer Vision , previous offerings: 2022 Fall Fall 2025: ECE/CS 5578 Multimedia Communication , previous offerings: 2020 Fall 2019: ECE/CS 484 Digital Image Processing Fall 2017: Adv. Multimedia Communication Invited Talks - Mobile Visual Search: Object Re-Identification Against Large Repositories, invited talk at Academia Sinica, Taipei, 2015.12, hosted by Prof. Wen-Huang Cheng, University of Science & Tech of China (USTC), hosted by Prof. Houqiang Li, and Shanghai Jiaotong University, hosted by Prof. Y.L. Xu, 2016.01. - Subspace Indexing on Grassmannian Manifold for Large Scale Visual Identification, given at EPFL/IBM Research/Northwestern Univ/Stevens Tech/Motorola Solutions Research/MIT Lincoln Lab/Beijing University. Multimedia Computing & Communication Lab Publications: patents, papers & standards contributions People: Raghunath Puttagunta, MS UMKC, PhD Student (Fall 2017~) , Hyper Spectral Imaging. Paras Maharjan, MS/PhD student, Deep learning image enhancement/post processing. 2018~ Matthew Kayrish, PhD Student (Spring, 2019~). Chris Henry, PhD Student (Fall'21 ~), B.S Hardmard Univ, M.S, Gachon Univ. Sajid Umair, PhD Student (Fall'22 ~), Zach Button, PhD Student (Fall'22 ~), Muhamud Talha, PhD Student (Spring'23 ~), Qi Yang, Post-Doc Researcher (Fall'23~) Abdul Malik Badash, PhD studnet (Fall'24~). Sayush Maharjan , MS Student, RA (Fall '24~) Alumni: Birendra Kathariya, MS UMKC, PhD, 2024, Point Cloud Compression, Neural Compression. Joined Dolby Lab as researcher. Rijun Liao, PhD Student (Spring 2020.01~2024.05), B.S & M.S, Shenzhen University, Computer Vision, Biometrics. Joining Guangdong Univ of Medicine as TT faculty. Yangfan Sun, MS UMKC, PhD Student (Spring 2017~Fall 2023), Light field compression and super resolution. Joined a start up on AIGC. Anique Akhatar, PhD, 2022. Joined Qualcomm Video Codec Research team in San Diego. Wei Jia, B.S and M.S, (Beijing Univ of Post & Telecomm)BUPT, PhD Student (Fall, 2018~21), Deep learning in compression, video transport.Now joining KWAI's video research team in San Diego, congrats ! Dewan F. Noor, Bangeladesh Univ of Engineering & Tech, PhD Student (Spring, 2016~2021), Gradient image super resolution, multi-frame super resolution. Now joined Tuskegee University as Asst Prof, congrats ! Li Li, PhD, Univ of Science & Tech of China, Visiting Assistant Professor/Asst. Director of MCC Lab (Fall, 2016~2020), Image/Video/Light Field/Point Cloud Compression. Now Associate Prof. with Univ of Science & Tech of China, congrats ! Zhaobin Zhang, Huazhong Univ of Science & Tech, PhD Student (Fall, 2016~20), Compression for machine. PhD, 2020, joining ByteDance Video Codec team in San Diego, Congrats ! Renlong Hang,Post-Doc Researcher (2018~2019), Asst. Prof., Nanjing Univ of Info Science & Tech (NUISCT). Yixin Mei , visiting PhD student on CSC scholarship, Xian Jiaotong Univ (XJTU), 2019~2020, Compression for Machine Vision. Han Zhang , visiting PhD student on CSC scholarship, Shanghai Jiaotong Univ (SJTU), 2018~2019. Yang Zhou, visiting faculty from Hanghzou Dianzi University, 2018.08-2019.08. Wenjie Zhu , visiting PhD student on CSC scholarship, Shanghai Jiaotong Univ (SJTU), 2017~2018. Yue Li , visiting PhD student on CSC scholarship, Univ of Science & Tech of China (USTC), 2017.09-2018.09. Karthik Ainala, MS Thesis ( Low Latency Point Cloud Compression and Communication ) Student (graduated, 2018) Eric Cornwell , MS Thesis (Dense Camera Capture Light Field Compression ) Student (graduated 2017, now with Honeywell KCP) Prasana Gadiparthi, MS Thesis (Content De-Duplication with Spatio-Temporal Compact Hash) Student (graduated 2017, now with American Express) Shaina Krumme, RA/visiting student, Univ of Kansas (Summer 2017, 18). Gerry Xie, undergrad research student, Dept of ECE, Univ of California, San Diego. Shelby Mohar, undergrad research student, Dept of CSEE, UMKC, working on the NEH project of hyperspectral imaging of ancient scriptures, 2021.01-2021.05. Caleb van Tassel research assitant, NSF-AFRL project on remote sensing and joint pixel-frequency domain attention network in areial image classification. 2021.08-2022.05. Haley Griffin research assistant, NSF AFRL project on remote sensing, 2022.03~2022.08 Siqi Wu, undergrad research student, Dept of Statistics, Univ of Kansas. now PhD student at Missouri, Columbia. Research Projects: Depth sensing and Point Cloud Capture and Comperssion for auto-driving and 3D mapping (PCC) Future Video Codec with deep learning for compression (FVC) Deep Learning Model Compression and Acceleration (DLMCA) Low Resolution and Quality Image Enhancement and Recognition (LRQIER) Multimedia Transport System research, Low latency visual communication, immersive visual communication system (MMSys) Sponsors: Many thanks to the generous support from: Full publication list 2025 K. Yang, Q. Yang,Y.-L. Xu,and Z. Li, \"Textured Mesh Quality Assessment Using Geometry and Color Field Similarity\", IEEE Trans on Visualization & Computer Graphics, (T-VCG), 2025. Y. Liu, Q. Yang, Y. Zhang, Y. Xu, L. Yang and Z. Li, \"From Images to Point Clouds: An Efficient Solution for Cross-media Blind Quality Assessment without Annotated Training,\" in IEEE Trans on Circuits & Sys for Video Tech(T-CSVT), doi: 10.1109/TCSVT.2025.3633154, 2025. E. Lee, L. Pan, Z. Li and S. S. Bhattacharyya, \"Efficient Hyperspectral Image Classification using Discrete Cosine Transform on Limited-Resource Systems\" IEEE Journal of Selected Topics in Applied Earth Observations and Remote Sensing(JSTARS), 2025. D. Xue, S.Wu, L. Li , D.Liu, and Z. Li, “Multi-Source Domain Generalization for Learned Lossless Volumetric Biomedical Image Compression”, to appear, IEEE Trans on Image Processing, (T-IP: IF 10.6), 2025. W.Wu, X. Hao, X. Luo, and Z. Li, \"Attention++ Network for Lightweight Image Super-Resolution\", IEEE Signal Processing Letters (SPL), 2025. L. Hou, T. Fan, Y. Xu and Z. Li, \"Lossless LiDAR Point Cloud Reflectance Compression with a Deep Hierarchical KNN Context Model,\" in IEEE Transactions on Multimedia, (T-MM), 2025. Y. Jiang, H. ZHang, L. Li, D. Liu and Z. Li, \"Sparse Point Clouds Assisted Learned Image Compression\", to appear, IEEE Trans. on Circuits & System for Video Tech (T-CSVT), 2025. W.Wu, X. Hu, X. Luo, Z. Li, \"FishermaskFormer: Lightweight Remote Sensing Scene Classification with Masked Transformer\", IEEE Jnl of Selected Topics in Applied Earth Observ. and Remote Sensing(J-STAR), 2025. W. Wu, W. Zhai, Y. Liu, X. Hu, T. Yang, and Z. Li: \"Three-domain joint deraining network for video rain streak removal\", Signal Process. Image Comm., vol.139:117400, 2025. D. Hu, Y.Zhou, X.H",
  "content_length": 49097,
  "method": "requests",
  "crawl_time": "2025-12-01 14:55:48"
}