{
  "name": "Zhu Han 0001",
  "homepage": "http://www2.egr.uh.edu/~zhan2",
  "status": "success",
  "content": "Zhu Han's Home Page Zhu Han's Home Page Grand Slam Marathon Club member (7 marathons in 7 continents plus North Pole Marathon). Many thanks for Richard Donovan and his team to make the dreams come true. Zhu Han (Chinese character 韩竹) received the B.S. degree in electronic engineering from Tsinghua University, in 1997, and the M.S. and Ph.D. degrees in electrical and computer engineering from the University of Maryland, College Park, in 1999 and 2003, respectively. From 2000 to 2002, he was an R&D Engineer of JDSU, Germantown, Maryland. From 2003 to 2006, he was a Research Associate at the University of Maryland. From 2006 to 2008, he was an assistant professor at Boise State University, Idaho. Currently, he is a John and Rebecca Moores Professor in the Electrical and Computer Engineering Department as well as in the Computer Science Department at the University of Houston, Texas. Please visit our Wireless Networking, Signal Processing and Security Lab, where you can find slides and codes for our newest research and books. Contact Information Office Address W302, Engineering Building 2, University of Houston, Houston, TX 77004. Mailing Address N308, Engineering Building 1, University of Houston, Houston, TX 77004. Contact Details Phone: +1 713-743-4437 Fax: +1 713-743-4444 E-mail: zhan2@uh.edu or hanzhu22@gmail.com Research Highlight IEEE Fellow since 2014 for contributions to resource allocation and security in wireless communications AAAS Fellow in class of 2020 for distinguished contributions to the field of game theory, particularly for modeling, analysis and algorithm design of new applications in communication networks 2021 IEEE Kiyo Tomiyasu Award (IEEE Field Awad), for outstanding early to mid-career contributions to technologies holding the promise of innovative applications, with the following citation: \"For contributions to game theory and distributed management of autonomous communication networks.\" ACM Fellow in class of 2024 for contributions to distributed and autonomous management for large scale communication networks Web of Science top 1% most cited, Highly Cited Researcher since 2017 H-Factor and citation from google scholar My c.v. in pdf Industrial Demo Generative AI enabled Semantic Communication Demo Space-Air-Gound Integration Network Demo Reconfigurable Holographic/Intelligent Surface Demo ISAC for 6G: Waveform Design, Resource Allocation, Application and Prototype Demo HQC-Bend: A Python Package of HybridQuantum-Classical Benders’ Decomposition LotusFA: a Federated Analytics System for Federated Learning of Watermarked Data Hardware Prototype of a Mirror Array-Based Optical Intelligent Reflecting Surface A Hardware Prototype for Ultraviolet Communications Across Water-Air-Interface Teaching Highlight Signal Processing and Networking for Big Data Applications Game Theory in Wireless and Communication Networks: Theory, Model, and Applications Beijing University Talk: Game theory (abstract, ppt, video) and Big data (abstract, ppt, video) Taiwan Short Courses Selective Topic in Optimization ECE4371: introduction to telecommunication engineering; ECE4117: telecommunication lab Graduate seminar on big data 2013, big data 2015, deep learning 2017 Graduate seminar on device to device Graduate seminar on smart grid ECE6332: Wireless Communications Current Students and Postdocs Faheem Quazi, Ph.D. student Salma Sultana, Ph.D. Zijun Zhan, Ph.D. Student Dingwen Pan, Ph.D. Student Jiachen Shen, Ph.D. Student Alexander Tang, Ph.D. Student Weimin Yuan, Ph.D. student Xudong He, Ph.D. Student Wenlu Xuan, Ph.D. student, joint with Dr. Lei Fan Keutayeva Aigerim, Ph.D. student, joint with Dr. Yunpeng Zhang Zirui (Starkie) Tong, Ph.D. student, joint with Dr. Jian Shi Dr. Shuhao Zeng, Postdoc Alumni Barsha Shrestha, MS. 2008, \"Wireless Access in Vehicular Environments using Bit Torrent and Bargaining\", first job in Ugobe, LLC. Jia Meng, Ph.D. 2010, \"Compressive Sensing Applications For Wireless Communications\", first job in CGGVeritas, co-advised with Dr. Wotao Yin in Rice University. Zhou Yuan, Ph.D. 2012, \"A Framework Of Belief Propagation And Game Theory For Cognitive Radio Security And Routing\". Tina Mathews, M.S. 2012, \"USRP2 implementation of compressive sensing based channel estimation in OFDM\". Yi Huang, Ph.D. 2013, \"A Quickest Detection Framework for Smart Grid\". Thanh Le, M.S. 2013, \"Sequential Learning for Passive Monitoring of Multi-Channel Wireless Network\" Mohammad Esmalifalak, Ph.D. 2013, \"Attack and Defense Mechanisms for State Estimation in Smart Grid\" Nam Nguyen, Ph.D. 2013, \"A Nonparametric Bayesian Framework For Mobile Device Security And Location Based Services\" Najmeh Forouzandeh Mehr, Ph.D. 2013, \"Game Theoretical Framework for Dynamic Control in Smart Grid\" Guanbo Zheng, Ph.D. 2013, joint with professor Rong Zheng, \"Toward Reliable and Robust Wireless Personal Area Networks\" Lanchao Liu, Ph.D. 2014, \"Big Data Optimization for Modern Communication Networks\" Ali Arab, Ph.D. 2015, \"Asset Management Of Smart Grid Infrastructure For Resiliency Enhancement\", Industrial Engineering, joint with Professor Suresh Khator. Ateeth Kumar Thirukkovulur, M.S. 2015, \"Novel Infrastructure Quantification For Utility Of Virtualized Network Debugging Using Openflow As Visualization Of Packets And Software Defined Networking,\" joint with Professor Deniz Gurkan. Erte Pan, Ph.D. 2016, \"Big Data Analysis of Complex Networks using Machine Learning Methods.\" Yanru Zhang, Ph.D. 2016, \"Contract Theory Framework for Wireless Networking.\" Yunan Gu, Ph.D. 2016, \"Matching Theory Framework for 5G Wireless Communications.\" Hung Nguyen, Ph.D. 2017, \"Big Data Optimization for Distributed Resource Management in Smart Grid.\" Fahira Sangare, Ph.D. 2017, \"RF Energy Harvesting and Information Transfer Implementation in the Internet of Things.\" Radwa Aly, Ph.D. 2017, \"Utilizing Full Duplex Multiple Antenna System in Heterogeneous Networks.\" Huaqing Zhang, Ph.D. 2017, \"A Hierarchical Game Framework for Distributive Resource Allocation in Future HetNet.\" Mounika Sai Errapotu, Ph.D. 2018, \"Secure Computing with Privacy Preservation for Cyber-Physical Systems,\" joint with Dr. Miao Pan Qiuyang Shen, Ph.D. 2019, \"Statistical Bayesian Inversion of Directional Electromagnetic Logging Data\", joint with Dr. Jiefu Chen Neetu Raveendran, Ph.D. 2019, \"Game Theoretic and Machine Learning Technigues for Efficient Resource Allocation in Next Generation Wireless Networks\" Reginald Banez, Ph.D. 2020, \"Mean Field Game Theory for Future Heterogeneous and Hierarchical Communication Networks\" Kevin Tsai, Ph.D. 2020, \"Link Game Theory and Machine Learning in Theories and Applications\" Saeed Ahmadian, Ph.D. 2020, \"Detecting Cyber-attacks to Smart Grids and Increasing Resiliency using Data Driving Algorithms,\" joint with Dr. Heidar Malki Xunsheng Du, Ph.D. 2020, \"Applied Machine Learning with Latent Space Representation and Manipulation\" Mohamed Elmossalamy, Ph.D. 2020, \"Passive Reflection Techniques for Wireless Communications\" Dawei Chen, Ph.D. 2021, \"Machine Learning for Multi-Access Edge Computing and Autonomous Driving\" Jing Li, Ph.D. 2022, \"Contract Theory Framework for Cryptoeconomics\" Wen Xie, Ph.D. 2023, \"Machine Learning and Unstructured Data Analytics for Digital Marketing\" Kai-Chu Tsai, Ph.D. 2024, \"Satellite-Terrestrial Integration under Uncertainty using Machine Learning and Distributionally Robust Optimization,\" joint with Dr. Ricardo, Lent Yuan Zi, Ph.D. 2024, \"Large-scale Carbon Monitoring with Data-Driven Optimization and Machine Learning-enhanced Signal Processing,\" joint with Dr. Jiefu Chen Daniel Doe, Ph.D. 2024, \"Incentive Mechanism Design for Blockchain Networks: Bridging Decentralized Exchanges, Web 3.0, and the Metaverse.\" Yuhan Kang, Ph.D. 2024, \"Synergies of Mean-Field Games in Machine Learning and 6G Communication Networks.\" Mingze Li, Ph.D. 2025, \"Quantum Assisted optimization and Machine Learning for Coordinated Power and Hydrogen System.\" Zhongqi Zhao, Ph.D. 2025, \"Hybird Quantum-Classical Optimization for Data Center Energy System.\" Yingying Li, Postdoc, Wall street. Walid Saad, Postdoc, Full professor in Virginia Tech. Samir Medina Perlaza, Full professor Inria, France Yong Xiao, Full professor, Huazhong University of Science and Technology (HUST), China. Duy Nguyen, Postdoc, now professor in San Diego State University, tenured. Hongliang Zhang, joint with Princeton University, Assistant professor in Peking University, China. Graduation Requirements Satisfying the course work and other department requirement. For MS student, one IEEE/ACM top conference paper. For Ph.D. student, 5 points are needed. Submission of one IEEE/ACM/Eurasip journal is 1 point, and acceptance is another 1 point. Acceptance of magazine/letter/book chapter is 1 point. Also you should be an independent thinker with sufficient presentation, writing, simulation and analysis ability. At least one journal accepted. For all graduate students, after defense, I need a 4 inch photo frame that represents your hometown style. I will put your graduation photo into it and post in my office, since I want to share one of the happiest time with you. Publications Cambridge University Press Books Zhu Han and K. J. Ray Liu, Resource Allocation for Wireless Networks: Basics, Techniques, and Applications, Cambridge University Press, 2008. Ekram Hossain, Dusit Niyato, and Zhu Han, Dynamic Spectrum Access in Cognitive Radio Networks, Cambridge University Press, 2009. Zhu Han, Dusit Niyato, Walid Saad, Tamer Basar, and Are Hjorungnes, Game Theory in Wireless and Communication Networks: Theory, Models and Applications, Cambridge University Press, UK, 2011. Zhu Han, Husheng Li, and Wotao Yin, Compressive Sensing for Wireless Networks, Cambridge University Press, UK, 2013. Lingyang Song, Dusit Niyato, Zhu Han, and Ekram Hossain, Wireless Device-to-Device Communications and Networks, Cambridge University Press, UK, 2015. Zhu Han, Mingyi Hong, and Dan Wang, Signal Processi",
  "content_length": 14058,
  "method": "requests",
  "crawl_time": "2025-12-01 14:55:49"
}