{
  "name": "Zhuangbin Chen",
  "homepage": "https://zbchern.github.io",
  "status": "success",
  "content": "Zhuangbin Chen - Sun Yat-sen University Hi, I am Zhuangbin Chen, currently an Assistant Professor at the School of Software Engineering, Sun Yat-sen University. I work on Distributed Systems, Software Reliability, Cloud Computing, and LLM Systems. More specifically, I am interested in improving the reliability, efficiency, and troubleshooting process of distributed systems. Prior to SYSU, I obtained a Ph.D. at the Computer Science and Engineering Department of The Chinese University of Hong Kong. I was privileged to work with Prof. Michael R. Lyu. Updates 09/2025 One paper accepted to ICSE '26! Congrats to the authors! 09/2025 Two papers accepted to ASE '25! Congrats to the authors! 01/2025 Two papers accepted to FSE '25! Congrats to the authors! 01/2025 Two papers accepted to ICSE '25! Congrats to the authors! 12/2024 One paper accepted to ISSTA '25! Congrats to the authors! 07/2024 Our paper won the 🏆 Best Paper Award at CLOUD '24! Congrats to the authors! 03/2024 One paper accepted to ISSTA '24! Congrats to the authors! 01/2023 One paper accepted to FSE '24! Congrats to the authors! 12/2023 One paper accepted to ICSE '24! Congrats to the authors! 08/2023 Two papers accepted to ASE '23! Congrats to the authors! 07/2023 One paper accepted to ISSRE '23! Congrats to the authors! 01/2023 Three papers accepted to ICSE '23! Congrats to the authors! 01/2023 I will be joining the School of Software Engineering of Sun Yat-sen University. 07/2022 Our project LogPAI: An Open-Source Project for Automated Log Analysis won The First IEEE Open Software Services Award! More... 12/2021 One paper accepted to ICSE '22! Selected Publications (* indicates correspondence) 2026 [ICSE '26] Metronome: Differentiated Delay Scheduling for Serverless Functions Zhuangbin Chen, Juzheng Zheng, Zibin Zheng [to appear] 2025 [ASE '25] ErrorPrism: Reconstructing Error Propagation Paths in Cloud Service Systems Junsong Pu, Yichen Li, Zhuangbin Chen*, Jinyang Liu, et al. [PDF] [ASE '25] Automated Proactive Logging Quality Improvement for Large-Scale Codebases Yichen Li, Jinyang Liu, Zhihan Jiang, Zhuangbin Chen, et al. [PDF] [FSE '25] No More Labelled Examples? An Unsupervised Log Parser with LLMs Junjie Huang, Zhihan Jiang, Zhuangbin Chen*, Michael R. Lyu [PDF] [FSE '25] L4: Diagnosing Large-scale LLM Training Failures via Automated Log Analysis Zhihan Jiang, Junjie Huang, Guangba Yu, Zhuangbin Chen, et al. [PDF] [ISSTA '25] Tracezip: Efficient Distributed Tracing via Trace Compression Zhuangbin Chen, Junsong Pu, Zibin Zheng [PDF] [ICSE '25] COCA: Generative Root Cause Analysis for Distributed Systems with Code Knowledge Yichen Li, Yulun Wu, Jinyang Liu, Zhihan Jiang, Zhuangbin Chen, Guangba Yu, Michael R. Lyu [PDF] [ICSE '25] ADAMAS: Adaptive Domain-Aware Performance Anomaly Detection in Cloud Service Systems Wenwei Gu, Jiazhen Gu, Jinyang Liu, Zhuangbin Chen*, et al. [PDF] 2024 [TOSEM '24] Identifying Performance Issues in Cloud Service Systems Based on Relational-Temporal Features Wenwei Gu, Jinyang Liu, Zhuangbin Chen, et al. [PDF] [ISSTA '24] KPIRoot: Efficient Monitoring Metric-based Root Cause Localization in Large-scale Cloud Systems Wenwei Gu, Xinying Sun, Jinyang Liu, Yintong Huo, Zhuangbin Chen, et al. [PDF] [CLOUD '24] TraceMesh: Scalable and Streaming Sampling for Distributed Traces Zhuangbin Chen, Zhihan Jiang, Yuxin Su, Michael R. Lyu, Zibin Zheng [PDF] [Code] 🏆 Best Paper Award [ISSTA '24] A Large-Scale Evaluation for Log Parsing Techniques: How Far Are We? Zhihan Jiang, Jinyang Liu, Junjie Huang, Yichen Li, Yintong Huo, Jiazhen Gu, Zhuangbin Chen*, et al. [PDF] [FSE '24] LILAC: Log Parsing using LLMs with Adaptive Parsing Cache Zhihan Jiang, Jinyang Liu, Zhuangbin Chen, et al. [PDF] [ICSE '24] FaultProfIT: Hierarchical Fault Profiling of Incident Tickets in Large-scale Cloud Systems Junjie Huang, Jinyang Liu, Zhuangbin Chen, et al. [PDF] 2023 [ASE '23] Prism: Revealing Hidden Functional Clusters of Massive Instances in Cloud Systems Jinyang Liu, Zhihan Jiang, Jiazhen Gu, Junjie Huang, Zhuangbin Chen*, et al. [PDF] [ASE '23] Maat: Performance Metric Anomaly Anticipation for Cloud Services with Conditional Diffusion Cheryl Lee, Tianyi Yang, Zhuangbin Chen*, Yuxin Su, Michael R. Lyu [PDF] [ISSRE '23] Practical Anomaly Detection over Multivariate Monitoring Metrics for Online Services Jinyang Liu, Tianyi Yang, Zhuangbin Chen*, Yuxin Su, Cong Feng, Zengyin Yang, Michael R. Lyu [PDF] [ICSE '23] Incident-Aware Duplicate Ticket Aggregation for Cloud Systems Jinyang Liu, Shilin He, Zhuangbin Chen, et al. [PDF] [ICSE '23] Heterogeneous anomaly detection for software systems via semi-supervised cross-modal attention Cheryl Lee, Tianyi Yang, Zhuangbin Chen, Yuxin Su, Yongqiang Yang, Michael R. Lyu [PDF] [ICSE '23] Eadro: An End-to-End Troubleshooting Framework for Microservices on Multi-Source Data Cheryl Lee, Tianyi Yang, Zhuangbin Chen, Yuxin Su, Michael R. Lyu [PDF] 2022 [SIGOPS OSR '22] An Intelligent Framework for Timely, Accurate, and Comprehensive Cloud Incident Detection Yichen Li, Xu Zhang, Shilin He, Zhuangbin Chen, Yu Kang, et al. [PDF] [ICSE '22] Adaptive Performance Anomaly Detection for Online Service Systems via Pattern Sketching Zhuangbin Chen, Jinyang Liu, Yuxin Su, Hongyu Zhang, et al. [PDF] [Code] [Official News] 2021 [ASE '21] Graph-based Incident Aggregation for Large-Scale Online Service Systems Zhuangbin Chen, Jinyang Liu, Yuxin Su, Hongyu Zhang, et al. [PDF] [Official News] [arXiv '21] Experience Report: Deep Learning-based System Log Analysis for Anomaly Detection Zhuangbin Chen, Jinyang Liu, Wenwei Gu, Yuxin Su, and Michael R. Lyu [PDF] [Code] [TOSEM '21] Memory-Safety Challenge Considered Solved? An In-Depth Study with All Rust CVEs Hui Xu, Zhuangbin Chen, Mingshen Sun, Yangfan Zhou, and Michael R. Lyu [PDF] [CSUR '21] A Survey on Automated Log Analysis for Reliability Engineering Shilin He, Pinjia He, Zhuangbin Chen, Tianyi Yang, Yuxin Su, and Michael R. Lyu [PDF] 2020 [FSE '20] Towards Intelligent Incident Management: Why We Need It and How We Make It Zhuangbin Chen, Yu Kang, Hongyu Zhang, et al. [PDF] [AAAI-W '20] AIOps Innovations of Incident Management for Cloud Services Zhuangbin Chen, Yu Kang, et al. [PDF] 2018 [ASE '18] Characterizing the Natural Language Descriptions in Software Logging Statements Pinjia He, Zhuangbin Chen, Shilin He, and Michael R. Lyu [PDF] [Dataset] [CIKM '18] Neural relational topic models for scientific article analysis Haoli Bai, Zhuangbin Chen, Michael R. Lyu, Irwin King, and Zenglin Xu [PDF] [Code] Teaching Cloud Computing Technology (SSE316云计算技术) Undergraduates, School of Software Engineering, Sun Yat-sen University, Spring 2023 Awards 2024 IEEE Cloud 2024 Best Paper Award 2022 The First IEEE Open Software Services Award CUHK Excellent Teaching Assistantship (CSCI3100 Software Engineering) 2020 Stars of Tomorrow (Award of Excellent Intern), Microsoft Research Asia",
  "content_length": 6927,
  "method": "requests",
  "crawl_time": "2025-12-01 14:55:47"
}