{
  "name": "Zhuotao Liu",
  "homepage": "https://inspiringgroup.github.io",
  "status": "success",
  "content": "InspiringGroup - Home Toggle navigation InspiringGroup Home Research Publications Team Join Us Welcome to the InspiringGroup The InspiringGroup is a dynamic research group here @ Tsinghua University INSC. We have worked on a wide range of topics centering around data. We build secure and efficient underlying systems infrastructure to support data transmissions and computations. Meanwhile, we create various data-centric applications with special interests on data security and privacy. See our Research for more details. The InspiringGroup is led by Principal Investigator (PI), Dr. Zhuotao Liu, who has a strong track-record in both academia and industry. Dr. Liu received his Ph.D. from University of Illinois at Urbana-Champaign (UIUC) and worked at Google as a Technical Lead in both the NetInfra (Network Infrastructure) and GGN (Google Global Networking) team. We are looking for new Ph.D. students, Postdocs, Master students, undergraduate students and external interns to join our team. Here at InspiringGroup, we strive to build a friendly, supportive, and flourishing culture, and to make your experiences at InspiringGroup full of “Wow Moments”. See Future Students. News Sep 2024 [Network Security] Our paper on pre-training transformer models for analyzing network-traffic data is accepted by IEEE S&P 2025. August 2024 [Award] Our paper on Internet Routing Security won USENIX Security 2024 Distinguished Paper Award and the Internet Defense Prize, simultaneously! July 2024 [Datacenter Networking] Our paper on rearchitecting the Random Early Detection for high performance transport in DCN is accepted by NSDI 2025. July 2024 [Applied AI] Our paper on performing fine-grained and large-scale webpage fingerprinting via encrypted traffic analysis is accepted by ACM CCS 2024. June 2024 [LLM Security / Privacy] Our paper on protecting LLM models by identifying key parameters is accepted by ICML 2024 NextGenAISafety workshop. June 2024 [Academic Service] Invited to serve on the TPC of IEEE S&P 2025. Please consider to submit. May 2024 [Privacy Computing for AI] CoGNN is awarded all three badges by the ACM CCS 2024 artifact evaluation committee. April 2024 [Privacy Computing for AI] Our paper CoGNN on training graph nerual networks (GNNs) over distributed and private graph data across multiple data providers is accepted by ACM CCS 2024. This work features multiple novel crypto constructions to realize fully-distributed and scalable GNN training/inference over distributed private graph data. Feb 2024 [Privacy Theory in FL] Our paper on understanding the data privacy in FL is accepted by USENIX Secuirty 2024. ... see all News © 2023 InspiringGroup. Current and Past Affiliations:",
  "content_length": 2709,
  "method": "requests",
  "crawl_time": "2025-12-01 14:55:49"
}