{
  "name": "Zhuowen Tu",
  "homepage": "http://pages.ucsd.edu/~ztu",
  "status": "success",
  "content": "Zhuowen Tu's homepage Machine Learning, Perception, and Cognition Lab (mlPC) Research Group Publications Teaching Download Biography (generated by Wordle) Address: Department of Cognitive Science Division of Social Sciences University of California, San Diego 9500 Gilman Drive La Jolla, CA 92093-0515  USA Office: SSRB 250 (map) Phone: 858-822-0908 Fax:     858-534-1128 Email: ztu  [at] ucsd [dot] edu zhuowen[dot]tu [at] gmail [dot] com Zhuowen Tu Professor Department of Cognitive Science Department of Computer Science and Engineering (affiliate) University of California, San Diego Our research is at the intersection of computer vision, machine learning, deep learning, natural language processing, and neural computation. We have been specifically focused on developing statistical learning/computing models for structured, large-scale, and multi-modality data prediction. What's new: Congratulations to Saining Xie, who will be joining the Courant Computer Science department at NYU in 2023 as an Assistant Professor! Congratulations to Wenlong Huang for his paper \"3D Volumetric Modeling with Introspective Neural Networks\" to be presented at AAAI'19 (an acceptance rate of 16.2%; Wenlong is a freshman of Compter Science at UC Berkeley and he was a high schooler at La Jolla Country Day School). Our new works on introspective learning, \"Introspective Neural Networks for Generative Modeling\" (ICCV 2017, code) and \"Introspective Classification with Convolutional Nets\" (NIPS 2017) have recently been accepted for publication, and new method \"Wasserstein Introspective Neural Networks\" (CVPR 2018, oral, code) that brings a large enhancement to INN. Saining wins a 2017 Google Fellowship in Machine Perception. Congratulations, Saining! The training/testing cod and trained models of Saining's Holistically-Nested Edge Detector (Marr Prize Honorable Mention at ICCV2015) have been released. To prospective applicants for internships or research assistantships: Please complete the form here (link). Kindly note that we generally do not consider applications for remote internships, particularly for candidates based overseas. To prospective PhD applicants: If you like the research direction of the mlPC lab and are intereted in joining our group, you may apply for the PhD program in the Computer Science and Engineering Department (deadline: Dec. 15). In addition, you may simoutanously apply for the Cognitive Science PhD program (deadline: Dec. 1).",
  "content_length": 2463,
  "method": "requests",
  "crawl_time": "2025-12-01 14:55:50"
}