{
  "name": "Zhuo Zhang 0002",
  "homepage": "https://zzhang.xyz",
  "status": "success",
  "content": "Zhuo's Homepage ☰ ☰ Links ▾ Links ▾ Awards Awards Publications Publications About About Github Github Google Scholar Google Scholar DBLP DBLP Twitter Twitter About About Publications Publications Awards Awards Github Github Google Scholar Google Scholar DBLP DBLP Twitter Twitter Zhuo Zhang  张倬 Oops, your browser doesn't support this application. I will be joining the Department of Computer Science at Columbia University as an Assistant Professor in Spring 2026. I completed my Ph.D. at Purdue University under the supervision of Samuel Conte Professor Xiangyu Zhang. Prior to that, I earned my B.Sc. with Zhiyuan Honors from Shanghai Jiao Tong University (SJTU). I study how to make software hard to break and easy to trust. My work treats security as a design discipline and a scientific question: engineering safety into development, expose defects with precise and scalable auditing, and use debugging to reach root-cause understanding and correctness. The aim is assurance and openness, with methods we can explain, check, and rely on. Beyond academia, I have been was an avid capture-the-flag (CTF) player. I enjoy hardcore hacking, bug hunting, and contributing to open-source projects. I am actively maintaining EDB ⭐ and RepoAudit ⭐ , and have archived Web3Bugs ⭐ . You can find more of my hobby projects on Github ⭐ . 🎯 I'm actively looking for self-motivated students with a strong background in systems or program analysis to join my research group at Columbia CS. Additional experience in the following areas will be considered a strong plus: • CTF experience (especially RE/Pwn) • C/Rust software development at scale • Familiarity with Web3 infra (e.g., reth) • Kernel/Browser vulnerability research 📬 If you're interested in working with me, please drop me an email with (1) your CV and (2) a brief overview of your research interests and relevant background. News Email The best way to reach me is via email. If you're specifically interested in topics related to binary analysis or Web3, feel free to reach out to [email protected] or [email protected], respectively. For other general inquiries, please contact [email protected]. Special Notes. Sometimes I might miss your email, so don't hesitate to follow up if you don't hear back for a while. That said, I do have a small trick to help you craft your email in a way that will easily catch my attention. I've encrypted this tip using a customized script, mycipher.py. Below is the encrypted message (in hex format): 040fc29c860b901336eae5caaf6942d79591253e75716770e794a31b0643382099ab594d5a4a106348b91f1ea98a4286b664f899a1ad632503253d4c3c87e89b315f8180fe00765afb5c0f286c573b6dc36d408f809cc9a368d20793a6c8a6f65541bc5a5b04eb4c1bbcd8742f94f9a7616ce1f347775badeaf5ac4b80be8e4a7979ac88f170ba7f86a7ad379e4381ead39a7bc33a05ebe9b492fabbeb12f318aa1aef96a518f59d16da6daafd9e1f5c930e241894a558b5609fcfb5b4094adf3344188d58f68a9c4b5266816f547313163b62cfb314811ad7a30bad24cfaafc62a31abfba4f45b28bf8c57585a8e8fa30acf74d87804afa3e213c4ad1925570ae221dc5f440a3aa96d48d02c743de13fc878836571bfcb57cbab43316995c248bb649e78561c149545ababf35b0082fff118fb4b9addd888bb27b201395ee6839dfafe9601d948bafdb669087f0ea3b9a071f22e50b76795741fb163f13e4ca4c465838a29deb24db89fdb56729987a98df495375d813e3901a6ee2d19dcd5d179d7fd184938b37e5963a1c1889da013a1af9c5f6df86dbea83ffb85b85b861 Unfortunately, the secret encryption key in mycipher.py has been lost 😕, and all I have are a few known plaintext-ciphertext pairs in data. If you do manage to decrypt the instructions above 🕵️‍♂️, just follow what they say 🧩. Publications Revamping Binary Analysis with Sampling and Probabilistic Inference abstract ➲ Zhuo Zhang, Ph.D. Dissertation, Purdue University, August 2023 ACM SIGSAC Doctoral Dissertation Award Excellent Score in Code Delivery and Evaluation of Office of Naval Research (ONR) Keywords: Decompilation, Probabilistic Analysis close Abstract: Binary analysis, a cornerstone technique in cybersecurity, enables the examination of binary executables, irrespective of source code availability. It plays a critical role in understanding program behaviors, detecting software bugs, and mitigating potential vulnerabilities, specially in situations where the source code remains out of reach. However, aligning the efficacy of binary analysis with that of source-level analysis remains a significant challenge, primarily due to the uncertainty caused by the loss of semantic information during the compilation process. This dissertation presents an innovative probabilistic approach, termed as probabilistic binary analysis, designed to combat the intrinsic uncertainty in binary analysis. It builds on the fundamental principles of program sampling and probabilistic inference, enhanced further by an iterative refinement architecture. The dissertation suggests that a thorough and practical method of sampling program behaviors can yield a substantial quantity of hints which could be instrumental in recovering lost information, despite the potential inclusion of some inaccuracies. Consequently, a probabilistic inference technique is applied to systematically incorporate and process the collected hints, suppressing the incorrect ones, thereby enabling the interpretation of high-level semantics. Furthermore, an iterative refinement mechanism is deployed to augment the efficiency of the probabilistic analysis in subsequent applications, facilitating the progressive enhancement of analysis outcomes through an automated or human-guided feedback loop. This work offers an in-depth understanding of the challenges and solutions related to assessing low-level program representations and systematically handling the inherent uncertainty in binary analysis. It aims to contribute to the field by advancing the development of precise, reliable, and interpretable binary analysis solutions, thereby setting the groundwork for future exploration in this domain. Unleashing the Power of Generative Model in Recovering Variable Names from Stripped Binary abstract ➲ Xiangzhe Xu, Zhuo Zhang†, Zian Su, Ziyang Huang, Shiwei Feng, Yapeng Ye, Nan Jiang, Danning Xie, Siyuan Cheng, Lin Tan, Xiangyu Zhang Proceedings of the 32rd Network and Distributed System Security Symposium (NDSS 2025) San Diego, CA, February 2025 Keywords: Binary Analysis, Variable Name Recovery, Large Language Model close Abstract: Decompilation aims to recover the source code form of a binary executable. It has many applications in security and software engineering such as malware analysis, vulnerability detection and code reuse. A prominent challenge in decompilation is to recover variable names. We propose a novel method that leverages the synergy of large language model (LLM) and program analysis. Language models encode rich multi-modal knowledge, but its limited input size prevents providing sufficient global context for name recovery. We propose to divide the task to many LLM queries and use program analysis to correlate and propagate the query results, which in turn improves the performance of LLM by providing additional contextual information. Our results show that 75% of the recovered names are considered good by users and our technique outperforms the state-of-the-art technique by 16.5% and 20.23% in precision and recall, respectively. Consolidating Smart Contracts with Behavioral Contracts abstract ➲ Guannan Wei, Danning Xie, Wuqi Zhang, Yongwei Yuan, Zhuo Zhang† Proceedings of the ACM on Programming Languages Volume 8 Issue PLDI (PLDI 2024) Copenhagen, Demark, June, 2024 Keywords: Behavioral Contract, Smart Contract, Runtime Monitoring close Abstract: Ensuring the reliability of smart contracts is of vital importance due to the wide adoption of smart contract programs in decentralized financial applications. However, statically checking many rich properties of smart contract programs can be challenging. On the other hand, dynamic validation approaches have shown promise for widespread adoption in practice. Nevertheless, as part of the programming environment for smart contracts, existing dynamic validation approaches have not provided programmers with a notion to clearly articulate the interface between components, especially for addresses representing opaque contract instances. We argue that the ``design-by-contract'' approach should complement the development of smart contract programs. Unfortunately, there is limited linguistic support for it in existing smart contract languages. In this paper, we design a Solidity language extension ConSol that supports behavioral contracts. ConSol provides programmers with a modular specification and monitoring system for both functional and latent address behaviors. The key capability of ConSol is to attach specifications to first-class addresses and monitor violations when invoking these addresses. We evaluate ConSol using 20 real-world cases, demonstrating its effectiveness in expressing critical conditions and preventing attacks. Additionally, we assess ConSol's efficiency and compare gas consumption with manually inserted assertions, showing that our approach introduces only marginal gas overhead. By separating specifications and implementations using behavioral contracts, ConSol assists programmers in writing more robust and readable smart contracts. Nyx: Detecting Exploitable Front-Running Vulnerabilities in Smart Contracts abstract ➲ Wuqi Zhang, Zhuo Zhang†, Qingkai Shi, Lu Liu, Lili Wei, Yepang Liu, Xiangyu Zhang, Shing-Chi Cheung Proceedings of the 45th IEEE Symposium on Security and Privacy (Oakland 2024) San Francisco, CA, May, 2024 [code] Keywords: Frontrunning Attack, Web3 Security, Blockchain close Abstract: Smart contracts are susceptible to front-running attacks, in which malicious users leverage prior knowledge of upcoming transactions to execute attack transactions in advance and benefit their own portfolios. Existing contract analysis techniques raise a number of false positives and false negatives in that they simplistically treat data races in ",
  "content_length": 25552,
  "method": "requests",
  "crawl_time": "2025-12-01 14:55:48"
}