{
  "name": "Zhuqing Liu",
  "homepage": "https://facultyinfo.unt.edu/faculty-profile?profile=zl0223",
  "status": "success",
  "content": "Faculty Profile | Faculty Information System Skip to main content Faculty Name Search By: Faculty Name Courses Search Zhuqing Liu Title: Assistant Professor Department: Computer Science and Engineering College: College of Engineering Zhuqing.Liu@unt.edu General Information Previous Courses Publications Research Curriculum Vitae Curriculum Vitae Link Education PhD, Ohio State University, 2024 Major: Electrical and Computer Engineering Current Scheduled Teaching CSCE 6280.002Advanced Topics in Artificial IntelligenceFall 2025 Syllabus CSCE 6940.881Individual ResearchFall 2025 CSCE 5215.003Machine LearningFall 2025 Syllabus Texas Education Code 51.974 (HB 2504) requires each institution of higher education to make available to the public, a syllabus for undergraduate lecture courses offered for credit by the institution. Previous Scheduled Teaching CSCE 5210.002Fundamentals of Artificial IntelligenceSpring 2025 SPOT CSCE 5210.003Fundamentals of Artificial IntelligenceSpring 2025 SPOT CSCE 4201.002Introduction to Artificial IntelligenceSpring 2025 Syllabus SPOT Texas Education Code 51.974 (HB 2504) requires each institution of higher education to make available to the public, a syllabus for undergraduate lecture courses offered for credit by the institution. Published Intellectual Contributions Conference Proceeding Qin, Z., Liu, Z., Lu, S., Liang, Y., Liu, J. (2025). DUET: Decentralized Bilevel Optimization without Lower-Level Strong Convexity. The Thirteenth International Conference on Learning Representations. Liu, Z., Zhang, X., Liu, J., Zhu, Z., Lu, S. (2024). PILOT: An O (1/K)-Convergent Approach for Policy Evaluation with Nonlinear Function Approximation. International Conference on Learning Representations. Dou, Z., Hu, X., Yang, H., Liu, Z., Fang, M. (2024). Adversarial Attacks to Multi-Modal Models. LAMPS 2024 - Proceedings of the 1st ACM Workshop on Large AI Systems and Models with Privacy and Safety Analysis. 35-46. https://api.elsevier.com/content/abstract/scopus_id/85215502541 Qiu, P., Li, Y., Liu, Z., Khanduri, P., Liu, J., Shroff, N.B., Bentley, E.S., Turck, K. (2023). Diamond: Taming sample and communication complexities in decentralized bilevel optimization. IEEE INFOCOM 2023-IEEE conference on computer communications. 1--10. Liu, Z., Zhang, X., Lu, S., Liu, J. (2023). Precision: Decentralized constrained min-max learning with low communication and sample complexities. Proceedings of the Twenty-fourth International Symposium on Theory, Algorithmic Foundations, and Protocol Design for Mobile Networks and Mobile Computing. 191--200. Liu, Z., Zhang, X., Khanduri, P., Lu, S., Liu, J. (2023). Prometheus: taming sample and communication complexities in constrained decentralized stochastic bilevel learning. International Conference on Machine Learning. 22420--22453. Liu, Z., Zhang, X., Khanduri, P., Lu, S., Liu, J. (2022). Interact: Achieving low sample and communication complexities in decentralized bilevel learning over networks. Proceedings of the Twenty-Third International Symposium on Theory, Algorithmic Foundations, and Protocol Design for Mobile Networks and Mobile Computing. 61--70. Zhang, X., Fang, M., Liu, Z., Yang, H., Liu, J., Zhu, Z. (2022). Net-fleet: Achieving linear convergence speedup for fully decentralized federated learning with heterogeneous data. Proceedings of the Twenty-Third International Symposium on Theory, Algorithmic Foundations, and Protocol Design for Mobile Networks and Mobile Computing. 71--80. Liu, Z., Zhang, X., Liu, J. (2022). Synthesis: A semi-asynchronous path-integrated stochastic gradient method for distributed learning in computing clusters. Proceedings of the Twenty-Third International Symposium on Theory, Algorithmic Foundations, and Protocol Design for Mobile Networks and Mobile Computing. 151--160. Zhang, X., Liu, Z., Liu, J., Zhu, Z., Lu, S., Ranzato, M., Beygelzimer, A., Dauphin, Y., Liang, P., Vaughan, J.W. (2021). Taming Communication and Sample Complexities in Decentralized Policy Evaluation for Cooperative Multi-Agent Reinforcement Learning. Advances in Neural Information Processing Systems. 34 18825--18838. Curran Associates, Inc.. https://proceedings.neurips.cc/paper_files/paper/2021/file/9c51a13764ca629f439f6accbb4ec413-Paper.pdf Liu, Z., Duan, H., Yang, Y., Hu, X. (2016). Pendulum-like oscillation controller for UAV based on L\\'evy-flight pigeon-inspired optimization and LQR. 2016 IEEE Symposium Series on Computational Intelligence (SSCI). 1--6. Journal Article Fang, M., Liu, Z., Zhao, X., Liu, J. (2025). Byzantine-Robust Federated Learning over Ring-All-Reduce Distributed Computing. Proceedings of the ACM Web Conference 2025. Fang, M., Nabavirazavi, S., Liu, Z., Sun, W., Iyengar, S.S., Yang, H. (2025). Do We Really Need to Design New Byzantine-robust Aggregation Rules?. Proceedings Network and Distributed System Security Symposium. https://www.ndss-symposium.org/wp-content/uploads/2025-1796-paper.pdf Wang, W., Ma, Q., Zhang, Z., Liu, Y., Liu, Z., Fang, M. (2025). Poisoning Attacks and Defenses to Federated Unlearning. Proceedings of the ACM Web Conference 2025. Yang, H., Liu, Z., Liu, J., Dong, C., Momma, M. (2023). Federated multi-objective learning. Other. 36 39602--39625. Yang, H., Liu, Z., Zhang, X., Liu, J. (2022). SAGDA: Achieving $$\\backslash$mathcal $\\$O$\\$($\\backslash$epsilon\\^{}$\\$-2$\\$) $ Communication Complexity in Federated Min-Max Learning. Other. 35 7142--7154. Zhang, X., Liu, Z., Liu, J., Zhu, Z., Lu, S. (2021). Taming communication and sample complexities in decentralized policy evaluation for cooperative multi-agent reinforcement learning. Other. 34 18825--18838. Bi, L., Zuo, Y., Tao, F., Liao, T.W., Liu, Z. (2017). Energy-aware material selection for product with multicomponent under cloud environment. Other. 17 (3) 031007. American Society of Mechanical Engineers. , OverallSummative Rating Challenge andEngagement Index Response Rate out of 5 out of 7 % of students responded Overall Summative Rating (median): This rating represents the combined responses of students to the four global summative items and is presented to provide an overall index of the class’s quality. Overall summative statements include the following (response options include a Likert scale ranging from 5 = Excellent, 3 = Good, and 1= Very poor): The course as a whole was The course content was The instructor’s contribution to the course was The instructor’s effectiveness in teaching the subject matter was Challenge and Engagement Index: This rating combines student responses to several SPOT items relating to how academically challenging students found the course to be and how engaged they were. Challenge and Engagement Index items include the following (response options include a Likert scale ranging from 7 = Much higher, 4 = Average, and 1 = Much lower): Do you expect your grade in this course to be The intellectual challenge presented was The amount of effort you put into this course was The amount of effort to succeed in this course was Your involvement in course (doing assignments, attending classes, etc.) was CLOSE",
  "content_length": 7103,
  "method": "requests",
  "crawl_time": "2025-12-01 14:55:50"
}