{
  "name": "Zhutian Chen",
  "homepage": "https://chenzhutian.org",
  "status": "success",
  "content": "Zhu-Tian ChenI am Zhu-Tian Chen, currently an Assistant Professor in the CSE department at the University of Minnesota, Twin Cities. Prior to that, I spent some great times in the Visual Computing Group at Harvard University with Prof. Hanspeter Pfister and the Design Lab and Creativity Lab at UC San Diego with Prof. Haijun Xia. I received my PhD in CSE from Hong Kong University of Science and Technology, where I worked with Prof. Qu Huamin in the HKUST VisLab.My research seeks to augment human intelligence in everyday activities through data visualizations. I design, build, and evaluate hybrid human-AI systems that empower users to visualize and interact with information in both desktop and outdoor environments, using methods of human-centered design, Augmented Reality, and Applied AI.I love little cats and big little dogs.I am actively seeking undergraduate, master's, and PhD students, as well as visiting scholars and interns to join and establish my new lab. Please find more in work with me if you are interested in!CVResearch,Teaching,DiversityStatements@22Selected Projects (Full list)I publish under the name Chen Zhu-TianProject - Towards Better Human-AI Teaming in Physical SpaceCan AR-Embedded Visualizations Foster Appropriate Reliance on AI in Spatial Decision Making? A Comparative Study of AR See-Through vs. 2D MinimapXianhao Carton Liu, Difan Jia, Tongyu Nie, Evan Suma Rosenberg, Victoria Interrante, and Chen Zhu-TianArXiv, 2025PDFReality Proxy: Fluid Interactions with Real-World Objects in MR via Abstract RepresentationsXiaoan Liu, Difan Jia, Xianhao Carton Liu, Mar Gonzalez-Franco, and Chen Zhu-TianUIST: ACM Symposium on User Interface Software and Technology, 2025PDFProject - Intelligent AR Systems for Dynamic ScenesSportify: Question Answering with Embedded Visualizations and Personified Narratives for Sports VideoChunggi Lee, Tica Lin, Hanspeter Pfister, and Chen Zhu-TianVIS: IEEE Transactions on Visualization and Computer Graphics, 2024PagePDFDOIPreviewRL-LABEL: A Deep Reinforcement Learning Approach Intended for AR Label Placement in Dynamic ScenariosChen Zhu-Tian, Daniele Chiappalupi, Tica Lin, Yalong Yang, Johanna Beyer, and Hanspeter PfisterVIS: IEEE Transactions on Visualization and Computer Graphics, 2023PagePDFDOIiBall: Augmenting Basketball Videos with Gaze-moderated Embedded VisualizationsChen Zhu-Tian, Qisen Yang, Jiarui Shan, Tica Lin, Johanna Beyer, Haijun Xia, and Hanspeter PfisterCHI: ACM Conference on Human Factors in Computing Systems, 2023PagePDFDOIVideoDemoPreviewThe Quest for Omnioculars: Embedded Visualization for Augmenting Basketball Game Viewing ExperiencesTica Lin, Chen Zhu-Tian, Yalong Yang, Daniele Chiappalupi, Johanna Beyer, and Hanspeter PfisterVIS: IEEE Transactions on Visualization and Computer Graphics, 2022PagePDFDOIAugmenting Sports Videos with VisCommentatorChen Zhu-Tian, Shuainan Ye, Xiangtong Chu, Haijun Xia, Hui Zhang, Huamin Qu, and Yingcai WuVIS: IEEE Transactions on Visualization and Computer Graphics, 2021PagePDFDOIVideoPreviewProject - Language-Oriented InteractionsWaitGPT: Monitoring and Steering Conversational LLM Agent in Data Analysis with On-the-Fly Code VisualizationLiwenhan Xie, Chengbo Zheng, Haijun Xia, Huamin Qu, and Chen Zhu-TianUIST: ACM Symposium on User Interface Software and Technology, 2024PagePDFDOIVideoPreviewSketch Then Generate: Providing Incremental User Feedback and Guiding LLM Code Generation through Language-Oriented Code SketchesChen Zhu-Tian, Zeyu Xiong, Xiaoshuo Yao, and Elena GlassmanArXiv, 2024PDFDOIPreviewDataParticles: Block-based and Language-oriented Authoring of Animated Unit VisualizationYining Cao, Jane L. E., Chen Zhu-Tian, and Haijun XiaCHI: ACM Conference on Human Factors in Computing Systems, 2023PagePDFDOIVideoPreviewSporthesia: Augmenting Sports Videos Using Natural LanguageChen Zhu-Tian, Qisen Yang, Xiao Xie, Johanna Beyer, Haijun Xia, Yingcai Wu, and Hanspeter PfisterVIS: IEEE Transactions on Visualization and Computer Graphics, 2022PagePDFDOIVideoPreviewTalkCrossData: Leveraging Text-Data Connections for Authoring Data DocumentsChen Zhu-Tian, and Haijun XiaCHI: ACM Conference on Human Factors in Computing Systems, 2022PDFDOIVideoPreviewNewsJul. 2025One paper got accepted by UIST 2025!Jul. 2025I find it is hard to maintain a `news`Jul. 2024One paper got accepted by VIS 2024 and one paper got accepted by UIST 2024!Jan. 2024Long time no see! Finally have moved to Minneapolis!Jul. 2023Three papers got accepted by VIS 2023 @ Melbourne, Australia!Jun. 2023Invited to serve as an Associate Chair for ACM CHI 2024.Jun. 2023One short paper got EuroVis Honorable Mention Award!May. 2023I am invited as a speaker and panalist of the KDD23 Workshop on Data Science and AI for Sports. See you in Long Beach, CA!Apr. 2023One paper got CHI Best Paper Award!Fed. 2023Invited to serve on the Program Committee for IEEE VIS 2023.Jan. 2023Two papers accepted to CHI23 @ Hamburg, Germany.Aug. 2022Two papers got VIS Honorable Mention Award!Jul. 2022Awarded with a Harvard Certificate of Distinction and Excellence in Teaching based on student's evaluation.Jun. 2022Four papers accepted to VIS 2022 @ Oklahoma.May. 2022Present CrossData in CHI22 @ NOLA. Plz check my talk here.Mar. 2022One paper accepted to L@S!Feb. 2022One paper accepted to CHI2022. See you guys in New Orleans!Oct. 2021Leave UCSD and start my PostDoc at Harvard!Sep. 2021VisCommentator got VIS Honorable Mention Award!Aug. 2021One paper got accepted by TVCG!Jul. 2021Two papers got accepted by VIS 2021 @ Virtual!Nov. 2020Started my PostDoc at UCSD.Aug. 2020Two papers got accepted by VIS 2020 @ Virtual!Dec. 2019One paper got accepted by CHI 2020 @ Hawaii, US Virtual!Sep. 2019I visited Dr.Benjamin Bach @ the University of Edinburgh, UK.Jul. 2019Two papers got accepted by VIS 2019 @ Vancouver, Canda!Jan. 2019One paper got accepted by TVCG. It will be presented at VIS 2019 @ Vancouver, Canda!",
  "content_length": 5928,
  "method": "requests",
  "crawl_time": "2025-12-01 14:55:49"
}