{
  "name": "Zi Huang",
  "homepage": "http://staff.itee.uq.edu.au/huang",
  "status": "success",
  "content": "Helen Huang Professor\tZi (Helen) Huang Big Media Intelligence (BMI) Research Group Data Science Discipline School of Electrical Engineering & Computer Science The University of Queensland huang@itee.uq.edu.au +61 7 336 53239 Overview Helen Huang is a Professor and the Discipline Leader for Data Science in the School of EECS at The University of Queensland. She received her BSc degree from Department of Computer Science, Tsinghua University, China, and her PhD in Computer Science from School of EECS, The University of Queensland in 2001 and 2007 respectively. Helen's research interests mainly include multimedia indexing and search, computer vision, recommender systems, social data analysis and knowledge discovery. She has published 200+ papers in prestigious venues, and has served as an Associate Editor for The VLDB Journal, ACM Computing Surveys, ACM Transactions on Information Systems (TOIS), IEEE Transactions on Multimedia (TMM), Pattern Recognition Journal, etc and also a member of the VLDB Endowment Board of Trustees. Helen has been elevated to IEEE Fellow for her contributions to multi-modal data management and recognised as an ACM Distinguished Member for her contributions to multimedia computing research. Helen Huang has received 2016 Chris Wallace Award from Computing Research and Education (CORE) Australasia for a notable breakthrough or a contribution of particular significance in Computer Science, and Women in Technology (WiT) Infotech Research Award 2014, Queensland. She was also a recipient of the Excellence in Higher Degree by Research Supervision Award, University of Queensland, 2018. Research Interest Big Database Management: Data quality; Data linkage and fusion; Indexing structures; Query processing; Dimensionality reduction; spatio-temporal data management Machine Learning: Few-shot Learning; Zero-shot Learning; Domain adaptation; Adversarial learning; Graph learning Multimedia Search: Visual content (image and videos) understanding and analysis; Multimedia indexing and retrieval; Ranking and recommendation; Visual question answering; Information systems: Privacy-aware information retrieval; cross-modal retrieval; Heterogeneous data fusion; Knowledge distillation Social Media Analytics: Event detection and monitoring; User behaviour modelling and prediction; Social interactions analysis; Web data mining For Prospective Students We are always looking for highly motivated Ph.D students. The research topics include multimedia, computer vision, spatial&temporal database, and knowledge discovery. UQ ranks among the world’s top universities, as measured by several key independent rankings, including the U.S. News Best Global Universities Rankings 2023 (36), the Performance Ranking of Scientific Papers for World Universities 2023 (37), CWTS Leiden Ranking 2023 (35), QS World University Rankings 2024 (43), Academic Ranking of World Universities 2023 (51), and Times Higher Education World University Rankings 2024 (70). Honours and Master thesis project students from UQ are also welcome. Selected Journals J. Yu, H. Yin, X. Xia, T. Chen, J. Li, and Z. Huang. \"Self-Supervised Learning for Recommender Systems: A Survey\". IEEE Trans. Knowl. Data Eng. 36(1): 335-355 (2024) M. Zhao, X. Qi, Z. Hu, L. Li, Y. Zhang, Z. Huang, and X. Yu. \"Calligraphy Font Generation via Explicitly Modeling Location-Aware Glyph Component Deformations\". IEEE Trans. Multim. 26: 5939-5950 (2024) J. Li, Y. Bin, Y. Ma, Y. Yang, Z. Huang, TS. Chua. \"Filter-based Stance Network for Rumor Verification\". ACM Trans. Inf. Syst. 42(4): 108:1-108:28 (2024) Y. Luo, Z. Wang, Z. Chen, Z. Huang, M. Baktashmotlagh. \"Progressive Graph Learning for Open-Set Domain Adaptation\". IEEE Transactions on Pattern Analysis and Machine Intelligence (PAMI) 45(9): 11240-11255, 2023 T. Niu, S. Dong, Z. Chen, X. Luo, Z. Huang, S. Guo, X. Xu. \"A multi-layer memory sharing network for video captioning\". Pattern Recognit (PR) 136: 109202, 2023 T. Chen, H. Yin, J. Ren, Z. Huang, X. Zhang and H. Wang. \"Uniting Heterogeneity, Inductiveness, and Efficiency for Graph Representation Learning\". IEEE Transactions on Knowledge and Data Engineering 35(2): 2103-2117, 2023 M. Imran, H. Yin, T. Chen, Z. Huang, K. Zheng. \"DeHIN: A Decentralized Framework for Embedding Large-scale Heterogeneous Information Networks\". IEEE Transactions on Knowledge and Data Engineering 35(4): 3645-3657, 2023 Y. Luo, Z. Huang, H. Chen, Y. Yang, H. Yin, M. Baktashmotlagh. \"Interpretable Signed Link Prediction With Signed Infomax Hyperbolic Graph\". IEEE Transactions on Knowledge and Data Engineering 35(4): 3991-4002, 2023 P. Zhang, G. Bai, H. Yin, Z. Huang. \"Proactive Privacy-preserving Learning for Cross-modal Retrieval\". ACM Transactions on Information Systems (TOIS) 41(2): 35:1-35:23, 2023 J. Duan, P. Zhang, R. Qiu, Z. Huang. \"Long short-term enhanced memory for sequential recommendation\". World Wide Web: 1-23, 2022 M. Imran, H. Yin, T. Chen, Z. Huang, K. Zheng. \"DeHIN: A Decentralized Framework for Embedding Large-scale Heterogeneous Information Networks\". IEEE Transactions on Knowledge and Data Engineering: 2022 Y. Luo, Z. Huang, H. Chen, Y. Yang, H. Yin, M. Baktashmotlagh. \"Interpretable signed link prediction with signed infomax hyperbolic graph\". IEEE Transactions on Knowledge and Data Engineering: 2021 R. Qiu, Z. Huang, T. Chen, H. Yin. \"Exploiting positional information for session-based recommendation\". ACM Transactions on Information Systems (TOIS): 40(2):1-24, 2021 T. Chen, H. Yin, X. Zhang, Z. Huang, Y. Wang, M. Wang. “Quaternion Factorization Machines: A Lightweight Solution to Intricate Feature Interaction Modeling”. IEEE Transactions on Neural Networks and Learning Systems: 2021 Y. Li, T. Chen, Z. Huang. \"Attribute-aware explainable complementary clothing recommendation\". World Wide Web 24: 1885–190, 2021 T. Chen, H. Yin, J. Ren, Z. Huang, X. Zhang and H. Wang, \"Uniting Heterogeneity, Inductiveness, and Efficiency for Graph Representation Learning\" in IEEE Transactions on Knowledge and Data Engineering: 2021 S. Ji, X. Li, Z. Huang, E. Cambria, \"Suicidal ideation and mental disorder detection with attentive relation networks\". Neural Comput & Applic: 1-11, 2021 P. Zhang, Y. Luo, Z. Huang, X. Xu, J. Song, “High-order nonlocal Hashing for unsupervised cross-modal retrieval”. World Wide Web 24(2):563-83, 2021 P. Zhang, Y. Li, Z. Huang and X. Xu, \"Aggregation-Based Graph Convolutional Hashing for Unsupervised Cross-Modal Retrieva,\" in IEEE Transactions on Multimedia: 24:466-79, 2021 S. Ji, S. Pan, X. Li, E. Cambria, G. Long and Z. Huang, \"Suicidal Ideation Detection: A Review of Machine Learning Methods and Applications\". IEEE Transactions on Computational Social Systems, 8(1): 214-226, 2021 J. Li, K. Lu, Z. Huang, and H. T. Shen. \"On Both Cold-Start and Long-Tail Recommendation with Social Data\". IEEE Transactions on Knowledge and Data Engineering (TKDE), 33(1): 194-208, 2021 P. Zhang, Y. Luo, Z. Huang, X. Xu, and J. Song. \"High-order nonlocal Hashing for unsupervised cross-modal retrieval\". World Wide Web 24(2):563-583, 2021 L. Peng, Y. Yang, Z. Wang, Z. Huang, and H. T. Shen, \"MRA-Net: Improving VQA via Multi-modal Relation Attention Network\". IEEE Transactions on Pattern Analysis and Machine Intelligence (PAMI). (accepted) X. Ren, H. Yin, T. Chen, H. Wang, N. Huang, Z. Huang, and X. Zhang, \"CRSAL: Conversational Recommender Systems with Adversarial Learning\". ACM Transactions on Information Systems. 38(4): 34:1-34:40, 2020 R. Qiu, Z. Huang, J. Li, H. Yin, \"Exploiting Cross-Session Information for Session-based Recommendation with Graph Neural Networks\". ACM Transactions on Information Systems. 38(3): 22:1-22:23, 2020 J. Li, K. Lu, Z. Huang, L. Zhu, and H. T. Shen, \"Transfer Independently Together: A Generalized Framework for Domain Adaptation\". IEEE Trans. Cybernetics 49(6): 2144-2155 (2019) X. Luo, P. Zhang, Z. Huang,L. Nie, and X. Xu, \"Discrete Hashing With Multiple Supervision\". IEEE Trans. Image Processing 28(6): 2962-2975 (2019) Z. Zhang, Z. Lai, Z. Huang, W. Wong, G. Xie, L. Liu, and L. Shao, \"Scalable Supervised Asymmetric Hashing With Semantic and Latent Factor Embedding\". IEEE Trans. Image Processing 28(10): 4803-4818 (2019) Y. Yang, Y. Duan, X. Wang, Z. Huang, N. Xie and H. T. Shen, \"Hierarchical Multi-Clue Modelling for POI Popularity Prediction with Heterogeneous Tourist Information\". IEEE Transactions on Knowledge and Data Engineering (TKDE)31(4): 757-768 (2019) J, Li, K. Lu, Z Huang, L. Zhu, and H. T. Shen, \"Heterogeneous Domain Adaptation Through Progressive Alignment\". IEEE Trans. Neural Netw. Learning Syst. 30(5): 1381-1391 (2019) Z. Liu, Y. Yang, Z Huang, F. Shen, D. Zhang, and H. T. Shen, \"Embedding and predicting the event at early stage\". World Wide Web 22(3): 1055-1074 (2019) H. Yin, W. Wang, L. Chen, X. Du, Q. Nguyen and Z. Huang. \"Mobi-SAGE-RS: A sparse additive generative model-based mobile application recommender system\". Knowledge Based Systems. 157:68-80, 2018 F. Shen, Y. Xu, L Liu, Y. Yang, Z. Huang, and H. T. Shen, \"Unsupervised Deep Hashing with Similarity-Adaptive and Discrete Optimization\". IEEE Transactions on Pattern Analysis and Machine Intelligence (PAMI) 40(12): 3034-3044, 2018 Y. Luo, Y. Yang, F. Shen, Z. Huang, P. Zhou, and H. T. Shen, \"Robust Discrete Code Modeling for Supervised Hashing\". Pattern Recognition 75: 128-135, 2018 L. Zhu, Z. Huang, Z. Li, L. Xie, and H. T. Shen, \"Exploring Auxiliary Context: Discrete Semantic Transfer Hashing for Scalable Image Retrieval\". IEEE Transactions on Neural Networks and Learning Systems (TNNLS) 29(11): 5264-5276, 2018 X. Du, H. Yin, Z. Huang, Y. Yang, and X. Zhou, \"Exploiting detected visual objects for frame-level video filtering\". World Wide Web 21(5): 1259-1284, 2018 H. Cai, V. Zheng, F. Zhu, K. Chang, and Z. Huang, \"From Community Detection to Community Profiling\". PVLDB 10(7): 817-828, 2017 C. Li, Z. Huang, Y. Yang, J. Cao, X. Sun, and H. T. Shen, \"Hierarchical Latent Concept Discovery f",
  "content_length": 69454,
  "method": "requests",
  "crawl_time": "2025-12-01 14:55:52"
}