{
  "name": "Zi Wang 0003",
  "homepage": "https://www.augusta.edu/faculty/directory/view.php?id=ZWANG1",
  "status": "success",
  "content": "Zi Wang - Faculty Profile Home Faculty Directory Profile Update Your Profile Directory FAQs PACT Login Give Feedback Zi Wang Assistant Professor Zi Wang Assistant Professor Academic Appointment(s)AdministrationDepartment of Computer & Cyber SciencesSchool of Computer and Cyber SciencesDepartment of Computer & Cyber Sciences BioZi Wang is an Assistant Professor in the School of Computer and Cyber Sciences at Augusta University. His research focuses on mobile sensing, ubiquitous computing, human-computer interaction, and cyber-physical systems security. ZWANG1@augusta.edu UH 131H Personal Website General Credentials Instruction Scholarship Service Education Ph.D., Computer Science. Florida State University, 2022 MS, Transportation and Highway Eng Beijing Jiaotang University, 2014 BS, Information Science/Studies Beijing Jiaotang University, 2010 Courses Taught Most Recent Academic Year CYBR 2600 Networking & Cyber Security Teaching Interests My teaching interests are deeply rooted in my research on ubiquitous computing and intelligent sensing. I am enthusiastic about offering advanced courses in Human-Computer Interaction (HCI), Mobile Computing, Internet of Things (IoT), and Cyber-Physical Systems, where students can gain hands-on experience with modern smart technologies. Furthermore, I am committed to teaching foundational courses in Computer Networks and Cyber Security, ensuring students build a robust understanding of the infrastructure that powers and protects these systems. Scholarship Selected Recent Publications Geospatial Analysis of Wildfire Impact and Predictive Modeling of Susceptibility: A Case Study of Maui, Hawaii and California, 2025 Conference Proceeding UWB-PostureGuard: A Privacy-Preserving RF Sensing System for Continuous Ergonomic Sitting Posture Monitoring, 2025 Conference Proceeding A Multi-Temporal LiDAR-Derived Geospatial Dataset for Coastal Hazard Assessment, 2025 Conference Proceeding CochlearMotion: Head Gesture Recognition Leveraging Ear Canal De-formation Sensing, 2025 Conference Proceeding DynamicLip: Shape-Independent Continuous Authentication via Lip Articulator Dynamics, 2025 Journal Article, Academic Journal Research Interests Mobile and Wearable Computing, AI-Enhanced Human-Centric Sensing, Healthcare and Biometric Security, Human-Computer Interaction (HCI). Professional Service ACM CHI 2024 2023 - Present Role: Reviewer, Conference Paper CANS conference 2023 - Present Role: Committee Member IEEE TSMC 2023 - Present Role: Reviewer, Journal Article Sensors 2023 - Present Role: Reviewer, Journal Article IEEE Internet of Things Journal 2022 - Present Role: Reviewer, Journal Article",
  "content_length": 2659,
  "method": "requests",
  "crawl_time": "2025-12-01 14:55:51"
}