{
  "name": "Zidong Wang",
  "homepage": "https://www.brunel.ac.uk/people/zidong-wang",
  "status": "success",
  "content": "Professor Zidong Wang | Introduction | Brunel University London Skip to Content Home People Professor Zidong Wang Professor Zidong WangProfessor - Dynamic Systems and Computing Wilfred Brown Building 217 Email: zidong.wang@brunel.ac.uk Tel: +44 (0)1895 266021 Personal Website Computer Science College of Engineering, Design and Physical Sciences Summary Zidong Wang is a member of Academia Europaea, a Member of the European Academy of Sciences and Arts, an IEEE Fellow and Professor of Computing at Brunel University London, UK. He has research interests in intelligent data analysis, statistical signal processing and dynamic systems & control. He has been named as the Hottest Scientific Researcher in 2012 in the area of Big Data and listed as highly cited researchers in categories of both computer science and engineering in 2015-2020 with an h-index of 139. He is currently serving as the Editor-in-Chief for International Journal of Systems Science, the Editor-in-Chief for Neurocomputing, the Editor-in-Chief for Systems Science and Control Engineering, and Associate Editor for other 12 prestigious journals including 5 IEEE Transactions.  His research has been funded by the EU, the Royal Society and the EPSRC. Responsibility Chief/ Co-/Area/Subject/Action/Associate Editors: Editor-in-Chief for International Journal of Systems Science (Taylor & Francis)  (2021- ); Editor-in-Chief for Neurocomputing (Elsevier) (2016- ); Editor-in-Chief for Systems Science & Control Engineering (Taylor & Francis) (2012- ); Area Editor for Procedia Computer Science (Elsevier) (2021- ); Associate Editor for IEEE Transactions on Systems, Man, and Cybernetics - Systems (2013- ); Associate Editor for Science China Information Sciences (Springer) (2015- ); Associate Editor for IEEE/CAA Journal of Automatica Sinica (2017- ); Associate Editor for Control Theory and Technology (Springer) (2020- ); Associate Editor for IET Control Theory & Applications (Wiley) (2012-2021); Deputy Editor-in-Chief for International Journal of Systems Science (Taylor & Francis)  (2017- 2020); Action Editor for Neural Networks (Elsevier) (2006-2020); Co-Editor for International Journal of Systems Science (Taylor & Francis)  (2014-2016 ); Subject Editor for Journal of The Franklin Institute (Elsevier) (2015-2016); Associate Editor for IEEE Transactions on Automatic Control (2008-2013); Associate Editor for IEEE Transactions on Control Systems Technology (2005-2013); Associate Editor for IEEE Transactions on Neural Networks (2007- 2012); Associate Editor for IEEE Transactions on Systems, Man, and Cybernetics - Part C (2004-2012); Associate Editor for IEEE Transactions on Signal Processing (2003-2007); Associate Editor for Asian Journal of Control (Wiley) (2009-2016 ); Associate Editor for Circuits, Systems & Signal Processing (Springer) (2003-2009) 2. Editorial Board Members: Editorial Board Member for Information Fusion (Elsevier) (2017- ); Editorial Board Member for Complexity (Hindawi) (2018- ); Editorial Board Member for International Journal of General Systems (Taylor & Francis) (2006- ); Editorial Board Member for Neurocomputing (Elsevier) (2006-2015); Editorial Board Member for International Journal of Systems Science (Taylor & Francis) (2005-2013); Editorial Board Member for International Journal of Computer Mathematics (Taylor & Francis) (2006-2009); Editorial Board Member for book series of Studies in Autonomic, Data-driven and Industrial Computing (Springer) (2020-); Member of the Conference Editorial Board for the IEEE Control Systems Society (2003- 2010) 3. Memberships: Member of the Academia Europaea (2020- ); Member of the European Academy of Sciences and Arts (2021- ); Academician of the International Academy for Systems and Cybernetic Sciences (2021- ); Fellow of the IEEE (for contributions to networked control and complex networks) (2014- ); Fellow of the Chinese Association of Automation (2014- ); Member of the IEEE Press Editorial Board (2015- ); Member of the EPSRC Peer Review College of the UK (2012- ); Fellow of the Royal Statistical Society (2004- ); A regular reviewer for Mathematical Reviews (1996- ) Newest selected publications Jia, C., Wang, Z., Hu, J. and Dong, H. (2025) 'Reputation-based Distributed Filtering Over Sensor Networks Subject to Stochastic Nonlinearity and Network-Induced Quantization'. IEEE Transactions on Network Science and Engineering, 12 (6). pp. 4671 - 4684.Open Access Link Journal article Song, B., Zhao, S., Wang, Z., Liu, W. and Liu, X. (2025) 'DAF-DETR: A dynamic adaptation feature transformer for enhanced object detection in unmanned aerial vehicles'. Knowledge Based Systems, 323. pp. 1 - 13. ISSN: 0950-7051 Open Access Link Journal article Wang, Y., Lei, Y., Li, N., Feng, K., Wang, Z., Tan, Y. and Li, H. et al. (2025) 'Machinery Multimodal Uncertainty-Aware RUL Prediction: A Stochastic Modeling Framework for Uncertainty Quantification and Informed Fusion'. IEEE Internet of Things Journal, 12 (15). pp. 31643 - 31653.Open Access Link Journal article Wang, Y-A., Wang, Z., Zou, L. and Wang, F. (2025) 'Recursive Resilient State Estimation for Nonlinear Stochastic Complex Networks With Energy Harvesting Sensors Under Deception Attacks'. IEEE Transactions on Network Science and Engineering, 12 (5). pp. 4086 - 4097.Open Access Link Journal article Zhu, K., Wang, Z., Ding, D., Hu, J. and Dong, H. (2025) 'Proportional-Integral-Observer-Based Fusion Estimation for Artificial Neural Networks: Implementing a One-Bit Encoding Scheme'. IEEE Transactions on Neural Networks and Learning Systems, 36 (9). pp. 16253 - 16263. ISSN: 2162-237X Open Access Link Journal article More publications(1065)",
  "content_length": 5677,
  "method": "requests",
  "crawl_time": "2025-12-01 14:55:53"
}