{
  "name": "Zigui Jiang",
  "homepage": "https://ziguijiang.github.io",
  "status": "success",
  "content": "Welcome to Zigui Jiang's homepage Zigui Jiang School of Software Engineering Sun Yat-Sen University, China E-mail: jiangzg3@mail.sysu.edu.cn Other Sites: Google Scholar, DBLP, Researchgate Biography I'm currently working in the School of Software Engineering at Sun Yat-Sen University, China. I received the Ph.D degree in computer science and technology from the Beijing University of Posts and Telecommunications, Beijing, China, in 2019. I have worked as a postdoctoral fellow at Sun Yat-Sen University for years, under the supervision of Prof. Zibin Zheng. My research interests include blockchain, smart contract analysis and service recommendation. I am the associate editor of International Journal of Systems and Service-Oriented Engineering, and has served as Conference organizer and reviewer of some international conferences, including CollaborateCom 2022, ICSS 2022, BlockSys 2020, BlockSys 2019, IEEE Services 2020, IEEE SCC 2016, ICCSA 2016, CollaborateCom 2016. I also have served as reviewer of some international journals, such as TOSEM, IEEE TSC, ACM TSAS, PPNA, etc. I am looking for self-motivated students. Please drop me an email if you are interested in. Publications [ISSTA'23] Queping Kong, Jiachi Chen, Yanlin Wang, Zigui Jiang, and Zibin Zheng, “DeFiTainter: Detecting Price Manipulation Vulnerabilities in DeFi Protocols”, In the 32nd ACM SIGSOFT International Symposium on Software Testing and Analysis (ISSTA), 2023. [JIOT'23] Changlin Yang, Xiaodong Wang, Zigui Jiang, Ying Liu, Fengnian Lin, and Zibin Zheng. “On Min-Max Storage for Resource Restricted Clients in Coded Blockchain Systems”, IEEE Internet of Things Journal, 2023. [IEEE GCN'23] Huawei Huang, Yang Yang, Zigui Jiang, and Zibin Zheng, “Worker-Centric Model Allocation for Federated Learning in Mobile Edge Computing”, IEEE Transactions on Green Communications and Networking, 2023, 7(2):869-880. [IEEE OJCS'23] Peilin Zheng, Zigui Jiang, Jiajing Wu, and Zibin Zheng, “Blockchain-based Decentralized Application: A Survey”, IEEE Open Journal of the Computer Society, 2023. [IEEE CSClound'23] Peilin Zheng, Bowei Su, Zigui Jiang, Changlin Yang, Jiachi Chen, and Jiajing Wu. “Exploring Heterogeneous Decentralized Markets in DeFi and NFT on Ethereum Blockchain”, In the 10th IEEE International Conference on Cyber Security and Cloud Computing (CSCloud), 2023. [DCN'22] Zigui Jiang, Kai Chen, Hailin Wen, and Zibin Zheng, “Applying Blockchain-based Method to Smart Contract Classification for CPS Applications”, Digital Communications and Networks, 2022, pp.1-12. [IEEE TSC'22] Zigui Jiang, Zibin Zheng, Kai Chen, Xiapu Luo, Xiuwen Tang, and Yin Li. “Exploring Smart Contract Recommendation: Towards Eﬀicient Blockchain Development”. IEEE Transactions on Services Computing, pp.1-12. [EMSE'22] Zigui Jiang, Xiuwen Tang, Zibin Zheng, Jinyan Guo, Xiapu Luo, and Yin Li, “Calling Relationship Investigation and Application on Ethereum Blockchain Platform”. Empirical Software Engineering, pp.1-34. [ICSS'22] Xiuwen Tang, Jiazhen Gan, Zigui Jiang, “A Graph Neural Network-based Code Recommendation Method for Smart Contract Development”, In the 15th International Conference on Service Science, 2022: 248-254. [IEEE GreenCom'22] Zhirong Zhu, Jianzhong Su, Zigui Jiang, Mingxi Ye, Zibin Zheng, “Making Smart Contract Classification Easier and More Effective”. In the 18th IEEE International Conference on Green Computing and Communications, 2022: 228-230. [Sensors'21] Zigui Jiang, Rongheng Lin, and Fangchun Yang, “An Incremental Clustering Algorithm with Pattern Drift Detection for IoT-Enabled Smart Grid System”, Sensors, 2021, 21(19):6466. [BlockSys'20] Xiangping Chen, Queping Kong, Hao-Nan Zhu, Yixin Zhang, Yuan Huang, and Zigui Jiang, “Deciphering Cryptocurrencies by Reverse Analyzing on Smart Contracts”, In International Conference on Blockchain and Trustworthy Systems (BlockSys), 2020: 532-546. (Best Paper Award) [IEEE TII'18] Zigui Jiang, Rongheng Lin, Fangchun Yang and Budan Wu, “A Fused Load Curve Clustering Algorithm based on Wavelet Transform,” IEEE Transactions on Industrial Informatics, 2018, 14(5):1856-1865. [Energies'18] Zigui Jiang, Rongheng Lin, and Fangchun Yang, “A Hybrid Machine Learning Model for Electricity Consumer Categorization using Smart Meter Data”, Energies, 2018, 11(9):2235. [IJCNN'18] Zigui Jiang, Rongheng Lin, and Fangchun Yang, “Mining Daily Canonical Correlations among Multivariable Electricity, Gas and Climate data”, In the 2018 International Joint Conference on Neural Networks (IJCNN), 2018: 1-8. [ICA3PP'17] Zigui Jiang, Rongheng Lin, Fangchun Yang, Zhihan Liu, and Qiqi Zhang, “Comparing Electricity Consumer Categories based on Load Pattern Clustering with Their Natural Types”, In the 17th International Conference on Algorithms and Architectures for Parallel Processing (ICA3PP), 2017:658-667. [SCC'16] Zigui Jiang, Ao Zhou, Shangguang Wang, Qibo Sun, Rongheng Lin, and Fangchun Yang, “Personalized Service Recommendation for Collaborative Tagging Systems with Social Relations and Temporal Influences”, In the 2016 IEEE International Conference on Services Computing (SCC), 2016: 786-789. Journal/Conference Reviewers IEEE Transactions on Services Computing ACM Transactions on Software Engineering and Methodology IEEE Transactions on Network and Service Management IEEE ACCESS ACM Transactions on Spatial Algorithms and Systems Peer-to-Peer Networking and Applications Transactions on Cloud Computing",
  "content_length": 5452,
  "method": "requests",
  "crawl_time": "2025-12-01 14:55:52"
}