{
  "name": "Zih-Yun Chiu",
  "homepage": "https://sarahchiu.github.io",
  "status": "success",
  "content": "Zih-Yun (Sarah) Chiu Zih-Yun (Sarah) ChiuIncoming Assistant Professor at Johns Hopkins University | PhD, UC San Diego Follow La Jolla, California ResearchGate LinkedIn Github Google ScholarAbout me [CV]I will join the Department of Computer Science at Johns Hopkins University as a tenure-track assistant professor starting in Fall 2025. I am actively recruiting students at all levels (undergraduate, master’s, and Ph.D.)! If you are interested in joining my research group, please read this page and contact me by email.I am an incoming assistant professor at the Department of Computer Science at Johns Hopkins University. I received my Ph.D. in Electrical and Computer Engineering at the University of California San Diego, where I was advised by Michael Yip.My goal is to develop the next generation of intelligent robots that can see, plan, move, and learn as skilled medical professionals. My research tackles four fundamental challenges:How can robots understand medical environments?How can medical knowledge inform robots’ movements?How can robots learn medical skills by observing others and continuously accumulating their knowledge over time?How can the precision, dexterity, and intelligence pioneered in medical robotics create more capable robots everywhere?I aim to answer these questions from the following two perspectives:The mathematical modeling of various medical and general knowledge and how these models empower robots with the ability to operate in complex medical environments with precision, safety, and efficiencyThe seamless integration of robotic perception, planning, control, and learning that unlocks the full potential of autonomous agents in challenging and dynamic settingsNewsJun. 2025: I will attend RSS at USC.Jun. 2025: I successfully defended my PhD dissertation, Advancing Robot Sensing, Planning, and Adaptability for Autonomous Medical Interventions!Apr. 2025: I was selected as an RSS Pioneer!Oct. 2024: I will attend the Rising Stars in EECS Workshop at MIT!Sep. 2024: Our paper on Incremental RL for Automating Multiple Surgical Tasks is now published.Jul. 2024: Our paper on SURESTEP: An Uncertainty-Aware Trajectory Optimization Framework to Enhance Visual Tool Tracking for Robust Surgical Automation is accepted to IROS 2024!Apr. 2024: Our paper on Uncertainty-Aware Trajectory Optimization for Robust Surgical Automation is now published.Dec. 2023: We release the implementation of Knowledge-Grounded RL algorithms on GitHub.Sep. 2023: Our paper on Flexible Attention-Based Multi-Policy Fusion for Efficient Deep Reinforcement Learning is accepted to NeurIPS 2023!",
  "content_length": 2618,
  "method": "requests",
  "crawl_time": "2025-12-01 14:55:52"
}