{
  "name": "Zijun Cui",
  "homepage": "https://zijunjkl.github.io",
  "status": "success",
  "content": "Zijun Cui (崔梓筠) Zijun Cui (崔梓筠) cuizijun@msu.edu LinkedIn Twitter GitHub Google Scholar I am an assistant professor in the Department of Computer Science and Engineering at Michigan State University, starting in Fall 2024. Prior to this, I was a postdoctoral researcher at University of Southern California. I obtained my doctoral degree from Rensselaer Polytechnic Institute. I am looking for highly motivated PhD students to join my lab in Spring or Fall 2026, as well as research interns. To apply, please send your CV and a short statement of interest to cuizijun@msu.edu. Research Interests Knowledge-augmented Deep Learning, including Physics-informed Deep Learning and Neural Symbolic Integration Probabilistic Graphical Models Computer Vision AI for Health Education Ph.D. in Computer Engineering, Rensselaer Polytechnic Institute M.S. in Engineering, Brown University B.S. in Physics, University of Science and Technology of China (USTC) News Sep 25, 2024 One paper on Sample-efficient Simulation-based Inference has been accepted for publication at NeurIPS 2024 Apr 8, 2024 Our paper “Capturing Relationships between Suturing Sub-skills to Improve Automatic Suturing Assessment” is accepted to npj Digital Medicine. Apr 6, 2024 I gave a talk at the Women in Data Science (WiDS) Youth event Selected Papers CVPR Biomechanics-guided Facial Action Unit Detection through Force Modeling Zijun Cui, Chenyi Kuang, Tian Gao, Kartik Talamadupula, and Qiang Ji In Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition, 2023 Bib PDF @inproceedings{cui2023biomechanics, title = {Biomechanics-guided Facial Action Unit Detection through Force Modeling}, author = {Cui, Zijun and Kuang, Chenyi and Gao, Tian and Talamadupula, Kartik and Ji, Qiang}, booktitle = {Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition}, pages = {8694--8703}, year = {2023}, } IEEE TNNLS Knowledge-Augmented Deep Learning and Its Applications: A Survey Zijun Cui, Tian Gao, Kartik Talamadupula, and Qiang Ji IEEE Transactions on Neural Networks and Learning Systems, 2023 Bib PDF Supp @article{10359123, author = {Cui, Zijun and Gao, Tian and Talamadupula, Kartik and Ji, Qiang}, journal = {IEEE Transactions on Neural Networks and Learning Systems}, title = {Knowledge-Augmented Deep Learning and Its Applications: A Survey}, year = {2023}, pages = {1-21}, doi = {10.1109/TNNLS.2023.3338619}, } CVPR PhysPT: Physics-aware Pretrained Transformer for Estimating Human Dynamics from Monocular Videos Yufei Zhang, Jeffrey O. Kephart, Zijun Cui, and Qiang Ji Computer Vision and Pattern Recognition Conference (CVPR), 2024 Bib PDF @article{zhang2024CVPR, title = {PhysPT: Physics-aware Pretrained Transformer for Estimating Human Dynamics from Monocular Videos}, author = {Zhang, Yufei and Kephart, Jeffrey O. and Cui, Zijun and Ji, Qiang}, journal = {Computer Vision and Pattern Recognition Conference (CVPR)}, year = {2024}, }",
  "content_length": 2957,
  "method": "requests",
  "crawl_time": "2025-12-01 14:55:53"
}