{
  "name": "Ziliang Zong",
  "homepage": "http://cs.txstate.edu/~zz11",
  "status": "success",
  "content": "Ziliang Zong - Texas State University College of Science and Engineering Department of Computer Science E-mail: ziliang@txstate.edu I am a Professor of the Computer Science Department. I received the Distinguished Ph.D. Dissertation Award from Auburn University (2008), Texas State University Presidential Award for Excellence in Scholarly/Creative Activities (2015), and the Texas State University Presidential Distinction Award for Excellence in Scholarly/Creative Activities (2020). I am a general member of the Green Software Foundation. My research focuses on Energy-Efficient Computing and Systems, including Green Software Design, Green AI, Green Cloud, and Green Data Center. We welcome qualified and self-motivated students to join our group. Congratulations Congratulations for Stuart, Sarah, Andi, Jonathan, Sang, Divya, Keshav, and Cody received job offers from Google, Intel, Apple, Amazon, LinkedIn, Dell, Tesla, and Databricks! Congratulations for Aaron's and Jonas's internships at Google and Dell! NSF Project Funded (Oct. 2019 - Sep. 2023) Our research project \"Interpretable Multi-Modal Neural Network Pruning for Edge Devices\" has been funded by the NSF CISE CNS program. More details... NSF Project Funded (Feb. 2015 - Jan. 2016) Our I-Corps project \"I-Corps: GreenSoft: A Cloud Based Framework for Green Software Design and Education\" has been funded by the NSF I-Corps Teams program. More details... NSF Project Funded (Sep. 2013 - Aug. 2018) Our research project \"Marcher - A Heterogeneous High Performance Computing Infrastructure for \t\t\tResearch and Education in Green Computing\" has been funded by the NSF CISE CRI program. More details... NSF Project Funded (Sep. 2011 - Nov. 2014) Our research project \"FastStor: Data-Mining-Based Multilayer Prefetching for Hybrid Storage Systems\" has been funded by the NSF CISE CNS program. More details... NSF Project Funded (Sep. 2011 - Aug. 2013) Our research project \"EEDAG: Exploring Energy-Efficient Parallel Tasks Generation and Scheduling for Heterogeneous Multicore Systems\"has been funded by the NSF CISE CNS program. More details... Two LLMs Papers Published (11/2025) Two research papers on improving the quality of code generated by LLMs have been published by ICPC and IPCCC. IEEE Transaction Paper Published (09/2025) Our paper on measuring energy consumption of software running on cloud has been published by the IEEE Transactions on Sustainable Computing. Two IGSC Papers Published (11/2024) Two research papers on evaluating the energy efficiency of LLM generated code and modeling the energy consumption of programs in VSCode have been published by IGSC. Two LLMs Papers Published (11/2023) Two research papers on the carbon impact of Large Language Models inference and training have been published by IPCCC and IGSCC. Three ECCV Papers Published (08/2022) Three research papers on AI and computer vision have been published by the European Conference on Computer Vision (ECCV'22). ICASSP  Paper Published (05/2022) Our paper on winning the lottery ticket via fourier analysis has been published by the IEEE International Conference on Acoustics, Speech and Signal Processing (ICASSP'22). Teaching CS1428 CS2308 CS4328 CS7333 Research Current Projects Completed Projects Publications Journal Papers Conf/Workshop Papers Students Current Students Student Alumni Software EEDAG: Power-Aware Scheduling FastStor: VisEROS Number Of Visits",
  "content_length": 3420,
  "method": "requests",
  "crawl_time": "2025-12-01 14:56:00"
}