{
  "name": "Zimeng Zhou",
  "homepage": "https://faculty.sdu.edu.cn/zhouzimeng1/en/index.htm",
  "status": "success",
  "content": "山东大学教师主页 周梓梦 Home Home Login   | SDU   | 中文 X9zsQ4rjAT1bcebofSjDG8ldzZ9y07a05of975eB7a2FNrPjNwfd9IsZ5zNb 周梓梦 Associate Professor School of Cyber Science and Technology Visit:次 Personal Information Name (Pinyin): Zhou Zimeng E-Mail: ad6322b307a6b0049ce38547eb000ef83701f19421438616a5e562055c6acc751ab1dac500594d236ff90fbeb8249dfd8f960a053cad85825de8e52ffcd1a35fadbba5cc60c5778ce96d4e0bba52cbea42618c7855a5509865b873099a81c26644a5bb5e1aad95db67e2ee9592ab486492237be16d12b45cc4b2583bc403e442 Date of Employment: 2020-08-05 School/Department: 网络空间安全学院（研究院） Education Level: With Certificate of Graduation for Doctorate Study Business Address: 山东省青岛市即墨滨海路72号山东大学青岛校区淦昌苑D座 Gender: Male Degree: Doctoral Degree in Engineering Status: Employed Alma Mater: 香港城市大学 Supervisor of Master's Candidates Biography 博士，山东大学网络空间安全学院副教授，分别于2015年和2020年在山东大学和香港城市大学获得硕士和博士学位。主要研究方向为物联网系统优化设计、嵌入式系统和无线传感器网络、系统架构及安全性。 在存储架构及数据挖掘、物联网及边缘计算、系统架构及安全性领域的国际重要学术会议（如RTSS、DAC、ICDE）和期刊（如IEEE Transactions on computer-aided design of Integrated Circuits and Systems、IEEE Transactions on Knowledge and Data Engineering）发表高水平论文十余篇。担任中国计算机学会嵌入式系统专委会委员。近年来作为项目负责人承担的国家级科研课题1项，省部级科研课题1项。担任IEEE Transactions on computer-aided design of Integrated Circuits and Systems (TCAD), IEEE/ACM Transactions on Networking(TON), ACM Transactions on Embedded Computing Systems (TECS)等国际期刊审稿人。 Education 2016-07 — 2020-07 香港城市大学 计算机科学 Doctor 2012-09 — 2015-07 山东大学 计算机科学与技术 Master 2008-09 — 2012-07 沈阳航空航天大学 计算机科学与技术 工学学士 Publication Research Direction 1. 网络与系统安全 2. 物联网与边缘计算 Paper Publications 1. . FPGA-TrustZone: Security Extension of TrustZone to FPGA for SoC-FPGA Heterogeneous Architecture .Proceedings - Design Automation Conference.2025 2. 许硕. Cache-aware Task Decomposition for Efficient Intermittent Computing Systems .Proceedings - Design Automation Conference.2024 (1) 3. 杜泽林. AcceleratingDNN Inference with Heterogeneous Multi-DPU Engines. .the ACM/IEEE Design Automation Conference (DAC).2023 (1) 4. 周梓梦. Maintaining Real-Time Data Freshness in Wireless Powered Communication Networks .The IEEE Real-Time Systems Symposium.2020 (12) 5. . Work or Sleep: Freshness-Aware Energy Scheduling for Wireless Powered Communication Networks with Interference Consideration .the ACM/IEEE Design Automation Conference (DAC).2023 (7) 6. 周梓梦. Optimizing Worst-Case Data Freshness in RF-Powered Networked Embedded Systems .IEEE Transactions on Computer-Aided Design of Integrated Circuits And System.2023 (一月) 7. 张伟. Adaptive Task-based Intermittent Computing System with Parallel State Backup .IEEE Transactions on Computer-Aided Design of Integrated Circuits And System.2022 (3213989) 8. 周梓梦. Maintaining Real-Time Data Freshness in Wireless Powered Communication Networks .2020 9. Energy-Constrained Data Freshness Optimization in Self-Powered Networked Embedded Systems .IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems (TCAD).2019 10. Transmit or Discard: Optimizing Data Freshness in Networked Embedded Systems with Energy Harvesting Sources .ACM/IEEE Design Automation Conference (DAC).2019 11. A hardware-accelerated solution for hierarchical index-based merge-join .IEEE Transactions on Knowledge and Data Engineering (TKDE).2018 Patents 1. 基于新鲜度感知的无线供能通信网络能量调度方法及系统 Research Projects 1. RISC-V CoVE架构预研内存隔离框架, 2025-04-30-2026-02-28 2. （包干项目）面向间歇计算的物联网智能感知与融合关键技术研究, 2025-01-01-2027-12-31 3. 基于GPU的CKKS Bootstrapping 加速技术研究, 2025-01-01-2025-12-31 4. 面向全同态加密的跨硬件平台编译框架研究, 2023-08-24-2027-12-31 5. 车联网场景下面向间歇计算的设备智能控制, 2023-01-01-2025-10-31 6. （包干项目）基于无线供能的物联网边缘计算架构关键技术研究, 2021-12-23-2024-12-31 7. （包干项目）面向间歇性计算的边端协同策略设计与优化, 2021-10-12-2024-12-31 8. 基于 FPGA 的物联网边缘节点目标检测关键技术研究, 2020-12-16-2022-12-31 9. 山东省网络空间安全技术创新中心-2, 2020-01-01-2022-12-31 Student Information 1.殷祥凯 2.王舒晨 3.马立峰 4.王文凯 5.匡欣舒 6.范新东 7.王淑鹏 Copyright All Rights Reserved Shandong University Address: No. 27 Shanda South Road, Jinan City, Shandong Province, China: 250100Information desk: (86) - 0531-88395114On Duty Telephone: (86) - 0531-88364731 Construction and Maintenance: Information Work Office of Shandong University TOP",
  "content_length": 4077,
  "method": "requests",
  "crawl_time": "2025-12-01 14:55:54"
}