{
  "name": "Zirui Zhuang",
  "homepage": "https://ziruizhuang.github.io",
  "status": "success",
  "content": "Zirui Zhuang 511 Research Building XiTuCheng Rd. #10 Beijing, China, 100876 Dr. Zirui Zhuang (Associate Professor, PhD supervisor, MSc supervisor, Pioneering Scholar) is currently with the State Key Laboratory of Networking and Switching Technology[中文][English] and the School of Computer Science, Beijing University of Posts and Telecommunications (BUPT). He was also with the Institute of Network Technology from 2015 to 2020. Please see official page at [中文][English]. He is currently an full-time associate professor, and supervisor for PhD and MSc students. He received his B.Eng. in electronic information engineering, and Ph.D. in information and communication engineering from Beijing University of Posts and Telecommunications[中文][English], in 2015 and 2020, respectively. He is advised by Professor Jingyu Wang during the course of his Ph.D. study. In 2019, he visited the Department of Electrical and Computer Engineering, University of Houston, doing research on network routing and optimization, advised by Professor Zhu Han. His research interests include network routing and management for next generation network infrastructures, using machine learning and artificial intelligence techniques, including deep learning, reinforcement learning, graph representation, multi-agent system, and Lyapunov-based optimization. Recently, he has been focusing on the design of Knowledge-Defined Networking (KDN) framework which employs artificial intelligence (AI) for the next-generation networks (AI4Network), in settings of wired computer networks as well as wireless communication networks. The integration of knowledge promotes profound intelligence in networked systems by acquisition, extraction, optimization, and application of the best practices of network control and resource management. This new paradigm demands for more advanced theory, techniques, and procedures in the aspects of sensing, modelling, decision making, and interpretation, where the combination of human intelligence and artificial intelligence is a must. While there has been a trending research interest over the convergence of communication, computation, and control, the era of KDN and AI4Network is still at its early stage. There are broad but challenging research opportunities to be explored. He is an active member of computer communication and signal processing communities. He joined the IEEE as a Graduate Student Member in 2018, and he became a professional Member in 2020. He is a reviewer for many high impact journals and international conferences, such as Journal reviewer IEEE Journal on Selected Areas in Communications IEEE Internet of Things Journal IEEE Internet of Things Magazine IEEE Systems Journal IEEE Transactions on Mobile Computing IEEE Transactions on Network Science and Engineering IEEE/ACM Transactions on Networking IEEE Communications Letters Future Generation Computer Systems Knowledge-Based Systems Artificial Intelligence in Medicine Ad Hoc & Sensor Wireless Networks Journal of Communications and Networks Springer Journal of Cloud Computing: Advances, Systems and Applications Scientific Reports SN Applied Sciences Results in Control and Optimization Conference reviewer ACM ICMR 2023, 2024, 2025 ACM KDD 2024, 2025 ACM MM 2023, 2024 ACM UIST 2023 DASFAA 2024, 2025 ECMLPKDD 2023, 2024, 2025 IEEE Globecom 2023, 2024 IEEE ICCC 2020 IEEE PIMRC 2024 IEEE WCNC 2021(Workshops), 2022, 2024, 2025 MobiQuitous 2019 ITU-K 2024 news Nov 21, 2025 One of our paper has been accepted by IEEE Transactions on Dependable and Secure Computing. [CCF A] Oct 21, 2025 One of our paper has been accepted by 20th EAI International Conference on Communications and Networking in China (ChinaCom’25). Sep 19, 2025 Three of our papers have been accepted by 2025 Thirty-seventh Conference on Neural Information Processing Systems (NeurIPS’25). [CCF A] Aug 21, 2025 One of our paper has been accepted by 2025 Conference on Empirical Methods in Natural Language Processing (EMNLP’25). [CCF B] Aug 02, 2025 One of our paper has been accepted by ACM Transactions on Knowledge Discovery from Data. [CCF B] Jul 25, 2025 One of our paper has been accepted by 44th International Symposium on Reliable Distributed Systems (SRDS). [CCF B] Jul 06, 2025 One of our paper has been accepted by 2025 ACM Multimedia (MM). [CCF A] Jun 27, 2025 One of our paper has been accepted by IEEE Transactions on Neural Networks and Learning Systems. [CCF B] May 26, 2025 One of our paper has been accepted by ACM Transactions on Knowledge Discovery from Data. [CCF B] Apr 29, 2025 One of our paper has been accepted by 2025 The 34th International Joint Conference on Artificial Intelligence (IJCAI’25). [CCF A] Apr 25, 2025 One of our paper has been accepted by 2025 USENIX Annual Technical Conference (ATC’25). [CCF A] Apr 22, 2025 One of our paper has been accepted by IEEE Transactions on Mobile Computing. [CCF A] Apr 07, 2025 One of our paper has been accepted by IEEE Transactions on Intelligent Transportation Systems. [一区 / CCF B] Mar 27, 2025 One of our paper has been accepted by IEEE Communications Magazine. [Q1 / 二区] Mar 21, 2025 One of our paper has been accepted by IEEE International Conference on Multimedia and Expo (ICME). [CCF A] Feb 27, 2025 One of our paper has been accepted by 2025 IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR). [CCF A] Feb 09, 2025 One of our workshop paper has been accepted by IEEE International Conference on Computer Communications (INFOCOM’25). Jan 25, 2025 One of our paper has been accepted by The 30th International Conference on Database Systems for Advanced Applications (DASFAA’25). [CCF B] latest posts selected publications IWQoS CORE B CCF B Beyond Throughput-Optimal: Second-Order Smooth Backpressure Algorithm for Reducing Jitter and Delay Yuexi Yin, Zirui Zhuang, Jingyu Wang, Qi Qi, Haifeng Sun, Xiaoyuan Fu, and Jianxin Liao In IEEE/ACM 32nd International Symposium on Quality of Service (IWQoS’24), Jun 2024 DOI TMC 二区 Q1 CCF A Slice Sandwich: Jagged Slicing Multi-tier Dynamic Resources for Diversified V2X Services Yu Liu, Zirui Zhuang, Qi Qi, Jingyu Wang, Dezhi Chen, Lu Lu , Hongwei Yang, Jianxin Liao, and Zhu Han IEEE Transactions on Mobile Computing, May 2024 DOI IPDPS CORE A CCF B Fast Policy Convergence for Traffic Engineering with Proactive Distributed Message-Passing Zicheng Wang, Zirui Zhuang, Jingyu Wang, Qi Qi, Haifeng Sun, and Jianxin Liao In 38th IEEE International Parallel & Distributed Processing Symposium (IPDPS’24), May 2024 DOI INFOCOM CORE A* CCF A Efficient Throughput and Loop-Free Routing: An Adaptive Second-Order Backpressure Algorithm Yuexi Yin, Zirui Zhuang, Jingyu Wang, Qi Qi, Haifeng Sun, Xiaoyuan Fu, and Jianxin Liao In IEEE INFOCOM 2024 Poster, May 2024 DOI NSDI CCF A EPVerifier: Accelerating Update Storms Verification with Edge-Predicate Chenyang Zhao , Yuebin Guo, Jingyu Wang, Qi Qi, Zirui Zhuang, Haifeng Sun , Lingqi Guo, Yuming Xie, and Jianxin Liao In The 21st USENIX Symposium on Networked Systems Design and Implementation (NSDI’24), Apr 2024 DOI ComMag 一区 Q1 Toward High-Powered Connected Autonomous Vehicles: A Cooperative Solution via Transient Edge Intelligence Provision Yu Liu, Jingyu Wang, Qi Qi, Zirui Zhuang, Jianxin Liao, and Zhu Han IEEE Communications Magazine, Dec 2023 DOI NeurIPS CORE A* CCF A Drift doesn’t Matter: Dynamic Decomposition with Diffusion Reconstruction for Unstable Multivariate Time Series Anomaly Detection Chengsen Wang, Zirui Zhuang, Qi Qi, Jingyu Wang , Xingyu Wang, Haifeng Sun, and Jianxin Liao In Thirty-seventh Conference on Neural Information Processing Systems (NeurIPS’23), Dec 2023 DOI SIGCOMM P&D CORE A CCF A Poster: PipeLLM: Pipeline LLM Inference on Heterogeneous Devices with Sequence Slicing Ruilong Ma, Jingyu Wang, Qi Qi , Xiang Yang, Haifeng Sun, Zirui Zhuang, and Jianxin Liao In SIGCOMM’23 Posters and Demos, Sep 2023 DOI Deep Reinforcement Learning for Network Intelligence Qi Qi, Xiaoyuan Fu, Zirui Zhuang, Jingyu Wang, and Jianxin Liao Apr 2023 ToN 二区 Q1 CCF A Standing on the Shoulders of Giants: Cross-Slice Federated Meta Learning for Resource Orchestration to Cold-Start Slice Tianjian Dong, Qi Qi, Jingyu Wang, Zirui Zhuang, Haifeng Sun, Jianxin Liao, and Zhu Han IEEE/ACM Transactions on Networking, Apr 2023 Online August 2022 DOI TCCN 二区 Q1 Intelligent Joint Network Slicing and Routing via GCN-powered Multi-Task Deep Reinforcement Learning Tianjian Dong, Zirui Zhuang, Qi Qi, Jingyu Wang, Haifeng Sun, F. Richard Yu , Tao Sun, Cheng Zhou, and Jianxin Liao IEEE Transactions on Cognitive Communications and Networking, Jun 2022 Online Dec. 2021. DOI ICMR CORE B CCF B FedNKD: A Dependable Federated Learning Using Fine-tuned Random Noise and Knowledge Distillation Shaoxiong Zhu, Qi Qi, Zirui Zhuang, Jingyu Wang, Haifeng Sun, and Jianxin Liao In 2022 ACM International Conference on Multimedia Retrieval (ICMR’22), Jun 2022 DOI 通信学报 CIC T1 CCF T1 Research on a knowledge-defined polymorphic network attainable service architecture Jingyu Wang, and Zirui Zhuang Journal on Communications, Apr 2022 High PCSI DOI Received the High PCSI Paper from CNKI for 2025-01 to 2025-02 period JIoT 一区 Q1 Adaptive and Robust Routing with Lyapunov-Based Deep RL in MEC Networks Enabled by Blockchains Zirui Zhuang, Jingyu Wang, Qi Qi, Jianxin Liao, and Zhu Han IEEE Internet of Things Journal, Feb 2021 Online Oct. 2020 DOI JSTSP 一区 Q1 Tensor-Based Reinforcement Learning for Network Routing Kai-Chu Tsai, Zirui Zhuang, Ricardo Lent, Jingyu Wang, Qi Qi , Lichun Wang, and Zhu Han IEEE Journal of Selected Topics in Signal Processing, Feb 2021 Online Feb. 2021. DOI JIoT 一区 Q1 Mean Field Deep Reinforcement Learning for Fair and Efficient UAV Control Dezhi Chen, Qi Qi, Zirui Zhuang, Jingyu Wang, Jianxin Liao, and Zhu Han IEEE Internet of Things Journal, Jan 2021 Online July 2020 DOI ISJ 一区 Q1 Toward Greater Intelligence in Route Planning: A Graph-Aware Deep Learning Approach Zirui Zhuang, Jingyu Wang, Qi Qi, Haifeng Sun, and ",
  "content_length": 11472,
  "method": "requests",
  "crawl_time": "2025-12-01 14:55:59"
}