{
  "name": "Ziv Goldfeld",
  "homepage": "https://people.ece.cornell.edu/zivg",
  "status": "success",
  "content": "Ziv Goldfeld Home Teaching Biography Research Interests Publications Talks Ziv Goldfeld Ziv Goldfeld Associate Professor School of Electrical & Computer Engineering Cornell University I am an Associate Professor at the School of Electrical and Computer Engineering, and a graduate field member of Computer Science, Statistics and Data Science, Operations Research and Information Engineering, and the Center of Applied Mathematics at Cornell University. I am also a member of the Foundations of Information, Networks, and Decision Systems (FIND) group. I was a postdoctoral fellow in the Laboratory for Information and Decision Systems (LIDS) at MIT. Before that, I received my B.Sc., M.Sc. (both summa cum laude) and Ph.D. in the Department of Electrical and Computer Engineering at Ben Gurion University of the Negev. My research is supported by the NSF CAREER Award, an NSF DMS Grant, an NSF-BSF CIF Grant, and the IBM 2020 University Award. Graduate Students and Postdocs Ph.D. Students: Venkatkrishna Karumanchi Zhengxin Zhang Alumni: Gabriel Rioux (Chapman Postdoc Fellow in Statistics at Imperial College London) Haiyun He (Assistant Professor, Hong Kong University of Science and Technology in Guangzhou) Sloan Nietert (Postdoc at EPFL) Sreejith Sreekumar (Assistant Professor, Centralesupelec, University Paris-Saclay) Theshani Nuradha (Postdoc at UIUC) Research Interests I study mathematical and algorithmic foundations of machine learning and AI by integrating ideas from optimal transport theory, information theory, mathematical statistics, optimization, and applied probability. Some specific interests include: Optimal transport theory and Gromov-Wasserstein alignment: geometry, statistics, and computation (seminars I gave on smooth and sliced optimal transport, and one on GW geometry, statistics, and computation). Information theory for learning and privacy (seminars on information flows in deep neural nets and sliced mutual information; also, a lecture on information-theoretic security I gave at Stanford's Science of Information course and a podcast by the students). Robust statistics and decision-making, private computation. Quantum divergences and information measures. Contact Information: Office: Frank H. T. Rhodes Hall, Room 335 Email: goldfeld {at} cornell.edu Webpage: http://people.ece.cornell.edu/zivg/ Due to the large volume of emails that I receive, I typically cannot respond to unsolicited inquiries about student or postdoc openings, or research advice. Nevertheless, if you have a strong quantitative background and think your interests are aligned with mine, please feel free to contact me.",
  "content_length": 2636,
  "method": "requests",
  "crawl_time": "2025-12-01 14:56:00"
}