{
  "name": "Ziwei Liu 0002",
  "homepage": "https://liuziwei7.github.io/index.html",
  "status": "success",
  "content": "Ziwei Liu - Homepage Home  · Research  · Publications  · Softwares  · Team  · Services  · Awards Ziwei Liu 刘子纬 Associate Professor College of Computing and Data Science Nanyang Technological University Email: ziwei.liu at ntu.edu.sg Google Scholar GitHub Twitter Short Bio Prof. Ziwei Liu is an Associate Professor at MMLab@NTU, College of Computing and Data Science in Nanyang Technological University, Singapore. Previously, he was a research fellow in Chinese University of Hong Kong with Prof. Dahua Lin and a post-doc researcher in University of California, Berkeley with Prof. Stella Yu. His research interests include computer vision, machine learning and computer graphics. Ziwei received his Ph.D. (2013-2017) from Multimedia Lab, CUHK, advised by Prof. Xiaoou Tang and Prof. Xiaogang Wang. He is fortunate to have internships at Microsoft Research and Google Research. Ziwei is the recipient of PAMI Mark Everingham Prize, MIT TR Innovators under 35 Asia Pacific, ICBS Frontiers of Science Award, CVPR Best Paper Award Candidate, Asian Young Scientist Fellowship and Singapore President's Young Scientist Award. His works have been transferred to products, including Microsoft Pix, SenseGo and Google Clips. News [Twitter] [2025-11] Penghao is awarded ByteDance PhD Fellowship 2025. [2025-10] Invited talk (slides) at ACM MM 2025 Workshop on Large Generative Models. [2025-10] Ziang is awarded Google PhD Fellowship 2025. [2025-10] Invited talk (slides) at ICCV 2025 Workshop on Egocentric Body Motion Tracking, Synthesis. [2025-10] Invited talk (slides) at ICCV 2025 Workshop on Interactive Human-centric Foundation Models. [2025-10] Invited talk (slides) at ICCV 2025 Workshop on Multimodal Continual Learning. [2025-10] Invited talk (slides) at ICCV 2025 Tutorial on Reasoning in Vision-Language Models. [2025-10] VChain is selected as ICCV 2025 KnowledgeMR Workshop Outstanding Paper Award. [2025-10] CelebA is awarded CCF-CV Test of Time Award. [2025-10] Singapore President's Young Scientist Award. [2025-10] Invited talk (slides) at Mini3DV 2025. [2025-09] We are hosting ICCV 2025 Video-TT Challenge. [2025-09] Weichen and Mutian are recognized as ICCV 2025 Outstanding Reviewers. [2025-09] Yuming is awarded CCDS Outstanding PhD Thesis Award (Honourable Mention). [2025-08] Video-MMMU is covered in OpenAI GPT-5 Public Release. [2025-07] Evaluation Agent is selected as ACL 2025 SAC Highlights Award. [2025-07] CoOp is selected as WAIC 2025 Youth Outstanding Paper Award. [2025-06] Invited talk (slides) at CVPR 2025 Workshop on Efficient and On-Device Generation. [2025-06] Invited talk (slides) at CVPR 2025 Workshop on Human Motion Generation. [2025-06] We are organizing CVPR 2025 Tutorial on From Video Generation to World Model. [2025-06] Invited talk (slides) at VALSE 2025. [2025-06] We are hosting IROS 2025 RoboSense Challenge.",
  "content_length": 2856,
  "method": "requests",
  "crawl_time": "2025-12-01 14:55:59"
}