{
  "name": "Ziwei Zhu 0001",
  "homepage": "https://zziwei.github.io",
  "status": "success",
  "content": "Ziwei Zhu - George Mason University Ziwei Zhu (竺子崴) Assistant Professor Department of Computer Science George Mason University Office: Engineering Building 4609 Email: zzhu20 'at' gmu.edu Google Scholar, Semantic Scholar, DBLP, GitHub Howdy! I am an Assistant Professor in the Department of Computer Science at George Mason University. I got my Ph.D. from the Computer Science & Engineering Department at Texas A&M University, advised by Prof. James Caverlee. Before that, I obtained my Bachelor's degree in Computer Science from Wuhan University. I am broadly interested in data mining, machine learning, and natural language processing, with a specific focus on enhancing fairness, interpretability, reliability, and robustness to achieve trustworthy and responsible AI. I am looking for self-motivated PhD students. If you are interested, please contact me. For Prospective Students For prospective PhD students: I am looking for highly self-motivated PhD students. If you are interested in working with me, please email me with your CV, transcript, a description of your research interests and experience, and your writting samples (e.g., publications, dissertations, project reports, and so on). Please start your email subject with \"[Prospective PhD Student - ${Your_Application_Semester}]\". News 11/2025: One paper is accepted to WACV 2026. Congratulations to my student Mehrdad, and all collaborators! 11/2025: One paper is accepted to AAAI 2026. Congratulations to my students Bowen and Jinhao, and all collaborators! 11/2025: Two papers (one oral and one poster) are accepted to AAAI 2026. Congratulations to my students Bowen and Jinhao, and all collaborators! 10/2025: Invited to be an Area Chair for ACL Rolling Review. 10/2025: Invited to be a PC member for the Web conference 2026. 10/2025: Invited to be a reviewer for CVPR 2026. 09/2025: A paper is accepted to NeurIPS 2025 Workshop on Bridging Language, Agent, and World Models for Reasoning and Planning. 09/2025: A paper is accepted to NeurIPS 2025 LLM Evaluations Workshop. 09/2025: A paper is accepted to NeurIPS 2025 MLxOR Workshop. 09/2025: Invited to be a reviewer for ICLR 2026. 09/2025: Two papers are accepted to EMNLP 2025 finding, congratulations to my students Jinhao, Chahat, and all collaborators! 08/2025: Gave a talk about social bias in generative AI at CIP-CAR workshop on AI at VT. 08/2025: Invited to be a Senior PC for PAKDD 2025. 07/2025: Received a grant from NSF -- \"III: Small: Harnessing Interpretable Neuro-Symbolic Learning for Reliable Ranking\". Many thanks to NSF! 07/2025: Invited to be a PC for AAAI 2026. 05/2025: Two papers about interpretable text classification and Spurious Correlations are accepted to ACL 2025, congratulations to my student Bowen and Fardin! 04/2025: Gave a talk about social bias in generative AI at CCI Symposium 2025. 04/2025: Gave talks about social bias in generative AI at GW and VT. 03/2025: Invited to be a Senior PC for CIKM 2025. 02/2025: Invited to be a reviewer for NeurIPS and RecSys 2025. 01/2025: A paper about addressing spurious correlations in classification is accepted to NAACL 2025, congratulations to my student Yuqing! 12/2024: Invited to be a reviewer for ICML 2025. 11/2024: A paper about Cultural Adaptation with Large Multimodal Models is accepted to 2025 WACV, congratulations to my student Anjishnu and all collaborators! 10/2024: A paper about active learning with annotation errors is accepted to 2024 Big Data, congratulations to all collaborators! 10/2024: A paper about addressing heterogeneous biases in RecSys is accepted to WSDM 2025, congratulations to my student Jinhao, and all collaborators! 09/2024: Two papers are accepted to EMNLP 2024 finding, congratulations to my students Chahat, Anjishnu, Yuqing, and all collaborators! 09/2024: Invited to be a PC member for SDM 2024. 08/2024: Invited to be a reviewer for ICLR 2024. 07/2024: One paper about social bias in LLM is accepted to AIES 2024, congratulations to my students Chahat and Anjishnu! 06/2024: Invited to be an Associated Editor for ACM Transactions on Intelligent Systems and Technology. 06/2024: Received a funding award from Commonwealth Cyber Initiative (CCI), thank you! And thanks to Co-PI Dr. Jin Lee! 06/2024: Invited to be a PC member for WSDM 2025. 06/2024: Invited to be a PC member for AAAI 2025. 05/2024: Invited to be a reviewer for NeurIPS 2024. 05/2024: Invited to be a PC member for ASONAM 2024. 03/2024: One paper about cross-domain recommendation is accepted to IJCNN 2024, congratulations to Ajay and all collaborators! 03/2024: One paper about Culture Understanding in LLMs is accepted to NAACL 2024, congratulations to Anjishnu and all collaborators! 03/2024: Invited to be a PC member for CIKM 2024. 02/2024: Invited to be a PC member for RecSys 2024. 02/2024: Invited to be a PC member for ECMLPKDD 2024. 01/2024: One paper about machine unlearning is accepted to WWW 2024, congratulations to all collaborators! 01/2024: Invited to be a PC member for KDD 2024. 12/2023: Three papers are accepted to ECIR 2024 IR4Good track, congratulations to all collaborators! 12/2023: A paper about cross-domain recommendation is accepted to SDM 2024, congratulations to Ajay! 11/2023: Invited to be a PC member for PAKDD 2024. 10/2023: Gave talks about fairness in RecSys at American University and VT 10/2023: A paper about societal biases in multilingual LM is accepted to EMNLP 2023, congratulations to my student Anjishnu and Chahat! 10/2023: Two papers are accepted to EMNLP Findings 2023, congratulations to Zhuoer, Xiangjue, and Cav! 09/2023: Received a funding award from 4-VA@GMU, thank you! 09/2023: Invited to be a PC member for AAAI 2024. 09/2023: Invited to be a PC member for SDM 2024. 08/2023: A paper about unbiased post-click conversion prediction is accepted to CIKM 2023, congratulations to my student Yuqing! 07/2023: A paper about alleviating filter bubbles in dynamic news recommendation is accepted to KDD EAI Workshop. 06/2023: Invited to be a PC member for WSDM 2024. 06/2023: Invited to be a PC member for CIKM 2023. 05/2023: A paper about attacks to dialog systems is accepted to ACL Findings 2023. 04/2023: Invited to be a PC member for RecSys 2023. 02/2023: A paper about Mobile Voice Assistant for Emergency Medical Services is accepted to MobiSys 2023. 02/2023: Invited to be a PC member for ECMLPKDD 2023. 01/2023: A paper about conversational RecSys is accepted to WWW 2023. 01/2023: Invited to be a PC member for FAccT 2023. 01/2023: Invited to be a PC member for KDD 2023. 12/2022: A short paper about polarization in news recommender system is accepted to ECIR 2023. 09/2022: Invited to be a PC member for SDM 2023. 08/2022: Received the best paper award at the DSAI4RRS workshop! 08/2022: A long paper about popularity bias in conversational recommender system is accepted to CIKM 2022. 07/2022: Invited to be a PC member for AAAI 2023. 07/2022: A paper about recommendation popularity bias is accepted to DSAI4RRS workshop. See you in August! 06/2022: Invited to be a PC member for WSDM 2023. 05/2022: Successfully defended my Ph.D. dissertation! 03/2022: I am so happy to receive the Graduate Research Excellence Award from the CSE department at TAMU! 01/2022: A paper about fairness in learning-to-rank is accepted to WWW 2022 Web4Good track. 11/2021: Invited to be a PC member for KDD 2022 Applied Science Track. 10/2021: A long paper about user mainstream bias in recommendation is accepted to WSDM 2022. 08/2021: Gave an oral presentation for our accepted paper at KDD 2021. 07/2021: Gave an oral presentation for our accepted paper at SIGIR 2021. 07/2021: Gave a talk about recommendation fairness among cold-start items at Netflix research seminar. 06/2021: Invited to be a PC member for WSDM 2022. 05/2021: A long paper about popularity bias in dynamic recommendation is accepted to KDD 2021. 04/2021: Gave a talk about fairness in recommender systems at University of North Texas. 04/2021: A long paper about recommendation fairness among cold-start items is accepted to SIGIR 2021. Students Chahat Raj (co-advised by Dr. Antonios Anastasopoulos), PhD, Fall 2022 - Anjishnu Mukherjee (co-advised by Dr. Antonios Anastasopoulos), PhD, Fall 2022 - Yuqing Zhou, PhD, Fall 2023 - Bowen Wei, PhD, Fall 2023 - Mehrdad Fazli, PhD, Fall 2023 - Jinhao Pan, PhD, Fall 2024 - Fardin Ahsan Sakib (co-advised by Dr. Özlem Uzuner), PhD, Fall 2021 - Balassubramanian Srinivasan, MS Diwita Banerjee, MS Mamnuya Rinki, MS Sina Mansouri, MS Mohit Bharatbhai Marvania, MS Rishi Pania, Undergrad Ahmet Sari, Undergrad Tanvi Pedireddi, Thomas Jefferson High School Amrit Singh, Thomas Jefferson High School Mahika Banerjee, Thomas Jefferson High School Daksha Rajagopal, Thomas Jefferson High School Angela Liu, Thomas Jefferson High School Shloka Yada, Lightridge High School Kyle Li, McLean High School Publications (Google Scholar) (Semantic Scholar) [arxiv] Measuring South Asian Biases in Large Language Models. Mamnuya Rinki, Chahat Raj, Anjishnu Mukherjee, Ziwei Zhu [arxiv] Talent or Luck? Evaluating Attribution Bias in Large Language Models. Chahat Raj, Mahika Banerjee, Aylin Caliskan, Antonios Anastasopoulos, Ziwei Zhu [arxiv] VIGNETTE: Socially Grounded Bias Evaluation for Vision-Language Models. Chahat Raj, Bowen Wei, Aylin Caliskan, Antonios Anastasopoulos, Ziwei Zhu [arxiv] Neural Symbolic Logical Rule Learner For Interpretable Learning. Bowen Wei and Ziwei Zhu [arxiv] Assessing Large Language Models for Online Extremism Research: Identification, Explanation, and New Knowledge. Beidi Dong, Jin R. Lee, Ziwei Zhu, and Balassubramanian Srinivasan [WACV 2026] CAAC: Confidence-Aware Attention Calibration to Reduce Hallucinations in Large Vision-Language Models. IEEE/CVF Winter Conference on Applications of Computer Vision 2026. Mehrdad Fazli, Bowen Wei, Ahmet Sari, Ziwei Zhu [AAAI 2026] Bias Association Discovery Framework for Open-Ended LLM Generation. The 40th Annual AAAI Conference on Artificial Intellig",
  "content_length": 25209,
  "method": "requests",
  "crawl_time": "2025-12-01 14:56:00"
}