{
  "name": "Ziyang Li",
  "homepage": "https://liby99.github.io",
  "status": "success",
  "content": "Ziyang Li's Homepage Ziyang Li Johns Hopkins University Computer Science Curriculum Vitae Education: Ph.D. Computer and Information Science - UPenn, 2019-2025 B.S. Mathematics and B.S. Computer Science - UCSD, 2015-2019 Welcome! I am an Assistant Professor of Computer Science at Johns Hopkins University. I am also a part of DSAI and ISI. I received my Ph.D. in Computer Science from the University of Pennsylvania, where I was advised by Prof. Mayur Naik. My primary research interests lie in programming languages and machine learning, with special interest in neurosymbolic methods. I also have work in security and software engineering. My dissertation research is focused on neurosymbolic programming, an emerging paradigm that bridges the gap between deep learning and logical reasoning. To this end, I have developed Scallop, a general-purpose neurosymbolic programming language and compiler toolchain. Scallop has been used to develop diverse applications in the domains of natural language processing (NLP), computer vision (CV), cybersecurity, clinical-decision making, and bioinformatics. I was awarded the AWS Fellowship in 2023 for my research on trustworthy AI. Before my PhD, I obtained a dual B.S. degree in Computer Science and Mathematics from the UCSD, where I conducted research in computer graphics with Prof. Ravi Ramamoorthi. I also spent a year working in the UCSD Design Lab on HCI with Prof. Scott Klemmer. In my spare time, I am a Piano enthusiast and the keyboardist of the band, The Protagonists, where I play Jazz, Fusion, and Pop music. My favorite programming language is Rust! For students: I am looking for self-motivated students at both undergraduate and graduate levels to work on research in the intersection of programming languages, security, and machine learning. Please reach out to me via email if you are interested! I am also looking for Ph.D. students; prospective applicants should include their CV and a brief statement of research interests when contacting me. Recent News Sep 2025 - I am teaching EN.601.727, Machine Programming, a new course on foundation, frontiers, and applications of program synthesis! July 2025 - I joined the Johns Hopkins University as an Assistant Professor in CS and a part of DSAI! June 2025 - I defended my PhD thesis! June 2025 - Our 🦞 Lobster paper is headed to ASPLOS 2026! Yes, another seafood-themed system! Check it out on ArXiv. May 2025 - I will be joining Johns Hopkins University as a Tenure-Track Assistant Professor in CS and a part of DSAI! Spring 2025 - I am on the academic job market for the 2024-25 cycle! Here is my CV, Teaching Statement, and Research Statement. Teaching EN.601.727, Machine Programming - Johns Hopkins University, Fall 2025 Publications Core Scallop Language and its Applications: ESCA: Contextualizing Embodied Agents via Scene-Graph Generation NeurIPS 2025 Jiani Huang Matthew Kuo Amish Sethi Mayank Keoliya Neelay Velingker JungHo Jung Ser-Nam Lim Ziyang Li Mayur Naik 🏆 Spotlight ArXiv ESCA-Video-87K Dataset Vine-v0 Model Lobster: A GPU-Accelerated Framework for Neurosymbolic Programming ASPLOS 2026 Paul Biberstein Ziyang Li Joseph Devietti Mayur Naik ArXiv Code LASER: A Neuro-Symbolic Framework for Learning Spatial-Temporal Scene Graphs with Weak Supervision ICLR 2025 Jiani Huang Ziyang Li Mayur Naik Ser-Nam Lim OpenReview ArXiv Neurosymbolic Programming with Scallop: Principles and Practice Foundations and Trends in Programming Languages, 2024 Ziyang Li Jiani Huang Jason Liu Mayur Naik Invited Monograph Book Picture Buy it on Amazon Data-Efficient Learning with Neural Programs NeurIPS 2024 Alaia Solko-Breslin Seewon Choi Ziyang Li Neelay Velingker Rajeev Alur Mayur Naik Eric Wong ArXiv Github Relational Programming with Foundation Models AAAI 2024 Ziyang Li Jiani Huang Jason Liu Felix Zhu Eric Zhao William Dodds Neelay Velingker Rajeev Alur Mayur Naik Paper Plugin Library Improved Logical Reasoning of Language Models via Differentiable Symbolic Programming ACL Findings 2023 Jiani Huang* Hanlin Zhang* Ziyang Li Mayur Naik Eric Xing ArXiv Code Scallop, A Language for Neurosymbolic Programming PLDI 2023 Ziyang Li Jiani Huang Mayur Naik 🏆 MIT Programming Languages Review 2025 ArXiv Paper Zenodo Github Scallop: From Probabilistic Deductive Databases to Scalable Differentiable Reasoning NeurIPS 2021 Jiani Huang* Ziyang Li* Binghong Chen Karan Samel Mayur Naik Le Song Xujie Si Paper Code Security and Program Analysis: QLCoder: A Query Synthesizer For Static Analysis of Security Vulnerabilities Preprint 2025 Claire Wang Ziyang Li Saikat Dutta Mayur Naik arXiv Locus: Agentic Predicate Synthesis for Directed Fuzzing ICSE 2026 Jie Zhu Chihao Shen Ziyang Li Jiahao Yu Yizheng Chen Kexin Pei ArXiv Challenges and Paths Towards AI for Software Engineering Preprint Alex Gu Naman Jain Wen-Ding Li Manish Shetty Yijia Shao Ziyang Li Diyi Yang Kevin Ellis Koushik Sen Armando Solar-Lezama ArXiv LLM-Assisted Static Analysis for Detecting Security Vulnerabilities ICLR 2025 Ziyang Li Saikat Dutta Mayur Naik ArXiv Dataset Understanding the Effectiveness of Large Language Models in Detecting Security Vulnerabilities ICST 2025 Avishree Khare Saikat Dutta Ziyang Li Alaia Solko-Breslin Rajeev Alur Mayur Naik ArXiv TYGR: Type Inference on Stripped Binaries using Graph Neural Networks USENIX Security 2024 Ziyang Li* Chang Zhu* Anton Xue Ati Priya Bajaj William Gibbs Yibo Liu Hanjun Dai Mayur Naik Rajeev Alur Tiffany Bao Adam Doupé Yan Shoshitaishvili Ruoyu Wang Aravind Machiry Paper Github Arbitrar: User Guided API Misuse Detection IEEE S&P 2021 Ziyang Li Aravind Machiry Binghong Chen Ke Wang Mayur Naik Le Song Paper Code Talk Hoppity: Learning Graph Transformation to Detect and Fix Bugs in Programs ICLR 2020 Elizabeth Dinella Hanjun Dai Ziyang Li Mayur Naik Le Song Ke Wang 🏆 Spotlight Paper Code Health and Bioinformatics: Advances in RNA secondary structure prediction and RNA modifications: Methods, data, and applications Preprint 2025 Shu Yang Nhat Truong Pham Ziyang Li Jae Young Baik Joseph Lee Tianhua Zhai Weicheng Yu Bojian Hou Tianqi Shang Weiqing He Duy Duong-Tran Mayur Naik Li Shen Arxiv Paper Crowd-sourced machine learning prediction of Long COVID using data from the National COVID Cohort Collaborative eBioMedicine 2024 Timothy Bergquist et al. ... Neelay Velingker Ziyang Li Yinjun Wu Jiani Huang Adam Stein Emily J Getzen Qi Long Mayur Naik Ravi B Parikh ... 🏆 NIH L3C Honorable Mention Award Paper DISCRET: Synthesizing Faithful Explanations For Treatment Effect Estimation ICML 2024 Yinjun Wu Mayank Keoliya Kan Chen Neelay Velingker Ziyang Li Emily J Getzen Qi Long Mayur Naik Ravi B Parikh Eric Wong 🏆 Spotlight ArXiv Others: Unifying Inference-Time Planning Language Generation Preprint 2025 Prabhu Prakash Kagitha Bo Sun Ishan Desai Andrew Zhu Cassie Huang Manling Li Ziyang Li Li Zhang ArXiv Vision Language Models Cannot Plan, but Can They Formalize? Preprint 2025 Muyu He Yuxi Zheng Yuchen Liu Zijian An Bill Cai Jiani Huang Lifeng Zhou Feng Liu Ziyang Li Li Zhang ArXiv TurnaboutLLM: A Deductive Reasoning Benchmark from Detective Games EMNLP 2025 Main Yuan Yuan Muyu He Muhammad Adil Shahid Jiani Huang Ziyang Li Li Zhang ArXiv NeuroStrata: Harnessing Neurosymbolic Paradigms for Improved Design, Testability, and Verifiability of Autonomous CPS FSE 2025 IVR Track Xi Zheng Ziyang Li Ivan Ruchkin Ruzica Piskac Miroslav Pajic ArXiv Towards Faithful and High-Fiedlity Synthesis of Driving Scene Videos Preprint 2024 Jiani Huang Siyang Zhang Ziyang Li Ser-Nam Lim Mayur Naik Paper Numerical Reasoning over Legal Contracts via Relational Database NeurIPS 2021 Workshop on Databases and AI Jiani Huang Ziyang Li Ilias Fountalis Mayur Naik Paper Talks and Tutorials Dec 19, 2024 Neurosymbolic Scene Graph Generation @ TACPS Workshop, CAV'25 Dec 19, 2024 Invited talk on Scallop and Neurosymbolic Programming @ HKUST SEPL Seminar Oct 11, 2024 Invited talk on Scallop and Neurosymbolic Programming @ Columbia University Oct 4, 2024 Invited talk on Scallop and Neurosymbolic Programming @ TACPS workshop, ESWEEK'24 Sep 26, 2024 Invited talk on Scallop and Neurosymbolic Programming @ UT Austin Jun 10-11, 2024 Scallop tutorial @ Summer School of Neurosymbolic Programming (SSNP'24) Tutorial Apr 17, 2024 Guest lecture on Neurosymbolic Programming in CIS 7000, Spring 2024 Dec 10, 2023 Invited talk on Scallop and Neurosymbolic Programming @ Peking University PL Seminar Nov 9, 2023 Invited talk on Scallop and Neurosymbolic Programming @ Purdue University Aug 7, 2023 Invited talk on Scallop @ KDD'23 Jun 17-19, 2023 Tutorial and Talk on Scallop and Neurosymbolic Programming @ PLDI'23 Tutorial Slides Apr 10, 2023 Invited talk on Scallop and Neurosymbolic Programming @ MIT Neurosymbolic Reading Group Jun 1-2, 2022 Tutorial on Scallop @ Summer School of Formal Techniques (SSFT'22) Tutorial Slides © Ziyang Li 2025 ⋅ All rights reserved ⋅ Last Update: Jan 3, 2025",
  "content_length": 8935,
  "method": "requests",
  "crawl_time": "2025-12-01 14:56:00"
}