{
  "name": "Ziyu Guan",
  "homepage": "https://web.xidian.edu.cn/zyguan/en/index.html",
  "status": "success",
  "content": "Guan Ziyu | Profile | Xidian University Homepage Xidian Meeting Xidian Guide About Help Search Home Login Control Panel AddBookMark Guan Ziyu's MessageBoard Guan Ziyu's Homepage:ProfileResearchPapersHonorsTeachingAdmissionChinese ProfileZiyu Guan, ProfessorSchool of Computer Science and TechnologyContact InformationAddress: 2 South Taibai Road, Xi\\\\\\\\'an, Shannxi, ChinaEmail: zyguan@xidian.edu.cn BiographyZiyu Guan is currently a full professor in Xidian University. His research work is focused on social media computing and pattern recognition, with an emphasis on developing novel machine learning and data mining techniques for exploiting the wisdom of crowd in social media, to solve problems such as classification, recommendation, retrieval, etc. He has published over 70 high quality journal/conference papers, out of which 51 papers were published in leading journals/conferences, such as IEEE TKDE, IEEE TPAMI, IEEE TIP, VLDB, SIGMOD, SIGIR, ICDE, CVPR, WWW, AAAI, IJCAI and SIGKDD. According to Google Scholar, his research work has been cited over 2300 times (h-index 25). In 2015, he acquired a national youth talent title. He is an associated editor of IEEE TKDE, Neurocomputing, the International Journal of Machine Learning and Cybernetics, and Knowledge and Information Systems. He has served or is serving as (senior) program committees members of many leading international conferences, e.g., SIGKDD, AAAI, IJCAI, NeurIPS, ICML, ICLR, SIGIR. Full CV available at: CV Working & Education Experience2017 - present, Xidian University                         Professor, School of Computer Science and Technology2014 - 2017, Northwest University of China                         Professor, College of Information Science and Technology2012 - 2013, Northwest University of China                         Researcher, College of Information Science and Technology2010 - 2012, University of California at Santa Barbara                         Assistant project scientist, Department of Computer Science                         Advisor: Prof. Xifeng Yan2004 - 2010, Zhejiang University                         PhD in Computer Science and Technology                         Advisor: Prof. Chun Chen2000 - 2004, Zhejiang University                         BS in Computer Science and Technology 版权声明 未经西安电子科技大学以及个人主页教师本人许可，不得复制、转载和传播本页内容，禁止用于任何商业用途。如需转载请征得主页所有者同意，并附上主页链接！ 更新 Guan Ziyu's MessageBoard Copyright © 2011-2025 Xidian University ICP 021284(05016169)　Powered by XIDIANNIC & SEENIC",
  "content_length": 2500,
  "method": "requests",
  "crawl_time": "2025-12-01 14:55:59"
}