{
  "name": "Ziyu Yao 0002",
  "homepage": "https://ziyuyao.org",
  "status": "success",
  "content": "Ziyu Yao's Personal Website Nguyen Engineering Building, 4415 4400 University Drive Fairfax, VA, 22030 Contact: ziyuyao at gmu dot edu Hello! I am an Assistant Professor of the Department of Computer Science at George Mason University, where I co-lead the George Mason NLP group. I received my PhD degree from Department of Computer Science and Engineering at the Ohio State University (OSU) in 2021, and have spent time interning at Microsoft Semantic Machines, Carnegie Mellon University, Microsoft Research, Fujitsu Lab of America, and Tsinghua University. My research has been founded by National Science Foundation, Microsoft Accelerate Foundation Models Research Award, and Virginia Commonwealth Cyber Initiative, among others. I was the Diversity & Inclusion Co-Chair at NAACL 2024 and have organized XLLM-Reason-Plan at COLM 2025, MASC-SLL 2023 (a local NLP event with a 10-year history in the Mid-Atlantic area), SUKI at NAACL 2022, and NLP4Prog at ACL 2021. I gave a tutorial about Mechanistic Interpretability for Language Models at ICML 2025. With my students, we work on: LLMs for Reasoning and Planning: We advance Large Language Models (LLMs) in various tasks demanding reasoning and planning, such as code generation, math reasoning, motion planning, and information extraction. Actionable Interpretability of LLMs: We seek to understand the underlying mechanisms of LLMs, particularly applying the interpretation to enhance the model (\"actionable interpretability\"). Check out our task-centric survey on Mechanistic Interpretability and interpretation of LLMs in code generation and CoT-based arithmetic reasoning. Human-AI/LLM Interaction: We study (1) interactive AI/LLM systems, represented by our multi-year effort in \"interactive semantic parsing/code generation\" -- Preprint'24, ACL'23, ICLR'21, EMNLP'20, EMNLP'19, AAAI'19; (2) problems emerged from real-life deployment of LLMs, such as cost-efficiency of LLM calling and user prompt optimization; and (3) interdisciplinary applications, such as LLM4Edu. During July 7-11, 2025, we (w/ Dr. Jennifer Suh) organized the first Math EdVenture Summer Camp at GMU, the Fairfax campus, as our commitment to the NSF RITEL project. We hosted a total of 40 middle-school kids across multiple school districts in Northern Virginia. Check out our activities here! We are organizing a The First Workshop on the Application of LLM Explainability to Reasoning and Planning at COLM 2025! Submit your excellent work to our worshop! We gave a Tutorial on Mechanistic Interpretability for Language Models at ICML 2025! Our slides are now available. Excited to release Version 2 of our task-centric survey on Mechanistic Interpretability, in collaboration with Salesforce Research, Purdue University, and George Washington University. Also check out our survey on Sparse Autoencoder (SAE) in collaboration with NJIT and University of Georgia. ** I plan to recruit 2-3 PhD students for the Fall'26 cycle. In this cycle, the recruiting focus is \"Actionable Interpretability of LLMs\". Students with backgrounds in Interpertability and LLM reasoning/planning are welcome. If you are interested, please email me with your resume, research statement, transcript, future career plan (e.g., academia or industry), representative work, and your reviews on my recent publications, following the instructions on this page!** **Why George Mason CS?** We rank at No. 35 on CSRanking. We are in one of the BEST locations for studying and living in the US, only 30min driving to Washington DC. I wrote a blog \"Why you should apply for Mason CS and work with me\" here. news 10/2025 Our paper, Failure by Interference, received two best paper nominations and won a Best Paper Honorable Mention from the First Workshop on the Application of LLM Explainability to Reasoning and Planning at COLM 2025! 10/2025 Paper with highschool ASSIP intern Sarah Li is accepted to IEEE ICDM 2025 Undergraduate and High School Symposium! 10/2025 I gave a talk about “Mechanistically Interpreting Language Models: From Syntactic Code Completion to Arithmetic Reasoning” at DaSCI Seminar at the University of Granada and GMU’s AI Club! 10/2025 Invited talk at the Annual Summit of VASEM (Virginia Academy of Science, Engineering, and Medicine) representing GMU. 09/2025 1 paper accepted to NeurIPS 2025! (X Post) 08/2025 Four papers (2 Main + 2 Findings) were accepted to EMNLP 2025! Thanks for the collaborators! 06/2025 I gave a talk about “Interpretability Fills the Gap of Data Benchmarks” at the BI4LLMC workshop at FSE! 06/2025 One paper about VLM reasoning for social robot navigation is accepted to IROS 2025 (w/ Xuesu Xiao and students)! 05/2025 Two papers accepted to ACL Findings 2025 (Instruction-Tuning for Event Extraction, and Batch Prompting Attack)! Congrats to Murong, Saurabh, and Sweta! 05/2025 Saurabh, Murong, and Hao will intern at Adobe, Salesforce Research, and Amazon. Mohamed received the CVPR Travel Award. Sai received $1k prize from the CEC Undergrad Research Celebration. Saurabh received the Outstanding GTA Award from GMU CS and was selected to present at the SDM Doctoral Form. Congrats to them!! 04/2025 Our Tutorial on Mechanistic Interpretability for Language Models is accepted to ICML 2025. Hope to see everyone in Vancouver this summer! 04/2025 I gave a talk about Language Modeling Reasoning at Georgetown University! Slides 02/2025 Congrats to Mohamed and collaborators for a paper about Benchmarking VLMs in Path Plan Evaluation being accepted CVPR’25! 01/2025 Congrats to Murong and collaborators for a paper about “dynamic LLM reasoning” being accepted ICLR’25! 12/2024 I gave a talk about mechanistic understanding of LLMs in reasoning and code generation at University of Cambridge, Language Technology Lab Seminars! 08/2024 Grateful to receive a 3-year grant from National Science Foundation (NSF) on fostering the mathematical modeling competencies of middle-school students by leveraging the power of Generative AI/LLMs (see our prototype)! My first lead-PI NSF project ever;) I’m very lucky to make it with the wonderful Jennifer Suh from GMU Math Edu and Janice Zhang from William & Mary CS! 08/2024 Congrats to Daking and Saurabh for their two long papers being accepted to ACL 2024 (Main and Findings)! [EDIT] Daking’s paper about mechanistic interpretation of CoT is reported by MIT Technology Review China [English Translate]! 07/2024 Check out our latest review on Mechanistic Interpretability for Language Models. We particularly present a taxonomy and a beginner’s roadmap for people interested in this field. 05/2024 Great pleasure to speak about semantic parsing at the CTO Data Science Speaker Series at Bloomberg NYC! 05/2024 I was invited to talk about “Interactive Semantic Parsing” at Microsoft Research the PROSE team! 04/2024 CONGRATS to Murong for being awarded an Outstanding PhD Student by GMU CS, and Hao for receiving the Summer 2024 GRA Fellowship from CAHMP! 04/2024 Check out our project on “LLM Agents for Mathematics Education” as a teamwork with experts from NLP, HCI, and Mathematics Education! The project was funded by Microsoft Research, Accelerating Foundation Models Research program. 04/2024 I was invited to talk about “Building Natural Language Interfaces in the Age of LLMs” at Indiana University, Indianapolis! Slides are available here. 03/2024 I was invited to talk about “Towards Enhancing the Utilization of Large Language Models for Humans” at University of Arizona and Virginia Tech NVC! Slides are available here. 03/2024 Invited to give a guest lecture about LLMs at Department of Health Administration and Policy and School of Education at GMU! 01/2024 Our paper on LLM Cascade for Cost Saving in Reasoning (Featured in Hugging Face Daily Papers) is now accepted to ICLR’24! Congrats to Murong and collaborators from Microsoft Research and VT! 12/2023 Received a grant from Commonwealth Cyber Initiative (CCI) on the topic of LLM supply chain security, with Dr. Xiaokuan Zhang. Thank you, CCI! 11/2023 I was selected as a Top Reviewer at NeurIPS’23, thanks for the discussions with my students! 10/2023 Check out our three new preprints on Cost-saving LLMs in reasoning (Featured in Hugging Face Daily Papers), Prompt optimization for zero-shot LLMs, and Benchmarking LLMs in spatial-temporal reasoning! 10/2023 Congrats to Saurabh and Murong for papers accepted to EMNLP’23 main conference (MailEx, a new conversational event extraction benchmark) and the demo track (Gentopia, our open-source platform streamlining the creation and sharing of augmented LLMs)! Many thanks to our collaborators. See U in Singapore! 09/2023 Received Azure credits from Microsoft Research, Accelerating Foundation Models Research program for our project on LLM4Edu (in collaboration w/ Dr. Anthony E. Kelly at GMU Educational Psychology)! Thank you, Microsoft! 08/2023 Received a grant from National Science Foundation (NSF) on the topic of interpretability and explainability of large language models for code! Many thanks to NSF and my collaborators Dr. Kevin Moran (GMU -> UCF) and Dr. Denys Poshyvanyk (W&M)! 08/2023 I gave in-person talks titled “Building Natural Language Interfaces in the Age of LLMs” at Google and Apple! (Good summer time in the Bay Area ) 07/2023 I was invited to serve as Diversity & Inclusion Chair at NAACL 2024! 06/2023 Congrats to Hao and Daking for receiving the Graduate Student Travel Fund from GMU! 06/2023 I was invited to serve as Senior PC member at AAAI’24! 05/2023 Two papers accepted to ACL’23 (main conference)! Congrats to Hao, Saurabh, and Daking! 04/2023 George Mason organized MASC-SLL 2023, an annual NLP event in the Mid-Atlantic area! 03/2023 I was invited to serve as reviewer at NeurIPS’23! 02/2023 I will be attending AAAI’23 in D.C. and serving as Session Chair! 01/2023 I was invited to serve as Area Chair at ACL’23 (Question Answering). 12/2022 Received a grant from Commonwealth Cyber Initiative (CCI) on the topic of algorithm explanation a",
  "content_length": 16540,
  "method": "requests",
  "crawl_time": "2025-12-01 14:56:01"
}