{
  "name": "Zizhong Chen",
  "homepage": "http://www.cs.ucr.edu/~chen",
  "status": "success",
  "content": "The Homepage of Zizhong Chen Zizhong (Jeffrey) Chen Professor Department of Computer Science and Engineering University of California, Riverside 900 University Avenue, Riverside, CA 92521 Office: 422 Winston Chung Hall Telephone: +1 (951) 827 2403 Email: chen@cs.ucr.edu Home | Teaching | Publications | Service | Research Group UCR ranks #6 in high performance computing in USA by CSRankings. UCR ranks #28 combining all areas of computer science by CSRankings. TOP researchers in high performance computing https://nebelwelt.net/pubstats/top-authors-sys_hpc.html. Biographical Sketch Zizhong (Jeffrey) Chen is a professor in the Department of Computer Science and Engineering at the University of California, Riverside. He is interested in high performance computing, GPU programming, distributed machine learning, and big data analytics. Collaborating with ByteDance, his group has helped to develop ByteTransformer - a GPU-based high performance Transformer that powers all of ByteDance's in-house search businesses, including TikTok, Douyin, Xigua Video, Magellan, and Toutiao Search Portal, serving billions of daily active users worldwide. He has published over 150 papers with many in highly competitive conferences and journals such as SC, HPDC, ICS, SIGMOD, ICDE, PPoPP, IPDPS, TPDS, TC, TKDE, TPAMI, SIMAX, and SISC. He received a CAREER Award from the U.S. National Science Foundation and Best Paper Awards from the IEEE Transactions on Big Data (TBD'24), the IEEE International Parallel & Distributed Processing Symposium (IPDPS'23), the International Conference on Supercomputing (ICS'23), the IEEE International Conference on Cluster Computing (Cluster'18), the IEEE International Parallel & Distributed Processing Symposium (IPDPS'10) and the International Supercomputing Conference (ISC'05). Dr. Chen is a Senior Member of the IEEE and a Life Member of the ACM. He currently serves as Subject Area Editor for Elsevier Parallel Computing journal and he was Associate Editor for IEEE Transactions on Parallel and Distributed Systems from 2015-2019. Ph.D. Students Current Ph.D. Students: Shixun Wu (BS from Peking University and MS from Columbia University) Zizhe Jian (BS from University of Science and Technology of China) Jiajun Huang (BS from University of Electronic Science and Technology of China) Huangliang Dai (BS from University of Electronic Science and Technology of China) Elisabeth Giem (BS from UC Riverside and MS from Rice University) Giovanni Rivera (BS from California State University Dominguez Hills) Haiyang Hu (BS from Beijing Normal University) Yue Zhu (BS from Peking University) Past Ph.D. Students Academia: Jinyang Liu, Ph.D. 2024 (BS in Math from Peking University), Assistant Professor - University of Houston Kai Zhao, Ph.D. 2022 (BS in CS from Peiking University), Assistant Professor - Florida State University Baiyun Chen, Ph.D. 2022 (BE in MIS from Zhongnan University of Economics and Law), Assistant Professor - Tuskegee University Jieyang Chen, Ph.D. 2019 (BS in CS from Beijing University of Technology), Assistant Professor - University of Oregon Xin Liang, Ph.D. 2019 (BS in CS&Math from Peiking University), Assistant Professor - University of Kentucky (NSF CAREER Award 2025, IEEE TCHPC Early Career Researchers Award 2024) Dingwen Tao, Ph.D. 2018 (BS in Math from USTC), Associate Professor - Indiana University (NSF CAREER Award 2023, IEEE TCHPC Early Career Researchers Award 2020) Panruo Wu, Ph.D. 2016 (BS in Math from USTC), Associate Professor - University of Houston (NSF CAREER Award, 2022) Christer Karlsson, Ph.D. 2012 (BS in CS from University of Wyoming), Associate Professor - South Dakota School of Mines and Technology Industry: Yujia Zhai, Ph.D. 2023 (BS in Chemistry from USTC), Software Engineer for Deep Learning Library - NVIDIA Kaiming Ouyang, Ph.D. 2022 (BE in EE from UESTC), Software Engineer - NVIDIA Sihuan Li, Ph.D. 2020 (BS in Math from HUST), Research Scientist - Facebook Hongbo Li, Ph.D. 2018 (BS in CS from Ningxia University), Senior Robotics Software Engineer - Tesla Li Tan, Ph.D. 2015 (BS in CS from ECNU) , Product Manager II Lead, Azure HPC+AI - Microsoft Teresa Davies, Ph.D. 2014 (BS in CS from Colorado School Mines), Kinnami Software Corporation Doug Hakkarinen, Ph.D. 2013 (BS in Biology&CS from University of Colorado Boulder), Director of Data Engineering - ConocoPhillips High School Students Current High School Students: Vincent Tran (Portola High School, USACO Platinum) Selected Publications (with My Students Underlined, Full List at Google Scholar >>>) SC'24 Jinyang Liu, Jiannan Tian, Shixun Wu, Sheng Di, Boyuan Zhang, Robert Underwood, Yafan Huang, Jiajun Huang, Kai Zhao, Guanpeng Li, Dingwen Tao, Zizhong Chen, Franck Cappello, High-ratio Scientific Lossy Compression on GPUs with Optimized Multi-level Interpolations, IEEE/ACM The International Conference for High Performance computing, Networking, Storage and Analysis (IEEE/ACM SC2024), Atlanta, Georgia, USA, November 17 - 22, 2024. SC'24 Jiajun Huang, Sheng Di, Xiaodong Yu, Yujia Zhai, Jinyang Liu, Zizhe Jian, Xin Liang, Kai Zhao, Xiaoyi Lu, Zizhong Chen, Franck Cappello, Yanfei Guo, Rajeev Thakur, hZCC: Accelerating Collective Communication with Co-designed Operation-supported Compression, IEEE/ACM The International Conference for High Performance computing, Networking, Storage and Analysis (IEEE/ACM SC2024), Atlanta, Georgia, USA, November 17 - 22, 2024. ICS'24 Jiajun Huang, Sheng Di, Xiaodong Yu, Yujia Zhai, Jinyang Liu, Yafan Huang, Ken Raffenetti, Hui Zhou, Kai Zhao, Xiaoyi Lu, Zizhong Chen, Franck Cappello, Yanfei Guo, Rajeev Thakur, gZCCL: Compression-Accelerated Collective Communication Framework for GPU Clusters, Proceedings of THE 38th ACM International Conference on Supercomputing,, Kyoto Japan June 4 - 7, 2024. SIGMOD'24 Jinyang Liu , Sheng Di, Kai Zhao, Xin Liang, Sian Jin , Zizhe Jian, Jiajun Huang, Shixun Wu, Zizhong Chen, and Franck Cappello . High-performance Effective Scientific Error-bounded Lossy Compression with Auto-tuned Multi-component Interpolation, The 2024 ACM International Conference on Management of Data,, Santiago, Chile, on June 9 - June 15, 2024. IPDPS'24 Zizhe Jian, Sheng Di, Jinyang Liu, Kai Zhao, Xin Liang, Haiying Xu, Robert Underwood, Jiajun Huang, Shixun Wu, Zizhong Chen, Franck Cappello CliZ: Optimizing Lossy Compression for Climate Datasets with Adaptive Fine-tuned Data Prediction, Proceedings of the 38th IEEE International Parallel & Distributed Processing Symposium (IPDPS'24), San Francisco, California, USA, May 27-21, 2024. IPDPS'24 Jiajun Huang, Sheng Di, Xiaodong Yu, Yujia Zhai, Zhaorui Zhang, Jinyang Liu, Xiaoyi Lu, Ken Raffenetti, Hui Zhou, Kai Zhao, Zizhong Chen, Franck Cappello, Yanfei Guo, Rajeev Thakur, An Optimized Error-controlled MPI Collective Framework Integrated with Lossy Compression, Proceedings of the 38th IEEE International Parallel & Distributed Processing Symposium (IPDPS'24), San Francisco, California, USA, May 27-21, 2024. IPDPS'23 (Best Paper Award) Yujia Zhai, Chengquan Jiang, Leyuan Wang, Xiaoying Jia, Shang Zhang, Zizhong Chen, Xin Liu, and Yibo Zhu, ByteTransformer: A High-Performance Transformer Boosted for Variable-Length Inputs, Proceedings of the 37th IEEE International Parallel & Distributed Processing Symposium (IPDPS'23), St. Petersburg, Florida USA, May 15-19, 2023. This research and the associated software are currently used to power all of ByteDance's in-house search businesses, including TikTok, Douyin, Xigua Video, Magellan, and Toutiao Search Portal, serving over billions of daily active users worldwide. ICS'23 (Best Paper Finalist) Jinyang Liu, Sheng Di, Jieyang Chen, Xin Liang, Zizhong Chen, and Franck Cappello. FZ: A flexible auto-tuned modular error-bounded compression framework for scientific data, Proceedings of THE 37th ACM International Conference on Supercomputing,, Orlando, FL, June 21-23, 2023 ICS'23 Shixun Wu, Yujia Zhai, Jinyang Liu, Jiajun Huang,Zizhe Jian, Bryan M. Wong, and Zizhong Chen. Anatomy of High-Performance GEMM with Online Fault Tolerance on GPUs, Proceedings of THE 37th ACM International Conference on Supercomputing,, Orlando, FL, June 21-23, 2023 PPoPP'23 Jieyang Chen, Xin Liang, Kai Zhao, Hadi Zamani Sabzi, Laxmi Bhuyan, and Zizhong Chen Improving Energy Saving of One-sided Matrix Decompositions on CPU-GPU Heterogeneous Systems, Proceedings of the 28th ACM SIGPLAN Symposium on Principles and Practice of Parallel Programming (PPoPP'23), Montreal, Canada, February 25 - March 1, 2023. SC'22 Jinyang Liu, Sheng Di, Kai Zhao, Xin Liang, Zizhong Chen, Franck Cappello, Dynamic Quality Metric Oriented Error Bounded Lossy Compression for Scientific Datasets, IEEE/ACM The International Conference for High Performance computing, Networking, Storage and Analysis (IEEE/ACM SC2022), Dallas, Texas, USA, November 14 - 19, 2022. IPDPS'22 Yujia Zhai, Mohannad Ibrahim, Yiqin Qiu, Fabian Boemer, Zizhong Chen, Alexey Titov, and Alexander Lyashevsky, Accelerating Encrypted Computing on Intel GPUs, Proceedings of the 36th IEEE International Parallel & Distributed Processing Symposium (IPDPS'22), Lyon, France, May 30 - June 3, 2022. ICDE'22 Kai Zhao, Sheng Di, Danny Perez, Franck Cappello, and Zizhong Chen, MDZ: An Efficient Error-bounded Lossy Compressor for Molecular Dynamics Simulations, Proceedings of the 38th IEEE International Conference on Data Engineering, Virtual Event, May 9 - 12, 2022. TPAMI'22 Shuyin Xia, Daowan Peng, Deyu Meng, Changqing Zhang, Guoyin Wang, Elisabeth Giem, Wei Wei, and Zizhong Chen, Ball k-Means: Fast Adaptive Clustering With No Bounds, IEEE Transactions on Pattern Analysis and Machine Intelligence, Volume: 44, Issue: 1, January 2022. ICDE'21 Kai Zhao, Sheng Di, Maxim Dmitriev, Thierry-Laurent D. Tonellot, Zizhong Chen, and Franck Cappello, Optimizing Error-Bounded Lossy Compression for Scienti?c Data by Dynamic Spline Interpolation, Proceedings of the 37th IEEE International Conference on Data Engineering, Chania, ",
  "content_length": 23229,
  "method": "requests",
  "crawl_time": "2025-12-01 14:56:02"
}