{
  "name": "Zoltán Toroczkai",
  "homepage": "http://physics.nd.edu/people/faculty/zoltan-toroczkai",
  "status": "success",
  "content": "Zoltan Toroczkai | People | Department of Physics and Astronomy | University of Notre Dame Home › Zoltan Toroczkai Zoltan Toroczkai Professor, Department of Physics & Astronomy Office384C Nieuwland Science HallNotre Dame, IN 46556Phone+1 574-631-2618Emailtoro@nd.edu http://www.nd.edu/~toro Concurrent Professor, Computer Science and EngineeringResearch InterestsProf. Toroczkai's work is in the general area of complex systems research, bringing and developing tools from mathematics, equilibrium and non-equilibrium statistical physics, nonlinear dynamics and chaos theory to bear on problems in network science, neuroscience, biophysics, fluid dynamics, processes in solids, social sciences and foundations of computing.Honors and ActivitiesAmerican Physical Society Fellow, 2012EducationM.Sc., Physics, Babes-Bolyai University, Cluj-Napoca, Romania, 1992 Ph.D., Virginia Polytechnic Institute and State University, Blacksburg, VA, 1997Publications\"Cortical High-Density Counterstream Architectures\", N.T. Markov, M. Ercsey-Ravasz, D.C. Van Essen, K. Knoblauch, Z. Toroczkai, H. Kennedy. Science 342(6158), 1238406 (2013). \"A predictive network model of cerebral cortical connectivity based on a distance rule.\" M. Ercsey-Ravasz, N.T. Markov, C. Lamy, D.C. Van Essen, K. Knoblauch, Z. Toroczkai and H. Kennedy. Neuron 80(1), 184-197 (2013). \"The role of distance on the specificity of inter-areal connectivity in the macaque cerebral cortex.\" N.T. Markov, M. Ercsey-Ravasz, C. Lamy, A.R. Ribeiro Gomes, L. Magrou, P. Misery, P. Giroud, P. Barone, C. Dehay, Z. Toroczkai, K. Knoblauch, D.C. Van Essen, H. Kennedy. Proc. Natl. Acad. Sci. USA 110(13), 5187-5192 (2013). \"The Chaos Within Sudoku.\"  M. Ercsey-Ravasz, Z. Toroczkai. Scientific Reports, 2, 755 (2012). \"Optimization Hardness as Transient Chaos in an Analog Approach to Constraint Satisfaction.\"   M. Ercsey-Ravasz, Z. Toroczkai.  Nature Physics 7, 966-970 (2011). Cover-page article. \"Centrality scaling in large networks.\" M. Ercsey-Ravasz and Z. Toroczkai. Phys. Rev. Lett. 105, 038701 (2010). \"Degree-based graph construction.\" H. Kim, Z. Toroczkai, I. Miklós, P.L. Erdös and L. Székely. J. Phys. A: Math. Theor. 42, 392001 (2009). Fast Track Communication. \"Structural bottlenecks for communication in networks.\" S. Sreenivasan, R. Cohen, E. Lopez, Z. Toroczkai, H.E. Stanley. Phys.Rev.E. 75, 036105 (2007). \"Network Dynamics: Jamming is Limited in Scale-free Systems.\" Z. Toroczkai and K.E. Bassler. Nature 428, 716 (2004). \"Modelling disease outbreaks in realistic urban social networks.\" S. Eubank, H. Guclu, V.S.A. Kumar, M. Marathe, A. Srinivasan, Z. Toroczkai, N. Wang. Nature 429, 180 (2004). \"Competition-driven Network Dynamics: Emergence of a Scale-free Leadership Structure and Collective Efficiency.\" M. Anghel, Z. Toroczkai, K.E. Bassler, G. Korniss. Phys.Rev.Lett. 92, 058701 (2004). \"Suppressing Roughness of Virtual Times in Parallel Discrete-Event Simulations.\" G. Korniss, M.A. Novotny, H. Guclu, Z. Toroczkai, P.A. Rikvold. Science 299, 677 (2003). \"Selective Sensitivity of Open Chaotic Flows on Inertial Tracer Advection: Catching Particles with a Stick.\"  I.J. Benczik, Z. Toroczkai and T. Tél. Phys.Rev.Lett. 89, 164501 (2002). \"Topological classification of the Horton-Strahler index on binary trees.\" Z. Toroczkai. Phys.Rev.E 65, 016130 (2002). \"Chaotic flow: the physics of species coexistence\". G. Károlyi, Á. Péntek, I. Sheuring, T. Tél, and Z. Toroczkai. Proc. Natl. Acad. Sci. USA 97, 13661 (2000).",
  "content_length": 3495,
  "method": "requests",
  "crawl_time": "2025-12-01 14:56:04"
}