{
  "name": "Zoltan Kato",
  "homepage": "http://www.inf.u-szeged.hu/~kato",
  "status": "success",
  "content": "Zoltan Kato Home Page Zoltan Kato [ Research Group |   Software |   Publications |   Teaching |   Contact info |   CV |   Photography ] Zoltan Kato I was born in Hungary. I graduated from Jozsef Attila University, Szeged, Hungary in 1990. I received the PhD degree from University of Nice, France in December 1994, doing my research at INRIA, Sophia-Antipolis, France and the DSc title from the Hungarian Academy of Sciences in 2014. I've been a visiting research associate at the Computer Science Department of the Hong Kong University of Science & Technology, Hong Kong; an ERCIM postdoc fellow at CWI, Amsterdam, The Netherlands; and a visiting fellow at the School of Computing, National University of Singapore, Singapore. Currently I'm with the Institute of Informatics, University of Szeged, Hungary. In 2012, I created the Research Group on Visual Computation. I'm a Senior Member of IEEE, IEEE Signal Processing Society, and a former Executive Committee Member (2007-2019) of the Hungarian Association for Image Analysis and Pattern Recognition (President between 2011-2015). My research interest includes image segmentation, statistical image models, Markov random fields, color, texture, motion, combinatorial optimization, parameter estimation, variational and level set methods. For more details, visit my Research Group on Visual Computation. You can also consult and download my publications (see also ResearchGate) or see a partial list of citations at GoogleScholar or Scopus. PhD Students: Hichem Abdellali (2016-) Robert Frohlich (2014-2019), PhD 2019 (Currently with Research Group on Visual Computation). Co-supervised with Levente Tamas. Zsolt Santa (2013-2016), PhD 2018. Csaba Molnar (2010-2015), PhD 2019 (Currently with Broad Institute of MIT and Harvard, Cambridge, MA, USA). Co-supervised with Ian Jermyn and Peter Horvath. Jozsef Nemeth (2009-2010), PhD 2016. Csaba Domokos (2006-2010), PhD 2011 (Currently with Bosch Center for Artificial Intelligence, Renningen, Germany). Peter Horvath (2004-2007), PhD 2007 (Currently with Synthetic and Systems Biology Unit, Biological Research Centre of the Hungarian Academy of Sciences, Szeged, Hungary ). Co-supervised with Ian Jermyn and Josiane Zerubia from Ariana Group, INRIA - Sophia Antipolis. Recent Editorial Activities, Conference Organization: Associate Editor of IEEE Transactions on Image Processing: 2003-2008 Associate Editor of Acta Cybernetica: 2005- Associate Editor of IET Computer Vision : 2016- Area Chair for VISAPP -- International Conference on Computer Vision Theory and Applications, Porto, Portugal. 27 Feb - 1 March, 2017. Recent grants: National Research, Development and Innovation Office: Beyond Point-based Geometric Alignment, Fusion, 3D Reconstruction and Recognition of Visual Objects. Consortial project of University of Pannonia and University of Szeged. Principal investigator (2016-2020). National Office for Research and Technology - Hungarian Scientific Research Fund (NKTH-OTKA): Coherent attributes in the interpretation and perception of the visual world. Consortial project of SZTAKI, University of Pannonia, Pazmany Peter Catholic University, and the University of Szeged. Principal investigator for the University of Szeged (2010-2013). Hungarian Scientific Research Fund (OTKA): Estimation of Linear Shape Deformations and its Medical Applications. Principal investigator (2009-2011). Janos Bolyai Research Fellowship of the Hungarian Academy of Sciences (2003-2006). Hungarian Scientific Research Fund (OTKA): Markovian Image Models and their Applications in Unsupervised Image Segmentation. Principal investigator (2004-2006). Hungarian Science and Technology Foundation (TET), Hungarian-French Cooperation (Balaton): Efficient Shape Priors for Color Textured Image Segmentation. Principal investigator (2005-2006). Partners: Josiane Zerubia, and Ian Jermyn from Ariana Group, INRIA - Sophia Antipolis. I also spend some time with travel and photography which resulted in an online gallery of travel photographs that I invite you to visit. [ Research Group |   Software |   Publications |   Teaching |   Contact info |   CV |   Photography ] Last modified: Wed Apr 1 09:27:16 CEST 2020",
  "content_length": 4205,
  "method": "requests",
  "crawl_time": "2025-12-01 14:56:04"
}