{
  "name": "Zongchen Chen",
  "homepage": "https://sites.gatech.edu/zongchenchen",
  "status": "success",
  "content": "Zongchen Chen Skip to content About Me I am an assistant professor in the School of Computer Science at Georgia Tech.Previously, I was an assistant professor in the Department of Computer Science & Engineering at University at Buffalo, and an instructor (postdoc) in the Department of Mathematics at MIT. I received my PhD degree in Algorithms, Combinatorics and Optimization (ACO) from the School of Computer Science at Georgia Tech in 2021. I was very fortunate to be advised by Eric Vigoda. I received my BS degree in Mathematics & Applied Mathematics from Zhiyuan College at Shanghai Jiao Tong University in 2016.I have broad interests in randomized algorithms, discrete probability, and machine learning. Currently, my research focuses on Markov chain Monte Carlo (MCMC) methods, approximate counting and sampling, and learning and testing of high-dimensional distributions.My thesis received the 2021 Outstanding Doctoral Dissertation Award from College of Computing, Georgia Tech. Teaching Spring 2025: CS 3510 Design and Analysis of AlgorithmsFall 2024: CS 8803 Counting and SamplingSpring 2024: CSE 632 Analysis of Algorithms II: Randomized Algorithms Preprints and Publications Improved Mixing of Critical Hardcore Modelwith Tianhui Jiang. RANDOM 2025. Rapid Mixing on Random Regular Graphs Beyond Uniquenesswith Xiaoyu Chen, Zejia Chen, Yitong Yin, and Xinyuan Zhang. FOCS 2025. Factorizations of Relative Entropy Using Stochastic Localizationwith Pietro Caputo and Daniel Parisi. Rapid Mixing at the Uniqueness Thresholdwith Xiaoyu Chen, Yitong Yin, and Xinyuan Zhang. STOC 2025. Counting Random k-SAT Near the Satisfiability Thresholdwith Aditya Lonkar, Chunyang Wang, Kuan Yang, and Yitong Yin. STOC 2025. Entropy Contractions in Markov Chains: Half-Step, Full-Step and Continuous-Timewith Pietro Caputo, Yuzhou Gu, and Yury Polyanskiy. EJP 2025. Fast Sampling of Satisfying Assignments from Random k-SAT with Applications to Connectivitywith Andreas Galanis, Leslie Ann Goldberg, Heng Guo, Andrés Herrera-Poyatos, Nitya Mani, and Ankur Moitra. SIDMA 2024. On the Low-Temperature MCMC Threshold: The Cases of Sparse Tensor PCA, Sparse Regression, and a Geometric Rulewith Conor Sheehan and Ilias Zadik. Time Lower Bounds for the Metropolis Process and Simulated Annealingwith Dan Mikulincer, Daniel Reichman, and Alex Wein. RANDOM 2025. Influence Maximization in Ising Modelswith Elchanan Mossel. ITCS 2024. Combinatorial Approach for Factorization of Variance and Entropy in Spin SystemsSODA 2024. Fast Sampling of b-Matchings and b-Edge Coverswith Yuzhou Gu. SODA 2024. Strong Spatial Mixing for Colorings on Trees and its Algorithmic Applicationswith Kuikui Liu, Nitya Mani, and Ankur Moitra. FOCS 2023. Complexity of High-Dimensional Identity Testing with Coordinate Conditional Samplingwith Antonio Blanca, Daniel Štefankovič, and Eric Vigoda. COLT 2023. From Algorithms to Connectivity and Back: Finding a Giant Component in Random k-SATwith Nitya Mani and Ankur Moitra. SODA 2023. Almost-Linear Planted Cliques Elude the Metropolis Processwith Elchanan Mossel and Ilias Zadik. SODA 2023. Spectral Independence via Stability and Applications to Holant-Type Problemswith Kuikui Liu and Eric Vigoda. FOCS 2021. Sampling Colorings and Independent Sets of Random Regular Bipartite Graphs in the Non-Uniqueness Regionwith Andreas Galanis, Daniel Štefankovič, and Eric Vigoda. SODA 2022. On Mixing of Markov Chains: Coupling, Spectral Independence, and Entropy Factorizationwith Antonio Blanca, Pietro Caputo, Daniel Parisi, Daniel Štefankovič, and Eric Vigoda. SODA 2022. Optimal Mixing of Glauber Dynamics: Entropy Factorization via High-Dimensional Expansionwith Kuikui Liu and Eric Vigoda. STOC 2021. Invited to SICOMP Special Issue. Rapid Mixing for Colorings via Spectral Independencewith Andreas Galanis, Daniel Štefankovič, and Eric Vigoda. SODA 2021. The Swendsen-Wang Dynamics on Treeswith Antonio Blanca, Daniel Štefankovič, and Eric Vigoda. RANDOM 2021. Rapid Mixing of Glauber Dynamics up to Uniqueness via Contractionwith Kuikui Liu and Eric Vigoda. FOCS 2020. Hardness of Identity Testing for Restricted Boltzmann Machines and Potts Modelswith Antonio Blanca, Daniel Štefankovič, and Eric Vigoda. COLT 2020. Optimal Convergence Rate of Hamiltonian Monte Carlo for Strongly Logconcave Distributionswith Santosh Vempala. RANDOM 2019. Invited to ToC Special Issue. Fast Algorithms at Low Temperatures via Markov Chainswith Andreas Galanis, Leslie Ann Goldberg, Will Perkins, James Stewart, and Eric Vigoda. RANDOM 2019. Lower Bounds for Testing Graphical Models: Colorings and Antiferromagnetic Ising Modelswith Ivona Bezáková, Antonio Blanca, Daniel Štefankovič, and Eric Vigoda. JMLR 2020. Preliminary version in COLT 2019. Swendsen-Wang Dynamics for General Graphs in the Tree Uniqueness Regionwith Antonio Blanca and Eric Vigoda. RSA 2020. Preliminary version in RANDOM 2018. Structure Learning of H-coloringswith Antonio Blanca, Daniel Štefankovič, and Eric Vigoda. TALG 2020. Preliminary version in ALT 2018 (Best Paper Award). NEMO: Novel and Efficient Multicast Routing Schemes for Hybrid Data Center NetworksXiaofeng Gao, Tao Chen, ZC, and Guihai Chen. Computer Networks, 2018. On Symmetric BIBDs with the Same 3-Concurrencewith Da Zhao. Designs, Codes and Cryptography, 2017. FT-INDEX: A Distributed Indexing Scheme for Switch-Centric Cloud Storage SystemXiaofeng Gao, Binjie Li, ZC, Maofan Yin, Guihai Chen, and Yaohui Jin. ICC 2015. Email: chenzongchen at gatech dot eduOffice: KACB 2134",
  "content_length": 5525,
  "method": "requests",
  "crawl_time": "2025-12-01 14:56:04"
}