{
  "name": "Zoran Nikoloski",
  "homepage": "https://www.uni-potsdam.de/en/ibb-bioinformatik/members",
  "status": "success",
  "content": "Members - Bioinformatics - Prof. Dr. Zoran Nikoloski - Universität Potsdam JavaScript is not activated in your browser. Please activate JavaScript to use the whole functionality of this website! Skip to main contentInstitut für Biologie und Biochemie IBB (Home) Übersicht Standorte Geschäftsleitung Institutsrat LogIn/LogOut Studium und Lehre Studium und Lehre Forschung Forschung Promotion und Habilitation Arbeitsgruppen Professuren / AGs Ehemalige Privatdozenturen Botanischer Garten Forschungsstation Gülpe Uni-Startseite Intranet Notfall Uni A-Z Gebärdensprache Leichte Sprache Sitemap Close Close EnglishDeutschMembersMembersCloseStudiumStudieren an der UPStudienangebotBewerbung und ImmatrikulationStudium konkretBeratungs- und ServiceeinrichtungenTermine und FristenForschungForschen an der UPProfile, Programme und ProjekteForschungsförderungOpen ScienceForschungsdatenKooperationen und PartnerschaftenWissenschaftlicher NachwuchsUniversitätUP entdeckenOrganisationWirtschaft, Transfer und GesellschaftCampus InternationalFörderinstrumenteArbeiten an der UPOnline-DiensteAccount.UPBI.UPMail.UP (Webmailbox)PULSMoodleUniversitätsbibliothekEvaluationsportal (PEP)PraxisportalZIM – Zentrum für IT und MedienCloseGroup membersUniversity of Potsdam - Institute of Biochemistry and Biology- Bioinformatics group - Group membersBioinformatics group 2022Prof. Dr. Zoran NikoloskiHead of working grouptelephone:+49 331 977 6305E-Mail:znikouuni-potsdampdeaddress: University of Potsdam Institute of Biochemistry and Biology house 29, room 1.15 Karl-Liebknecht-Str. 24-25, 14476 Potsdam-Golm opening time: consulting hours by appointment Secretary's officeLisa GöselE-Mail:bioinf-officeuuni-potsdampdeaddress: University of Potsdam Institute of Biochemistry and Biology House 29, Room 1.14 Karl-Liebknecht-Str. 24-25 14476 Potsdam-Golm opening time: consulting hours Appointments only after registration via email. Dr. Detlef Grothresearch assistant / coordinator master course; interests: genome annotation, network analysis, machine learning, multivariate statisticstelephone:+49 331 977 2706E-Mail:dgrothuuni-potsdampdeaddress: University of Potsdam Institute of Biochemistry and Biology house 29, room 1.12 Karl-Liebknecht-Str. 24-25 14476 Potsdam-Golm opening time: consulting hours Tuesday 14:00 - 15:30 or by appointmentDr. Zahra Razaghi Moghadam research assistant; Metabolic networks, Gene regulatory networks, Network dynamics, Network analysis, Network inference and integrationtelephone:+49 331 977-2620E-Mail:razaghiumpimp-golm.mpgpdeaddress: University of Potsdam Institute of Biochemistry and Biology house 29, room 1.11 Karl-Liebknecht-Str. 24-25 14476 Potsdam-GolmDr. Seyed Damoun Langaryresearch assistantE-Mail:langaryumpimp-golm.mpgpdeaddress: University of Potsdam Institute of Biochemistry and Biology house 29 Karl-Liebknecht-Str. 24-25 14476 Potsdam-Golm Dr. Anika KükenJunior group leadertelephone:+49 (0)331 977-2620E-Mail:ankuekenuuni-potsdampdeaddress: University of Potdsam Institute of Biochemistry and Biology bioinformatics group house 29, room 1.11 Karl-Liebknecht-Str. 24-25 14476 Potsdam-Golm Dr. Alain Julio Mbebiresearch assistantE-Mail:mbebiumpimp-golm.mpgpdeaddress: University of Potsdam Institute of Biochemistry and Biology house 29 Karl-Liebknecht-Str. 24-25 14476 Potsdam-Golm Dr. Jacqueline Nowakresearch assistenttelephone:+49 331 567-8634E-Mail:jnowakumpimp-golm.mpgpdeaddress: University of Potdsam Institute of Biochemistry and Biology bioinformatics group Karl-Liebknecht-Str. 24-25 house 29, room 1.07 14476 Potsdam-Golm Dr. Sandra Marcela Correaresearch assistantE-Mail:cordobaumpimp-golm.mpgpdeaddress: University of Potdsam Institute of Biochemistry and Biology bioinformatics group Karl-Liebknecht-Str. 24-25 14476 Potsdam-Golm Sebastian HußPhD student; constraint-based modeling of metabolism, kinetic models, isotopically non-stationary metabolic flux analysisE-Mail:shussuuni-potsdampdeaddress: University of Potsdam Institute of Biochemistry and Biology Bioinformatics group house 29, room 1.10 Karl-Liebknecht-Str. 24-25 14476 Potsdam-Golm Anahita SamihPhD studentE-Mail:anahita.samihuuni-potsdampdeaddress: University of Potdsam Institute of Biochemistry and Biology Bioinformatics group house 29, room 1.09 Karl-Liebknecht-Str. 24-25 14476 Potsdam-Golm Milad Rahimi MajdPhD studentE-Mail:milad.rahimi.majduuni-potsdampdeaddress: University of Potsdam Institute of Biochemistry and Biology house 29, room 1.09 Karl-Liebknecht-Str. 24-25 14476 Potsdam-Golm Rudan Xu PhD studentE-Mail:rudan.xuuuni-potsdampdeaddress: University of Potsdam Institute of Biochemistry and Biology Bioinformatics group house 29, room 1.11 Karl-Liebknecht-Str. 24-25 14476 Potsdam-Golm David HobbyPhD studentE-Mail:david.hobbyuuni-potsdampdeaddress: University of Potdsam Institute of Biochemistry and Biology Bioinformatics group house 29, room 1.07 Karl-Liebknecht-Str. 24-25 14476 Potsdam-Golm Fayaz SoleymaniE-Mail:fayaz.soleymaniuuni-potsdampdeaddress: University of Potdsam Institute of Biochemistry and Biology bioinformatics group, house 20, room 108 Karl-Liebknecht-Str. 24-25 14476 Potsdam-Golm Arne NeumannSystems programmerHave you tried turning it off and on again?telephone:+49 331 977 2257E-Mail:neumann19uuni-potsdampdeaddress: University of Potsdam Institute of Biochemistry and Biology Bioinformatics group house 29, room 1.13 Karl-Liebknecht-Str. 24-25 14476 Potsdam-Golm Alumniformer member of the bioinformatics group",
  "content_length": 5473,
  "method": "requests",
  "crawl_time": "2025-12-01 14:56:05"
}