{
  "name": "Zoran Popovic",
  "homepage": "https://cs.washington.edu/homes/zoran",
  "status": "success",
  "content": "Zoran Popović Papers | Projects | Students Zoran Popović Professor Director, Center for Game Science Founder, Chief Scientist Enlearn University of Washington Dept. Of Computer Science and Engineering Box 352350, [express mail: Allen Center 101] Seattle, WA 98195-2350 Office: 590 Allen Center (directions) (206) 543-4226 Please enable JavaScript to view email address. Assistant: Jayashree Hari Please enable JavaScript to view email address. latest news 11/29/13 A featured article in Wired Magazine covers Washington State Algebra Challenge. 9/25/13 Foldit receives the Dr. Frank H. Netter Award for Special Contributions to Medical Education. 09/12/13 KUOW airs a 5 minute piece on the Washington State Algebra Challenge's that showed that over 90% of elementary school students can master key algebra concepts after 1.5 hours. 08/26/13 Front page of Seattle times reports on exciting outcomes of the Washington State Algebra Challenge. 3/28/13 Foldit receives honorable mention for Technical Excellence at the 15th Annual IGF Awards. 3/05/13 Interview for NPR Science segment on scientific-discovery games. 1/31/13 Foldit wins the 2012 Katerva Award. 1/31/13 An awesome animated documentary on Foldit. 1/2/13 The Scientist profiles our games for learning and scientific-discovery. 9/24/12 An interview and presentaion at NBC News Education Nation Summit hosted by Tamron Hall. 6/07/12 Bloomberg Businessweek Innovator of the week. 5/01/12 Seth Cooper wins the 2011 ACM Doctoral Dissertation Award (the best PhD in Computer Science) with his thesis \"A Framework for Scientific Discovery through Video Games\". [see older news] 3/7/12 The Center for Game Science and Foldit make the list of the World's 50 Most Innovative Companies. 2/3/12 Foldit wins 1st Prize in the 2011 International Science and Engineering Visualization Challenge. 1/22/12 Foldit players invent a brand new protein 18 times more reactive than previous findings. This marks the third Foldit player authored Nature paper. Followup in The Wall Street Journal. 12/05/11 Foldit in Boston Globe, New York Times and The Economist. 12/01/11 Foldit wins TechFlash Newsmaker award in the \"Innovation of the Year\" award. 11/07/11 UW team wins the International IGem 2011 grand prize. The team's project used Foldit to redesign a key enzyme for Celiac disease. 11/22/11 Foldit players discover state-of-the art algorithms. Published in Proceedings of National Academy of Sciences (PNAS). 10/28/11 Refraction wins the Prize for the Best Work in the Primary School Category in the 38th NHK Japan Prize, 2011. 9/18/11 A new Nature article: after 15 years of stumping scientists, Foldit players solve a protein structure in just 3 weeks. 9/1/11 Seattle Business Magazine has an extended article on our Center for Game Science. 7/12/11 Three new papers presented at SIGGRAPH 2011. 6/30/11 Three papers presented at Foundations of Digital Games 2011. 4/05/11 Yun-En Liu receives NSF graduate fellowship. 12/13/10 Two papers on game science accepted to CHI 2011. One of them wins a nomination for the Best Paper Award. 11/01/10 Seattle Magazine's Most Influential list of 2010 includes me and David Baker for our impact with scientific-discovery games. 09/16/10 NPR's All Things Considered story on Foldit and the power of game-based democratized science. 08/09/10 New York Times article covers our Foldit Nature paper and our future plans for scientific discovery games. 08/04/10 Nature publishes paper on Foldit produced proteins in August 5 2010 issue. The first nature paper where results are produced by game play, and most certainly the Nature's first paper with over 200,000 authors! 07/28/10 Refraction wins a Grand Prize in the Disney Learning Challenge. Refraction is a game prototype that discovers optimal pathways for learning fractions. 06/10/10 Six games produced in the 10-week Games Capstone class make it big in the wild: two independent reviews (1, 2), second best game of the week, and third best game of the month at Kongregate.com, over $3,000 in awards and earnings in first two weeks, and more than 10 web distribution contracts. 03/29/10 Six papers accepted over the weekend: three conditionally accepted to ACM TOG (SIGGRAPH), and three accepted to Foundations of Digital Games. 02/16/10 Karen Liu (PhD, 2006) wins Alfred P. Sloan Fellowship. 02/23/10 New York Times writes a science article about our latest serious game PhotoCity that aims to eventually reconstruct a 3D replica of the entire world. 01/07/10 Brett Allen (PhD, 2005) receives a Technical Achievement Oscar for development of iMocap. 9/20/09 Adrien Treuille (PhD, 2008) wins the TR-35 award, two years after Karen Liu (PhD, 2006) wins the same award. 4/20/09 Foldit feature article in WIRED magazine. 4/6/09 Two papers on character dynamics and control accepted to SIGGRAPH. 3/21/09 Foldit story on PRI. 7/22/08 New York Times article talks about Foldit. 5/8/08 Foldit goes open beta, with an article in The Economist, and a press release. 3/13/08 DraftTrack, developed from our realtime fluids paper, nominated for Sports Emmy (Technical Achievement). 2/08/08 A TV version of the dance symmetry paper in Nature, airs on Valentine's day again. [see less news] Zoran joined the CSE faculty in the summer of 1999. He received a Sc.B. with Honors in Computer Science from Brown University in 1991, M.S. in Computer Science in 1993 and a Ph.D. in Computer Science in 1999 from Carnegie Mellon University. His Ph.D. dissertation research focused on the automatic synthesis and transformation of realistic character animation. His thesis also involved numerous performances of embarrassing acts. He has also held research positions at Sun Microsystems and Justsystem Pittsburgh Research Center and University of California at Berkeley.  Zoran's research interests lie primarily in computer graphics, especially in character animation, motion editing, physically based modeling and modeling/simulation of natural phenomena. He is also interested in nonlinearly constrained optimization, motion planning and biomechanics. Zoran enjoys spending his free time outdoors. He is also an avid tanguero and a lindy hopper. You will find a more official short bio here. Awards ACM SIGGRAPH Significant New Researcher Award, 2004 Alfred P. Sloan Fellowship, 2003-2004 NSF CAREER Award, 2001-2006 Schlumberger Foundation Fellowship, 1997-1999 Selected Publications \"Subgroup Robustness Grows On Trees: An Empirical Baseline Investigation.\" with Gardner, J. and & Schmidt, L.. in Advances in Neural Information Processing Systems, 35, 9939-9954. 2022. [pdf] \"Exploring the Role of Local and Global Explanations in Recommender Systems.\" with Radensky, M., Downey, D., Lo, K., & Weld, D. S. in CHI Conference on Human Factors in Computing Systems Extended Abstracts (pp. 1-7) 2022. [project] \"Modernizing Training in Psychotherapy Competencies With Adaptive Learning Systems: Proof of Concept.\" with Renn, B. N., Areán, P. A., Raue, P. J., Aisenberg, E., Friedman, E. C. in Research on social work practice, 31(1), 90-100. 2021. [pdf] \"Integrated morphoelectric and transcriptomic classification of cortical GABAergic cells.\" with Gouwens, N., et al. in Cell, 183(4), 935-953. 2020. [pdf] \"Building de novo cryo-electron microscopy structures collaboratively with citizen scientists.\" with Khatib, F., et al. in PLoS Biology, 17(11), e3000472. 2019. [pdf] \"De novo protein design by citizen scientists.\" with Koepnick, B., et al. in Nature, 570(7761), 390-394. 2019. [pdf] \"Automatic generation of problems and explanations for an intelligent algebra tutor.\" with O’Rourke, E., Butler, E., Díaz Tolentino, A. in 20th International Conference, AIED 2019, Proceedings, Part I 20 (pp. 383-395). 2019. [pdf] \"An analysis and evaluation of the WeFold collaborative for protein structure prediction and its pipelines in CASP11 and CASP12.\" with Keasar, C. et. al in Scientific reports, 8(1), 1-18. 2018. [pdf] \"Automatic diagnosis of students' misconceptions in k-8 mathematics.\" with Feldman, M. Q., Cho, J. Y., Ong, M., Gulwani, S., & Andersen, E. in Proceedings of the CHI Conference on Human Factors in Computing Systems (pp. 1-12). 2018. [pdf] \"Empowering families facing english literacy challenges to jointly engage in computer programming.\" with Banerjee, R., et al. in Proceedings of the CHI Conference on Human Factors in Computing Systems (pp. 1-13). 2018. [pdf] \"A framework for computer-aided design of educational domain models.\" with Butler, E., Torlak, E. in Verification, Model Checking, and Abstract Interpretation: 19th International Conference, VMCAI (pp. 138-160). 2018. [pdf] \"Collaborative problem solving in an open-ended scientific discovery game.\" with Bauer, A. in Proceedings of the ACM on human-computer interaction, 1(CSCW), 1-21. 2017. [pdf] \"Dragon architect: open design problems for guided learning in a creative computational thinking sandbox game.\" with Bauer, A., Butler, E. in Proceedings of the 12th International Conference on the Foundations of Digital Games (pp. 1-6). 2017. [pdf] \"Synthesizing interpretable strategies for solving puzzle games.\" with Butler, E., Torlak, E. in Proceedings of the 12th International Conference on the Foundations of Digital Games (pp. 1-10). 2017. [pdf] \"Analysis of Problem-Solving Behavior in Open-Ended Scientific-Discovery Game Challenges.\" with Bauer, A., Flatten, J. in International Educational Data Mining Society. 2017. [pdf] \"Where to add actions in human-in-the-loop reinforcement learning.\" with Mandel, T., Liu, Y. E., Brunskill, E. in Proceedings of the AAAI Conference on Artificial Intelligence (Vol. 31, No. 1). 2017. [pdf] \"Crowdsourcing accurate and creative word problems and hints.\" with Chen, Y., Mandel, T., Liu, Y. E. in Proceedings of the AAAI Conference on Human Computation and Crowdsourcing (Vol. 4, pp. 12-21). 2016. [pdf] \"Efficient Bayesian Clustering for Reinforcement Learning.\" with Mandel, T., Liu, Y. E., Brunskill, E. in IJCAI (pp. 1830-1838). 2016. [pdf] \"Power to t",
  "content_length": 31987,
  "method": "requests",
  "crawl_time": "2025-12-01 14:56:07"
}