{
  "name": "Zoran Obradovic",
  "homepage": "http://www.dabi.temple.edu/~zoran",
  "status": "success",
  "content": "Zoran Obradovic - Center for Data Analytics and Biomedical Informatics College of Science and Technology Center for Data Analytics and Biomedical Informatics Search Menu Temple-Logo-T-Header Center for Data Analytics and Biomedical Informatics Search Close Menu Zoran Obradovic Home » Zoran Obradovic Profile Research Publications Teaching Lab Heritage Zoran Obradovic Laura H. Carnell Professor of Data Analytics,Director, Center for Data Analytics and Biomedical Informatics,Professor, Statistics, Operations and Data Science Department, Fox School of Business (secondary appointment),Temple University Research areas Data science Machine learning Healthcare informatics Complex systems Topics Big data Data fusion Spatial and temporal data Missing and noisy observations Applications Social networks Sensor networks Healthcare management Earth science Profile Zoran Obradovic is a Distinguished Professor and a Center director at Temple University, an Academician at the Academia Europaea (the Academy of Europe) and a Foreign Academician at the Serbian Academy of Sciences and Arts. He mentored about 50 postdoctoral fellows and Ph.D. students, many of whom have independent research careers at academic institutions (e.g. Northeastern Univ., Ohio State Univ,) and industrial research labs (e.g. Amazon, eBay, Facebook, Hitachi Big Data, IBM T.J.Watson, Microsoft, Yahoo Labs, Uber, Verizon Big Data, Spotify). Zoran is the editor-in-chief of the Big Data journal and the steering committee chair for the SIAM Data Mining conference. He is also an editorial board member of 13 journals and was the general chair, program chair, or track chair for 11 international conferences. His research interests include data science and complex networks in decision support systems addressing challenges related to big, heterogeneous, spatial, and temporal data analytics motivated by applications in healthcare management, power systems, earth, and social sciences. His studies were funded by AFRL, DARPA, DOE, KAUST, NIH, NSF, ONR, PA Department of Health, US Army ERDC, US Army Research Labs, and industry. He published about 470 articles and is cited more than 36,000 times (H-index 70). Recruitment Status Accepting/supporting highly qualified and motivated Ph.D. students, postdoctoral associates, and visiting scholars with research interests related to developing effective data science/machine learning methods and challenging knowledge discovery applications in healthcare, science, engineering and business. Bio/CV NSFNIH Projects Big Data Health Sciences Social Sciences Environmental Sciences Other Domains Big Data Advanced Learning for Energy Risk Tracking (ALERT) (NSF)Advanced GeoAI for Terrain Analytics in Cold Regions (US Army Corps of Engineers ERDC)Advanced Terrain Analytics to Support Tactical Scale Planning and Operations over Varied Environment (US Army Corps of Engineers ERDC)Testing and Evaluation for Soldier-Device Teaming Compatibility, Vulnerability, and Durability in Emergent Situations (US Army Research Laboratory)Big Data Analysis of Synchrophasor Data (DOE)Distributed Machine Learning for Understanding News (XSEDE )   Modeling Temporal Dynamics of User Behavior for Improved Advertising (Verizon Media)Assessing Influence of News Articles on Emerging Events (NSF)US-Serbia and West Balkan Data Science Workshop (NSF)Big Data Spokes: Smart Grids Big Data (NSF)Acquisition on a Flexible High-Performance Computing System for Data and Compute-Driven Scientific Discovery (NSF)Structured Regression in Complex Networks by Fusion of Qualitative Knowledge and Big Data (Office of Naval Research)BIGDATA: Multi-level Predictive Analytics & Motif Discovery Across Massive Dynamic Spatio-Temporal Networks in Complex Socio-Technical Systems: An Organizational Genetics Approach (National Science Foundation)Prospective Analysis of Large and Complex Partially Observed Temporal Social Networks (DARPA) Health Sciences CIBR: Bridging Fields and Expanding Research Opportunities with the Timescale of Life (NSF)Developing and Validating EHR-Integrated Readmission Risk Prediction Model for Hospitalized Patients with Diabetes (NIH)Characterizing Diversity of Demographics and Health Conditions Affecting Risk for Comorbidities and Health Conditions Affecting Risk for Comorbidities Development in Cancer Patients (KAUST)   Disease Detection and Disease Progression Modeling (IQVIA)Clinical Decision Support System for Multiple Choice Ranking in Cancer Comorbidity (King Abdullah University of Science and Technology’s Center Partnership Fund Program)Assessing Cognitive Computing to Analyze Immunization Program Data (Center for Disease Control)Big Data Analytics for Clinical Trials Optimization (QuintilesIMS)Reverse Engineering Host Resilience (DARPA)Predictive Modeling of Patient State and Therapy Optimization (DARPA)Bioinformatics of protein disorder (NIH, NSF)Data mining in brain image databases (NIH, NSF)Gene expression data analysis (NIH, PA Dept. of Health)Bioinformatics core facility (PA Dept. of Health) Social Sciences Data mining for juvenile recidivism investigation (NIJ) Environmental Sciences Discriminative Modeling Framework for Mining of Spatio-Temporal Data in Remote Sensing (NSF)Estimation of geophysical parameters from sensors on satellites (NSF) Other Domains UAS Detection and Counter UAS R&D (AFRL)Text mining (Public Health, Public Affairs, Biomedical) (PA Dept. of Health)Spatial-temporal data reduction (precision agriculture) (NSF, INEEL)Knowledge discovery in distributed databases (agriculture) (DOE)Time series analysis (deregulated electricity markets) (NSF) Recognition Elected Fellow of the Asia-Pacific Artificial Intelligence Association, Nov. 2021.The best student paper award, the 16th International Conference on Artificial Intelligence Applications and Innovations (AIAI), 2020The best paper award, the Sixth IEEE International Conference on Healthcare Informatics (ICHI 2018).Elected Member at the Academia Europaea (the Academy of Europe), 2015.Elected Foreign Member at the Serbian Academy of Sciences and Arts, 2015.Appointed Adjunct Professor, School of Medicine, University of Belgrade, 2015.Appointed L.H. Carnell Professor of Data Analytics, Temple University, 2013.Appointed Professor (secondary appointment) Statistics, Operations and Data Science Department, Fox School of Business, Temple University, 2013.Appointed Adjunct Professor, Faculty of Organizational Sciences, University of Belgrade, 2012.Temple University Faculty Research Award, April 2009.College of Science and Technology Faculty Research Excellence Award, Nov. 2008.Team leader for the best rated model of intrinsically disordered protein regions at the seventh critical assessments of structure prediction experiments (CASP 7), Nov. 26-30, 2006.Team leader for the best predictor in protein disorder category at fifth and the sixth critical assessments of structure prediction experiments (CASP 5 and CASP 6), 2002 and 2004.Researcher of the Year for College of Engineering and Architecture, Annual Convocation, Washington State University, April 11, 2000. Temple University Copyright 2020, Temple University. All rights reserved.Design: Ameen Abdel Hai | Blink.mk Center for Data Analytics and Biomedical InformaticsTemple University386 SERC, 1925 N. 12th St.Philadelphia, PA 19122, USA (215) 204-3651 (215) 204-5082 dabi@temple.edu Menu",
  "content_length": 7388,
  "method": "requests",
  "crawl_time": "2025-12-01 14:56:09"
}