{
  "name": "Zsolt Kira",
  "homepage": "http://www.cc.gatech.edu/~zk15",
  "status": "success",
  "content": "Zsolt Kira - Home Toggle navigation Zsolt Kira Home Research Group Join Publications Teaching Code Associate Professor Associate Director, ML@GT School of Interactive Computing CODA room S1181B Email: zkira at gatech dot edu --> Latest News Recent Talks: Podcast with Kausar Patherya [slides] ECCV 24 OOD-CV: OOD Robustness when Finetuning FMs [slides] ECCV 24 FOCUS: Multi-Modal VLA FMs for Generalizable Robotics [video] [slides] CoRL 2023 LangRob: Act, Interact, and Finetune [video] CVPR 2023 CLVISION: Continual Fine-tuning of Foundation Models 10/2025 NeurIPS paper on memory architectures and training for decision-making Transformers! 07/2025 ICCV paper on EmbodiedSplat, a real-sim-real pipeline for training RL policies! 05/2025 Congratulations to Andrew Szot for successfully defending his Ph.D. and starting at Apple. 01/2025 Three CVPR papers on Generalist policies via large-scale SFT+RL Vision-Language-Action (VLA) models, VQA robust finetuning benchmark, and category discovery! 01/2025 Two ICLR papers on robust VLM finetuning and weakly-supervised video grounding. 01/2025 ACC paper on hierarchical RL for complex locomotion. 11/2024 CVPR Workshop on 3D Vision-Language Models (VLMs). We look forward to submissions! 09/2024 Three NeurIPS papers on action tokenization for vision-language-action models, diffusion-based representations for robotics, and robust finetuning of Foundation Models. 09/2024 TMLR paper on continual federated learning! 08/2024 Associate Professor! Thank you to the students and everyone who made this possible! 07/2024 Two ECCV papers on RL for long-horizon embodied rearrangement and large-scale MAE-based NeRF pre-training! 06/2024 Congratulations to Junjiao Tian for defending his thesis! Amazing body of work! 03/2024 Congratulations to James Smith for winning outstanding GRA Award and Ram Ramrakhya for winning CoC Rising Star Doctoral Student Research Award! Well done! 02/2024 Three CVPR Papers: on unsupervised open-world segmentation with diffusion models, open-world Go To Anything Benchmark, and Semantic Placement 01/2024 Co-Organizing Workshop: RoboNerF: 1st Workshop on Neural Fields in Robotics 01/2024 Two ICRA paper on Self-supervised 3D pose estimation and Multi-robot correspondences. 01/2024 ICLR paper on Habitat 3.0: Fast simulation for studying learning human-robot interaction! 2023 We had 1 ICRA, 1 ICLR, 4 CVPR, 1 ICML, 1 ICCV, 1 CoRL, 3 NeurIPS, and 2 WACV papers. I gave invited talks at the CVPR 2023 CLVISION workshop, CVIT Summer School on AI, and CorL 2023 LangRob workshop. I co-organized the ICCV tutorial on Continual Learning and NeurIPS HomeRobot Challenge. I was Area Chair of CVPR, ICLR, NeurIPS, and ICRA. I received the NSF CAREER Award, the College of omputing Outstanding Junior Faculty Research Award, EURASIP Best Paper Award, James Smith was accepted to the CVPR Doctoral Colloquim, and Nathan Glaser won 2nd place paper at the ICRA CoPerception Workshop. I graduated 5 Ph.D. students: James Smith (Samsung), Nathan Glaser (Zoox), Yen-Cheng Liu (Meta), Zubair Irshad (TRI), and Chia-Wen Kuo (TikTok). 2022 We had 2 ICRA, 2CVPR, 1 Nature Machine Intelligence, 2 ECCV, and 1 NeurIPS papers. I gave invited talks at UIUC, Vanderbilt, and ECCV Workshop. I co-organized the 2nd workshop on Learning from Limited and Imperfect Data (L2ID). I received funding from IRIM/IPaT, TRI, and Google. Andrew Szot won the Outstanding Online Teaching Assistant of the Year Award. 2021 We had 1 ICLR, 2 ICRA, 1 ICCV, 2 NeurIPS spotlight papers, and 1 IJCNN papers. I served as Area Chair for ICLR and NeurIPS, we had significant press for Habitat 2.0, received funding for DARPA LwLL and DARPA L2M Phase II projects, gave invited talks at Google and Microsoft AI, and I co-organized the CVPR L2ID Workshop. 2020 We had 1 AAAI, 2 ICRA, 3 CVPR, 2 ECCV papers. We partnered with Facebook on a co-teaching program, I served as Area Chair for NeurIPS, and I gave invited talks at the VL3, Agriculture Vision, and ULAD-2020 Workshops. 2019 We had 3 ICLR, 1 ICRA, 1 CVPR, 1 Oral ICCV, 2 journal, 1 WACV, and ICLR/IROS workshop papers. We received funding from DARPA LwLL and Samsung. 2018 We had a ICLR, CVPR, WACV, NeurIPS Continual Learning Workshop, and one journal paper. We received new funding from DARPA L2M and ONR. 08/2018 Assistant Professor! Bio I am an Asssociate Professor at the School of Interactive Computing in the College of Computing, and serve as an Associate Director of ML@GT which is the machine learning center recently created at Georgia Tech. Previously I was a Branch Chief at the Georgia Tech Research Institute (GTRI) and Research Scientist at SRI International Sarnoff in Princeton. I received my Ph.D. in 2010 with Professor Ron Arkin as my advisor. I lead the RobotIcs Perception and Learning (RIPL) lab. our work lies at the intersection of machine learning and artificial intelligence for perception and robotics, focusing on generalization and robustness. Recent works include robust finetuning of vision-language models to preserve out-of-distribution generalization capabilities, open-world generalization, long-horizon RL, 3D processing, and fine-tuning of Multi-Modal Foundation Models into Vision-Language-Action models via supervised finetuning, reinforcement learning, and post-training. I have grown a portfolio of projects funded by NSF, ONR, DARPA, and industry (Samsung, TRI, Google, and Meta). I have also won the NSF CAREER Award, the College of Computing Outstanding Junior Faculty Research Award, and several best paper/student paper awards. © 2025 Zsolt Kira. Site made using Jekyll repo Contact: zkira at gatech dot edu",
  "content_length": 5639,
  "method": "requests",
  "crawl_time": "2025-12-01 14:56:08"
}