{
  "name": "Zvi Galil",
  "homepage": "http://www.cc.gatech.edu/people/zvi-galil",
  "status": "success",
  "content": "Zvi Galil | College of Computing Skip to main navigation Skip to main content Zvi Galil Former John P. Imlay, Jr. Dean of Computing, Storey Chair, Executive Advisor for Online Programs, and Professor galil@cc.gatech.edu Biography Zvi Galil was born in Tel Aviv, Israel. He earned BS and MS degrees in Applied Mathematics from Tel Aviv University, both summa cum laude. He then obtained a PhD in Computer Science from Cornell University. After a post-doctorate in IBM's Thomas J. Watson research center, he returned to Israel and joined the faculty of Tel-Aviv University. He served as the chair of the Computer Science department in 1979-1982. In 1982 he joined the faculty of Columbia University. He served as the chair of the Computer Science Department in 1989-1994 and as dean of The Fu Foundation School of Engineering & Applied Science in 1995-2007. Galil was appointed Julian Clarence Levi Professor of Mathematical Methods and Computer Science in 1987, and Morris and Alma A. Schapiro Dean of Engineering in 1995. In 2007 Galil returned to Tel Aviv University and served as president. In 2009 he resigned as president and returned to the faculty as a professor of Computer Science. Galil served as the third John P. Imlay Jr. Dean of Computing at Georgia Tech from July 2010 through June 2019. Galil's research areas have been the design and analysis of algorithms, complexity, cryptography and experimental design. In 1983-1987 he served as chairman of ACM SIGACT, the Special Interest Group of Algorithms and Computation Theory. He has written over 200 scientific papers, edited 5 books, and has given more than 150 lectures in 20 countries. Galil has served as editor in chief of two journals and as the chief computer science adviser in the United States to the Oxford University Press. He is a fellow of the ACM and the American Academy of Arts and Sciences and a member of the National Academy of Engineering. In 2009 the Columbia Society of Graduates awarded him the Great Teacher Award. Zvi Galil is married to Dr. Bella S. Galil, a marine biologist. They have one son, Yair, a corporate lawyer in New York. Affiliations School of Computer Science Algorithms and Randomness Center (ARC)",
  "content_length": 2202,
  "method": "requests",
  "crawl_time": "2025-12-01 14:56:08"
}