{
  "name": "Zygmunt J. Haas",
  "homepage": "http://www.utdallas.edu/~zjh130030",
  "status": "success",
  "content": "Prof. Zygmunt J. Haas ZYGMUNT J. HAAS - Wireless Networks Laboratory Erik Jonsson School of Engineering and Computer Science Computer Science Department University of Texas at Dallas Richardson, TX 75080 haas(at)utdallas(dot)edu www.utdallas.edu/~haas (972) 883-3571 B.Sc. 1979; M.S. 1985; Ph.D. 1988; Zygmunt J. Haas received his B.Sc. in EE in 1979 and M.Sc. in EE in 1985. In 1988, he earned his Ph.D. from Stanford University and subsequently joined AT&T Bell Laboratories in the Network Research Department. There he pursued research on wireless communications, mobility management, fast protocols, optical networks, and optical switching. From September 1994 till July 1995, Dr. Haas worked for the AT&T Wireless Center of Excellence, where he investigated various aspects of wireless and mobile networking, concentrating on TCP/IP networks. Since August 1995, he has been with the faculty of the School of Electrical and Computer Engineering at Cornell University. Since August 2013, he joined the Computer Science Department at the University of Texas at Dallas, where he is now a Professor and Distinguished Chair. Dr. Haas is an author of over 300 technical papers and holds twenty one patents in the fields of high-speed networking, wireless networks, and optical switching. He has organized several workshops, delivered numerous tutorials at major IEEE and ACM conferences, and has served as editor of several journals and magazines, including the IEEE Transactions on Networking, the IEEE Transactions on Wireless Communications, the IEEE Communications Magazine, the Springer Wireless Networks journal, the Elsevier Ad Hoc Networks journal, the Journal of High Speed Networks, and the Wiley Wireless Communications and Mobile Computing journal. He has been a guest editor of IEEE JSAC issues on \"Gigabit Networks,\" \"Mobile Computing Networks,\" and \"Ad-Hoc Networks.\" Dr. Haas is an IEEE Fellow, an IET Fellow, and a Fellow of EAI. He has served in the past as a Chair of the IEEE Technical Committee on Personal Communications (TCPC). His interests include: mobile and wireless communication and networks, biologically-inspired networks, and modeling of complex systems. His e-mail is: haas(at)utdallas(dot)edu and his URL is: http://www.utdallas/~haas/ Research Interests and Activities: The goal of my research is the proliferation of wireless and mobile communication, so as to allow ubiquitous, multi-media access to information and services by mobile and stationary users. My research interests concentrate on two fields: Wireless Communications and Mobile Systems, and Biologically-inspired Complex Systems and Networks. In the context of the Wireless Communications and Mobile System topic, I am interested in studying (a) novel protocols for information dissemination in ad hoc and sensor networks, and (b) the effects of mobility on protocol design and on the optimal distribution of processing in distributed systems. In the context of Biologically-inspired Complex Systems and Networks, I am interested in stochastic modeling of complex systems based on incomplete observation of the behavior of such systems. Projects: ã  Passive Network of Tags for Smart Spaces (sponsored by NSF, award number CNS-1763627, Medium: Collaborative Research: Passive Network of Tags for Smart Spaces, joint project with ECE department at Stony Brook) Publications: ã  List of journal and archival publications ã  List of conference and workshop publications ã  Also, please consult WNL personnel web page",
  "content_length": 3521,
  "method": "requests",
  "crawl_time": "2025-12-01 14:56:10"
}