{
  "name": "Ágnes Horvát",
  "homepage": "https://agneshorvat.soc.northwestern.edu",
  "status": "success",
  "content": "Homepage | Agnes Horvat Homepage RESEARCH GROUP      CV a-horvat (at) northwestern (dot) edu I am an Associate Professor of Communication and Computer Science (by courtesy) at Northwestern University, where I direct the Lab on Innovation, Networks, and Knowledge (LINK). My research lies in human-centered computing and network science and investigates how online spaces operate and disseminate information. My group strives to make digital tools more efficient for scientists, entrepreneurs, and creative artists. Our recent projects investigate the use of LLMs in scientific writing and music creation, study biases in online attention to science, identify cases of collective intelligence and opportunities for improved decision-making, and develop frameworks to examine persuasion and opinion change in online discussions. My work has been awarded an NSF CAREER, CRII, and collaborative awards as PI. My doctoral advisees have received highly competitive prizes, including a Northwestern Presidential Fellowship and best student paper awards at international conferences. My research has been featured recently in Nature, The New York Times, The Washington Post, Le Monde, The Economist, and Frankfurter Allgemeine Zeitung. SELECTED RECENT PUBLICATIONS Delving into LMM-assisted writing in biomedical publications through excess vocabulary D Kobak, R González-Márquez, E-Á Horvát and J Lause Science Advances, 2025 Covered in The Economist, Nature, The New York Times, and Frankfurter Allgemeine Zeitung (FAZ) The gender gap in scholarly self-promotion on social media H Peng, M Teplitskiy, D Romero and E-Á Horvát Nature Communications, 2025 Covered in MSN and Psychology Today Disparities by design: Toward a research agenda that links science misinformation and socioeconomic marginalization in the age of AI M Schirmer, N Walter and E-Á Horvát HKS Misinformation Review, 2025 Beyond words: An experimental study of signaling in crowdfunding H Dambanemuya, D Choi, D Gergle and E-Á Horvát ACM TOCHI, 2025 Collective dynamics behind success M Mariani, F Battiston, E-Á Horvát, G Livan, F Musciotto and D Wang Nature Communications, 2024 Extending human creativity with AI K O’Toole and E-Á Horvát Journal of Creativity, 2024 Emergent influence networks in good-faith online discussions H Dambanemuya, D Romero and E-Á Horvát AAAI ICWSM, 2024 Hidden indicators of collective intelligence in crowdfunding E-Á Horvát, H Dambanemuya, J Uparna and B Uzzi ACM Web Conference (WWW), 2023 Dynamics of cross-platform attention to retracted papers H Peng, D Romero and E-Á Horvát PNAS, 2022 Covered in Inside Higher Ed, The Washington Post, Le Monde and Deutschlandfunk (German Public Radio) RESEARCH GROUP Dr Miriam Schirmer (Postdoctoral Fellow) Katherine O’Toole (PhD Student, TSB) Jose Cordova (PhD Student, TSB) Maalvika Bhat (PhD Student, TSB) Haohan Shi (PhD Student, MTS) Nick Ornstein (PhD Student, TSB)",
  "content_length": 2908,
  "method": "requests",
  "crawl_time": "2025-12-01 14:56:08"
}