{
  "name": "Ágoston E. Eiben",
  "homepage": "http://www.cs.vu.nl/~gusz",
  "status": "success",
  "content": "Prof. Dr. A.E. Eiben I am an Artificial Intelligence expert with 30+ years of experience. I work as a full professor on the Vrije Universiteit Amsterdam where I lead the Computational Intelligence Group and as a visiting professor on the University of York, UK. My research lies in the field of Artificial Intelligence, Artificial Life, Adaptive Collective Systems. My approach to AI is based on Evolutionary Computing. Throughout my carreer I worked on a diverse set of topics from theoretical foundations to artificial societies, multi-sexual reproduction, and applications in health, finance, and traffic management. I have publications in top journals including Nature, Science Robotics, and Nature Machine Intelligence, and Nature Communications. I also appreciate the importance of outreach. I have exhibited my Escher style evolutionary art system in the Kunstmuseum Den Haag and have given many lectures for the general public, including a TED talk, a keynote on hub.berlin, and a special lecture in Paradiso, the iconic music venue of Amsterdam (Dutch with English subtitles). My work has been covered by TV stations (NOS, VPRO, RAI Uno, ARTE), popular magazines (Wired, New Scientist, Techcrunch), and professional periodicals like The Communications of the ACM. Lately I am active in the field of Embodied AI, specifically in Evolutionary Robotics. The fundamental insight behind my research is: Given the fact that evolution can produce intelligence, it is plausible that artificial evolution can produce artificial intelligence. In short, I am working on evolving and learning machines that reproduce, improve themselves, and develop intelligence over time. My most prominent endevours in this direction are the Robot Baby Project and the Autonomous Robot Evolution Project, and the SPEAR project. Robot Evolution Click to read more Spotlight TED Talk: Tech Kangaroos Video of my TEDx Danubia talk “Tech Kangaroos: Evolution at Work”. It started off the publicity in 2011. Read more Robot baby is prime time news The proverbial 15 minutes of fame on national television. (NOS journaal, Dutch) Read more A New Frontier of Artificial Life Video of my talk at the HUB Berlin 2017 “The Robot Baby Project: a New Frontier of Artificial Life”. Read more Publication: Evolutionary reproduction of Dutch masters A book chapter about the Mondriaan and Escher evolvers. Quote: “Systems using interactive evolution have proven capable of achieving creativity.” Read more Publication: Science paper on Optimized flocking of autonomous drones A paper in Science Robotics Read more Publication: Nature paper on the Evolution of Things A paper in Nature discussing evolution in different substrates: wetware, software, and hardware Read more Technology news website TechCrunch on our project “Robots date, mate, and procreate 3D printed offspring in ‘Robot Baby’ project”. TechCrunch notes the start of the Industrial Evolution. Read more Robot Baby Movie – indeed, the ‘making of’ Made for the Vrije Universiteit Science youtube channel, it introduces the team and gives insights into the Robot Baby Project. Read more Robot brain evolution explained on TV VPRO TV series “De Volmaakte Mens” shows how e-puck robots get smarter by evolving their brains (English with Dutch subtitles) Read more Publications Click to see them Education I teach the courses Introduction to Business Analytics, Heuristics, Evolutionary Computing (see the VU Study Guide), and Computational Intelligence (see the UvA Study Guide). I also supervise Bachelor projects and Master Thesis projects. Publicity My work covered in the media: TV, radio, newspapers, magazines, websites. Click to see more Contact Head of the Computational Intelligence Group Department of Computer Science Faculty of Sciences Vrije Universiteit Amsterdam A: Room 10A.69, NU Building, VU campus, de Boelelaan 1111, 1081HV Amsterdam, Netherlands E: a.e.eiben at vu.nl T: +31-20-5987758 Secr: +31-20-5987782",
  "content_length": 3956,
  "method": "requests",
  "crawl_time": "2025-12-01 14:56:12"
}