{
  "name": "Ákos Lédeczi",
  "homepage": "https://www.isis.vanderbilt.edu/akos",
  "status": "success",
  "content": "Akos Ledeczi | ISIS Website Skip to main content Contact: 1025 16th Ave., S. Nashville, Tennessee 37212 firstname.lastname@vanderbilt.edu Akos Ledeczi Professor of Computer Science Professor of Electrical and Computer Engineering My two main research areas are computer science education and wireless sensor networks (WSN). NetsBlox, our open source, web-based visual programming environment for K12 supports synergistic learning of STEM and Computational Thinking. I co-authored a highly popular introductory programming MOOC available on Coursera. In the WSN domain, my team has developed a novel WSN-based countersniper system. An enhanced version is soldier wearable and not only does it localize the shooter very accurately, but it can also tell the caliber and the weapon type. An interesting paper describes the system in detail. My other focus is Model Integrated Computing. Our latest open source software tool, the Web-based Generic Modeling Environment is a web- and cloud-based, collaborative, configurable toolkit for creating domain-specific visual modeling and program synthesis environments.  NewsDevin Jean has defended his PhD dissertation on tools for introductory computing education in K12 (March 2025).Our new MOOC, AI-Assisted MATLAB Programming with ChatGPT has launched on Coursera (March, 2025).Gordon Stein has defended his PhD dissertation on his education robotics simulation environment (March, 2024).Our music extension called BeatBlox is in the final round of the NSF Vital Prize Challenge: Code to Joy (December, 2023).New NSF project on cybersecurity education in middle schools has started (August, 2023)New NSF project to develop animal-borne acoustic monitoring has been awarded (August, 2023).Our PhoneIoT, demo won the Best Showpiece Award at IEEE VL/HCC 2021 (October, 2021).Check out RoboScape Online, a 3D virtual robotics environment for introductory CS education (May 2021)General Chair of ACM IPSN 2021 (May 2021)Our new MATLAB Specialization on Coursera has launched (August 2020)New NSF project: Beyond CS Principles: Engaging Female High School Students in New Frontiers of Computing (May 2020)Our anti-poaching paper is an ACM SIGMOBILE research highlight (May 2020)NetsBlox on the K12 Engineering Education Podcast (August 2019)Best Paper and Best Poster Runner up at MobiSys  (June (2019)Our cybercamp on the Stem for All Video Showcase (May 2019)New article about our anti-poaching system funded by Vodafone (September 2018) NetsBlox now does robots and cybersecurity education (July 2018)Addisu Taddese has successfully defended his PhD dissertation on capsule endoscopes (July 2018).Brian Broll has successfully defended his PhD dissertation related to NetsBlox (March 2018).NSF is funding Brian Broll's brainchild: DeepForge (October 2017).Nice article about the MATLAB MOOC (July 2017) WIPER, our anti-poaching project has won 2nd place in the Vodafone Wireless Innovation project (June, 2017)NetsBlox in the news! (May, 2017) Check out the MathWorks Newsletter on our MOOC! (December, 2016) Our time synchronization paper from 2004 received the Test of Time Award at ACM SenSys. (November 2014).  PublicationsGoogle Scholar Education Ph.D.,Vanderbilt UniversityDiploma,Technical University of Budapest Projects Self-Powered Ultrasonic Wireless Sensor Network for Structural Health Monitoring Collaborative Research: Beyond CS Principles: Engaging Female High School Students in New Frontiers of Computing Cyber Makerspace - Science of Security for Cyber-Physical Systems Lablet WIPER: Wireless anti Poaching collar for Elephants and Rhinos SI2-SSE: Deep Forge: a Machine Learning Gateway for Scientific Workflow Design Code to Joy: A Music-Based Framework for Teaching Computer Science A3EM: Animal-borne Adaptive Acoustic Environmental Monitoring VITALPrize Challenge - William Hedgecock VITALPrize Challenge - Devin Jean Collaborative Research: Beyond CS Principles: Engaging Female High School Students in New Frontiers of Computing",
  "content_length": 3992,
  "method": "requests",
  "crawl_time": "2025-12-01 14:56:09"
}