{
  "name": "Éric Schost",
  "homepage": "https://cs.uwaterloo.ca/~eschost",
  "status": "success",
  "content": "Éric Schost Éric Schost Professor Cheriton School of Computer Science University Waterloo eschost@uwaterloo.ca Publications Computing roadmaps in unbounded smooth real algebraic sets II: algorithm and complexity, with R. Prébet, M. Safey El Din. Journal of Symbolic Computation, to appear. PDF. Some Applications of Chinese Remainder Theorem Codes with Error-Correction, with J. Elliott. Proceedings ISSAC’25, pp. 345-352, 2025. PDF. A SageMath Package for Analytic Combinatorics in Several Variables: Beyond the Smooth Case, with B. Hackl, A. Luo, S. Melczer. Séminaire Lotharingien de Combinatoire, Proceedings of FPSAC 2025. PDF. Newton iteration for lexicographic Gröbner bases in two variables, with C. St-Pierre. Journal of Algebra, 653: 325-377, 2024. PDF. Faster modular composition, with V. Neiger, B. Salvy, G. Villard. Journal of the ACM, 71(2): 1-79, 2024. PDF. Computing roadmaps in unbounded smooth real algebraic sets I: connectivity results, with R. Prébet, M. Safey El Din. Journal of Symbolic Computation, 120, 2024. PDF. p-adic algorithm for bivariate Gröbner bases, with C. St-Pierre. Proceedings ISSAC’23, pp. 508-516, 2023. PDF. Journal version, An m-adic algorithm for bivariate Gröbner bases, Journal of Symbolic Computation, 128, 2025. PDF. Faster real root decision algorithm for symmetric polynomials, with G. Labahn, C. Riener, M. Safey El Din, T. X. Vu. Proceedings ISSAC’23, pp. 452-460, 2023. PDF. Computing the characteristic polynomial polynomial of endomorphisms of a finite Drinfeld module using crystalline cohomology, with Y. Musleh. Proceedings ISSAC’23, pp. 461-469, 2023. PDF. Bit complexity for computing one point in each connected component of a smooth real algebraic set, with J.-C. Faugère, G. Labahn, T. X. Vu. Journal of Symbolic Computation, 116: 365-399, 2023. PDF. Bit complexity for computing one point in each connected component of a smooth real algebraic set, with J. Elliott and M. Giesbrecht. Journal of Symbolic Computation, 116: 72-97, 2023. PDF. Subquadratic-time algorithms for normal bases, with M. Giesbrecht and A. Jamshidpey. Computational Complexity, 30(5), 2021. PDF. Solving determinantal systems using homotopy techniques, with J. D. Hauenstein, M. Safey El Din and T. X. Vu. Journal of Symbolic Computation, 104:754-804, 2021. PDF. Homotopy techniques for solving sparse column support determinantal polynomial systems, with G. Labahn, M. Safey El Din and T. X. Vu. Journal of Complexity 66, 2021. PDF. Sparse multiplication of multivariate linear differential operators, with M. Giesbrecht and Q. Huang. Proceedings ISSAC’21, pp. 155–162, 2021. PDF. Algorithms for linearly recurrent sequences of truncated polynomials, with S. G. Hyun and V. Neiger. Proceedings ISSAC’21, pp. 201–208, 2021. PDF. Computing syzygies in finite dimension using fast linear algebra, with V. Neiger. Journal of Complexity, 60, 2020. PDF. On the bit complexity of finding points in connected components of a smooth real hypersurface, with J. Elliott and M. Giesbrecht. Proceedings ISSAC’20, pp. 170–177, 2020. PDF. Sparse multiplication for skew polynomials, with M. Giesbrecht and Q. Huang. Proceedings ISSAC’20, pp. 194–201, 2020. PDF. Block-Krylov techniques in the context of sparse-FGLM algorithms, with K. Hyun, V. Neiger and H. Rahkooy. Journal of Symbolic Computation, 98:163-191, 2019. PDF. Computing isomorphisms and embeddings of finite fields, with L. Brieulle, L. De Feo, J. Doliskani and J.-P. Flori. Mathematics of Computation, 88(317): 1391-1426, 2019. PDF. Quadratic-time algorithms for normal elements, with A. Jamshidpey and M. Giesbrecht. Proceedings ISSAC’19, pp. 179–186, 2019. PDF. Change of basis for m-primary ideals in one and two variables, with K. Hyun, S. Melczer and C. St-Pierre. Proceedings ISSAC’19, pp. 227–234, 2019. PDF. Implementations of efficient univariate polynomial matrix algorithms and application to bivariate resultants, with K. Hyun and V. Neiger. Proceedings ISSAC’19, pp. 235–242, 2019. PDF. Computing the characteristic polynomial of a finite rank two Drinfeld module, with Y. Musleh. Proceedings ISSAC’19, pp. 307–314, 2019. PDF. Drinfeld modules with complex multiplication, Hasse invariants and factoring polynomials over finite fields, with J. Doliskani and A. Narayanan. Journal of Symbolic Computation, 105:199-213, 2018. PDF. Algebraic construction of quasi-split algebraic tori, with A. Jamshidpey and N. Lemire. Journal of Algebra and its Applications, 19(11), 2018. PDF. Bit complexity for multi-homogeneous polynomial system solving - application to polynomial minimization, with M. Safey El Din. Journal of Symbolic Computation, 87: 176-206, 2018. PDF. On semiring complexity of Schur polynomials, with S. Fomin, D. Grigoriev and D. Nogneng. Computational Complexity, 27(4): 595-616, 2018. PDF. On the evaluation of some sparse polynomials, with D. Nogneng. Mathematics of Computation, 87(310): 893-904, 2018. PDF. On matrices with displacement structure: generalized operators and faster algorithms, with A. Bostan, C.-P. Jeannerod and C. Mouilleron. SIAM Journal on Matrix Analysis and Applications, 38(3): 733-775, 2017. PDF. Computing minimal interpolation bases, with C.-P. Jeannerod, V. Neiger and G. Villard. Journal of Symbolic Computation, 83: 272-314, 2017. PDF. A nearly optimal algorithm for deciding connectivity queries in smooth and bounded real algebraic sets, with M. Safey El Din. Journal of the ACM 63(6):1-48, 2017. PDF Algorithms for structured linear systems solving and their implementation, with K. Hyun and R. Lebreton. Proceedings ISSAC’17, pp. 205–212, 2017. PDF. Sparse rational univariate representation, with A. Mantzaflaris and E. Tsigaridas. Proceedings ISSAC’17, pp. 301–308, 2017. PDF. Algorithms for zero-dimensional ideals using linear recurrent sequences, with V. Neiger and H. Rahkooy. Proceedings CASC’17, pp. 313–328, 2017. PDF. Fast computation of roots of polynomials over the ring of power series, with V. Neiger and J. Rosenkilde. Proceedings ISSAC’17, pp. 349–356, 2017. PDF. Explicit isogenies in quadratic time in any characteristic, with C. Hugounenq, L. De Feo and J. Plˆut. LMS Journal of Computation and Mathematics 19 (A), pp. 267-282, 2016 PDF. Computation of the similarity class of the p-curvature, with X. Caruso and A. Bostan Proceedings ISSAC'16, pp. 111-118, 2016. PDF. Fast computation of minimal interpolation bases in Popov form for arbitrary shifts, with C.-P. Jeannerod, V. Neiger and G. Villard. Proceedings ISSAC'16: 295-302, 2016 PDF. A fast algorithm for computing the truncated resultant, with G. Moroz Proceedings ISSAC'16, pp. 341-348, 2016. PDF. A quasi-optimal Monte Carlo algorithm for the symbolic solution of polynomial systems in Z[X,Y], with E. Mehrabi. Journal of Complexity 34:78-128, 2016. PDF. A simple and fast online power series multiplication and its analysis, with R. Lebreton Journal of Symbolic Computation, 72: 231-251, 2016. PDF. A quadratically convergent algorithm for structured low-rank approximation, with P.-J. Spaenlehauer Foundations of Computational Mathematics, 16(2): 457-492, 2016. PDF. Algorithms for finite field arithmetic. Proceedings ISSAC'15, pp. 7-15, 2015 (invited). PDF. A fast algorithm for computing the p-curvature, with X. Caruso and A. Bostan Proceedings ISSAC'15, pp. 69-76, 2015. PDF. Faster algorithms for multivariate interpolation with multiplicities and simultaneous polynomial approximations, with M. Chowdhury, C.-P. Jeannerod, V. Neiger and G. Villard. IEEE Transactions on Information Theory, 61(5):2370-2387, 2015. PDF. A standard basis free algorithm for computing the tangent cones of a space curve , with P. Alvandi, M. Moreno Maza and P. Vrbik. Proceedings CASC'15, pp. 45-60, 2015. PDF. Computing in degree 2^k-extensions of finite fields of odd characteristic, with J. Doliskani Design, codes and cryptography 74: 559-569, 2015. PDF. Doing algebraic geometry with the RegularChains library , with P. Alvandi, C. Chen, S. Marcus, M. Moreno Maza and P. Vrbik. ICMS'14, pp. 472-479, Springer, 2014. PDF. A fast algorithm for computing the characteristic polynomial of the p-curvature, with X. Caruso and A. Bostan Proceedings ISSAC'14, pp. 59-66, ACM, 2014. PDF. Fast arithmetic for the algebraic closure of finite fields, with L. De Feo, J. Doliskani Proceedings ISSAC'14, pp. 122-129, ACM, 2014. PDF. On the complexity of solving bivariate systems: the case of non-singular solutions, with R. Lebreton, E. Mehrabi Proceedings ISSAC'13, pp. 251-258, ACM, 2013. PDF. Structured FFT and TFT: symmetric and lattice polynomials, with J. van der Hoeven, R. Lebreton Proceedings ISSAC'13, pp. 355-362, ACM, 2013. PDF. Fast algorithms for l-adic towers over finite fields, with L. De Feo, J. Doliskani Proceedings ISSAC'13, pp. 165-172, ACM, 2013. PDF. A baby step-giant step roadmap algorithm for general algebraic sets, with S. Basu, M.-F. Roy, M. Safey El Din Foundations of Computational Mathematics, 14: 1117-1172, 2014. PDF. Algorithms for the universal decomposition algebra, with R. Lebreton Proceedings ISSAC'12, pp. 234-241, ACM, 2012. PDF. Power series solutions of singular (q)-differential equations, with A. Bostan, M. F. I. Chowdhury, R. Lebreton and B. Salvy Proceedings ISSAC'12, pp. 107-114, ACM, 2012. PDF. Inversion modulo zero-dimensional regular chains, with M. Moreno Maza and P. Vrbik Proceedings CASC'12, pp. 224-235, Springer, 2012. PDF. On the complexity of computing with zero-dimensional triangular sets, with A. Poteaux Journal of Symbolic Computation 50: 110-138, 2013. PDF. Modular composition modulo triangular sets and applications, with A. Poteaux Computational Complexity 22: 463-516, 2013. PDF. Taking roots over high extensions of finite fields, with J. Doliskani Mathematics of Computation 83: 435-446, 2014. PDF. Genus 2 point counting over prime fields, with P. Gaudry Journal of Symbolic Computation 47 (4): 368-400, 2012. PDF. Multipoint evaluation in higher dimensions, with J. van der Hoeven Applicable Algebra in Engine",
  "content_length": 19224,
  "method": "requests",
  "crawl_time": "2025-12-01 14:56:14"
}