{
  "name": "Éric Beaudry",
  "homepage": "http://ericbeaudry.uqam.ca/index.en.html",
  "status": "success",
  "content": "Éric Beaudry Éric Beaudry, Ph.D. [Français] [English] Summary Research Available Positions Teaching Short Bio Links Publications ActuPlan Planner Ph.D Project (2011) Assistant Professor Département d'informatique Université du Québec à Montréal 201, Président-Kennedy ave. Montréal (Québec) Canada  H2X 3Y7 Maps: Google Maps | OpenStreetMap Office: PK-4635 Phone: +1 514 987-3000 ext. 4005 beaudry.eric@uqam.ca Research My research work is in the field of AI (artificial intelligence) planning, also known as automated planning. Automated planning is an fundamental capability which enables automatic decisions making of intelligent systems and intelligent agents. Automated planning has many applications in various fields including robotics, space exploration, games, defence and operation management. Research Interests Decision making and Planning under Uncertainty (resources, duration and effects of actions). Planning with Actions Concurrency. Heuristic Planning. Decision Architectures. For more information, take a look at my publications and my former Ph.D. project's page. Applications Games, Serious games and Intelligent Tutoring Systems. Spatial Exploration. Defence. Mobile Robotics. Management and Logistics. Available Positions for Master and Ph.D. Students I'm looking for master and Ph.D students to assist me in my research projects in the fields of automated planning, and games and serious games. Available projects could be on fundamental research or applied research, depending of personal interests of candidates. Requirements Holding a bachelor degree in computer science, computer engineering, mathematics or in a related field. Having a GPA of at least 3.2/4.3 (B+). Having a strong knowledge in data structures and graph algorithms. Having a good background in stats and probabilistic reasoning (e.g., Bayesian Networks). Meeting the requirements for admission of the UQÀM's programs of the master in computer science or of the Ph.D. in computer science. Demonstrating an interest for scientific research and artificial intelligence. Being rigorous. Having made ​​an introductory course in AI is an asset. Having an interest for travelling is an asset! Students are strongly encouraged to submit and present their research at international scientific conferences including ICAPS, AAAI, IJCAI, ECAI, UAI, AIED, ITS, AIIDE, IEEE CIG and other relevant conferences. Funding Funding could be available depending of the availability of funds from my research grant. NSERC and FQRNT offer great scholarships for students having a strong academic record and demonstrate a good potential for research. Research Topics Partial Observable Markov Decision Processes (POMDP). Partial Satisfaction Planning (Over-Subscription Planning). Planning with Plan Stability. Student (or learner) and Player Modelling using Bayesian Networks. Games and Intelligent Tutoring Systems Architectures. Cooperative Path-Finding. Heuristic Planning. Students can submit their own research proposal if they fall in my research expertise and interests. Feel free to contact me by email (Eric.Beaudry @ GMail.com) for more information. Teaching Université du Québec à Montréal (UQÀM) INF3105 - Structures de données et algorithmes (Winter 2012). Université de Sherbrooke IFT313 - Introduction aux langages formels (2007E, 2009E, 2010E)IFT615 - Intelligence artificielle (2010E, 2011E) TP0 - Recherche heuristique TP1 - Algorithme alpha-beta prunning et jeu Connect5 [ Énoncé ] [ Résultats ] TP2 - MDP avec le jeu de serpents et échelles [ Énoncé ] [ Résultats ]Exposé sur la robotique mobile et IA : PDF (4.3 Mo) | PowerPoint (9.5 Mo)  (13 fév 2008) IFT821 - Méthodologie de communication en informatique (2010H, 2011E) Atelier Comment rédiger et publier un article scientifique : PPTX | PDF. Short Bio Before his graduate studies, Éric Beaudry was a research assistant at CARTEL, a research center in remote sensing at Université de Sherbrooke. Éric holds a master (2006) and a Ph.D. (2011) in computer science from Université de Sherbrooke in the fields of artificial intelligence (AI) and mobile robotics. He was a member of Planiart et d'IntRoLab, respectively two labs conducting research in AI planning and mobile robotics. In 2005 and 2006, IntRoLab and Éric has recevied many awards at the AAAI Robot Challenge, a robotics competition taking place at the prestigious annual conference of the Association for the Advancement of Artificial Intelligence. In March 2011, Éric has defended his Ph.D. thesis on Planning concurrent actions under uncertainty. After his Ph.D., Éric spends few months as a postdoctoral fellow at the center of Defence Reseach and Development Canada (DRDC) where he continues his research on planning under uncertainty. He has developped te planner in the core of CORALS, a prototype for real-time decision support for combat operators on the Canadian frigates. From July to December 2011, Éric is a research fellow at the Intelligent Systems Division at NASA Ames Research Center in California (USA). He works to improve its planning algorithms to demonstrate their applicability to space exploration missions. From January 2012, Éric will join the Département d'informatique of Université du Québec à Montréal (UQÀM) as assistant professor. He will continue his research in automated planning and will investigate their application to serious games. Graduate studies of Éric has been funded by scholarships from the Natural Sciences and Engineering Research Council of Canada (NSERC) and the Fonds québécois de recherche sur la nature et les technologies (FQRNT). His results has been presented and published in several international conferences and journals. © Éric Beaudry 2011. All rights reserved.",
  "content_length": 5731,
  "method": "requests",
  "crawl_time": "2025-12-01 14:56:13"
}