{
  "name": "Özcan Özturk 0001",
  "homepage": "http://www.cs.bilkent.edu.tr/~ozturk",
  "status": "success",
  "content": "Homepage -- Ozcan Ozturk Professor Dept. of Computer Engineering Engineering Building, EA 421 Bilkent University Bilkent, 06800, Ankara, Turkey Phone: +90 (312) 290-3444 +90 (312) 290-1218 (Dept.) Fax: +90 (312) 266-4047 Email:MYLASTNAME@cs.bilkent.edu.tr Dr. Ozturk has been on the faculty at Bilkent since 2008 where he currently is a Professor in the Department of Computer Engineering. His research interests are in the areas of cloud computing, GPU computing, manycore accelerators, on-chip multiprocessing, computer architecture, heterogeneous architectures, and compiler optimizations. Prior to joining Bilkent in Spring 2008, he worked as a software optimization engineer in Cellular and Handheld Group at Intel and Marvell. Dr. Ozturk has been recognized by Bilkent University Distinguished Teaching Award in 2019, Science Academy's Young Scientist Award (BAGEP) in 2018, HiPEAC Paper Award in 2016, Turkish Academy of Sciences (TUBA) Associate Membership since 2015, Fulbright Senior Researcher Award in 2014, Intel Research Award in 2013, Turk Telekom Research Collaboration Award in 2012, IBM Faculty Award in 2009, European Network of Excellence on High Performance and Embedded Architecture and Compilation (HiPEAC) Paper Award in 2009, and ICPADS Best Paper Award in 2006. He is a member of GSRC, HiPEAC, IEEE, and ACM and is currently serving as editor/reviewer on leading IEEE, ACM, and various other journals. Dr. Ozturk received his Ph.D. degree in computer science and engineering from the Pennsylvania State University, the M.S. degree in computer engineering from University Of Florida, and received the B.Sc. degree in computer engineering from Bogazici University, Turkey. CV Research Highlights Research Assistant Positions Available: Looking for bright, creative, self-motivated, and hardworking students to work in our funded projects. See Research page for details. Parallel Systems: Accelerators, Cloud Computing, GPU Computing, Manycore, Parallel Programming Processor Architecture: Multicore Processors, Computer Organization, Reliability-Aware 3D Chip Multiprocessor Design, Heterogeneous Chip Multiprocessors, Network On Chip Architectures Compilers: Automatic Parallelization, Dataflow Analysis, Optimizing Compilers, Memory Optimization Industrial and Academic Experience Professor, Bilkent University, Computer Engineering Department, Ankara, Turkey, November 2018 - Present. Adjunct Professor, North Carolina State University, Department of Computer Science (CSC), School of Engineering, Raleigh, North Carolina, July 2018 - Present. Associate Professor, Bilkent University, Computer Engineering Department, Ankara, Turkey, June 2013 - October 2018. Assistant Professor, Bilkent University, Computer Engineering Department, Ankara, Turkey, January 2008 - May 2013. Visiting Associate Professor, North Carolina State University, Raleigh, North Carolina, January 2018 - August 2018. Visiting Associate Professor, Arizona State University, Tempe, Arizona, July 2014 - January 2015. Senior Researcher, NEC Labs, Systems Architecture Lab, Princeton, New Jersey, February 2011 - June 2011. Visiting Researcher, INRIA, ALCHEMY group, Paris, France, June 2009 - August 2009. Consultant, Erendiz Supercomputer, Compiler Group, Eskisehir, Turkey, 2008 - 2009. Senior Software Optimization Engineer, Intel Corporation, Cellular and Handheld Group, Chandler, Arizona, April 2006 - January 2008. Research Associate, Processor Architecture Laboratory (LAP), Swiss Federal Institute of Technology of Lausanne (EPFL), Lausanne, Switzerland, July 2003 - August 2003. Research Assistant/Teaching Assistant, CSE Department, Pennsylvania State University, State College, Pennsylvania, August 2002 - August 2006. Teaching Assistant, Computer and Information Science and Engineering Department, University of Florida, Gainesville, Florida, August 2000 - May 2002.",
  "content_length": 3878,
  "method": "requests",
  "crawl_time": "2025-12-01 14:56:19"
}