{
  "name": "Özgür Erkent",
  "homepage": "https://web.cs.hacettepe.edu.tr/~ozgurerkent",
  "status": "success",
  "content": "Ozgur Erkent @ Department of Computer Engineering :: Hacettepe University Home CV Projects Publications Teaching Contact Contact Computer Engineering Beytepe Campus 06800 ANKARA TURKEY Phone (+90) 312 297 75 00/136 ozgurerkentAThacettepeDOTeduDOTtr https://web.cs.hacettepe.edu.tr/~ozgurerkent/ Ozgur Erkent is an assistant professor at Department of Computer Engineering at Hacettepe University. His research interests include autonomous vehicles, robotics, object pose estimation, attentive vision, place recognition, semantic segmentation, object recognition, scene classification, machine learning, human-robot interaction, localization, SLAM, mechanical and electronical design of robots. He is also an extrnal collaborator at Team Chroma at INRIA. He was working as the Starting Research Position at Team Chroma working with Christian Laugier and Christian Wolf. He was a Post-doc at Intelligent and Interactive Systems at University of Innsbruck under the supervision of Prof. Dr. Justus Piater from 2013 until 2017 August. He received his PhD in 2013 from Department of Electrical and Electronics Engineering at Boğaziçi University, MSc in 2004 from Cognitive Science Department and BS from Mechanical Engineering in 2001, both from Middle East Technical University. During his PhD thesis, he worked as a research assistant of Boğaziçi University Intelligent Systems Laboratory (ISL) under the supervision of Prof. Dr. Isil Bozma. He participated in the design and implementation of an active vision system on robot APES (mechanical and electronical design process - motor control cards, etc.). During his master's thesis, he gained some experience on eye movement studies, analysis and measurement techniques as well as psychological aspects of the eye movements which was a collaborative study between Hacettepe University Medicine Faculty Biophysics Department and Middle East Technical University Cognitive Science Department where he made an electrooculogram device to measure the eye movements of the players while analyzing a chess position. © Content by Ozgur Erkent [24.06.2024]",
  "content_length": 2095,
  "method": "requests",
  "crawl_time": "2025-12-01 14:56:22"
}