{
  "name": "Øyvind Hanssen",
  "homepage": "https://uit.no/ansatte/oyvind.hanssen",
  "status": "success",
  "content": "Hanssen, Øyvind | UiT Oyvind.hanssen – Institutt for informatikk | UiT Gå til hovedinnhold Enheten Ansatte Øyvind Hanssen Førsteamanuensis Informatikk Institutt for informatikk oyvind.hanssen@uit.no +4777620895 Mo i Rana Øyvind Hanssen Om Forskning og undervisning CV Vitenskapelige arbeidsområder Sikkerhet og sårbarhet / Systemutvikling og -arbeid / Teoretisk databehandling / programmeringsspråk og -teori / Databaser og multimediasystemer / Kommunikasjon og distribuerte systemer / Algoritmer og beregnbarhetsteori / Geografiske informasjonssystemer / Datateknologi / Annen informasjonsteknologi / Informasjons- og kommunikasjonsteknologi Arbeider i Cristin Vitenskapelige artikler og bokkapitler Andre Øyvind Hanssen : Improving Trails from GPS Trackers with Unreliable and Limited Communication Channels 2021 Øyvind Hanssen : Position Tracking and GIS in Search and Rescue Operations 2018 DOI / ARKIV Øyvind Hanssen : Position Tracking in Voluntary Search and Rescue Operation 2015 DOI / ARKIV / FULLTEKST Øyvind Hanssen : Towards Declarative Characterisation and Negotiation of Bindings 2005 Øyvind Hanssen, Frank Eliassen : Policy Trading 2000 Tina Lien Barken, Stefano Bonacina, Rune Bostad, Elia Gabarron, Beate Hennie Garcia, Kristine Haddeland m.fl.: University campus as a smart technology-supported active learning arena Septentrio Reports 2023 DOI Øyvind Hanssen : Vi trenger høgere utdanning på Helgeland i flere fag, også i teknologi Helgelendingen 2023 Øyvind Hanssen : Kan universitetene samarbeide om høgere utdanning på Helgeland? 2022 Øyvind Hanssen : Nei, digitalisering trenger ikke virke sentraliserende Nordlys 2021 FULLTEKST Øyvind Hanssen : Etikk, samfunnsansvar og profesjonalitet i IKT-utdanning 2021 Øyvind Hanssen : Improving Trails from GPS Trackers with Unreliable and Limited Communication Channels 2021 Øyvind Hanssen : Er digitaliseringen en trussel mot vår frihet? 29. oktober 2021 FULLTEKST Kjetil Olsen, Øyvind Hanssen : Nord Universitet - En brems for utdanning og utvikling på Helgeland? 2020 Øyvind Hanssen : En region uten IKT-teknisk utdanning? 2020 Øyvind Hanssen : Blir behovet for IKT-kompetanse i regionene dekket? 09. mai 2020 FULLTEKST Øyvind Hanssen : Den regionale dimensjonen Nordlys 18. juni 2020 FULLTEKST Øyvind Hanssen : Utdanningsnivå, distrikt og kjønnsforskjeller 12. april 2020 FULLTEKST Øyvind Hanssen : Et universitet og en region uten teknologifag? www.universitetsavisa.no 29. mai 2019 Erik Bøgild, Øyvind Hanssen : Taktisk debriefing i politiet, et læringsverktøy? Nord universitet 2019 Line Bogan, Øyvind Hanssen : Håndtering av hendelser på lufthavner med fjernstyrte tårn Nord universitet 2019 Trine Rimer, Øyvind Hanssen, Rune Kristian Ellingsen : Nytt IT-studium i Rana ble fullbooket i løpet av én dag. –Vi trodde at kurset skulle bli populært 09. desember 2019 FULLTEKST Øyvind Hanssen : Satser Nord Universitet virkelig på Helgeland? 2019 Stein Erik B. Myhre, Tone Gurendal, Øyvind Hanssen, Arne Forbord : Vil vekke IT Helgeland opp fra de døde 17. september 2018 Øyvind Hanssen : Teaching ethics and society issues for students in information systems or computer science 2017 Øyvind Hanssen, Erlend Bullvåg, Hugo Charles Hansen : Ikke opptak på studiene i informasjonssystemer på Mo i høst -Trenger IKT-studiene 31. mai 2017 Øyvind Hanssen : Position Tracking in Voluntary Search and Rescue Operation 2015 SAMMENDRAG / OMTALE Rune Bostad, Øyvind Hanssen : Videoundervisning via studiesenteret.no. 1 år av Informasjonssystemer 2014 Øyvind Hanssen : Infrastruktur for sporingsinformasjon, Polaric Server 2013 Øyvind Hanssen : APRS sporing og den frivillige redningstjenesten 2011 ARKIV Øyvind Hanssen : Creating and testing APRS (Automatic Position Reporting System) - technology for GPS tracking and messaging (via radio and internet) in areas without infrastructure 2010 Øyvind Hanssen : Towards the Semantic Desktop 2010 Øyvind Hanssen : \"Polaric Tracker prosjektet Amatørradio 2009 Øyvind Hanssen : APRS - the amateur radio tracking system 2009 Øyvind Hanssen : APRS: Radioamatørenes sporingssystem 2009 Øyvind Hanssen : Secure Distributed Storage in Peer to Peer Networks 2008 Øyvind Hanssen, Frank Eliassen : Quality of service aware binding in open systems UiT Norges arktiske universitet 07. februar 2008 Øyvind Hanssen, Svein Isachsen, Kjell Karlsen, Dag Kjetil Sjaaeng, Guttorm Pedersen : Radioamatører setter redningsmannskaper på sporet 17. oktober 2008 Øyvind Hanssen : A Declarative Profile Model for QoS negotiation UiT Norges arktiske universitet 2005 Ragnhild Varmedal, Øyvind Hanssen, Randi Karlsen, Geir-Egil Myhre : EIAO Distribution Specification EIAO Deliverable D.5.1.1.3 2005 Øyvind Hanssen : Towards Declarative Characterisation and Negotiation of Bindings 2005 Øyvind Hanssen, Gunnar Hartvigsen, Randi Karlsen, Ragnhild Varmedal, Karen Marie Berg : Gjør internett brukervennlig 27. oktober 2004 M.H. Snaprud, C.H. Jensen, N. Ulltveit-Moe, J.P. Nytun, M. Rafoshei-Klev, A. Savicka m.fl.: Towards a Web accessibility monitor 2002 Øyvind Hanssen, Agata Sawicka, M.E. Rafoshei-Klev, Jan P. Nytun, Nils Ulltveit-Moe, Mikael Odd H. Snaprud m.fl.: Towards a Web Accessibility Monitor 2002 Mikael Odd H. Snaprud, Christian S. Jensen, Nils Ulltveit-Moe, Jan P. Nytun, M.E. Rafoshei-Klev, Agata Sawicka m.fl.: Towards a Web Accessibility Monitor 2002 Morten Thorsen, Arnfinn Andersen, Jan Petersen Nytun, Mikael Snaprud, Øyvind Hanssen : Dynamisk konfigurering av komponentbaserte tjenester Universitetet i Agder 2001 Per Ivar Pedersen, Jan Petersen Nytun, Øyvind Hanssen, Mikael Snaprud : Integrasjon mellom Java 2 Platform Enterprise Edition og Microsoft DNA i Objectnets driftsmiljø Universitetet i Agder 2001 Kim Andre Andersen, Mikael Snaprud, Øyvind Hanssen : Digital maps on the web, and accessibility Universitetet i Agder 2001 Aida Arslanagic, Elisabeth S Siqveland, Karsten Vileid, Øyvind Hanssen, Jan Petersen Nytun : Simulated testing in Mobile Datacom Systems (GPRS / UMTS) Universitetet i Agder 2000 Steffen S. Hellestøl, Øyvind Hanssen, Jan Petersen Nytun, Mikael Snaprud : Effektiv integrasjon av Java servlets i Apache web-tjener Universitetet i Agder 2000 Karl Snorrason, Øyvind Hanssen : Video-On-Demand tjener seleksjon system Universitetet i Agder 2000 De 50 siste resultatene fra Cristin vises på siden. Se alle arbeider i Cristin her → Undervisning INF1800 - Digitalisering og IT-profesjonalitet (Mo i Rana, høst 23) Også involvert i: INF-3701/INF-8701 Advanced Database Systems (vår 23) INF-2700 Database Systems (høst 22) INF-2900 Software Engineerng (vår 22) Forskning og undervisning Medlem i forskningsgruppe Open Distributed Systems (ODS) Medlem i prosjekt TechWatch CV Doktorgrad i informatikk.",
  "content_length": 6714,
  "method": "requests",
  "crawl_time": "2025-12-01 14:56:25"
}